[
    {
        "id": "UwGn1ht8TrF",
        "original": null,
        "number": 1,
        "cdate": 1665950954198,
        "mdate": null,
        "ddate": null,
        "tcdate": 1665950954198,
        "tmdate": 1670633889576,
        "tddate": null,
        "forum": "0cpM2ApF9p6",
        "replyto": "0cpM2ApF9p6",
        "invitation": "ICLR.cc/2023/Conference/Paper3314/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This paper presents MeshDiffusion, a method for generating 3D meshes. The authors use the deformable tetrahedral grid as the 3D representation, and train a diffusion model on this parameterization. The authors demonstrated the effectiveness of the proposed model on multiple generative tasks, including unconditional and conditional generation.",
            "strength_and_weaknesses": "+ The tetrahedral grid representation is able to generate fine details of 3D shapes with arbitrary topology.\n\n+ The mesh output can be easily used in graphics pipelines.\n\n- The main problem is: There's a recently published paper  \"GET3D: A Generative Model of High Quality 3D Textured Shapes Learned from Images\" in NeurIPS 2022. This paper is released on Sep. 22, which is before the paper deadline of ICLR 2023 (Sep. 28). So it should be considered as \"previous work\". The GET3D paper uses a similar idea (tetrahedral representation) to perform a similar task. However, in the submission the authors didn't mention, review, or compare with GET3D.\n\n- Multiple loss functions are used for training the network. However, the ablation study does not show the necessity of each loss function.",
            "clarity,_quality,_novelty_and_reproducibility": "Clarity: The mathematical formulations in this paper needs more explanations. For the training objective equation in Sec. 4.2, it would be better if the symbols are explained right in this section, because it is hard for readers to find the meaning of the symbols in Sec. 3. Besides, the training objective equation is not numbered.\n\nQuality: The result is better than compared methods. However, it is unclear whether it outperforms GET3D.\n\nNovelty: The novelty is questionable since it is very similar to GET3D.\n\nReproducibility: It should be reproducible given the implementation details.\n\n",
            "summary_of_the_review": "The paper proposes a mesh generation model based on tetrahedral grid representation and diffusion model. The results show that the proposed method outperforms the baseline methods. However, the main issue is that one main state-of-the-art method \"GET3D\" was not mentioned or compared in this paper. Thus I would suggest the authors add this comparison and re-submit the paper.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "details_of_ethics_concerns": "N/A",
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper3314/Reviewer_Mo7X"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper3314/Reviewer_Mo7X"
        ]
    },
    {
        "id": "3OqWai7yGUB",
        "original": null,
        "number": 2,
        "cdate": 1666621943299,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666621943299,
        "tmdate": 1670421167327,
        "tddate": null,
        "forum": "0cpM2ApF9p6",
        "replyto": "0cpM2ApF9p6",
        "invitation": "ICLR.cc/2023/Conference/Paper3314/-/Official_Review",
        "content": {
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully.",
            "summary_of_the_paper": "The paper proposed a diffusion model-based mesh generator. \nIt adopts the representation from the previous `deep marching tetrahedral`.\nThe method works in two steps by first learning to reconstruct 3D meshes and then training a diffusion model on the grid points using a 3D U-Net. \n",
            "strength_and_weaknesses": "Strength:\n- To my knowledge, it is the first diffusion model on 3D **mesh**. \n- On unconditional generation evaluation, it truly beats one of the latest SOTA(SDF-StyleGAN).\n\nWeakness:\n- Not particularly novel. The paper is more like a combination of previous tetrahedral generation work and the diffusion model, especially when I see that the method has two training steps. \n\n- Misses evaluation on SVR. Obviously, the first step can reconstruct shapes from 2D images. However, I could not find any evaluation on it neither in the paper nor in the appendix. \n\n- Miss closest shape results when showing generated shapes. Can you show the nearest shapes in training set to validate the generation capability of your generative model? \n\n- I saw claims like `extremely easy and stable to train.` and `MeshDiffusion is also very stable to train without bells and whistles.`. Is there any evidence to prove this?\n\n- Holes seem still exist on the generated meshes. Are there any quantitative results that can support your point `REDUCING NOISE-SENSITIVITY OF MARCHING TETRAHEDRA`? \n\n- Why FID metric of the car category is so high(even worse than IM-GAN)? \n\n- Misses comparison with GET3D. \n\nMisses references:\npoint cloud diffusion model:\nLION: Latent Point Diffusion Models for 3D Shape Generation\n\nrecent tetrahedral mesh generation method:\nGET3D: A Generative Model of High Quality 3D Textured Shapes Learned from Images\n\nTypos:\n`including unconditional generation, conditional generation and interpolation` -> \n`including unconditional generation, conditional generation**,** and interpolation`",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is well-structured and gives as many details as possible. \nArchitecture and hyperparameters are given. I think the paper is reproducible. ",
            "summary_of_the_review": "The paper proposes the first diffusion model on 3D meshes. \nHowever, due to its limited evaluation, I have doubts on its generation capacity and its claims on stable training and reducing noise. \nIn addition, quantitative comparisons in FID metrics with baseline methods can not show its superiority.\nThe paper also misses a comparison with recent GET3D. \nSo I am slightly leaning toward rejection. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "details_of_ethics_concerns": "NO.\n",
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper3314/Reviewer_NSt1"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper3314/Reviewer_NSt1"
        ]
    },
    {
        "id": "fvIjxn44S58",
        "original": null,
        "number": 3,
        "cdate": 1666797055398,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666797055398,
        "tmdate": 1666797055398,
        "tddate": null,
        "forum": "0cpM2ApF9p6",
        "replyto": "0cpM2ApF9p6",
        "invitation": "ICLR.cc/2023/Conference/Paper3314/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper proposes a diffusion model MeshDiffusion for 3D meshes generation.  The meshes are embedded in a deformable\ntetrahedral grid, and then employ a score based method to train a diffusion model on this direct parameterization. Besides using in the 3D space, the network can be used when only 2.5D information is available as well. The model is tested  on multiple generative tasks.",
            "strength_and_weaknesses": "The paper is for 3D mesh generation using the score based diffusion model. Score based diffusion model for generative modeling such as image synthesis has shown significant improvement over existing methods such as GAN, VAE, etc. This paper tries to extend the score based diffusion method into 3D mesh generation domain, which is a very important area to explore.\n\nThe main framework is based on Deep Marching Tetrahedra, plus the score based diffusion model. These are the main strength of the proposed method which essentially combines these two and applies to mesh generation.\n\nThe results seem good in comparison with existing methods.\n\nThe work on the other hand, seems still at a very earlier stage, and the paper seems generated in a little rush, e.g. there are two citations of 38,38] in page 3, second line, second paragraph. There are probably still some issues that need to solve before it can be fully utilized, as some of the limitations mentioned by the authors.\n\nNonetheless, this paper does point to an interesting direction in 3D mesh generation which the 3D community might not be fully aware of before (including myself), in this point the paper has merit and is to be accoladed.\n",
            "clarity,_quality,_novelty_and_reproducibility": "The paper generally reads okay, kind of clear if you are familiar with the score-based method. Figure 2 is very similar to the original deep marching tetrahedra paper (not copied but does look similar). For general audience especially those who are not familiar with score-based method the paper might be a little hard to read, at least in the beginning. Novelty wise the paper seems is a combination of two frameworks the deep marching tetrahedra and the score based method, but applies to a new field of 3D mesh generation, in this perspective it can be considered novel. I am not sure about how easier to reproduce the code yet.",
            "summary_of_the_review": "Overall it is an interesting application of the score based method in the 3D mesh generation domain which is very important. The paper does show some good results over the existing method. The paper would benefit from more time spent on the presentation, illustration, proof reading etc as it contains some typos and errors.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper3314/Reviewer_jFa3"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper3314/Reviewer_jFa3"
        ]
    }
]