[
    {
        "id": "V8_u0_rqxU",
        "original": null,
        "number": 1,
        "cdate": 1666614575600,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666614575600,
        "tmdate": 1670499414168,
        "tddate": null,
        "forum": "3ZPESALKXO",
        "replyto": "3ZPESALKXO",
        "invitation": "ICLR.cc/2023/Conference/Paper1162/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper extends the recent spur of research on VCA. In particular, it provides theoretical properties on the computational complexity of OAVI by utilizing the fact that the ideals must only vanish approximately and not exactly and improve the training time by clever tricks in the optimization.",
            "strength_and_weaknesses": "Strengths:\n* VCA is an intuitive and promising concept that suffers from some limitations in practice. This paper makes an important contribution to approximate versions thereof (namely OAVI) in that it shows that the complexity is actually linear in the number of samples (and not superlinear as believed hitherto)\n* The paper further proposes practical improvements (PCG and BPCG) and inverse Hessian boosting for the optimization steps involved.\n* The contributions are well-explained and comprehensible and related to prior work\n\nWeaknesses:\n* The empirical evaluation shows a slight benefit of the proposed method; yet, for many experiments, the advantages in comparison to the classical VCA algorithm are less clear. My experiences were that VCA suffers particularly from sample-complexity whenever higher order polynomials are required (because of the large amount of generators that might be generated). This alligns well with the experiments in Figure 3 and suggests that the benefit of the proposed method becomes relevant only for more complex problems. I am afraid though that the experiments performed are not sufficient for making a particularly strong point for the OAVI type algorithms. I think that including more complex datasets (similar to spam) would really highlight the benefits.\n* The proof of Theorem 4.2 (a crucial piece of the paper) relies on the assumption that the oracle in OAVI is accurate. This seems to be a relative hand waving argument and -- at least for me -- it is not obvious if or under which conditions this is the case\n* The paper has a strong theoretical flavor. Yet, the most important contributions are completely hidden in the appendix. At the very least it would be desirable to have a brief summary of the proofs in the main part of the paper and to link to the respective proofs. For example, found it unnecessary tedious to look through the whole appendix for the proof of Th 4.2 without any pointer (only to finally find it under \"missing proofs\").",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is novel, cites the relevant research and shows how it extends the current state of the art.\nIt is generally well written and easy to follow, although a stronger integration between the main part of the paper and the appendix would be preferable (see weaknesses above)",
            "summary_of_the_review": "The paper tackles a relevant problem and makes progress both from a theoretical and from a practical perspective. The main insights could be better highlighted in the paper though. \nMoreover, the experiments are well-designed and correct but focus on too many 'easy' problems that do not reveal the capabilities of the proposed approaches well enough.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper1162/Reviewer_thxT"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper1162/Reviewer_thxT"
        ]
    },
    {
        "id": "SpBNhZDYvY",
        "original": null,
        "number": 2,
        "cdate": 1666653242987,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666653242987,
        "tmdate": 1670814302534,
        "tddate": null,
        "forum": "3ZPESALKXO",
        "replyto": "3ZPESALKXO",
        "invitation": "ICLR.cc/2023/Conference/Paper1162/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "The authors propose a modified version of the OAVI algorithm for computing the generators of the set of polynomials who has a given dataset as roots - called the ideal. They show theoretically that their proposed modified algorithm yields significant savings in computational complexity. They then use these ideals to solve a classification task and show good test set performance. ",
            "strength_and_weaknesses": "The algorithm seems to require a lot of hand-holding and might be hard to tune in practice. For example, the numerical instabilities that come with matrix inversion need to be handled carefully, as pointed out by the authors. \n\nExperimental results seem impressive in general, but it would be good to understand why the method suffers in one particular dataset. \n\nExperiments in section 5 do not seem to report runtime results unless I am missing them. ",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is written clearly. I believe enough details are given about the proposed algorithm, as well as the algorithm the authors are building on.",
            "summary_of_the_review": "I am not an expert in this field and my limited understanding based on reading the paper is that it seems to be a worthy publication given the experimental results. \n\nAfter rebuttal: \n\nThank you for your responses and clarifications. I strongly suggest the authors to write their modified algorithm explicitly in a separate algorithmic environment. After a closer look, I found the first paragraph of page 15 (in appendix) to appreciate the steps they had to take to accommodate for the change they did to line 5's optimization problem. It will greatly help the readers to compare with the existing work. Since there is no option of 7 as a score, and I cannot justify an 8 in terms of novelty and impact (no comparison with other classifiers in the experiments), I will keep my score of 6 (weak accept). ",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper1162/Reviewer_qggK"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper1162/Reviewer_qggK"
        ]
    },
    {
        "id": "GU_dDIiPMbQ",
        "original": null,
        "number": 3,
        "cdate": 1666913164127,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666913164127,
        "tmdate": 1670210215623,
        "tddate": null,
        "forum": "3ZPESALKXO",
        "replyto": "3ZPESALKXO",
        "invitation": "ICLR.cc/2023/Conference/Paper1162/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "The key contribution of the paper is providing a faster algorithm (with improved dimension dependence) for computing generators of the approximate vanishing ideal of a set of points. To this end, it provides (1) a novel analysis of an existing algorithm for this purpose (\"OAVI\" by Wirth and Pokutta), and (2) a simple modification to accelerate OAVI. The notion of vanishing ideals is used as a core technique in several classical machine learning tasks like feature selection and transformation. Efficient algorithms for this subroutine are, therefore, a problem of clear interest to ICLR. \n\n",
            "strength_and_weaknesses": "Strength: The scalability of an existing algorithm for an important problem \n\nWeakness: \n\n1. I am not sure how standard the notation used in the paper is (I wasn't familiar with it), and the description in the Preliminaries section was not enough for me to clearly follow the details. For instance, the notion of degree-lexicographical term ordering could be motivated better; I found the notation too succinct for my taste. I think this could be rectified by providing a working example for the reader. Along the same lines, since the paper builds heavily upon the OAVI algorithm and its notation, it might be useful to the reader to better motivate all the key concepts therein. \n\n2. The paper could provide some intuition for the proof of Theorem 4.2, which shows the runtime improvement: What exactly is the analysis doing differently from that of Wirth and Pokutta? What step, exactly, makes the prior work's analysis sub-optimal? I believe answering these questions would make the paper more insightful and the concepts more broadly applicable.  \n\n------ AFTER THE REBUTTAL PHASE ---- \n\nThe above weaknesses have been adequately addressed. ",
            "clarity,_quality,_novelty_and_reproducibility": "Please see \"Weaknesses\" above. \n\n------- AFTER THE REBUTTAL PHASE ----- \n\nIn their rebuttal, the authors very clearly explained both their algorithm and the intuition for *what*'s being done differently compared to the prior work of Wirth and Pokutta. I strongly suggest incorporating into the final version this explanation since it significantly improves the paper in my opinion. With this added explanation, I believe the paper is quite well-written.",
            "summary_of_the_review": "My preliminary review is, unfortunately, to reject the paper: I believe the problem studied is important, and I am ready to believe the (theoretical) claims made, but I think there is plenty of room for improvement in the clarity. I am, however, happy to raise my score and change my opinion if the authors can submit a rebuttal clarifying notation and providing intuition for the main proof. \n\n----- AFTER THE REBUTTAL PHASE --- \n\nI am convinced of the importance of the paper's contributions and vote to accept the paper. I do strongly recommend that the authors incorporate into this version the following (1) a plain description (in words) of what the steps in the algorithm are doing, and (2) intuition for why their new methods improve upon the prior analysis (i.e., the explanations they provided in the rebuttal). Doing so would significantly increase readability. \n\n",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper1162/Reviewer_298L"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper1162/Reviewer_298L"
        ]
    }
]