[
    {
        "id": "NCm4ctRNg2b",
        "original": null,
        "number": 1,
        "cdate": 1665678678216,
        "mdate": null,
        "ddate": null,
        "tcdate": 1665678678216,
        "tmdate": 1665678678216,
        "tddate": null,
        "forum": "4PJUBT9f2Ol",
        "replyto": "4PJUBT9f2Ol",
        "invitation": "ICLR.cc/2023/Conference/Paper2373/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper proposes to use heat dissipation to define a forward process (blurring) in the diffusion model. It uses eigendecomposition to decompose the Laplace operation and uses a variational model, similar to DDPM to learn the generative process. Gaussian noise is added to ensure the diversity of the generated images.\n\nOverall using different blurring ops is an interesting exploration direction.",
            "strength_and_weaknesses": "Strength:\n1. Overall the idea is valid and interesting;\n2. This paper provides several interesting analysis such as PSD analysis.\n3. Lots of experiments are conducted to show interesting properties of the model.\n\nWeakness:\n1. There is not much supportive evidence to demonstrate the unique advantage of using heat dissipation. This greatly reduces the novelty of the paper. I believe there should be some important undiscovered advantages to using this approach. As the effective resolution is changing --- can it save the inference time?\n\n2. There are several numerical approach to deal with the Laplace ops: 1. the eigendecomposition used in this paper; 2. directly using Gaussian blurring; 3. grid-based finite difference; To me there seems no significant difference between these three approaches. Although author mentioned numerical stability and some gradient analysis, I would say it is worth really running those models to exam the outcomes.\n\n",
            "clarity,_quality,_novelty_and_reproducibility": "Questions:\n\n1. Can you give a definition of the power spectral density (PSD) of natural images?\n2. Seems the prior is estimated using KDE ---- that means we need extra space complexity for that model?\n\nOverall, the clarity is good. The novelty is less due to my comments in weakness.",
            "summary_of_the_review": "Please see above. I will adjust my score based on the rebuttal.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2373/Reviewer_ZA3r"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2373/Reviewer_ZA3r"
        ]
    },
    {
        "id": "4UxFpK3g594",
        "original": null,
        "number": 2,
        "cdate": 1666628229792,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666628229792,
        "tmdate": 1666628351661,
        "tddate": null,
        "forum": "4PJUBT9f2Ol",
        "replyto": "4PJUBT9f2Ol",
        "invitation": "ICLR.cc/2023/Conference/Paper2373/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "The paper proposes to combine heat dissipation forward process with gaussian diffusion.",
            "strength_and_weaknesses": "\\+ This is an interesting topic and it improves our understanding of what is possible in generative modeling.\n\n\\+ The experiments are well-analyzed.\n\n\\- The main text of the paper contains excessive details which make it harder to read.\n\n\\- Experimental results do not show that the proposed method is a promising direction, at least in terms of the sample quality.\n\nQuestions/minor comments:\n* \"Their generative process does not explicitly consider the inductive biases of natural images, such as their multi-scale nature\" - Imagen (https://arxiv.org/abs/2205.11487) does use upsamplers, some of its predecessors also do.\n* This work is not just heat dissipation, but rather a combination of heat dissipation with gaussian noising - this needs to be highlighted early in the paper. \"noise-relaxed solution of the forward heat equation\" in the abstract sounds rather obscure, just saying that it's a combination with gaussian diffusion would be more clear.\n* \" We obtain samples by taking a training example, blurring it with F(tK), and adding noise with variance δ2\" - does it mean that the prior is non-parametric, so we would need the training set during the generation time? That sounds like a limitation which should be mentioned early on?",
            "clarity,_quality,_novelty_and_reproducibility": "* Quality is high, experiments are well-conducted and analyzed.\n* Clarity is moderate, with too many details cluttering the main text.\n* Originality is high.\n* Reproducibility is high - the authors included the source code in a supplementary material.",
            "summary_of_the_review": "This is an interesting work proposing a novel approach to generative modeling of images based on heat dissipation. I am learning towards acceptance.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2373/Reviewer_D1k3"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2373/Reviewer_D1k3"
        ]
    },
    {
        "id": "Pc2rVUPoIQ",
        "original": null,
        "number": 3,
        "cdate": 1666689058365,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666689058365,
        "tmdate": 1666689058365,
        "tddate": null,
        "forum": "4PJUBT9f2Ol",
        "replyto": "4PJUBT9f2Ol",
        "invitation": "ICLR.cc/2023/Conference/Paper2373/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This paper proposes a new generative model by using inverse heat dissipation. The proposed model is motivated by diffusion models and the empirical success of coarse-to-fine modelling. Specifically, the authors propose to synthesize images by iteratively inverting the heat equation, which is basically a PDE that locally erases fine-scale information. Furthermore, they theoretically interpret the noise-relaxed solution of the forward heat equation as a variational approximation in a diffusion-like latent variable model. Extensive theoretical and experimental analyses have been conducted to demonstrate the effectiveness of the proposed model. ",
            "strength_and_weaknesses": "Strengths:\nThis paper proposes a new type of generative model based on inverse heat dissipation, which possesses a different mechanism compared to existing diffusion models. Moreover, a solid and extensive mathematical derivation of method details has been provided in the Appendix. The proposed method shows emergent qualitative properties not seen in existing diffusion models, which has also been proved by experimental results.\n\nWeaknesses:\nFrom the qualitative results shown in this paper, it seems to me that existing SOTA generative models (e.g., StyleGAN, IMAGEN, DALLE) clearly outperform the proposed method. Yet, since the paper opens a new way for designing generative models, it is acceptable for me that the quality of synthesis results obtained by the proposed one is not as good as SOTA ones. However, there is no qualitative and quantitative performance comparison between the existing methods and the proposed one. Please explain the reasons. In fact, no matter whether the performance is good or not, it is still necessary to compare the proposed method against existing approaches. \n",
            "clarity,_quality,_novelty_and_reproducibility": "Good. ",
            "summary_of_the_review": "This paper proposes a new generative model which is both theoretically and technically sound. Extensive mathematical deviations of method details have also been provided making it a solid paper. Despite the above-mentioned weaknesses, I believe that this paper is still deserved to be published in ICLR after some necessary revisions. The proposed method is interesting and shows up some valuable potential for future research. \n\nHowever, the quality of synthesized images of the proposed method is not as good as the state of the art, and there is no comparison between existing methods and the proposed one. Otherwise, I could give it a higher score. \n",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2373/Reviewer_kPGb"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2373/Reviewer_kPGb"
        ]
    },
    {
        "id": "9CxP8czTPV",
        "original": null,
        "number": 4,
        "cdate": 1667171980735,
        "mdate": null,
        "ddate": null,
        "tcdate": 1667171980735,
        "tmdate": 1667171980735,
        "tddate": null,
        "forum": "4PJUBT9f2Ol",
        "replyto": "4PJUBT9f2Ol",
        "invitation": "ICLR.cc/2023/Conference/Paper2373/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This paper proposes a variant of the diffusion-based model with \"inverse heat dissipation\" (equivalent to continuous de-blurring Gaussian blur). Compared to the standard diffusion model, inverting the heat equation -- a PDE locally erases fine-scale information -- makes the generation consider multi-scale structures naturally. The paper also shows empirical evidence on emergent properties when applying IHDM, such as disentanglement of color and shape.",
            "strength_and_weaknesses": "Strength:\n-- An interesting study is one of the first several works applying blurring transformations in the diffusion process. Unlike existing works, the paper directly derives the formulation from the heat equation SDE and analyzes the inductive bias compared to the standard diffusion models.\n\nWeakness:\n-- The empirical results are relatively much worse than standard diffusion models. The paper seems to hide the quantitative comparisons (only small captions in the figure). However, the visual quality is also over-smoothed compared to the baselines. Although it is brought by the change of diffusion process, it is hard to justify \"why we want to apply heat equation in generative models in the first place,\" considering there is less merit in doing so.\n-- Moreover, there are also existing works that try to incorporate Gaussian blurring in the diffusion process. For example, \n\nLee, Sangyun, Hyungjin Chung, Jaehyeon Kim, and Jong Chul Ye. \"Progressive deblurring of diffusion models for coarse-to-fine image synthesis.\" arXiv preprint arXiv:2207.11192 (2022).\n\nSimilar to this submission, their method applies a stochastic blurring process in diffusion models. While having differences, their quantitative and qualitative results are much better and match the same performance of standard diffusion models. I think comparing more carefully than citing them solely and indicating solutions to improve the current method is necessary. \n\n-- Noise scheduling is less clear than the standard diffusion models, especially since this paper involves two hyperparameters, \"sigma\" (forward) and \"delta\" (backward), which, however, are unclear how to choose both of them and how to adapt with the blurring schedule (Gaussian kernel)",
            "clarity,_quality,_novelty_and_reproducibility": "Clarity & Quality:  the paper is clearly written and easy to follow. The mathematical formulation is technically meaningful.\nNovelty: the paper proposes a novel method by inverting a stochastic heat equation, which only extends standard diffusion models with Gaussian noise.\nReproducibility: the paper includes a detailed description of implementation and training details.\n\n",
            "summary_of_the_review": "Overall, based on the review above, I think the methodology and the proposed method are technically reasonable and novel, which can be a good contribution toward a better understanding of diffusion-based models beyond Gaussian noises. However, as the concerns raised in the weakness, the poor visual performance and lack of proper comparison/justification with baselines decrease the actual impact.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2373/Reviewer_dZbG"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2373/Reviewer_dZbG"
        ]
    }
]