[
    {
        "id": "gEQCBuaJ0aC",
        "original": null,
        "number": 1,
        "cdate": 1666194591332,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666194591332,
        "tmdate": 1666194591332,
        "tddate": null,
        "forum": "5T80c_5NSbV",
        "replyto": "5T80c_5NSbV",
        "invitation": "ICLR.cc/2023/Conference/Paper6306/-/Official_Review",
        "content": {
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper presents a new topological data analysis framework based on persistent homology. The main contributions are first the general framework with multiparameter persistency and a sparse implementation. The experiments show interesting results on point cloud classification. ",
            "strength_and_weaknesses": "## Strength\n\nThe proposed framework is interesting on several points.\n1. The combination of multiparameter persistency with persistent homology allows to catch complex features inside the data. The multiparameter is then crucial to deal with data with more than one dimension.\n2. The representation is robust (using geometric and stable parameters) so usable in context where noise may be important.\n3. There is an analysis of both the approximation quality of the feature and the convergence toward a complete representation of the data.\n\n## Weaknesses\n\nSuch framework have several weakness,\n1. High dimensional data are still an issue with such framework.\n2. The scope of such methods is unclear and should be discuss. ",
            "clarity,_quality,_novelty_and_reproducibility": "## Clarity\n\nThere is an clear effort to adapt the article to a community not familiar with persistent homology. Thus, the paper may sometime be hard to follow but the authors always put a citation for help. Moreover the figure helps to better understand most of the statements.\n\nStill there is little issue with the citation, please use \\citep when making reference to paper when the name of the authors in not in the text.\n\n## Quality\n\nThe proposed framework is interesting and there is an effort to make the paper readable.\n\n## Novelty\n\nI am not sure on how new is the framework. Both main ingredient exist, but some part rely on recent results. The full framework is clearly new.\n\n## Reproducibility\n\nEven for someone not familiar with persistent homology, the appendix gives the information needed to implement the method.  The code is also available.",
            "summary_of_the_review": "This article proposes a framework for topological data analysis. It combines multiparameter persistency with persistent homology to produce robust feature to describe data. The features are shown to produce a controlled approximation of the data robust to noise. Experiments show interesting results for classification of complex data. This paper is easy to read and may reach a larger public than just its community.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper6306/Reviewer_su2T"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper6306/Reviewer_su2T"
        ]
    },
    {
        "id": "k196CqV-dc",
        "original": null,
        "number": 2,
        "cdate": 1666670185598,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666670185598,
        "tmdate": 1666670185598,
        "tddate": null,
        "forum": "5T80c_5NSbV",
        "replyto": "5T80c_5NSbV",
        "invitation": "ICLR.cc/2023/Conference/Paper6306/-/Official_Review",
        "content": {
            "confidence": "1: You are unable to assess this paper and have alerted the ACs to seek an opinion from different reviewers.",
            "summary_of_the_paper": "The paper proposes a framework to use multiple parameters to compute persistent homology for topological data analysis. The proposed sparse implementation reduces memory usage and running time. Experiments show the proposed method converges fast and achieves the best performance on several classification tasks.",
            "strength_and_weaknesses": "Strength:\n- The proposed framework unifies previous work by selecting different operations and functions. The proposed parameters consider geometry and stability, which are effective in classification.\n- Experiments show the proposed method has fast convergence rate, and better quality than others.\n\nWeakness\n- The paper has heavy theory, and it’s not easy to read for the audience without a background in topological data analysis and persistent homology. \n",
            "clarity,_quality,_novelty_and_reproducibility": "The paper proposes a general framework for multiparameter persistent homology, and parameters that consider geometry and stability. They contribute to the novelty of the paper.\n\nThe paper is difficult to read for the audience without a certain background.\n",
            "summary_of_the_review": "The paper proposes a general framework for multiparameter persistent homology with geometric and stable parameters. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper6306/Reviewer_WBCA"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper6306/Reviewer_WBCA"
        ]
    },
    {
        "id": "6ugfuAfR6x",
        "original": null,
        "number": 3,
        "cdate": 1666696135183,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666696135183,
        "tmdate": 1666696135183,
        "tddate": null,
        "forum": "5T80c_5NSbV",
        "replyto": "5T80c_5NSbV",
        "invitation": "ICLR.cc/2023/Conference/Paper6306/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper mentions introduces a multiparameter persistent homology based solution to the \"finding shape descriptors problem\" in point clouds.  The authors also introduce their solution for topological data analysis as a generic tool. The authors introduce some upper limits for the stability for their work.\n\n",
            "strength_and_weaknesses": "Strengths: \n\n- The paper introduces a multiparameter based approach for modeling. The authors provide proof for their theorem (which I did not check for correctness).\n\n- The run time of the algorithm seems faster when compared to the run time of the used baseline algorithms as shown in Table 2.\n\n- The algorithm shows more than 10 % improvement on accuracy, when compared to MPL and Ripley. (However, more baseline algorithms could also be used there for a better judgment).\n\n\nWeaknesses: \n- The idea of using multiple parameters for geometric modeling and for filtering is not new, and there are other multiparameter based solutions exist in the literature. The authors can do a better taxonomy of those works from the literature by including them in their work and in their experiments (for example, the authors should also include the following 3 works as they also are highly related to this work: (i) O. Chapelle, V. Vapnik, O. Bousquet, and S. Mukherjee, \"Choosing multiple parameters for support vector machines\", Machine learning, 46(1-3):131–159, 2002; and (ii) Ozer, S. (2018), \"Similarity domains machine for scale-invariant and sparse shape modeling\", IEEE Transactions on Image Processing, 28(2), 534-545; (iii) Witkin, Andrew P. \"Scale-space filtering.\" In Readings in Computer Vision, pp. 329-332. Morgan Kaufmann, 1987)\n\n- The paper uses heavy Math based representation, which is hard to follow. Furthermore, the proposed \"algorithm\" is not clear to understand. The structure of this paper could be improved by focusing the flow of the paper to explain the steps of the proposed approach first. Currently the proposed algorithm is given as Appendix and it is not citing the any particular equation from the main text. That could be simplified. \n\n- Experimental results show marjinal improvement on toy datasets and the approach is compared to k-NN classifier along with 3 additional random algorithms in Table 3.  The baseline algorithms seem limited. For classification, the authors could use many classification algorithms, when their performance metric is accuracy. \n\nIn Table 3, the caption states that \"classification results for time series\". It is not well explained how the time series problem is considered as a geometry based multi-scale classification problem there. That could be clarified.\n",
            "clarity,_quality,_novelty_and_reproducibility": "Clarity: The paper is hard to read due to the heavy math and almost lack of words (I could not had time to read most of the presented Math to check their correctness). The paper should properly balance both math and text. At the beginning of this paper, the authors state that they present an approach for shape modeling, but then, they show some basic results on toy datasets selected from UCR. That does not make a well structured and a complete story to me. The authors can focus on matching the beginning of the paper (their initial motivation) and their presented approach with its results.\n\nQuality: It seems there is some novelty here but the way it is presented, makes it harder to value its significance. The experimental results seem basic, and the reported improved results seem marginal. None of those shows any significance. While there are many multiparametric algorithms out there, the authors choose to compare their technique to more basic approaches.\n\nNovelty: As I stated above, it seems that this paper has some novelty but the main ideas also seem to be borrowed from scale-space theory and from geometry based multi-parameter computing concepts. Both concepts are studied in the literature (see some sample works from the literature above). Consequently, the novelty of this work and its motivation could be emphasized in a more clear way. \n\nReproducibility: I am not sure how well the presented results could be replicated without the code. Seems like there are many handpicked parameters that are not fully described in Algorithm 1. The authors claim to release their code upon acceptance, however.\n\n\n",
            "summary_of_the_review": "This paper mentions introduces a multiparameter persistent homology based solution to the \"finding shape descriptors problem\" in point clouds.  The authors also introduce their solution for topological data analysis as a generic tool. The authors introduce some upper limits for the stability for their work.\n\nOverall, due to the vast amount of Math usage, instead of words, this paper remains hard to read and requires way more time to understand fully (as a reviewer, I could not give that much time to check the correctness of each equation, unfortunately). The used ideas could be found in the literature. As such, the motivation and the novelty of this paper remains unclear to me. The experimental results include only a few baseline algorithms and they run on toy datasets. There are a vast amount of classifiers out there, and the authors could include a large amount of classifiers to support their claims in their experiments.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "details_of_ethics_concerns": "N/A",
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper6306/Reviewer_Bro2"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper6306/Reviewer_Bro2"
        ]
    },
    {
        "id": "MInCLi0f_DU",
        "original": null,
        "number": 4,
        "cdate": 1670249241460,
        "mdate": 1670249241460,
        "ddate": null,
        "tcdate": 1670249241460,
        "tmdate": 1670249241460,
        "tddate": null,
        "forum": "5T80c_5NSbV",
        "replyto": "5T80c_5NSbV",
        "invitation": "ICLR.cc/2023/Conference/Paper6306/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This paper discusses a framework of multiparameter persistence, which has been a long-standing problem in the field of topological data analysis with persistence homology, and proposes three types of specific representations (GS representations) with stability guarantee.   The numerical results demonstrate the convergence rates with respect to the sample size and the effectiveness in classification accuracies with real-world data.  \n",
            "strength_and_weaknesses": "Strength:\n- A framework for representing multiparameter persistence modules is proposed, covering some previous methods. \n- The proposed methods with specific representations have a theoretical guarantee of stability, which is an important property of a topological feature in applications. \n- In the two multiparameter cases of the measure bifiltration and Cech complex with density, the theoretical analysis gives convergence rates of the proposed GS representations, and the rates are also confirmed numerically. \n- The experimental results with real-world data sets demonstrate better classification accuracies than the existing multiparameter representations.\n\nWeakness:\n- The significance of the proposed framework and method is not clearly presented in the paper.  \n    - While the multiparameter persistence is a more general approach, the practical advantage in data analysis over 1-parameter persistence is not necessarily clear in the paper.  For the real-world data, more basic comparisons with 1-parameter persistent homology as well as other relevant methods should be included.  \n    - The advantage over the existing multiparameter methods is not sufficiently explained, although it is somehow discussed.  One of the advantages should be stability.  In comparison with Carriere & Blumberg (2022),  the authors just cite Botnan & Lesnick (2018) without details.  As an important contribution, the reason for having stability, unlike the others, should be explained more clearly and demonstrated with some basic numerical examples.  \n- The significance of the theoretical analysis in Section 4.1 is unclear.  \n    - As discussed in the paper, the dependence of constant $\\delta$ is not clear enough.  While the authors say that the empirical results do not show bad behavior by choice of \\delta, more detailed discussions are necessary about whether this dependence on $\\delta$ appears as an artifact by the theoretical derivation or an inevitable factor by the method. \n    - In the upper bound (8), the bandwidth parameter $h$ remains constant, and the bound involves a constant factor.  Can we say that the first term $1/\\sqrt{n}$ is the convergence rate?  \n- Some parts of the paper are tough to understand for standard readers in the machine learning field.  Some examples are:\n    - In the last paragraph of page 3, \"indecomposable\" module is undefined. \n    - In Figure 1, it is not clearly explained what is depicted in the middle and right figures.  More explanations are needed. \n- The paper may not be easy to read for most researchers in the machine learning field.   While I understand the difficulty of explaining persistent homology to non-experts, the authors could demonstrate better the importance of the problem to be solved in this paper.  Also, I recommend the authors include a brief introduction about the basic notions of persistence homology in Supplementary Materials.  \n",
            "clarity,_quality,_novelty_and_reproducibility": "- The paper is generally well-written, but some parts should be improved for clarity.  See Weakness.  \n- The paper contains sufficiently novel contributions to multiparameter persistent modules in topological data analysis. \n",
            "summary_of_the_review": "I think that the paper contains significant contributions to the problem of multiparameter persistent modules, which is one of the important issues in topological data analysis.  However, the presentation of the paper has much room for improvement, as detailed in Strength and Weaknesses.  \n",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "empirical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper6306/Reviewer_a971"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper6306/Reviewer_a971"
        ]
    }
]