[
    {
        "id": "op8FChOVln",
        "original": null,
        "number": 1,
        "cdate": 1666318022601,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666318022601,
        "tmdate": 1666318225375,
        "tddate": null,
        "forum": "96kgRrpnkgS",
        "replyto": "96kgRrpnkgS",
        "invitation": "ICLR.cc/2023/Conference/Paper2598/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "In this paper, the authors focus on the multi-modal representation learning and cross-modal similarity estimation topic and propose the Chimera framework. The proposed framework uses the hyperbolic space to better represent complex multi-modal relationships. The topic model is also utilized. The proposed Chimera method is plug and play. Experiments verify its effectiveness when combine with existing multi-modal representation learning framework.",
            "strength_and_weaknesses": "Strength\n+ This paper combines the topic model, hyperbolic space and Euclidean space to better model the complex relationships between modalities.\n+ The proposed Chimera method is plug-and-play. Diverse experiments are provided, validating that it can benefit the existing pre-trained models.\n\nWeaknesses\n- The authors claim that the hyperbolic space can better learn the complex cross-modal association. However, there is lacking strong evidence to support it. In table 4, the results of w HL (hyperbolic space) do not consistently outperform its w/o HL (hyperbolic space) counterpart. In addition, experiments only include the module effectiveness of HL. If using attention module in the Euclidean space replaces HL, could similar results be achieved?\n- In the introduction section, it states that Chimera has theoretical contribution to learn more semantic and complex relationships over modalities. However, it seems that the method section only provides the statement of the proposed framework, and the theoretical support does not well proved. \n- The ablation studies about the hyper-parameters are missing. Does the selection of hyper-parameters affect the model performance a lot?\n- This paper focuses on multi-modal representation learning, but the experiments only contain vision + language dataset.\n",
            "clarity,_quality,_novelty_and_reproducibility": "1. The structure and writing of this paper are relatively clear and well in clarity and quality. \n2. The paper provides enough experiment details for reproducibility\n3. The novelty of this paper is limited. For technical novelty, this proposed framework is combination of existing techniques (topic model, hyperbolic space, transformer, contrastive learning, ranking loss). Also, there is not enough technical support for such combination. For empirical novelty, the experiments are not inadequate and diverse enough. Only two V+L datasets are used. The downstream task only focuses on image-text matching.\n",
            "summary_of_the_review": "This paper proposes a plug-and-play framework, Chimera, for enhancing the multi-modal representation learning and cross-modal similarity estimation. The proposed method can improve the performance of pre-trained modal. However, the novelty of this paper both technical and empirical is limited. More detail is stated in the last part.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2598/Reviewer_Gm2Z"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2598/Reviewer_Gm2Z"
        ]
    },
    {
        "id": "eTNfWvQRO1Z",
        "original": null,
        "number": 2,
        "cdate": 1666689596802,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666689596802,
        "tmdate": 1666689596802,
        "tddate": null,
        "forum": "96kgRrpnkgS",
        "replyto": "96kgRrpnkgS",
        "invitation": "ICLR.cc/2023/Conference/Paper2598/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "The authors propose a framework for image-text retrieval task, by introducing matching on topic and hyperbolic space. Experiments are conducted on MSCOCO and Flickr30 datasets. Combined with some well-known models, improvements on these two datasets are shown.",
            "strength_and_weaknesses": "Strength\n1. Improvements are observed.\n\nWeaknesses\n1. Only 2 datasets are used to evaluate the proposed method. More dataset, more settings and more tasks are necessary for illustration the advantages of the proposed method.\n\n2. Fig.1 is not clear. Please use a high quality image.\n\n3. The equations in Eq.(1) are well-known. It is not needed to mention them all.\n\n4. About the novelty. It seems that the proposed method is just a combination of several losses.\n\n5. How to choose lambdas in Eq(13)?",
            "clarity,_quality,_novelty_and_reproducibility": "The presentation can be improved. Please focus on the contributions of the proposed method and present the details more clearly.",
            "summary_of_the_review": "See \"Strength And Weaknesses\".",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2598/Reviewer_hwZK"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2598/Reviewer_hwZK"
        ]
    },
    {
        "id": "xPTK06zh6O",
        "original": null,
        "number": 3,
        "cdate": 1666702178726,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666702178726,
        "tmdate": 1666702178726,
        "tddate": null,
        "forum": "96kgRrpnkgS",
        "replyto": "96kgRrpnkgS",
        "invitation": "ICLR.cc/2023/Conference/Paper2598/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "The author proposes a way to combine topic space, hyperbolic space, and Euclidean space in an end-to-end manner with learning semantic and complex relationships across modalities. ",
            "strength_and_weaknesses": "## Strength\n\n- Considering hyperbolic space for multi-modal search is a novel attempt given that there is a hypernym, and an entailment relationship within words, and texts.\n- The performance is also improved compared with baselines.\n\n## Weakness\n\n- The author only compares some small dimensional results. How about the high-dimensional performance comparisons?\n- The author's comparison is limited and lacks sufficient comparison to demonstrate the superiority of his method.",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is novel to multi-model search,  and the experiential settings are clear to readers.",
            "summary_of_the_review": "Considering hyperbolic space for multi-modal search is a novel attempt. However, there are some concerns that I mentioned before",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2598/Reviewer_YYrR"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2598/Reviewer_YYrR"
        ]
    }
]