[
    {
        "id": "gJPlpOlgqr",
        "original": null,
        "number": 1,
        "cdate": 1666592766096,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666592766096,
        "tmdate": 1668792354397,
        "tddate": null,
        "forum": "9OmCr1q54Z",
        "replyto": "9OmCr1q54Z",
        "invitation": "ICLR.cc/2023/Conference/Paper4429/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper proposes a normalizing flow-based autoencoder (AE-Flow) to address medical image anomaly detection.  The AE-Flow model contains three components, an encoder to extract features of the input images, a flow model to convert extracted feature vector to the specific feature space, which follows a standard normal distribution, and a decoder to reconstruct the image from normally distributed data. In the inference stage, a flow score and a reconstruction loss are combined into the final anomaly score. Its contribution to medical image anomaly detection is to adopt the normalizing flow-based method to supervise the model training deeply. ",
            "strength_and_weaknesses": "Strengths:\n\n1. This paper adopts a normalizing flow for anomaly detection. The final anomaly score consists of a negative probability density of the normalized feature and reconstruction error, which supervises the model training at both image and pixel levels. \n2. Two different datasets (OCT and CT) are used to conduct some comparison experiments to evaluate the effectiveness.\n\nWeaknesses:\n1. Direct anomaly detection is little help for medical image diagnosis.  It would be more meaningful to mark the abnormal areas, especially small lesions. \n2. It is a standard solution to combine auto-encoder with the normalizing flow for anomaly detection. \n3. It'd be better to explain why α and β values are sensitive for the final performance. If we can unify and fix α and β parameters, it will greatly reduce the model training time and will be more available for users. ",
            "clarity,_quality,_novelty_and_reproducibility": " I think the biggest weakness behind this paper is the lack of novelty. There have been some papers to combine auto-encoder and normalizing flows, and this multi-task training is more common in anomaly detection. \n\nIn addition, when a reconstruction loss (such as MSE) is applied to the reconstruction module, overfitting may become a major problem. To my knowledge,  the network could learn an identify mapping more easily. \n\n",
            "summary_of_the_review": "This paper wants to address medical image anomaly detection. The proposed AE-Flow method combines autoencoder and normalizing flows into a multi-task architecture. It is more common for anomaly detection, and could not convince me to accept this paper. ",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "details_of_ethics_concerns": "None",
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper4429/Reviewer_Ngn6"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper4429/Reviewer_Ngn6"
        ]
    },
    {
        "id": "fsJNGiyTsOj",
        "original": null,
        "number": 2,
        "cdate": 1666594528041,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666594528041,
        "tmdate": 1668785596386,
        "tddate": null,
        "forum": "9OmCr1q54Z",
        "replyto": "9OmCr1q54Z",
        "invitation": "ICLR.cc/2023/Conference/Paper4429/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper introduces an auto-encoder with the normalizing flow bottleneck called AE-FLOW for anomaly detection in medical images. The model combines the benefits of normalizing flow methods for computing the anomaly likelihood of extracted features at image level, and the interpretability of reconstruction-based methods at pixel-level.",
            "strength_and_weaknesses": "Strength:\n- A promising mechanism focusing on anomaly detection from medical images;\n- propose to construct a loss function and anomaly score function;\n- a representation model learns only from normal data;\n- provides image-level tractability of normal data as well as pixel-level interpretability of anomaly data.\n\nWeaknesses:\n- Experiments are conducted in a limited dataset.\n- limited technical contribution.\n",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is well-written and easy to follow, with the exception of a few typos (such as anormaly). The authors make clear and concise statements about their motivation of the study. The authors describe their implementation in detail as well. I believe the study is reproducible. However, the experiments should be conducted on more diverse, large, and public datasets (e.g., skin image dataset, microscopy images, and so on).",
            "summary_of_the_review": "The study sounds interesting. I think this is a promising mechanism for detecting anomalies in medical images. The problem is that the proposed approach has not been validated with enough experiments and diverse datasets. \n\nIt would be nice if the authors could cite a few relevant papers (page 1, second para, first sentence) for their assertions. In my opinion, it is not acceptable by asserting only “One may refer to the review paper (Wang et al., 2019) for more references.” (page1, second para)\n\nWe cannot draw conclusions about the robustness of a model based on limited experiments. Thus, I have some reservations on the robustness, quality, and novelty of the study. Overall, I am not fully convinced of the contribution of the paper that would lead me to suggest it for ‘acceptance’.\n\n",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper4429/Reviewer_hWE4"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper4429/Reviewer_hWE4"
        ]
    },
    {
        "id": "5QQD4hpi-z",
        "original": null,
        "number": 3,
        "cdate": 1666654432502,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666654432502,
        "tmdate": 1666654432502,
        "tddate": null,
        "forum": "9OmCr1q54Z",
        "replyto": "9OmCr1q54Z",
        "invitation": "ICLR.cc/2023/Conference/Paper4429/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "The authors present AE-FLOW, an autoencoder-based method for anomaly detection using normalizing flows in the latent space. Anomaly detection is an important problem in medical imaging, becuase in some domains, screening for abnormal diagnoses is critical. The authors propose using normalizing flows to learn an efficient and tractable distribution of medical images. An anomaly score is calculated using both the negative probability density and the negative reconstruction error. The encoder and decoder consist of conventional convolutional layers with downsampling and upsampling, respectively. The normalizing flow bottleneck consists of eight flow blocks. The model contains two major hyperparameters: one that interpolates between the flow and reconstruction losses and one that interpolates between the flow and reconstruction scores. The authors use two medical image dataset, OCT images and chest xrays. They were able to show that AE-FLOW outperforms other anomaly detection baselines on several metrics. An ablation study was performed that that demonstrated both the flow and reconstruction losses are important for overall performance. The authors show qualitative results using residual images generated from the original and reconstruction images. Abnormal images show much large residual values compared to normal images. ",
            "strength_and_weaknesses": " Strengths:\n1) The paper is very well written, clear, and easy to follow. \n2) The figures are well done and informative. \n3) The paper addresses a generally important problem for screening of diagnosis images.\n4) This is a good use of normalizing flows. \n\nWeakness:\n1) I would ask that the authors provide some additional explanation or evidence for the performance boost compared to other benchmarked models. The authors do a good job presenting the results and show good performance over the other baselines; but I am still unsure as why the model is outperforming the others. \n\n2) If one is to use this model for inference on a new example, how would you select a threshold for the anomaly score? The authors seem to have selected an anomaly score based on the testing set F1 scores. For a better model evaluation, identifying an anomaly score using a validation set, then testing on a true held out testing set seems to be the best way to determine the accuracy, sensitivity, specificity, etc. of AE-FLOW. This cross-validation experiment can be added to an appendix. \n\n3) The method applies in general for anomaly detection. Providing results in a non-medical dataset would strengthen the experimental results for AE-FLOW.  This could also be supplemental data. \n",
            "clarity,_quality,_novelty_and_reproducibility": "The quality, clarity and originality is good. ",
            "summary_of_the_review": "The authors present a novel application of normalizing flows for medical image anomaly detection with improved performance over previously benchmarked models. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper4429/Reviewer_XDoM"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper4429/Reviewer_XDoM"
        ]
    }
]