[
    {
        "id": "FtEkSe-ycB",
        "original": null,
        "number": 1,
        "cdate": 1666577252520,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666577252520,
        "tmdate": 1666577252520,
        "tddate": null,
        "forum": "_fouOVXUV7O",
        "replyto": "_fouOVXUV7O",
        "invitation": "ICLR.cc/2023/Conference/Paper1215/-/Official_Review",
        "content": {
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper proposes a MGST_GNN model which uses multi-granularity graph neural network and LSTM to do air quality forecasting. In the air quality forecasting task, a region contains multiple air quality stations. The authors define two graphs: The global graph has nodes as regions and the partial graph (within one region) has nodes as the stations in that region. The authors propose a new message passing model that incorporates these two kinds of graphs. The proposed model uses LSTM to learn the temporal dependencies. The authors conducted experiments on two real world datasets and showed the proposed method achieve good results.",
            "strength_and_weaknesses": "Strength:\n1. The proposed model is easy to understand and the idea behind partial graph and global graph is explained well.\n2. The experimental results contain many ablation study.\n\nWeaknesses:\n\n1. The contents of this paper definitely can be organized better. \n* The experimental results are all in appendixes. The experiments section in main body only have some vague description of the model's performance, e.g. \"the MAE ... decreases about 1.88 and 1.52 ...\", or \"MAE decreases about 1.99, 2.09, 0.59...\". This is confusing and it's hard for a general reader to understand what these metrics mean unless they go to check the tables in the appendix. I'd suggest to make the paper's main body self-contained.\n* The authors listed many related models in the related work section. However, the differences between existing models and the proposed model were not discussed thoroughly.\n\n2. The experimental results were not presented well. For table 6 in appendix A.6, the first two rows (method MGST_GNN) are all bolded. However, it doesn't seem that MGST_GNN gets the best metric in each column. For example, under metric=1h, HighAir's MAE is 7.12 while MGST_GNN's is 7.16. Under metric=18h, MGST_GNN's MAE is 27.92 while HighAir's is 27.49 and ST-UNet's is 27.86. I think the tradition is to bold the best metric in the corresponding column.\n\n3. In Appendix A.6 the authors claimed that MGST_GNN outperforms the baseline models and provided their explanations. I don't think this is very convincing. Even if MGST_GNN gets better results in Table 6, it doesn't imply that, for example, MGST_GNN outperforms HighAir model because MGST_GNN uses HYSPLIT model. A more promising way is to provide ablation study results on the same dataset. \n\n4. The proposed model uses HYSPLIT to construct the graphs. Since HYSPLIT is specifically designed for air quality related tasks, how does MGST_GNN generalize to other spatiotemporal forecasting tasks? It would be good to see some discussions along this line.",
            "clarity,_quality,_novelty_and_reproducibility": "I think in its current form, this paper has quite a lot of improvement space for its clarity and quality. It seems that both codes and datasets are not open sourced, I'm not confident about its reproducibility.",
            "summary_of_the_review": "There are a lot of improvements that can be made in this paper's organizations, experimental results presentations and discussions. I think it's not ready yet.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper1215/Reviewer_VRie"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper1215/Reviewer_VRie"
        ]
    },
    {
        "id": "cIAvJ4Dlesh",
        "original": null,
        "number": 2,
        "cdate": 1666619820953,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666619820953,
        "tmdate": 1666619820953,
        "tddate": null,
        "forum": "_fouOVXUV7O",
        "replyto": "_fouOVXUV7O",
        "invitation": "ICLR.cc/2023/Conference/Paper1215/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This paper provides a method to predict air quality by combining spatial-temporal data and graph neural networks. The contributions of this paper are mainly on integrating HYSPLIT for modeling the dynamic relationships between nodes.",
            "strength_and_weaknesses": "Strength:\n1. The topic of air quality prediction is of great social impact.\n\nWeaknesses:\n1. The format of the paper is unprofessional. All the experimental results are in the appendix.\n2. Figures are in poor resolution. Please use vectorized images for professional academic writing.\n3. The technical contribution is limited. The settings of LSTM, GNN, and attention mechanism are commonly used for air quality prediction. The motivation of multi-granularity also has been studied thoroughly for spatial-temporal forecasting.\n4. The experiment cannot fully support the validity of the model. Air quality prediction is inherently a time series prediction task. Time series forecasting models, such as N-BEATS, autoformer, informer, etc, are expected to compare.",
            "clarity,_quality,_novelty_and_reproducibility": "The writing is easy to follow. But the novelty is limited. We have concerns about the reproducibility, because the hyperparameter setting is not provided.",
            "summary_of_the_review": "The topic is important. But the novelty is limited, the experiment is weak. The paper needs lots of effort to improve.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper1215/Reviewer_mQij"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper1215/Reviewer_mQij"
        ]
    },
    {
        "id": "E75-BAukkz",
        "original": null,
        "number": 3,
        "cdate": 1666633804036,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666633804036,
        "tmdate": 1666633804036,
        "tddate": null,
        "forum": "_fouOVXUV7O",
        "replyto": "_fouOVXUV7O",
        "invitation": "ICLR.cc/2023/Conference/Paper1215/-/Official_Review",
        "content": {
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "The paper proposes a comprehensive spatiotemporal graph model to predict air pollution concentration in the future time. The model integrates the advantages of mechanical model and machine learning. The authors compare the model with various SOTAs and the proposed method provides an impressive applicability with competitive prediction ",
            "strength_and_weaknesses": "Strength\n1 The paper addresses an important problem in air pollutant concentration prediction. By integrating the mechanical model and machine learning, the work bridges the traditional methods and current trend.\n2 The high-level presentation is good which is easy to follow and understand.\n3 The experiment is solid and comprehensive.\nWeakness\n1 The paper uses inconsistent terms and symbols, which is confusing at some time\nFor example, R and r_a are to represent the region in section 3.1, but authors use the same symbol for messages in equation 2, which is a little ambiguous. In figure2, the input data doesn’t correspond to the variables in the definition section, I would suggest the authors to use consistent symbolic notations for the important features in the both the text and the explanatory figures. Some of the figures need more explanation, e.g., in figure1, the meanings of the axes are unknown. Typo: neighbor node net->neighbor node set\n2 The novelty is not outstanding. Although integrating the mechanical model and machine learning is interesting, most of the techniques are well-established and the authors simply apply them to the new problem.  The overall framework is the same as this paper:\nJiahui Xu, Ling Chen, Mingqi Lv, Chaoqun Zhan, Sanjian Chen, and Jian Chang. HighAir: A\nhierarchical graph neural network-based air quality forecasting method. arXiv preprint arXiv:\n2101.04264, 2021.\n",
            "clarity,_quality,_novelty_and_reproducibility": "The techniques used in this paper are solid. \nThe overall presentation is good and clear. \nThe originality is average.\n",
            "summary_of_the_review": "This paper is well-written and addresses an important question possibly helping bridge environmental science and machine learning. The work falls short on the technical novelty. However, it’s still marginally above the acceptance line.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper1215/Reviewer_tjqh"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper1215/Reviewer_tjqh"
        ]
    }
]