[
    {
        "id": "VoaE8D_pmvf",
        "original": null,
        "number": 1,
        "cdate": 1666152118497,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666152118497,
        "tmdate": 1666316477153,
        "tddate": null,
        "forum": "_VTkMy81R3x",
        "replyto": "_VTkMy81R3x",
        "invitation": "ICLR.cc/2023/Conference/Paper4953/-/Official_Review",
        "content": {
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully.",
            "summary_of_the_paper": "The manuscript proposes to tackle the imbalanced class distribution in semi-supervised learning. Motivated by the overfit on minority class, the author introduce a game model with three players, namely discrimintor D, generator G and Predictor C. In the training, being different with normal GAN pipeline, a new game between D and C is also introduced. Then, extensive experiments are conducted and demonstrate the superior results.",
            "strength_and_weaknesses": "Strength:\n1. The three-players game for GAN seems to be new, as far as I am concerned.\n2. The manuscript has closed form, in which the motivation, proposal and demonstration are all mentioned, despite that some of them are not clarified.\n\nWeakness(Issues):\n1. The motivation is confusing. What is the relationship between the paper with disease? The introduction is filled with rare disease detection, but the conducted datasets are all related to text. I think the authors didn' t get how to write an acdemic paper.\n2. The reason for introducing the predictor C is missed. As shown in introduction, the manuscript is to tackle the unbalancedly distributed class, then, how the C tackles the issue? Why maximizing distance between C with D faciliates the training on rare class?\n3. How the G in the manuscript tackles the bias generation of normal G in GAN? Why the G in this paper wouldn' t be influenced by class bias?\n4. The draft is not qualified. The figures and typesetting need to be further improved.\n5. The necessary analysis in experiments are missed. For example, the demonstration for adopted datasets. What' s the real ratio of positive samples in the dataset? \n6. The conclusion is weak. The author focus on comparing with GAN. Despite that GAN is actually the most related work to the manuscript, the motivation is on addressing unbalanced class in semi-supervised learning. There lacks elaboration on that point.",
            "clarity,_quality,_novelty_and_reproducibility": "The Clarity and Quality are very poor, see Weakness. As for the novelty, since the proposed three-players in a Game seems to be novel, it can be concluded as a contribution. In the light of Reproducibility, the manuscript is totally designed based on empirical intuition, but  I didn' t find code or traing log, so I cannot judge it.",
            "summary_of_the_review": "This review is terrible for me. The submitted manuscript even cannot clarify their opinion. And some components like figures and tables need to be polished. I think the manuscript is not ready to be published.",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper4953/Reviewer_2CqW"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper4953/Reviewer_2CqW"
        ]
    },
    {
        "id": "Hk3Yon-geuS",
        "original": null,
        "number": 2,
        "cdate": 1666282490072,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666282490072,
        "tmdate": 1666282490072,
        "tddate": null,
        "forum": "_VTkMy81R3x",
        "replyto": "_VTkMy81R3x",
        "invitation": "ICLR.cc/2023/Conference/Paper4953/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "- The authors tackled an interesting and practical problem, called semi-supervised learning with imbalance data.\n- The authors utilized the modified version of adversarial training to tackle this problem. More specifically, the authors proposed an adversarial training framework with 3 components: discriminator, generator, and predictor.\n- The proposed method achieved consistently better performances in comparison to the alternatives on multiple text datasets.",
            "strength_and_weaknesses": "Strength:\n- The authors tackled an important problem which is somewhat under-explored.\n- The experimental results are promising.\n\nWeakness:\n- The paper writing can be significantly improved. Many details (especially on the methodology part) are missing.\n- The motivations and intuitions are somewhat missing. How C can help D is not well explained.\n- Some important related works are missing, especially about semi-supervised anomaly detection.",
            "clarity,_quality,_novelty_and_reproducibility": "- The paper is unclear especially on the methodology section.\n- The method seems somewhat novel. At least using 3 components GANs on anomaly detection can be a novel part.\n- Due to the unclear methodology parts, it seems hard to reproduce the results and methods.",
            "summary_of_the_review": "1. Semi-supervised anomaly detection\n- There are some works that directly tackled the semi-supervised anomaly detection problem.\n- For instance, https://arxiv.org/abs/1906.02694 and https://arxiv.org/abs/2203.02034\n- The authors should also include these as the related works because the problems are exactly the same.\n\n2. Adversarially trained classifier.\n- It is unclear why the discriminator needs to maximize the distance between the predictions from D and C.\n- Would be good to clarify the motivations of this loss.\n- Also, why is the adversarially trained classifier useful for correct predictions on the unlabeled data?\n- How to extract data from the unlabeled data using C?\n\n3. Paper writing\n- The paper writing can be significantly improved. Many details are missing.\n- So, at the end, the authors use D? or C?\n- How to train the model with extracted minorities from unlabeled data?\n\n4. Other data domain\n- Based on the description, the proposed method (PGASL) can be applicable to any type of data.\n- In that point of view, it would be good to have other results with other data domains in addition to text data. (Such as tabular data like fraud detection)\n- As the authors mentioned, a rare disease dataset would be one of the possible datasets.\n\n5. Generative models for generating minority samples\n- If the number of minority samples are limited, how can we train the reasonable generative model that can generate those minority samples?\n\n6. Experiments\n- It would be interesting if the authors show the performance with different values of \\rho (labeled: unlabeled data ratios).\n- TSNE results seem somewhat confused. Some purble samples are actually out of distribution space.\n\n7. Etc.\n- Any insights that a larger dropout ratio on C is better?\n- Typo in l^*_{un} equation. No equal sign",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "details_of_ethics_concerns": "Not applicable",
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper4953/Reviewer_wJ3B"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper4953/Reviewer_wJ3B"
        ]
    },
    {
        "id": "tzmM6329-z3",
        "original": null,
        "number": 3,
        "cdate": 1666523329836,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666523329836,
        "tmdate": 1666523329836,
        "tddate": null,
        "forum": "_VTkMy81R3x",
        "replyto": "_VTkMy81R3x",
        "invitation": "ICLR.cc/2023/Conference/Paper4953/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "The authors proposed a three-player GAN-based model called PGASL for class-inbalanced data. The model was tested against several existing models for class-imbalanced data using two text datasets and showed superior performance.\n",
            "strength_and_weaknesses": "Strength\n\n- The proposed strategy seems straightforward.\n\nWeaknesses\n\n- Why was the model tested only using text datasets? As the authors mentioned in the introduction, class-imbalance data exist in many modality.\n\n- In figure 3, while the distribution of fake positive data is well overlapped with the real positive, there are two clusters in fake negative and only one of them is overlapped with the real negative. But the authors didn’t discuss this point.\n",
            "clarity,_quality,_novelty_and_reproducibility": "Code availability is not clearly stated.\n",
            "summary_of_the_review": "The authors proposed a three-player GAN-based model called PGASL for class-inbalanced data. The model was tested against several existing models for class-inbalanced data using two large text datasets and showed superior performance. However, actual distribution of the fake data needs more careful consideration, and the other type of data (e.g., image) needs to be tested.\n",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper4953/Reviewer_QruZ"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper4953/Reviewer_QruZ"
        ]
    },
    {
        "id": "7SxtE9INvie",
        "original": null,
        "number": 4,
        "cdate": 1666620328431,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666620328431,
        "tmdate": 1666620328431,
        "tddate": null,
        "forum": "_VTkMy81R3x",
        "replyto": "_VTkMy81R3x",
        "invitation": "ICLR.cc/2023/Conference/Paper4953/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper considers the problem of semi-supervised binary classification of imbalanced data. It proposes a training method inspired by the GAN and evalutes using two text datasets.",
            "strength_and_weaknesses": "Strength\n- This paper considers a practically important problem setting for real-world applications.\n- This paper trying to take advantage of GAN on semi-supervised learning, which is inspiring.\n\nWeakness\n- The proposed method is not well motivated and not well described. Usually discriminator is used to output two classes \"true\" of \"fake\", but is set to output N + 1 classes including \"fake\". Are there any precedents in the literature?\n- Why the predictive network is necessary as the discriminator can make class predictions?\n- Empirical evaluation is limited as only two binary and text datasets are used.",
            "clarity,_quality,_novelty_and_reproducibility": "- The paper is overall difficult for me to understand. The core proposal, the model structure, is not demonstrated in a clear way.\n- Novelty of the paper is limited. I can hardly see any new insights from the paper.\n- Reproducibility is reasonable, as the algorithm is listed step by step. ",
            "summary_of_the_review": "With limited contribution on the proposed algorithm and limited empirical evaluation, I recommend to reject the paper.\n",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper4953/Reviewer_cLsr"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper4953/Reviewer_cLsr"
        ]
    }
]