[
    {
        "id": "lE9PUg1zDOc",
        "original": null,
        "number": 1,
        "cdate": 1666274354577,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666274354577,
        "tmdate": 1670442821316,
        "tddate": null,
        "forum": "cnsHSSLnHVV",
        "replyto": "cnsHSSLnHVV",
        "invitation": "ICLR.cc/2023/Conference/Paper2586/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "The authors propose a method to generate the remainder of a molecule in 3D given some fragments. The generator is an E(3) equivariant denoising diffusion model, conditioned on the positions of the fragment atoms, and optionally also on the protein pocket that the molecule should fit into.",
            "strength_and_weaknesses": "This is a neat application of equivariant diffusion. The authors have chosen their problem well if the aim is to quickly produce something of practical use for drug discovery.  Linker design is a real task in the drug discovery process, it is constrained enough to do well, and existing ML models for the purpose have limitations that the new model addresses.\n\nWhy did the authors choose to train a conditional generator on fragmented molecules, rather than training a model to denoise entire molecules and treating conditional generation as an inpainting task?\n\nThe generated molecules in figure 2 look odd e.g. they contain 3, 4, and 7-member rings. Do you get better molecules after some simple post-filtering? Also in this figure, the bonds in the input fragments and true molecule do not look correct.\n\nIn table 1, please add the QED, SA and #rings scores for the ZINC, CASF and GEOM training data as well as the generated molecules.\n",
            "clarity,_quality,_novelty_and_reproducibility": "Code is provided.\n\nThe paper is clearly written and related work is well described.\n\nIn section 2.1, can the same molecule appear, differently fragmented, in both training and test sets?\n",
            "summary_of_the_review": "The paper combines conditional generation, denoising diffusion, and equivariant GNNs to tackle an important problem in drug discovery. ",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2586/Reviewer_oTUZ"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2586/Reviewer_oTUZ"
        ]
    },
    {
        "id": "G-YN6dBXZaB",
        "original": null,
        "number": 2,
        "cdate": 1666482716195,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666482716195,
        "tmdate": 1670437634781,
        "tddate": null,
        "forum": "cnsHSSLnHVV",
        "replyto": "cnsHSSLnHVV",
        "invitation": "ICLR.cc/2023/Conference/Paper2586/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "The paper studied the problem of molecular linker generation, which aims to generate the linker given different individual fragments of a desired molecule/drug. Specifically, the work borrows the idea of the recent equivariant diffusion molecule generative model [1] into this specific \"molecular missing part\" generation problem. Experiments on several human-designed datasets show that the proposed method is competitive or better than existing methods.\n\n[1] Emiel Hoogeboom, Vıctor Garcia Satorras, Clement Vignac, and Max Welling. Equivariant diffusion for molecule generation in 3d. In International Conference on Machine Learning, pp. 8867–8887. PMLR, 2022.",
            "strength_and_weaknesses": "[Strength]:\n\n1. The paper is well organized. The tackled linker generation scenario is clearly defined, and the method is easy to follow and understand.\n2. The author nicely provides the source code.\n3. The benchmark table's numerical results are superior to existing methods.\n\n[Weakness]\n\n1. Overall, the paper is not surprising to me. From the ML perspective, this work is an incremental adoption of the equivariant diffusion model in the context of linker design, without significant technical challenges.\n2. Besides, actually diffusion models itself has the capacity for \"inpainting\" missing parts. As shown in the original diffusion model paper [1], the diffusion model can naturally recover the missing patches of images. This further indicates this \"linker design\" is a natural and simple usage of existing diffusion models for molecule generation, making the technical contribution limited.\n3. I'm also a little doubtful about the experimental setup. From the domain-specific (biological or chemical) perspective, considering we already have several fragments and want to design the linker for them: why for the different disconnected fragments we can know their relative positions and even exact coordinates before generating the linker (as shown in Fig.1). I think for this linker design problem, we should take these fragments' positions as known, which, however, is even treated as rigid bodies in this paper.\n4. I'm also concerned about the \"reflection\" equivariance imposed on the proposed model. According to my knowledge, the energy of reflected biostructures should be different, which means they shouldn't have reflection symmetry. However, this is not the case for the proposed model.\n5. [minor point] Considering this is an application paper, actually I'm not sure whether the evaluation itself is sound. For the dataset part, the data is obtained by manually subtracting fragments from molecular structure datasets. This makes me feel like the benchmark itself is human-designed and far away from real-world challenges. I understand this setup may be already adopted in a few existing benchmarks, but this doesn't mean we can just follow them despite the limitation in existing benchmarks. Maybe better and more realistic benchmarks can also be introduced.\n\n[1] Ho, Jonathan, Ajay Jain, and Pieter Abbeel. \"Denoising diffusion probabilistic models.\" Advances in Neural Information Processing Systems 33 (2020): 6840-6851.",
            "clarity,_quality,_novelty_and_reproducibility": "1. The paper is pretty clear.\n2. Presentation quality is high, with all details clearly explained.\n3. The narrow topic \"diffusion for linker\" is somewhat new, but overall the novelty is limited. See my detailed feedback in the weakness part.\n4. The author provided the source code for this work. I didn't check the detail, but reproducibility should be fine.",
            "summary_of_the_review": "The paper introduced a diffusion model for linker design. the idea is not surprising for the ML community and the technical contribution is a little limited. The empirical improvement over existing methods is large, but the evaluation benchmarks are also not reasonable enough from my view.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2586/Reviewer_TyBL"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2586/Reviewer_TyBL"
        ]
    },
    {
        "id": "Tl9_Xcu2Jh",
        "original": null,
        "number": 3,
        "cdate": 1666648541235,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666648541235,
        "tmdate": 1666648541235,
        "tddate": null,
        "forum": "cnsHSSLnHVV",
        "replyto": "cnsHSSLnHVV",
        "invitation": "ICLR.cc/2023/Conference/Paper2586/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "The paper presents a diffusion model approach for predicting molecular linkers between disconnected fragments. This is a two stage process: a model first predicts linker size, and then a diffusion model produces the linker results. Empirical results demonstrates the effectiveness of the proposed method compared with baseline methods. ",
            "strength_and_weaknesses": "Strength:\n- Description of the method is generally clear.\n- This is a novel application of diffusion models on 3d molecule linker design.\n- Code is provided to encourage reproducibility. \n- A thorough ablation study is given to DiffLinker with regards to given anchors and sampled size.\n\nWeakness:\n- The method is described specifically for DDPM, so it inherits all the efficiency issues of DDPM as well. \n- It might help to give some context of some domain-specific settings, especially protein pockets and their representations. ",
            "clarity,_quality,_novelty_and_reproducibility": "Clarity (high): the paper is written clearly in both the method and experiment sections.\nQuality (high): the paper has high-quality figures and results to facilitate the understanding of readers.\nNovelty (high to fair): while the ideas in diffusion models have been explored in prior work such as GeoDiff, the application to molecular linker design is novel.\nReproducibility (high): code is provided to encourage reproducible results, from code to datasets. Reading the readme, it seems that downstream users should be able to run this code.",
            "summary_of_the_review": "The paper presents an interesting application of diffusion models to molecule linker design. While the method itself is straightforward, the method demonstrates the utility of diffusion models over autoregressive methods. The idea of the two-stage process is also interesting and could be useful in other applications. ",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "details_of_ethics_concerns": "N/A",
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2586/Reviewer_3ysG"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2586/Reviewer_3ysG"
        ]
    },
    {
        "id": "WD92hU_xye",
        "original": null,
        "number": 4,
        "cdate": 1666720677307,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666720677307,
        "tmdate": 1666720677307,
        "tddate": null,
        "forum": "cnsHSSLnHVV",
        "replyto": "cnsHSSLnHVV",
        "invitation": "ICLR.cc/2023/Conference/Paper2586/-/Official_Review",
        "content": {
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper proposes DiffLinker, which is a diffusion model for molecular linker design that can link an arbitrary amount of fragments. It features an E(3)-equivariant model in the diffusion process and 3-D conditional distribution on input fragments and optional protein pocket. The result shows superior performance on various real-world applications including a newly proposed one in the paper.",
            "strength_and_weaknesses": "Strength:\n1. The paper is written very clearly with each step and model overview.\n2. The results on linker design is very impressive and pioneering the study in the field.\n\nWeakness:\n1. It is not very clear on adopting diffusion process in conditional linker design. What's the advantage of VAE-based or Normalizing Flow-based algorithms?\n2. What's the limitation and common failures in the proposed generation process?",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is in good quality and reproducibility is good with the provided code.",
            "summary_of_the_review": "This paper tackles conditional generation in molecular design using recent diffusion model and equivariant graph neural networks. The generation quality is impressive compared with existing work.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2586/Reviewer_LoJe"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2586/Reviewer_LoJe"
        ]
    }
]