[
    {
        "id": "fHDlSv3xBu",
        "original": null,
        "number": 1,
        "cdate": 1666623372276,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666623372276,
        "tmdate": 1666623372276,
        "tddate": null,
        "forum": "cP2QVK-uygd",
        "replyto": "cP2QVK-uygd",
        "invitation": "ICLR.cc/2023/Conference/Paper5874/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper studies the ability of GNNs to solve linear programming problems.  It is quite systematic and proves that within a well defined class of GNNs, and given a set of LPs, there exist networks (with specified weights) which can distinguish pairs of LP problems within the set with different feasibility and objective values, and which can approximate the objective value.  The argument is that the Weisfeiler-Lehman test, which it is known that GNNs can perform, suffices for these tasks.  A simple experimental check is made.",
            "strength_and_weaknesses": "Strengths: what looks like a general and solid foundational theorem is clearly presented, with a conceptually simple argument.\n\nWeaknesses: the results do not bound the size of the networks required and do not cover generalization, so are of only theoretical interest.",
            "clarity,_quality,_novelty_and_reproducibility": "The authors claim that \"we established the first complete proof that GNN can universally represent a broad class of LPs\".\nI am not expert enough to be confident about this, but if so then this looks like a valuable foundational result.\nFurthermore the argument based on the WL test is conceptually very simple and relates to much previous work on GNNs.\n",
            "summary_of_the_review": "A very interesting theoretical contribution to study of GNN.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper5874/Reviewer_ubzC"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper5874/Reviewer_ubzC"
        ]
    },
    {
        "id": "Q2vUh70i8U",
        "original": null,
        "number": 2,
        "cdate": 1666739698651,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666739698651,
        "tmdate": 1666768775137,
        "tddate": null,
        "forum": "cP2QVK-uygd",
        "replyto": "cP2QVK-uygd",
        "invitation": "ICLR.cc/2023/Conference/Paper5874/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper studies the problem of learning Linear Program (LP) properties—feasibility, optimal value, and shortest optimal solution—by Graph Neural Networks (GNNs). By extending existing results on GNNs—namely the paper by Xu et al. 2019 which equates the separation power of GNNs with Weisfeiler–Lehman isomorphism test (WL test), and the Generalized Stone-Weierstrass Theorem as in Azizian &\nLelarge 2021—this paper shows that GNNs can separate and represent LP properties.\n",
            "strength_and_weaknesses": "Strengths:\nThe solution given to the problem is natural in hindsight, and the connection between LP graphs/properties and GNN/WL-test appear to be new. And GNN and LP are both important on their own.\n\nWeaknesses:\nThe task of learning different LP properties (feasibility, optimal value, and shortest optimal solution) by neural networks appears somewhat artificial, because there are much better tools out there (various LP solvers, including those used by this paper in the numerical experiments section) than neural networks for this task, and likely neural networks will never be remotely competitive (both in theory or in practice) for learning LP related properties, where a deep mathematical theory trumps neural networks and vast training data.",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is well written and easy to follow. The examples given, such as the LP-Graph in Figure 1 on page 3 and the LP-Graphs indistinguishable by WL test in Figure 2 on page 8, are very illustrative.\n\nIn general, both the big picture and the technical details are explained well, complete with experimental validation.\n\nIn terms of novelty, the idea of connecting LP graph or properties with GNN or WL test appears to be new, and mathematically natural in hindsight.\n\nThe paper presented sufficient details so the experimental results should be reproducible.",
            "summary_of_the_review": "This paper could be an interesting, if slightly incremental, contribution to the mathematical theory of GNN or WL tests.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper5874/Reviewer_AwvS"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper5874/Reviewer_AwvS"
        ]
    },
    {
        "id": "1CfK71sX62a",
        "original": null,
        "number": 3,
        "cdate": 1666774781640,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666774781640,
        "tmdate": 1666774781640,
        "tddate": null,
        "forum": "cP2QVK-uygd",
        "replyto": "cP2QVK-uygd",
        "invitation": "ICLR.cc/2023/Conference/Paper5874/-/Official_Review",
        "content": {
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "Linear programs (LPs) are a special case of constraint satisfaction problems (CSPs).\nThis work claims that GNN's may approximate the properties of LPs: if it is feasible, unbounded and its optimal solution if bounded.\nnamely: feasibility, optimal objective value, and optimal solution.\nThe work shows (in theorems 4.1 and 4.2 ) that the limitations of GNNs are not a problem for demonstrating these properties.\nThe work validates using numerical results (in section 5) that GNNs may approximate the optimal objective value and solution (in theorem 3.4).",
            "strength_and_weaknesses": "The work is missing a clear explanation of why the WL test limit is related to the task of representing an LP's optimality.\n\nIt would be interesting to see results and comparisons between the following special cases of CSPs:\n1. Linear programming in which the variables are real, and the factors are linear inequalities.\n2. Integer linear programming in which the variables are integers and the factors are linear inequalities.\n3. Mixed integer programming in which the variables are reals and integers and the factors are linear inequalities.",
            "clarity,_quality,_novelty_and_reproducibility": "The exposition is clear.\nThe paper consists of minor grammar and spelling mistakes.",
            "summary_of_the_review": "The presentation of the relationship to previous work on theoretical guarantees of optimality is lacking in the related work section.\nThe contribution is marginally significant and novel compared with previous work.\n",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper5874/Reviewer_XXXE"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper5874/Reviewer_XXXE"
        ]
    }
]