[
    {
        "id": "-YBYWGPNorn",
        "original": null,
        "number": 1,
        "cdate": 1667038728131,
        "mdate": null,
        "ddate": null,
        "tcdate": 1667038728131,
        "tmdate": 1667038728131,
        "tddate": null,
        "forum": "cxul04S-aG",
        "replyto": "cxul04S-aG",
        "invitation": "ICLR.cc/2023/Conference/Paper3923/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "The authors propose a decoding method for polar-like codes. The proposed approach is based on machine learning techniques, and novel training approach introduced by the authors. The authors show that the proposed method provides performance close to that of the successive cancellation list decoder.",
            "strength_and_weaknesses": "The paper is very well written, and the proposed training method seems to be novel, although I am not an expert in machine learning.\n\nThe main problem with the paper is that it lacks proper complexity comparison with state-of-the-art decoding techniques for polar codes, and throughput results presented in Table 1 are quite disappointing. In particular, this table implies that the authors obtained decoder throughput for (32,16) code 13008 b/s for SCL(L=4) and 533333 b/s for CRISP.  However, it was shown in  [L2019] that SCL decoder with larger list size L=8 for much longer code (128,64) provides single-threaded throughput more that 3.5 Mb/s.  The discussion after Table 1 suggests, that the obtained results correspond to a multi-threaded implementation, so actual throughput gap is even worse.\n\nPlease observe that the SCL decoder is not the best one in terms of throughput.  Much more efficient decoding algorithms are known, e.g. FastSCL, sequential and trellis-based decoding algorithms [A2019,T2018,T2020]. The authors do not provide performance and complexity comparison with these techniques.  Lack of comparison with sequential decoders is particularly disappointing, since the authors themselves introduced a sequential-type decoder.  \n\nThe authors use throughput of a software decoder as a complexity benchmark. This approach is quite unreliable and difficult to interpret, since it depends on software engineering skills and hardware platform features.  The reviewer suggests to use the number of arithmetic operations performed by the decoder as a benchmark. This would enable comparison with other published results.\n\nThe authors use non-standard notation (k,n) to denote the parameters of polar codes. The standard coding theory notation is (n,k), where n is code length and k is code dimension.\n\n[L2019] Léonardon, M., Cassagne, A., Leroux, C. et al. Fast and Flexible Software Polar List Decoders. J Sign Process Syst 91, 937–952 (2019).\n[A2019] M. H. Ardakani, M. Hanif, M. Ardakani and C. Tellambura, \"Fast Successive-Cancellation-Based Decoders of Polar Codes,\" in IEEE Transactions on Communications, vol. 67, no. 7, pp. 4562-4574, July 2019\n[T2018] P. Trifonov, \"A Score Function for Sequential Decoding of Polar Codes,\" 2018 IEEE International Symposium on Information Theory (ISIT), 2018, pp. 1470-1474\n[T2020] P. Trifonov, \"Recursive Trellis Decoding Techniques of Polar Codes,\" 2020 IEEE International Symposium on Information Theory (ISIT), 2020, pp. 407-412",
            "clarity,_quality,_novelty_and_reproducibility": "The proposed approach is described in a very clear way and seems to be novel, but it does not provide any benefits compared to state-of-the-art techniques used in coding theory.",
            "summary_of_the_review": "The paper is well-written, but the paper lacks proper comparison, and does not seem to provide any improvement with respect to state of the art.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper3923/Reviewer_1zGS"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper3923/Reviewer_1zGS"
        ]
    },
    {
        "id": "AoQ-NY5Skrx",
        "original": null,
        "number": 2,
        "cdate": 1667406947355,
        "mdate": null,
        "ddate": null,
        "tcdate": 1667406947355,
        "tmdate": 1667406947355,
        "tddate": null,
        "forum": "cxul04S-aG",
        "replyto": "cxul04S-aG",
        "invitation": "ICLR.cc/2023/Conference/Paper3923/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This paper proposes a curriculum-based sequential neural decoder for Polar codes. It is shown that CRISP, trained based on information-theoretic insights, outperforms the SC decoder achieving near-optimal error-correcting performance.",
            "strength_and_weaknesses": "Strength\n- It's an interesting application of curriculum learning to me. The rationale behind why the authors introduced curriculum learning for their purposes totally makes sense (feedback mechanism to overcome the key drawback of successive cancellation). I liked the key idea behind the curriculum training of CRISP. I feel it aligns well with what is happening when decoding the Polar codes.\n- It is shown from the evaluation results that CRISP achieves better error-correcting performances compared to the baselines.",
            "clarity,_quality,_novelty_and_reproducibility": "It is easy to follow and moderately novel.\nI don't think the result is not reproducible.",
            "summary_of_the_review": "Please see `Strength` section.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper3923/Reviewer_JMRY"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper3923/Reviewer_JMRY"
        ]
    },
    {
        "id": "23x5bscPa7b",
        "original": null,
        "number": 3,
        "cdate": 1667442011653,
        "mdate": null,
        "ddate": null,
        "tcdate": 1667442011653,
        "tmdate": 1667442011653,
        "tddate": null,
        "forum": "cxul04S-aG",
        "replyto": "cxul04S-aG",
        "invitation": "ICLR.cc/2023/Conference/Paper3923/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "================================================================= \n\n[Summary] \n\nThis paper presents an inductively biased curriculum-learning based training technique that makes use of a nesting hierarchy of polar codes to improve BER results through experimentation.\n\n================================================================= \n",
            "strength_and_weaknesses": "================================================================= \n\n[Main Strengths] \n\nThe authors' extensive descriptions of the backgrounds, as well as the important implementation codes, are included in the anonymous repo, which is the paper's main strength.\n\n================================================================= \n\n[Main Weaknesses] \n\nThe study's main shortcoming is that, while the performance improvements are intriguing, they do not appear to have a major impact, similar to the many flavors of data-driven channel decoders. I encourage the authors to make additional improvements, notably for the experiments mentioned in Section 4, which demonstrate how the CRISP handles non-Gaussian channels (e.g., memory channels) well with nonlinear GRU designs as compared to standard model-driven decoders.\n\n================================================================= \n",
            "clarity,_quality,_novelty_and_reproducibility": "================================================================= \n\n[Technical Comments] \n\nThe Inference throughput studies in Tables 1 and 2 are a little misleading because one column is based on GPU and the other on CPU, and also it also depends on the decoder implementations, which require more detailed descriptions.\n\n================================================================= \n",
            "summary_of_the_review": "The usage of polar code nesting hierarchy for curriculum-learning based training strategy is a simple yet intriguing notion, however, it does not appear to make a significant impact, similar to the many kinds of data-driven channel decoders.\n",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper3923/Reviewer_FDX2"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper3923/Reviewer_FDX2"
        ]
    },
    {
        "id": "uyPBrVSZCK",
        "original": null,
        "number": 4,
        "cdate": 1667483882900,
        "mdate": null,
        "ddate": null,
        "tcdate": 1667483882900,
        "tmdate": 1667483882900,
        "tddate": null,
        "forum": "cxul04S-aG",
        "replyto": "cxul04S-aG",
        "invitation": "ICLR.cc/2023/Conference/Paper3923/-/Official_Review",
        "content": {
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "The paper introduces a method to train a neural network to decode polar codes and related codes (PAC, polar with CRC). The main trick is that the training is gradual: first train to decode the first information bit, assuming all other information bits are frozen to 0, then start from the previous point and train assuming all but the second information bit is frozen to zero, etc. The resulting decoder is better than SC and worse than SCL in terms of bit error rate, but better than SCL in terms of throughput.",
            "strength_and_weaknesses": "I am not an expert in neural networks, so my assessment here is far from authoritative.  To me, the main strength is showing a method of decoding which has some intuition behind it. That is, the decoding is done sequentially, like in SC decoding of polar codes. Another strength is that the authors seem to have found a complexity/error rate point that other algorithms cannot match. A weakness of this method is that it does not seem to work to moderate length codes, and only works for short codes. To their credit, the authors state this outright.",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is clear and the authors do a good job of getting the main points across. I do not know of similar algorithms, so the result seems novel.",
            "summary_of_the_review": "The result seems to be a good fit for ICLR",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper3923/Reviewer_aVwC"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper3923/Reviewer_aVwC"
        ]
    }
]