[
    {
        "id": "3RmMPgBpZB",
        "original": null,
        "number": 1,
        "cdate": 1665586856546,
        "mdate": null,
        "ddate": null,
        "tcdate": 1665586856546,
        "tmdate": 1665586856546,
        "tddate": null,
        "forum": "gvMAooaEi3",
        "replyto": "gvMAooaEi3",
        "invitation": "ICLR.cc/2023/Conference/Paper436/-/Official_Review",
        "content": {
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "The paper revisits the idea of using higher-order gradient in multi-agent RL with two improvements: (1) using LOLA and LA for preserving higher-order gradients and (2) use a hierarchical reasoning approach to coordinate agents in team (cooperation) scenario.",
            "strength_and_weaknesses": "Pros:\n- The LOLA and LA approximations makes preserving high-order gradient more efficient and the improvement is shown via experiment results\n- The hierarchical reasoning approach further improves the performance in fully-cooperative case.\n\nCons:\n- The two approximation scheme, LA and LOLA, are existing approaches well known in the community. So how do you place your novelty using these methods for approximation purposes?\n- The term high-oerder gradient is actually very confusing. At the very beginning I was thinking this is use higher-order derivatives to do policy optimization. It would be super helpful if the author make a comment on this early in the intro part.",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is clear and the experiments look sound to me. I indeed have some concerns regarding novelty as mentioned above.",
            "summary_of_the_review": "The paper revisits the idea of using higher-order gradient in multi-agent RL with two improvements: (1) using LOLA and LA for preserving higher-order gradients and (2) use a hierarchical reasoning approach to coordinate agents in team (cooperation) scenarios. So far I am not fully convinced of the novelty of the paper.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper436/Reviewer_TWCf"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper436/Reviewer_TWCf"
        ]
    },
    {
        "id": "5PZsDnVW3H",
        "original": null,
        "number": 2,
        "cdate": 1666510265860,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666510265860,
        "tmdate": 1666510265860,
        "tddate": null,
        "forum": "gvMAooaEi3",
        "replyto": "gvMAooaEi3",
        "invitation": "ICLR.cc/2023/Conference/Paper436/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "\nThis paper revisits high order gradient methods for multi-agent reinforcement learning and points out that it usually does not apply to games with high-dimensional state spaces due to inefficient computation and preservation of high-order gradient information. The authors develop a scheme to address the problem and enable order gradient methods to work for high dimensional problem. Furthermore, hierarchical reasoning is proposed to improve the coordination in team games.\n",
            "strength_and_weaknesses": "\nStrength:\n1.\tMulti-Agent Deep Deterministic Policy Gradient (MADDPG)  and projecting gradient from state space to action space are adopted to addressed the issue of computation and preservation of high-order gradient information, respectively.\n2.\tHierarchical reasoning is proposed tackle the miscoordination of between common-interested agents. \nWeaknesses:\nLack of theoretical analysis on the proposed methods.\n",
            "clarity,_quality,_novelty_and_reproducibility": "The code to reproduce the numerical results is currently unavailable.",
            "summary_of_the_review": "1.\tThe review does not think that resorting to MADDPG can totally mitigate the computation difficulty of high-dimensional gradient. Even though  the high order gradient can be calculated, it takes long time when the gradient is of really high-dimensional.\n2.\tAbout projecting the gradient information from state space to action space, there is no theoretical analysis on how the projection influence the results. Does it degrade the performance or not? If not, what conditions are supposed to be satisfied.\n3.\tFor the hierarchical reasoning, is it guaranteed to converge to the equilibria for any level of hierarchy. \n",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper436/Reviewer_eo4T"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper436/Reviewer_eo4T"
        ]
    },
    {
        "id": "EQqRPa9tpa",
        "original": null,
        "number": 3,
        "cdate": 1666576900724,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666576900724,
        "tmdate": 1666576984031,
        "tddate": null,
        "forum": "gvMAooaEi3",
        "replyto": "gvMAooaEi3",
        "invitation": "ICLR.cc/2023/Conference/Paper436/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "The Higher-Order Gradient approach is of great value to the field of MAS, as it can be used in many important areas such as the theory of mind. The authors review the existing work and further propose Hierarchical Reasoning to facilitate the collaboration of team agents, noting that their approach is highly extensible and will help the community to explore the problem in the future.",
            "strength_and_weaknesses": "Strength.\n* The authors have studied a very important direction\n* The paper is clearly written and well understood\n* A comprehensive review of existing papers so that the value of the methods can be pinpointed\n* The experimental part looks adequate\n\nWeaknesses.\n* The authors claim that the existing methods are only applicable to low-dimensional settings, while their proposed methods can be applied to high-dimensional settings. But what puzzles me is that the experimental environment looks simple, while the number of real states in the environment is not very large, please note that I mean how many discrete states are in the environment.\n* Although the experiments show the effectiveness of the authors' method, it looks like the variance is large and there is a relatively large overlap between the algorithms, does this mean that more iterations of the experiments are needed or think about other evaluation methods?\n",
            "clarity,_quality,_novelty_and_reproducibility": "Clear writing, good quality and novelty, need subsequent open source code and environment to verify its reproducibility\n",
            "summary_of_the_review": "Looks like a good paper, very interesting, I will adjust my score further after considering the author's rebuttal with other reviewers' comments.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper436/Reviewer_ynkz"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper436/Reviewer_ynkz"
        ]
    },
    {
        "id": "a6jwO_QmngV",
        "original": null,
        "number": 4,
        "cdate": 1666778109147,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666778109147,
        "tmdate": 1666778109147,
        "tddate": null,
        "forum": "gvMAooaEi3",
        "replyto": "gvMAooaEi3",
        "invitation": "ICLR.cc/2023/Conference/Paper436/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper studies the use of higher order gradient methods for multi-agent RL with high dimensional state space. It shows that existing methods can lead to miscoordination among agents. A hierarchical reasoning algorithm is proposed. Experimental results are presented to show the applicability of the method. \n\n",
            "strength_and_weaknesses": "Strength\n- The problem in consideration is interesting. \n- The proposed algorithm performs well in the experiments. \n\nWeakness\n- The paper could make it clear what the exact setting is. This will help clarify some potential confusion. For example, the issue raised in the intro does not seem to exist in the CTDE framework (not a game setting). \n- What are the forms of (1) and (2) when there are multiple agents? So are (3)-(7). Right now everything is done with n=2. \n- Following the above comment, it appears that most of the derivation and most experiments are done for a 2-user case (or two coordinating agents with others). While the reviewer understands the tractability of this case, it seems a bit limited that even in the experiments only two agents are considered. \n- Where is the projection step in the algorithms? Also, what is the complexity for doing so? \n- The presentation is a bit confusing. In Fig. 2,  LA-MADDPG and LOLA-MADDPG are both marked as “ours”. But in Table 3, only HR-MADDPG has this label. From the text, it seems that the paper applies the ideas to LA-MADDPG and LOLA-MADDPG. Please clarify. \n- It would be useful to highlight the key difference between the proposed algorithms and MADDPG. Right now the novelty of the algorithm is not clear. \n- Minor: “between the agents” should be “among the agents”",
            "clarity,_quality,_novelty_and_reproducibility": "The writing and presentation of the paper could be improved. The authors should also further highlight the key novelty of the proposed algorithms and explain more about their advantages compared to existing methods. ",
            "summary_of_the_review": "Overall, the paper considers an interesting problem and the experimental results show that the algorithms perform well. However, the presentation of the paper could be improved, also, the contributions need to be better explained. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper436/Reviewer_VXeR"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper436/Reviewer_VXeR"
        ]
    }
]