[
    {
        "id": "fuCgqZ4l5RH",
        "original": null,
        "number": 1,
        "cdate": 1666523274353,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666523274353,
        "tmdate": 1669286273311,
        "tddate": null,
        "forum": "j1HyTEWHTT",
        "replyto": "j1HyTEWHTT",
        "invitation": "ICLR.cc/2023/Conference/Paper6309/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper focuses on template inversion attack against face recognition systems and proposes a method to reconstruct face images from facial templates. In a GAN-based framework, a mapping from facial templates to the intermediate latent space of a pre-trained face generation network is learned, from which high-resolution reconstructed face images can be generated. The proposed method can be\napplied in whitebox and blackbox attacks against face recognition systems. \n",
            "strength_and_weaknesses": "The main contributions of the paper are:\n-\tA method to generate high-resolution realistic face images from facial templates. Within a GAN-based framework, the mapping from facial templates to the latent space of a pre-trained face generation network is learned.\n-\tThe method is proposed for whitebox and blackbox attack scenarios. The method is based on the whitebox knowledge of the face recognition model, and it then extended to an attack blackbox scenario, using another face recognition model that the adversary has access to.\n\nThere are some aspects in the paper that need clarification:\n-\tIn my opinion the novelty of the paper is limited. The proposed method mainly relies on StyleGAN3 for face reconstruction. \n-\tDue to the social security and ethical implications of this works, authors could have described possible solutions to mitigate the effect of the proposed attacks.  \n-\tAuthors did not discuss the results in a good way. It is not clear which are the limitations of the method, and which are the case some reconstructions are not well recognized. No examples are given of such cases. \n",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is clearly writen and easy to read and understand. \n\nThe technical novelty is limited in my opinion because the proposed method mainly relies on StyleGAN3 for face reconstruction. \n\nDetails for reproducibility are given.",
            "summary_of_the_review": "The paper is clearly written and easy to read and understand. \n\nIn my evalaution I weighted more the weaknesses and the fact the actual novelty contribution is limited.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "Yes, Privacy, security and safety"
            ],
            "details_of_ethics_concerns": "The paper focuses on the problem of adversarial attacks in face recognition, which has clear implications for privacy and safety. Authors included an ethics statement, but they should also try to illustrate how to mitigate the potential issues deriving from their proposed attack method.\nMake public the code of the paper could result in potential risk. \n",
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper6309/Reviewer_bw96"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper6309/Reviewer_bw96"
        ]
    },
    {
        "id": "-f0HJ_3chlJ",
        "original": null,
        "number": 2,
        "cdate": 1666523290355,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666523290355,
        "tmdate": 1666523290355,
        "tddate": null,
        "forum": "j1HyTEWHTT",
        "replyto": "j1HyTEWHTT",
        "invitation": "ICLR.cc/2023/Conference/Paper6309/-/Official_Review",
        "content": {
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully.",
            "summary_of_the_paper": "In this paper, they focus on the template inversion attack against face recognition systems. Within a generative adversarial network (GAN)-based framework,  learn a mapping from facial templates to the intermediate latent space of a pre-trained face generation network. their proposed method achieves high success attack rates in white box and black box scenarios.",
            "strength_and_weaknesses": "Strength\n1.using a pre-trained StyleGAN3 network and learned a mapping from facial templates to intermediate latent space of StyleGAN within a GAN-based framework\n2. proposed method for whitebox and blackbox scenarios\n3. defined five different attacks and evaluated the vulnerability of SOTA FR systems to our proposed method.\n\nWeaknesses\n1. More details about the method\n2. More details about the attacks\n3. More analysis on white and black box\n",
            "clarity,_quality,_novelty_and_reproducibility": "Clarity\nLow\n\nQuality\nGood\n\nNovelty \nMedium\n\nReproducibility\nMedium",
            "summary_of_the_review": "The paper presented a method for better resolution using Style GAN.\nIts structure and methods looks good and novel, however, more details in mythology and presentation is needed.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "Yes, Privacy, security and safety"
            ],
            "details_of_ethics_concerns": "It was better, not to mentioned to the github link in this stage or make it blind!",
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper6309/Reviewer_dNW2"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper6309/Reviewer_dNW2"
        ]
    },
    {
        "id": "kDp5ZKHsJ0",
        "original": null,
        "number": 3,
        "cdate": 1666634846540,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666634846540,
        "tmdate": 1666634846540,
        "tddate": null,
        "forum": "j1HyTEWHTT",
        "replyto": "j1HyTEWHTT",
        "invitation": "ICLR.cc/2023/Conference/Paper6309/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "The paper studies the template inversion attack against face recognition (FR) systems. It uses results in the literature to train an encoder that generates the latent representation of StyleGAN and, using StyleGAN decoder, produces a realistic face, that is subsequently used to attack a FR system.\n",
            "strength_and_weaknesses": "Strength.\n\nThe paper addresses a relevant problem and proves an important vulnerability of present FR systems. It is well written and the experimentation seems correct.\n\nWeaknesses.\n\nMy main complain is the title of the paper, that, in my opinion, is misleading. The main contribution in the paper is using results in the literature to engineer of a set of attacks of an inrceasing degree of difficulty proving in all of them the vulnerability of present FR systems. \n\nThe face generation part is also relevant, but I would attribute the excellent performance of the attacks to StyleGAN's merits. From the experimentation in the paper it is not clear what is the contribution of the adversarial training. In your ablation you only analyze the contribution of (2) and (3), what about (4) and (5)?\n",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is well written. The results are new, relevant and they can be reproduced. The authors promise to make publicly available the experimentation code.",
            "summary_of_the_review": "The paper proves how vulnerable are present FR systems to the template inversion attack even if the intruder does not know the model used to produce the template nor the FR algorithm.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper6309/Reviewer_3DHW"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper6309/Reviewer_3DHW"
        ]
    },
    {
        "id": "fsEM4D6q2nz",
        "original": null,
        "number": 4,
        "cdate": 1666729303560,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666729303560,
        "tmdate": 1666730528318,
        "tddate": null,
        "forum": "j1HyTEWHTT",
        "replyto": "j1HyTEWHTT",
        "invitation": "ICLR.cc/2023/Conference/Paper6309/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "The authors of this paper propose  new method to reconstruct high-resolution realistic face images from\nfacial templates in a FR system. They focus on the template inversion attack against face recognition systems.",
            "strength_and_weaknesses": "\nStrength\n- The motivation is very clear.\n-  It is well written and the experimentation seems correct.\n- Five different attacks and evaluated the vulnerability of SOTA FR systems to the proposed method are defined.\n",
            "clarity,_quality,_novelty_and_reproducibility": "- The novelty and scope appear limited and incremental. The main contribution in the paper is in using results in StyleGAN in  FR systems.\n- The authors promise to make publicly available the experimentation code.\n",
            "summary_of_the_review": "The paper is clearly written and easy to read and understand. But the novelty and scope appear limited.  ",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "Yes, Legal compliance (e.g., GDPR, copyright, terms of use)"
            ],
            "details_of_ethics_concerns": "The authors should explain how to mitigate the potential issues deriving from the proposed attack method. ",
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper6309/Reviewer_e7hV"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper6309/Reviewer_e7hV"
        ]
    }
]