[
    {
        "id": "AeGI7t4LWi",
        "original": null,
        "number": 1,
        "cdate": 1666330542013,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666330542013,
        "tmdate": 1666344334885,
        "tddate": null,
        "forum": "JQc2VowqCzz",
        "replyto": "JQc2VowqCzz",
        "invitation": "ICLR.cc/2023/Conference/Paper5720/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This paper proposes a structured world model which learns to disentangle image sequences into interaction-irrelevant global features and interaction-relevant relational features without supervision. The design of the model continues the ideas from IODINE, which iteratively inference latent representations to generative target images. Differently, the global features and relational features are designed to be separated and learned implicitly. The model is evaluated on two downstream tasks: planning and casual understanding, experiments show the effectiveness of the disentangled representation.",
            "strength_and_weaknesses": "Strength:\nThe paper presents a very interesting idea of disentangling representations based on interaction.\n\nExperiments show that the learned representations achieve better performance in planning tasks and understanding causal relationships.\n\nWeakness:\nMissing discussion on type of factorization, especially between implicitly factorized representation and explicitly factorized representation.\n\nPlease discuss why the performance of OP3 on the Weights dataset is so poor even when doing nothing, because the result on the block moving dataset seems fine.\n\nI would like to see the video prediction performance comparison between OP3 and STEDIE on the non-action-conditioned datasets, like CLEVRER.\n\n",
            "clarity,_quality,_novelty_and_reproducibility": "There are som typos:\n•\t(a) (a) (b) in the caption of Figure 1 should be (a) (b) (c).\n•\tDoes a^{(t)} should be a^{(t-1)} in the first row of page 5?",
            "summary_of_the_review": "The paper presents a method to disentangle representations based on interaction. The ideas are validated quantitatively and qualitatively. Yet, I am concerned about the insufficient evaluation. I am open to adjusting my rating if the authors do sufficiently address the points raised in weaknesses.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper5720/Reviewer_sHVk"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper5720/Reviewer_sHVk"
        ]
    },
    {
        "id": "yd5TCFmIZM",
        "original": null,
        "number": 2,
        "cdate": 1666476066890,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666476066890,
        "tmdate": 1666476066890,
        "tddate": null,
        "forum": "JQc2VowqCzz",
        "replyto": "JQc2VowqCzz",
        "invitation": "ICLR.cc/2023/Conference/Paper5720/-/Official_Review",
        "content": {
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "The paper propose STEDIE, a new model that disentangles object representations based on interactions, into interaction-relevant relational features and interaction-irrelevant global features without direct supervision. Across different experiments, the authors showcases the model's effectiveness.",
            "strength_and_weaknesses": "I want to preface this by saying that I'm not really familiar with the field of object-centric learning.\n\nStrength:\n- I think the model is well designed and has some interesting novelties. The authors do a good job explaining the model.\n\nWeakness:\n- Equation one \\sigma has a (0) superscript, which seems to be a typo.\n- I think overall, the downstream task evaluation seems a bit underwhelming to me.\n1. I think the evaluation metrics and visualizations are not exactly informative. As far as I can tell from the paper, the action and measurements are done in 3D. The evaluation metrics of accuracy is based off a distance metric that's unspecified in the paper and appendix. Not showing direct measurement in 3D limits my confidence in the model. MSE is calcuated in pixel space, which is weird, because say we move the cube along the camera direction, it results in not so much change in pixel mse, but the 3D location can be far off.\n2. From what I can tell, OP3 seems like a model from quite awhile ago, while STOVE seems to be a very relevant baseline. I can't really tell from the paper which reference is STOVE, and why the authors are not comparing with it.",
            "clarity,_quality,_novelty_and_reproducibility": "Pretty clear, novel and seems reproducible. However, i think the downstream task's quality is a bit lacking.",
            "summary_of_the_review": "Please see my strength and weakness.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper5720/Reviewer_Hvkp"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper5720/Reviewer_Hvkp"
        ]
    },
    {
        "id": "24gG2hjFKq",
        "original": null,
        "number": 3,
        "cdate": 1666607620805,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666607620805,
        "tmdate": 1666607620805,
        "tddate": null,
        "forum": "JQc2VowqCzz",
        "replyto": "JQc2VowqCzz",
        "invitation": "ICLR.cc/2023/Conference/Paper5720/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper proposes a probabilistic model to learn disentangled object representation in an unsupervised fashion. The generative model is expressed through an observation module and a dynamic module, where the representations of entities are factorized into interaction-relevant relational features and interaction-irrelevant global features. The model is optimized with variational inference by maximizing the ELBO. Latent swapping experiments and downstream tasks are conducted on Block and Weights datasets.",
            "strength_and_weaknesses": "Strengths:\n- This paper differentiates itself from prior work by disentangling the object-centric representation to interaction-relevant feature and the global feature, which is a promising direction for unsupervised representation learning.\n- The experiments show that the model can learn disentangled representations, and the learned representations can facilitate downstream tasks in planning and roll-out reconstruction.\n\nWeaknesses:\nThe major concern lies in the experiments. 1) the latent swapping experiments are conducted on the block moving datasets, and the involved features are relatively simple, i.e., color for global feature and position as relational feature. Prior work also demonstrates such disentangled representation even without explicit modeling of the dynamic and static features. Without further quantitative comparison with other baselines or in more complex scenarios, it’s hard to justify the significance of the proposed model. 2) The downstream experiments are mainly compared against OP3, which does not disambiguate global or relational features. Are there justifications why not compare to factorized models like STOVE?\n",
            "clarity,_quality,_novelty_and_reproducibility": "Clarity and quality: Although not an expert, I find the paper writing and logic flow clear and easy to follow. The comparison with prior work on object-centric methods is also clear and distinctive.\nTypo: section 3.2 dynamic module\n\nNovelty: The proposed model is built upon previous work OP3 and various strategies are applied to infer the parameters. The major novelty lies in the disengagement probabilistic design.\n\nReproducibility: the paper included implementation details in the supplementary material. Code is not included.\n",
            "summary_of_the_review": "My ratings are given based on my evaluation of the strengths and weaknesses above. The authors are expected to address my concerns over the experiments.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper5720/Reviewer_qwR6"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper5720/Reviewer_qwR6"
        ]
    },
    {
        "id": "ku5sZVuNmtH",
        "original": null,
        "number": 4,
        "cdate": 1666756139742,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666756139742,
        "tmdate": 1666756139742,
        "tddate": null,
        "forum": "JQc2VowqCzz",
        "replyto": "JQc2VowqCzz",
        "invitation": "ICLR.cc/2023/Conference/Paper5720/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This paper proposes a method that learns disentangled representations of objects determined by interaction-relevant and interaction-irrelevant latents. The proposed method is based on OP3, but with a formulation that encourages the desired disentanglement. In experiments, the authors show that the interaction-relevant and interaction-irrelevant latent variables are in fact disentangled by swapping them between two different sequences. They also show that the disentangled representations lead to improved performance in downstream tasks against the baselines.",
            "strength_and_weaknesses": "Strengths:\n+ New method for disentangled object centric representation learning\n+ Experiments showing the disentanglement is present\n+ Experiments showing the disentanglement leads to better downstream performance\n\n\nWeaknesses:\n\n- Intersection over union evaluation:\nThe authors present an intersection over union evaluation to show that interaction-relevant latents contain location information. However, I am not clear how the authors are able to get locations from the latents, and so, can't really see how this evaluation is possible. Can the authors clarify how this is done? Or point out where in the paper this is described. If this is in fact somewhere in the paper, and I cannot find it, it would be useful if this is revised later on so it's easier to find.\n\n\n\n- Pairwise interactions mechanism visualizations:\nIn page 5, the authors mention that they use a d_{o,o} function to calculate pairwise interactions between objects. However, there is no analysis of how these interactions are happening after a model is trained. If this is possible, it would be good to have some type of visualization showing how these become active when objects are interacting in the pixel space.\n\n\n\n- Typos in the writing:\nThere are many typos throughout the text. For example, in section 3.2, first paragraph, line 7, module is misspelled as moduele. In addition, there is misuse of the verb is. For example, in page 6, 4th paragraph, the authors say \"Finally, parameters of a generative model pθ and an inference model qφ is\" while it should be \"Finally, parameters of a generative model pθ and an inference model qφ are\". These type of typos are happening in multiple places in the manuscript. I suggest the authors proof read the manuscript and fix these writing issues.",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is fairly clear, but the authors should improve the writing and how they describe things I mentioned in the weaknesses section. The results seem of quality to make the point the paper is about. The method seems novel, and the authors provided details of the architecture in the supplementary material so it should be reproducible.",
            "summary_of_the_review": "In conclusion, I find this paper interesting regardless of the toy setup the conceptual contribution is shown. I have a couple of questions that I have stated in the weakness section that I would like the authors to clarify. In the mean time, I am leaning towards accepting this paper, but I am looking forward to discussions to determine the final assessment.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "empirical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper5720/Reviewer_wuf5"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper5720/Reviewer_wuf5"
        ]
    }
]