[
    {
        "id": "ea52_COv5r",
        "original": null,
        "number": 1,
        "cdate": 1666687777371,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666687777371,
        "tmdate": 1666687777371,
        "tddate": null,
        "forum": "kzqRIEHBgH",
        "replyto": "kzqRIEHBgH",
        "invitation": "ICLR.cc/2023/Conference/Paper2427/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper proposes an approach to uncertainty estimation for image-to-image tasks based on continuous masking. The approach can work with arbitrary networks, and distance metrics between images and is guaranteed to yield distances within a small threshold with high probability. Experiments are conducted on image colorization, image completion, and super-resolution tasks. ",
            "strength_and_weaknesses": "Strength\n+ theoretically proved that the uncertainty mask is with an accuracy guarantee, and the user can set the threshold to control the ratio of trust-worthy regions.\n+ experiments done on three image-to-image tasks prove the adaptability of the proposed method.\n\nWeaknesses\n+ in the mask of the colorization task, there is some inexplicable circular artifact pattern, which would depreciate the uncertainty mask.\n+ in table 1, the proposed method produces comparable results to that of Opt in some settings, it’s not mentioned whether significant tests are performed or not.  It’s said that a smaller average mask size ||M|| indicates better performance, why Opt’s results are not the best?\n",
            "clarity,_quality,_novelty_and_reproducibility": "This paper is overall well-written.\nThe method of the work is well described and theoretically solid, with the correspondence between the mask and uncertainty being proved.\nThe method utilizes continuous masks that can work as uncertainty map as well and can be applied to any image-to-image network and distance function, which is flexible and somewhat novel. \n",
            "summary_of_the_review": "The paper presents a novel method that connects uncertainty estimation with masks. The method is highly flexible and has a theoretical guarantee. In the experiments, the method is tested on three different image-to-image tasks, which are comprehensive. While the results and comparison are not very intuitive and clear, which can be further improved. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2427/Reviewer_GH3K"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2427/Reviewer_GH3K"
        ]
    },
    {
        "id": "XBBxATfxW7t",
        "original": null,
        "number": 2,
        "cdate": 1666778208630,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666778208630,
        "tmdate": 1666778208630,
        "tddate": null,
        "forum": "kzqRIEHBgH",
        "replyto": "kzqRIEHBgH",
        "invitation": "ICLR.cc/2023/Conference/Paper2427/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "Quantifying uncertain regions when performing image-to-image tasks such as inpainting or super resolution can be useful in identifying low confidence regions. This work presents a mask minimization approach that strives to obtain the smallest regions that correspond to the the most uncertain regions, as defined by user defined probabilistic thresholds. The method is implemented as a neural network and is modular in which distance- or distortion measures can be used in assessing the quality of masks. Experiments are reported on three image-to-image tasks : inpainting, colorization, super-resolution on two datasets using multiple distance measures. The experimental evaluation on two datasets are compared with an oracle based method (Opt) and a related conformal prediction method (Quantile), showing improvements compared to the latter.  \n",
            "strength_and_weaknesses": "**Strengths:**\n\n* The problem formulations are clearly presented with elegant theoretical justifications. The proof of Theorem 1 solved using a dual formulation of P1 with KKT conditions look correct. The limitations of formulating the problem P1 are discussed clearly, and the motivation for simplifying it to P2 is reasonable.\n\n* The overall task of estimating uncertain regions in image-to-image tasks is interesting, and the diversity of tasks addressed in this work is comprehensive. \n\n* The resulting method is simple and looks like can be easily integrated into other image-to-image tasks. \n\n* Experimental results show the proposed method to consistently perform better than the baseline. There are some issues with the evaluation itself which is discussed further below.\n\n**Weaknesses:**\n\n* **Simplification from P1 to P2**: The simplification from P1 to P2, and finally the objective in Eq. 6 used to train the model assumes a series of strong simplifications. While I see the need for making these simplifications; for instance, going from P1 to P2 removes the reliance on ground truth masks at inference, the implications of making these simplifications remains unclear. One could ideally arrive at the same objective in Eq. 6 without theorising about P1/P2, as it is in the end trying to minimize the span of a mask and distortion. I appreciate the authors presenting theorems and proofs in Appendix A, but I am not entirely convinced this to be useful in the end. I would like clarifications on how the final objective in Eq. 6 still is a reasonable solution to P1. \n\n* **Distortion measures**: The modularity of the proposed method, that it is not tied to specific distance or distortion measures is appealing. However, there is no specification of the distortion measures at all (or that I could easily find). In the end, for the three experiments which are the distortion measures used? Is there a difference in which distortion measure $d(\\cdot)$ is used for the three tasks. \n\n* **Loss function in Eq. 6**: During training the loss function in Eq. 6 still uses the ground truth. If this method were to be an unsupervised one is there a further simplification of Eq. 6 that could remove the reliance on ground truth? For instance, the distortion measure could instead be based on some variation of pixel-level entropy of the reconstructed data.  \n\n* **Pixel-wise uncertainty measures**: One other simplification used in this work is that of the pixels being independent and their uncertainty measures are estimated/modelled at the pixel level (please correct me if I have misunderstood this part). If this is the case, how reliable are these uncertainty masks? At least from the visualizations in Fig. 3 the mask seems largely spatially correlated. How is this ensured in the model?\n\n* **Mask as a neural network**: In Sec 3.2 the authors state _modelling the mask as a neural network_. What does this exactly mean? The neural network $m_\\theta(x,\\hat{y})$ takes the degraded input and the reconstructed output and predicts the mask, as a pixel grid with [0,1] values? This is not entirely clear and also the neural network itself is later described as the mask model (implemented as a U-net); are these two the same? If the mask model is indeed a U-net what are the inputs to it? Are the degraded input and reconstruction both provided as the input?  \n\n* **Mask-size as a measure of uncertainty**: One of the main concerns with the evaluations reported in this work is using mask size as measure of uncertainty or the correlation of mask size with distortion. This is firstly an unconventional way of assessing uncertainty; perhaps also due to the lack of clarity on what distortion measures are used it seems to be not the most obvious way of representing uncertain regions. Additional results are reported in Fig. 4 but are not discussed in the context of uncertainty assessment, making it harder to wrap them in understanding the proposed work.   \n",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is largely clearly written, except for a few typos. The idea of minimizing a mask that captures distortion as a measure of uncertainty is certainly novel but if this exactly captures meaningful uncertainty is something that remains unclear. ",
            "summary_of_the_review": "A method to estimate uncertainty in image-to-image tasks is presented within a theoretical formulation. However, the problem formulations are simplified extensively to obtain the final objectives; implications of these simplifications are not explained in relation to the original problem formulation. Assessing uncertainty in the experiments is done using mask size as a proxy, which is unconventional and does not immediately translate into established notions of uncertainty estimation methods. \n",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2427/Reviewer_xoZ2"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2427/Reviewer_xoZ2"
        ]
    },
    {
        "id": "x0RS2eabQA5",
        "original": null,
        "number": 3,
        "cdate": 1667152831554,
        "mdate": null,
        "ddate": null,
        "tcdate": 1667152831554,
        "tmdate": 1667152831554,
        "tddate": null,
        "forum": "kzqRIEHBgH",
        "replyto": "kzqRIEHBgH",
        "invitation": "ICLR.cc/2023/Conference/Paper2427/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "     Authors present a new method for estimating the uncertainty in\n     image-to-image problems. Given a model that is already trained to do\n     image-to-image prediction, authors train a model that predicts a mask that\n     only retains the accurate areas in the prediction. The inaccurate areas are\n     masked out, therefore reducing the overall prediction error. The mask is\n     said to retain ``certain'' regions in the prediction. \n\n     Authors compare their method with two alternatives. First, is a method that\n     predicts confidence intervals. The confidence intervals are modified by the\n     authors of this work to generate a mask. The resulting mask is compared to\n     that given by the method here. The second alternative is an upper-bound. A\n     method that is aware of the prediction and the ground-truth. \n\n     Results show that the proposed method is indeed better than the\n     alternative and close to the upper-bound. ",
            "strength_and_weaknesses": "     Strengths: \n     1. The proposed method is a post-hoc analysis technique and, therefore, it\n        can be applied to any pre-trained network. This is a clear strength. \n     2. Predicted masks are not as good as the upper bound, but they are much\n        better than the alternative technique. \n     3. Authors demonstrate the method on three different tasks colorization,\n        super-resolution and image completion. \n     4. Authors demonstrate their method on biological imaging, where\n        uncertainty quantification may indeed be important. \n\n     Weaknesses: \n     1. The proposed technique does not seem to predict uncertainty. To the best\n        of my understanding, it predicts where the original model is making\n        errors. An easy way to see this would be to consider a point where the\n        model is confident but inaccurate, i.e., a bias. The predicted mask\n        should cover this point, even though it is not an uncertain prediction\n        of the model. The problem is actually in the definition of\n        ``uncertainty''. Equation 1 (or 3) do not necessarily only correspond to\n        uncertainty. It corresponds to expected error for a sample. It also\n        includes the contribution of bias. In this regard, I think the\n        uncertainty positioning may not be very accurate. Consequently, the\n        comparison with a method that computes confidence intervals may not be\n        appropriate. Here, I should note that predicting expected error or the error is not a\n        bad target. However, the difference between this and uncertainty\n        estimation should probably be made clear. \n\n     2. I am not sure about the contribution of the corollary 1. The result is\n        not very surprising in my opinion. The mask that aims to minimize the\n        ``uncertainty'' is bound to be related to the ``uncertainty''. \n\t\n     3. It is unclear how authors estimate the expectation in Equations 4\n        or 5. This is over y|x variable. However, in Equation 6, they drop the\n        expectation and simply take only one sample to compute this\n        expectation. Using this I am assuming the model learns to predict the\n        error and not the expected error. As a result, the model may not be able\n        to identify an uncertain prediction at a pixel for a given sample since\n        for that pixel, there may be only 1 output that happens to be close to\n        the ground truth. \n\n     4. Equation 8 yields a suspicious behavior. When m_{\\theta} = 0,\n        m_{\\lambda} = \\lambda. However, when m_{\\theta} = 1, m_{\\lambda} =\n        \\infty. It is unclear how authors deal with this. Furthermore, the\n        intuition of this specific calibration form is unclear. ",
            "clarity,_quality,_novelty_and_reproducibility": "     The writing is pretty clear. Authors are did a great job there. The only\n     missing parts are some details that confuses me about the equations, i.e.,\n     Equation 8 and what it implies. \n\n     The work seems like novel. However, for the comparison, I believe there are\n     other works that aimed to predict the expected error or a measure that\n     relates to expected error in image-to-image networks. A simple example is\n     the aleatoric uncertainty formulation of Gal et al. At the output, they\n     simply put a variance that would modulate itself for erroneous\n     predictions. The variance map can be used as the map authors produce here. \n\n     The work seems quite reproducible. Authors did a great job there as well. \n\n     The quality of the work is high in most parts. I believe the positioning of\n     the article can be better done. Moreover, the comparisons are very\n     limited. When we look at this as predicting expected error, I believe\n     different comparisons can be considered. I suggest authors to view their\n     method from that angle. ",
            "summary_of_the_review": "     The work is interesting but there are some drawbacks. \n\n     The most important drawback is that authors effectively present a method\n     that predicts error maps rather than uncertainty in the prediction.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2427/Reviewer_DEta"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2427/Reviewer_DEta"
        ]
    },
    {
        "id": "9My4PBoRRu",
        "original": null,
        "number": 4,
        "cdate": 1667409938216,
        "mdate": null,
        "ddate": null,
        "tcdate": 1667409938216,
        "tmdate": 1667410196882,
        "tddate": null,
        "forum": "kzqRIEHBgH",
        "replyto": "kzqRIEHBgH",
        "invitation": "ICLR.cc/2023/Conference/Paper2427/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This paper proposed a new approach for uncertainty estimation in image reconstruction, which uses masking mechanism to identify the more certain regions of the reconstructed image, thus narrowing the distance between masked ground truth and reconstructed images. The experiments are conducted on three reconstruction tasks: image colorization, image completion and super-resolution.",
            "strength_and_weaknesses": "Strength:\n1. The proposed method introduced a continuous mask to replace the previous binary mask for better modeling the uncertainty between the ground truth image and the reconstructed image.\n2. The conformal prediction strategy is employed to calibrate the masking model to obtain strong statistical guarantees. \n3. The paper is good writing and easy to follow.\n\nWeakness:\n1. The generation way of the continuous mask m is not clear, is it the same as the prevalent implicit neural representation? And the ablation study compared to the binary mask should be provided. \n2. The visualization results for super-resolution are not included in the paper.\n3. It seems that Figure 2 is dispensable, as it doesn’t provide more meaningful information to understand the experiment setups.\n",
            "clarity,_quality,_novelty_and_reproducibility": "The clarity and quality of this paper seem good, the proposed idea is somewhat interesting, and the reproducibility is reasonable.",
            "summary_of_the_review": "The paper studied the problem of uncertainty estimation in image-to-image domain. The idea seems somewhat interesting, but the effectiveness is not well verified. I think this paper meets the margins of acceptance.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2427/Reviewer_pBvq"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2427/Reviewer_pBvq"
        ]
    }
]