[
    {
        "id": "Z-PLkOfO6J",
        "original": null,
        "number": 1,
        "cdate": 1666363747064,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666363747064,
        "tmdate": 1668742964211,
        "tddate": null,
        "forum": "NeDc-Ak-H_",
        "replyto": "NeDc-Ak-H_",
        "invitation": "ICLR.cc/2023/Conference/Paper4448/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This paper introduces Loci, a self-supervised system for object-centric location and identity tracking in video. The motivation is to build a hybrid symbolic + neural system that addresses challenges pertaining to the binding problem. Emphasis is placed on disentangling “what” from “where” in each object representation. The main experimental results compare Loci against competitive baselines on CATER and Moving MNIST.\n",
            "strength_and_weaknesses": "Strengths\n=======\n- Identifying how to use self-supervised learning to solve binding-problem-respective challenges for object-centric perception is an important and relevant problem.\n\n- Good empirical results on CATER and MovingMNIST. The results of the self-supervised version are  mostly comparable to baselines while the supervised version shows a stronger improvement.\n\nWeaknesses\n=======\n- I believe that the idea of disentangling “what” from “where in object-centric representation learning has been explored repeatedly in the past by previous systems (as the authors also indicate in the paper), and so I view this aspect of the paper to be of limited novelty.\n\n- It is unclear to me what other aspects of the Loci architecture are novel. I struggle to see how Loci advances our understanding of how to solve binding-problem-respective challenges. Rather, Loci as a whole appears to be an agglomeration of various ideas from prior work into a single, complex system. \n",
            "clarity,_quality,_novelty_and_reproducibility": "- I had a hard time understanding how the Loci system works and what the specific novel ideas were behind it. Section 3 was hard to parse in particular. I hoped Figures 1 and 2 would illuminate this, but they did not. \n\n- As a result, my understanding is that the Loci system as a whole only makes for an incremental contribution (e.g., as mentioned under Weaknesses), although it is interesting as a \"demo\" of some promising research topics (slot-based object-centric representations, object-centric dynamics, disentanglement of position and identity).\n\n- Due to the complexity of the architecture and various losses, re-implementing this system from scratch would be difficult.\n\nMisc suggestions\n=======\n- Title: typo? “Learning What and Where - Unsupervised Disentangling *of* Location and Identity Tracking”?\n\n-  I would suggest spending time improving the last paragraph of the introduction (or adding another paragraph after it). For example, instead of starting this paragraph with “Our goal is to…” and telling the reader what you’d *like to do*, it is usually best to directly tell the reader what you *did* (e.g., a paragraph beginning with “In this work we…”).\n\n- I found it overwhelming to try to parse all the aspects of the Loci system as presented (particularly Section 3). More details are provided in appendix Section B (which I skimmed through). It would help to identify one or two key architectural components that are novel and that “make all the difference”, and to focus the paper on these alone (while simplifying the rest of the system). Maybe more focus should be placed on Loci's slot design --- \"each slot has a spotlight\"/\"tree-structured slots\" (??) Overall, this will help a lot with clarity, and then the ablation studies for the one or two new components can be included in the main experimental results to further validate them.\n\n- Having one high-level figure showing how Loci processes an entire sequence of images could be helpful to understand what the inputs and outputs are, how the transition module is used, etc.\n",
            "summary_of_the_review": "I believe the paper, in its current state, is probably not ready for publication. I encourage the authors to spend time improving the presentation and clarity of the work to be able to identify and highlight novel insights that advance our understanding of how to address aspects of the binding problem. This may involve simplifying the proposed Loci system.\n\n---\nUpdate: After reading the author response, I have increased my score from 5 to a 6. Justification is provided in the comments.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper4448/Reviewer_fFzL"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper4448/Reviewer_fFzL"
        ]
    },
    {
        "id": "DBTsb1l6wX",
        "original": null,
        "number": 2,
        "cdate": 1666536707860,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666536707860,
        "tmdate": 1669211457319,
        "tddate": null,
        "forum": "NeDc-Ak-H_",
        "replyto": "NeDc-Ak-H_",
        "invitation": "ICLR.cc/2023/Conference/Paper4448/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "The paper proposes a new method along slot based, generative multi-object tracking following the approach of representation, segregation and composition (Greff et al. 2020). It claims the idea to introduce two encoding streams one for appearance and one for position. The paper is well written, however some illustrations and the way how the algorithms are described make the paper challenging to understand.\n",
            "strength_and_weaknesses": "The paper follows a line of research with the new idea to disentangle appearance encoding from position encoding. The idea is motivated by the human visual system which also operates as dorsal and ventral streams. The work shows appealing results on the standard datasets (Table 1). There are two shortcomings: 1) the description of the algorithms is somehow difficult to read and understand. My suggestions would be instead of showing pseudo code (page 25) and narrow, nearly unreadable network illustrations (page 3, page 26, 27) to save page space by neglecting the pseudo code and referring to the implementation code. By that the architectural illustration could be made readable which I think is essential to understand the paper. 2) You state on page 3: \"But optical flow based methods notoriously struggle with occlusions as they can only represent parts of the scene that are currently visible.\". Optical flow by definition is the vector field of apparent motion. So there is no direct intention to represent flow vectors caused by hidden objects in the vector field. I agree OF struggles with occlusion but because they usually do not consider the concept of occlusion. There are exceptions (see e.g. Detecting Occlusions as an Inverse Problem, Estellers & Soatto, J Math Imaging Vis, 2016).",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is well structured and written, except the part which illustrates the neural architecture which is less detailed and difficult to read. This might have an impact o reproduce the results. My other main concern is the claim that the idea to disentangle appearance and position is new. This might be true for this specific field of slot-based generative model learning but this core idea has been reported in other literature earlier (Denil et al., Learning where to Attend with Deep Architectures for Image Tracking, 2011; M. Ranzato, On learning where to look, 2014; Kahou et al., RATM, 2016).",
            "summary_of_the_review": "There is a huge effort in the paper showing appealing results on the CATER dataset. The reason the authors claim is the new idea of disentangling appearance from position encoding in their slot network. It seems that this idea is new to this line of research, however it is not new in ML. The paper needs improvement in the illustrations and in the presentation of the algorithms.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "Yes, Privacy, security and safety"
            ],
            "details_of_ethics_concerns": "Tracking poses privacy issues. I would not see any immediate harm to people and society due to this work.",
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper4448/Reviewer_Nkjj"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper4448/Reviewer_Nkjj"
        ]
    },
    {
        "id": "vEUNy2g_EB",
        "original": null,
        "number": 3,
        "cdate": 1666635564777,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666635564777,
        "tmdate": 1666635564777,
        "tddate": null,
        "forum": "NeDc-Ak-H_",
        "replyto": "NeDc-Ak-H_",
        "invitation": "ICLR.cc/2023/Conference/Paper4448/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "In this paper, inspired by the “what” and “where” parallel pathways of the visual system, the authors present a novel architecture for object segmentation and tracking with disentangled representations of objects and their position. The proposed slot-based object representation architecture excels on the position tracking benchmark CATER which is a complex task requiring detecting and tracking multiple objects and understanding their interactions in dynamic scenes. \n",
            "strength_and_weaknesses": "$\\textbf{Strengths}$: \n\nThe main idea underlying the proposed method is an interesting, algorithmic implementation of the parallel visual processing in the brain. The results, as presented in the paper, strongly support the efficacy of the proposed method. The paper is very well written, and except for one part of the architecture, the rest of the paper is straightforward and easy to understand. Thorough ablation experiments perfectly demonstrate the contribution of each design choice in the performance of the model. Overall, I believe the manuscript is ready for publication as is, and can make a significant contribution to both machine learning and cognitive neuroscience.\n\n$\\textbf{Weaknesses}$:\n\nAs mentioned above, I believe this paper doesn’t have a significant weakness that needs to be addressed before acceptance. However, there are two parts of the paper that could benefit from further explanation and exploration: the transition module and the information represented by the Gestalt and the position variables. I’ll elaborate in my questions and comments.\n",
            "clarity,_quality,_novelty_and_reproducibility": "The paper and the proposed method are clear (except for the parts which I'll explain in my comments below). The proposed method is novel, and can have a large impact on both machine learning and cognitive neuroscience.",
            "summary_of_the_review": "$\\textbf{Questions}$:\n\n1- How do we know whether the Gestalt and the position encoding variables in the trained model represent the intended information, e.g. object identity and position, respectively? The Gestalt and position lesion results shown in figures 14 and 15 imply a more significant role for the position than the Gestalt. Especially, in the example in figure 15, the Gestalt lesion doesn’t seem to damage shape or object information much in the reconstructed images. How would the lesions affect the moving MNIST task? It should be simpler to see the effects of lesions in the moving MNIST task, e.g. Gestalt lesions should damage digit shapes (or misrepresent digits) while position lesions should interfere with the digits’ movements. \n\n2- Do different slots learn to represent different objects in a scene? Showing a few examples would help. \n\n3- The architecture of the transition module isn’t clear. Unlike the other parts of the model, the transition module's equations are not included in the appendix either. I found it difficult to follow the inner functioning of the transition module. For example, what does “interaction between slot-encoded entities” mean?\n\n4- Although explained in some details in the main text, the results with more complex backgrounds are only limited to one example (the aquarium) in the appendix. Can the authors give more examples of segmentation/training tasks with complex, naturalistic backgrounds? Although the performance of the model is impressive in the case of the given example, the average performance of the model and its cases of failure cannot be understood from the given example. \n",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper4448/Reviewer_BwtU"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper4448/Reviewer_BwtU"
        ]
    },
    {
        "id": "Ah532ks6GN",
        "original": null,
        "number": 4,
        "cdate": 1666672165662,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666672165662,
        "tmdate": 1666672165662,
        "tddate": null,
        "forum": "NeDc-Ak-H_",
        "replyto": "NeDc-Ak-H_",
        "invitation": "ICLR.cc/2023/Conference/Paper4448/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "Here, the authors desribe a variant of Siamese networks that performs objecting identification and tracking, Loci. A key feature of Loci is that it treats the “Gestalt” of objects separately from their position. Loci is benchmarked using CATER and Moving MNIST, and it generally shows impressive performance gains relative to other techniques, especially in CATER.",
            "strength_and_weaknesses": "**Strengths**\n\n\n1. For the most part the paper is well-written and straightforward to follow.\n2. While Loci is fairly complex, I found most of the modeling decisions to be reasonably well-justified.\n3. The results, especiall on CATER, are impressive.\n\n**Weakness**\n\n\n1. I found parts of the model to be under-described, e.g. what exactly is a Gestalt code. This should be presented clearly in the main text since it is central to the model.\n2. The total loss function appears to be specifically tuned to CATER. For instance, would the position change loss need to be altered to accomodate different object movement speeds?\n",
            "clarity,_quality,_novelty_and_reproducibility": "Clarity and quality: good. Overall the paper is well-written and the results are nicely presented.\n\nOriginality: good. I am not an expert in object tracking, but this appears to be a novel architecture for this type of problem.",
            "summary_of_the_review": "This work presents an advance over the current state of the art in object identification and tracking. Moreover, it is clearly presented and well-argued. Overall I think this would be a good contribution to ICLR.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper4448/Reviewer_vHnv"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper4448/Reviewer_vHnv"
        ]
    }
]