[
    {
        "id": "mIGF0JPDm5A",
        "original": null,
        "number": 1,
        "cdate": 1666504681183,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666504681183,
        "tmdate": 1666718980063,
        "tddate": null,
        "forum": "nQai_B1Zrt",
        "replyto": "nQai_B1Zrt",
        "invitation": "ICLR.cc/2023/Conference/Paper218/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This paper proposes an animal-pose estimation method which can be applied to multiple animal species. Firstly the proposed method divides a set of animal keypoints into several groups. The keypoints in one group are supposed to have close relation, i.e. intra-group keypoints may provide a localization cue to each other. On the other hand, keypoints in one group may hinder the localization of the ones in another group due to the independence between groups. Then, the authors build a separate branch for each keypoint group for the keypoint detection network in order to encourage the interaction between intra-group keypoints and suppress the interaction between inter-group keypoints. The authors propose three grouping methods, among which two are based on rules and one is attention-based clustering method. The experimental results show that the proposed method using attention-based clustering outperforms some SOTAs , and thus the effectiveness the proposed method is verified.",
            "strength_and_weaknesses": "Strength: \n1. The attention-based keypoint clustering method is interesting, and the effectiveness is verified well via comparison with SOTAs and ablation study. \n2. Gradient conflict is used to analyze the effectiveness of the proposed idea.\n\nWeaknesses:\n1. The authors claim that some joint relations are consistent across all the species while some other joint relations are inconsistent and harmful. But the proposed method divides the keypoints into constant groups without considering species, which means the relations between keypoints are constant cross species. I think this work aims to build keypoint groups and estimate each group of keypoints relatively independently. This does not provide capability of handling  the diversity of species. \n2. The main novelty lies in keypoint grouping, while the network-split's novelty is relatively limited. I expect the authors to perform multiple methods to encourage interaction between intra-group keypoints and suppress interaction between inter-group, in order to verify the effectiveness of the idea of keypoint grouping\n3. The keypoint grouping result shown in Fig. 5 indicates that the grouping does not comply with prior knowledge very well. I doubt that this is relevant with training data's distribution.",
            "clarity,_quality,_novelty_and_reproducibility": "The proposed method is well verified by the experiments. \n\nAlthough the attention-based keypoint clustering method is interesting, the whole novelty is limited since the divide-and-conquer is a common approach In computer vision. Besides, specific characteristic of a species is not actually considered by the proposed work as claimed by the authors.",
            "summary_of_the_review": "The attention-based keypoint clustering method is interesting, but novelty is still not impressive. Besides, specific characteristic of a species is not actually considered by the proposed work as claimed by the authors.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper218/Reviewer_SQkn"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper218/Reviewer_SQkn"
        ]
    },
    {
        "id": "Jm6D9SIQrAe",
        "original": null,
        "number": 2,
        "cdate": 1666602515250,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666602515250,
        "tmdate": 1670074692156,
        "tddate": null,
        "forum": "nQai_B1Zrt",
        "replyto": "nQai_B1Zrt",
        "invitation": "ICLR.cc/2023/Conference/Paper218/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This paper proposes a domain generation approach, D-Gen, for cross-species animal pose estimation. D-Gen first learns k concept embeddings using an attention-based module. Then, previously-learned concept embeddings are used to decompose the body joints into k joint concepts with nearest neighbor search. Finally, D-Gen split the top layer of the network into multiple concept-specific branches based on the joint concepts. Experiments are conducted in both intra-family and inter-family settings to show the effectiveness of D-Gen.",
            "strength_and_weaknesses": "Pros:\n\n-The motivation in this paper is reasonable in that some of the relationships between specific joints may be shared by multiple animal species; hence, considering such relationships aids in cross-species animal pose estimation.\n\nCons:\n\n-K (Number of concept embedding) is a fixed number and is set to 3 for all tasks. Concept embedding in Fig 3 (b) is similar to the codebook[1]. When estimating the poses of various animal species, it is better to select a larger value for k and let the network dynamically select the concept embeddings to utilize.\n\n-The gap between the source and target domain is relatively small in both intra-family and inter-family (basically a four-legged mammal). A larger domain gap would be more convincing (e.g., fish, birds).\n\n-Lack experiments on existing large-scale animal pose datasets, e.g. [2]\n\n【1】 Van Den Oord A, Vinyals O. Neural discrete representation learning[J]. Advances in neural information processing systems, 2017, 30.\n\n【2】 Ng, Xun Long, et al. \"Animal Kingdom: A Large and Diverse Dataset for Animal Behavior Understanding.\" Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition. 2022.",
            "clarity,_quality,_novelty_and_reproducibility": "The motivation in this article is well-explained and generally reasonable, but the technical novelty in the individual parts are limited.",
            "summary_of_the_review": "The paper addresses an interesting problem but is hampered by the limited novelty of the approach and the lack of experiments for cross-species animal pose estimation with a larger domain gap(e.g. fish, birds).",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper218/Reviewer_e7pK"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper218/Reviewer_e7pK"
        ]
    },
    {
        "id": "vO03JdqMYZc",
        "original": null,
        "number": 3,
        "cdate": 1666619201744,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666619201744,
        "tmdate": 1666619201744,
        "tddate": null,
        "forum": "nQai_B1Zrt",
        "replyto": "nQai_B1Zrt",
        "invitation": "ICLR.cc/2023/Conference/Paper218/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper describes a new approach for domain generalization in cross-species pose estimation using different approaches to partition joints to be estimated into different ‘concepts’, and separately training parts of the network to estimate the position of each joint concept group. Three approaches for separating joint concepts are used: based on the proximity of joints to one another (heuristic), based on the joint affinity matrix (geometric), and based on a learned attention mechanism (attention). In each images are processed using common feature extraction layers, and then joint concepts are separated and processed in separate branches. The manuscript introduces the details of the attention based approach, which is novel and shown to perform superior to the others in several cases. They show that the attention approach minimizes gradient conflicts, i.e. does a better job of separating weight gradient vectors across joint groups. \nThey then perform benchmark experiments on two datasets that allow for testing domain generalization approaches within and across animal family. They compare the performance of each approach, along with a random split to account for ensemble gains, to competing domain generalization approaches and oracle approaches, in particular training and testing within a species or family. In many cases the attention approach performs superior to other domain generalization approaches. They close by investigating the effect of salient hyperparameters: the number of layers that are concept-specific and the number of concepts. \n",
            "strength_and_weaknesses": "Strengths\n1) Attention Approach is novel, and compared against several other reasonable baselines and datasets. The experiments are well documented and well performed. I think the advantages are somewhat appreciable in the intra-family case, and less so in the inter-family case, but this will be a nice result to build on. \n2) Manuscript is clear and easy to follow, trained on standard benchmarks in the field and fairly comprehensive. I appreciated the didactic figure 5\n3) I thought the gradient conflict analysis was interesting and a nice empirical motivation for the work.\n\n\nWeaknesses\n1) Treatment of uncertainty in tables. I am not sure how large the uncertainty is for the experiments in Tables 1,2,3 are. It would help to have reporting of this to evaluate the significance of some of the results seen – I am not sure how seriously to take 0.5 differences in AP. The error bars reported below each family also seem too low given the spread of values (e.g. Table 1, attention/average has a s.e.m of 0.5 ?). These could be computed from different model seeds or training data subsets. \n\n2) The oracle shows worse performance than the domain generalization approaches at times in Table 1. Is this because of a lack of data for rarer classes (e.g. king cheetah)? In these cases the oracle would have much less training data. It might make sense to also try training the oracle on all datasets in the family, and report the number of instances of each animal. \n3) Its worth noting that none of the approaches seem very good on the inter-family experiments (Tables 2 and 3) \n4) It would help potential users to have representation qualitative visualization of some of these performance differences. What does a mAP gain of 63 vs 59 look like for Bobcat in Table 1? What are typical inter-family results? Without these it is hard for prospective users to gauge the quality of the performance gains. \n5) Why simply average the loss with the baseline network and why not include a learnable weight for combining the predictions? \n\nComments:\n I think the approach could have more broad generality, e.g. for facial keypoint tracking where separate groups of keypoints co-vary.  \nI would be curious if any of the domain adaptation approaches can be combined, e.g. those that seek to match distributions should be fairly orthogonal to the present work. \n\n\nNits\nFigure 1:  What are the methods for the bar graphs on the left, why are there no error bars? \nTable 1: A.S. undefined. \nViewpoint dependence. Could conceive of as a style difference. \nFigure 6 and 5 switched\nIts worth noting that these 2D style transfer approaches will be sensitive to camera viewing angle, and the relation between joints and joint concepts may depend on viewing angle. \nWhy is the domain generalization performance so poor for panda bears and polar bears? \nCan you provide more detail on the empirical risk minimization approach. \n",
            "clarity,_quality,_novelty_and_reproducibility": "The manuscript is clear and the experiments are well described. The network design appears novel. ",
            "summary_of_the_review": "Overall I thought this was an interesting approach and seemed to show some promise compared to other approaches. The manuscript was clear and contained both fairly thorough benchmark comparisons, some hyperparameter optimization and some explanations for performance gains. I have reservations about the overall effect size/improvement and variance that I would like to see addressed, but otherwise I think it is a good contribution. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "empirical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper218/Reviewer_2nfE"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper218/Reviewer_2nfE"
        ]
    },
    {
        "id": "JDJRB4GzOU2",
        "original": null,
        "number": 4,
        "cdate": 1666697975411,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666697975411,
        "tmdate": 1670419125136,
        "tddate": null,
        "forum": "nQai_B1Zrt",
        "replyto": "nQai_B1Zrt",
        "invitation": "ICLR.cc/2023/Conference/Paper218/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This paper proposes a method for animal pose estimation able to generalize to different species. The method approaches the problem from the domain generalization point of view. It is based on the observation that some relations among joints remain consistent among different species, while others change drastically. According to this, the paper proposes to separate joints to concepts/groups and process them using a network with split top layers, as to break inconsistent relations while maintaining consistent ones.",
            "strength_and_weaknesses": "## Strengths\nThe proposed approach is principled and well motivated. Moreover, there are improvements in the animal pose estimation performance, regardless of the decomposition method, i.e. attention-based, heuristic or geometric. It is also important that the attention-based performs significantly better with respect to the other two methods. The network split is also well motivated based on gradient analysis.\nThe method is compared against state-of-the-art domain generalization methods.\n\n## Weaknesses\nThe fact that the proposed approach is based on two distinct stages, namely joint decomposition and network split, can be considered a weakness. This is mainly because the two steps appear to be strictly coupled, yet they are treated independently. It would not be a weakness if being disjoint the two stages could offer better compositionality (e.g. some step could be replaced with some alternative) but this is not discussed in the paper. \n\nMoreover, the use of the split network seems to require some relatively involved bookkeeping for composing the per-concept features. A short discussion on this subject could help reproducibility.\n\nAdditionally, inference is only briefly discussed in the paper, mainly in Figure 2. It would help if more details were provided. ",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is well written and easy to read. The description of the method is sufficiently clear. Nevertheless, some aspects like inference (see above) could be described in more detail. \n\nAlthough the approach is based on established solutions (domain generalization, network splitting, etc.) their application to pose estimation, and animal pose estimation in particular, is novel.\n\nRegarding reproducibility, a code snippet is provided that can help in implementing the method and reproducing the results.",
            "summary_of_the_review": "Based on the discussion above, I think that the proposed method proposes an interesting and significant contribution to the less explored problem of animal pose estimation (in comparison to human pose estimation). I propose acceptance, although there are some aspects which could be improved (see weaknesses above)\n\n## Comments after the rebuttal\nI find the proposed approach novel in the specific domain. The contributions are well motivated and interesting, especially the distinction between consistent and not-consistent joints is intuitive and supported by the results. Nevertheless, the type of consistency needs to be better defined to avoid confusion (e.g., geometric/topological vs semantic consistency).\n\nI am quite satisfied with the author responses and I think that the paper has become stronger after the revisions. However, the increase in performance between different animal families is somewhat limited. I keep my score to 6 as I think that the paper is acceptable for publication.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper218/Reviewer_uMhs"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper218/Reviewer_uMhs"
        ]
    }
]