[
    {
        "id": "e55mH7DLY3",
        "original": null,
        "number": 1,
        "cdate": 1666551503581,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666551503581,
        "tmdate": 1669146964487,
        "tddate": null,
        "forum": "nYWqxUwFc3x",
        "replyto": "nYWqxUwFc3x",
        "invitation": "ICLR.cc/2023/Conference/Paper3948/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper introduces a learning-based method to predict vortex dynamics. It designs a vortex dynamics module to learn the evolution of the vortices and another network to transform from the vortex space to the image space velocity field. Results show that the proposed method provides a realistic and stable vortex evolution trajectory, both in synthetic and real-world videos.",
            "strength_and_weaknesses": "Strength:\n1. Instead of modeling the entire image space dynamics, the method models only the vortex information, which effectively reduces the dimension and difficulty, and also helps generalize to unseen cases.\n2. The results are very promising. They clearly outstand previous works.\n3. The experimental comparisons are thorough and complete. They support the claims well.\n\nWeakness:\n1. There should be more detailed descriptions in the method section. For example, how are the vortex positions initialized? Are they inferred from the image or overfitted to the given example? How does the model determine how many vortices to model given an image? I don't see a module to encode this information from the input image to the vortex space.\n2. The strengths and the sizes of all vortices are assumed to be the same throughout the entire prediction. Is it mostly the case in the real world? How does it introduce limitations to this model? Again, how to model the initial values using trainable vectors is unclear. Do they overfit to a certain example? If not, how are they estimated from the image?\n3. I wonder if this task can be achieved already by optimizing the parameters using differentiable fluid simulation:\nTakahashi, Tetsuya, et al. \"Differentiable fluids with solid coupling for learning and control.\" Proceedings of the AAAI Conference on Artificial Intelligence. Vol. 35. No. 7. 2021.\nPlease add some discussions regarding the difference between the proposed method and the differentiable simulation system.",
            "clarity,_quality,_novelty_and_reproducibility": "See above.",
            "summary_of_the_review": "Although the method and the results are mostly solid, there are some clarity issues regarding the method itself which can prevent the readers from understanding the whole picture. I would recommend weak reject now, but will be happy to change once the issues are addressed.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper3948/Reviewer_jKRP"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper3948/Reviewer_jKRP"
        ]
    },
    {
        "id": "PWOK4LlU1z",
        "original": null,
        "number": 2,
        "cdate": 1666562550925,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666562550925,
        "tmdate": 1666562883472,
        "tddate": null,
        "forum": "nYWqxUwFc3x",
        "replyto": "nYWqxUwFc3x",
        "invitation": "ICLR.cc/2023/Conference/Paper3948/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper proposes a method to learn vortex dynamics from a single fluid video and thus be able to infer and predict fluid dynamics. At the core of the method are a Lagrangian vortex particle representation and a learnable vortex-to-velocity dynamics mapping. These two components can be trained merely from the observed video in an end-to-end manner. After training, the hidden physics quantities such as velocity field would be obtained, and the prediction of future states is also supported. The proposed method is compared with existing methods on both synthetic and real videos, where the proposed method shows more accurate velocity estimation and more plausible future prediction.",
            "strength_and_weaknesses": "Strength:\n\n- The proposed method of using a Lagrangian vortex particle representation and a learnable vortex-to-velocity mapping looks pretty interesting and reasonable to me. The vortex particle representation is more compact and reduces the problem's dimension. The learnable vortex-to-velocity mapping well connects the vortex particle and the fluid phenomena, making the pipeline end-to-end trainable. The model design also integrates fluid simulation and learning-based approach in a reasonable way, combining the advantages of both fields. \n\n- The advantage of the proposed method over baselines is obvious in experiments. Quantitative and qualitative study in synthetic and real data demonstrate that the proposed method estimates more accurate velocity and predicts more plausible future sequences.\n\nWeaknesses:\n\n- The description of implementation is not detailed enough as some hyperparameters are missing. For example, the number of particles n is not provided. It is also not mentioned how $\\Delta$ and $\\Omega$ are initialized. Besides, it is suggested to also mention the efficiency of the method, like the training and inference time.\n\n- The amount of data used for evaluation seems limited. If I understand correctly, the quantitative study is conducted on only one synthetic video and one real video, which only covers limited diversity. It would be better to evaluate on more videos to strengthen the results.\n\n- The method now assumes inviscid fluid and 2-dimension, which is a somewhat constrained setting and would limit the application scope. ",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is clearly written and well organized. But some implementation details are missing such as the number of particles n and the initialization of $\\Delta$ and $\\Omega$. Given my limited knowledge in this field, this work looks novel to me and the proposed method would be useful to the community.",
            "summary_of_the_review": "I am not familiar with all the literature in this field, but to the best of my knowledge, this paper looks pretty interesting to me. It cleverly combines Lagrangian particle representation and Eular representation in a unified and end-to-end trainable framework, addressing several existing challenges. The parameterization of position x and the vortex-to-velocity mapping using neural networks is reasonable. But more implementation details could be added and the evaluation can be improved by using more videos. In general, I am in favor of accepting this paper. But it is possible that I may overlook some issues given my limited knowledge in this field, so I am also interested to see other reviewers' comments.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper3948/Reviewer_PYMt"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper3948/Reviewer_PYMt"
        ]
    },
    {
        "id": "skfqke_1ug",
        "original": null,
        "number": 3,
        "cdate": 1666614250857,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666614250857,
        "tmdate": 1666614250857,
        "tddate": null,
        "forum": "nYWqxUwFc3x",
        "replyto": "nYWqxUwFc3x",
        "invitation": "ICLR.cc/2023/Conference/Paper3948/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "I found this paper to be very interesting. The idea of having two 'simulators' one for vorticity for physics tracking and one for RGB video tracking is clever, and the coupling between vorticity/velocity in Equation (3) is something I was unfamiliar with. Although limited to 2D, in its current formulation, the idea of being able to link a visible and hidden simulator is intriguing. The results on both synthetic and real video captures are compelling and clearly perform better than other methods compared against. ",
            "strength_and_weaknesses": "+ Elegant and well-grounded formulation\n+ Compelling results on both synthetic and real sequences\n+ Section 3 and Figures 2/3 nicely explain the key ideas behind the approach\n\n- Limited to 2D in its current version\n- Are there invariants in vortex-based formulation that can be incorporated?\n- Other limitations are discussed at the end of the paper but they should encourage future works",
            "clarity,_quality,_novelty_and_reproducibility": "Clean formulation and is very clearly presented. The formulation is non-trivial -- it is a good example of using insights from physics to solve complex learning tasks. The approach is quite specialized, but I do not see that as a problem. Very novel unless I am aware of similar concepts having been used in physics simulations. \n\nWould be great if the authors provide code. Should be reproducible by someone with the necessary physics background. ",
            "summary_of_the_review": "An elegant solution to a difficult problem. Compelling demonstration on real video sequences. Not often such a coupling can be obtained between visible and hidden states to regularize a solution. The hidden states have the right complexity to regularize the problem! ",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "empirical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper3948/Reviewer_PvPD"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper3948/Reviewer_PvPD"
        ]
    },
    {
        "id": "1HHFwp3eE1",
        "original": null,
        "number": 4,
        "cdate": 1666868470755,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666868470755,
        "tmdate": 1666868470755,
        "tddate": null,
        "forum": "nYWqxUwFc3x",
        "replyto": "nYWqxUwFc3x",
        "invitation": "ICLR.cc/2023/Conference/Paper3948/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper considers the modeling of fluid dynamics from limited observations of particle densities, using the vorticity formulation of the 2D Navier-Stokes equation. Specifically, the velocity field that drives the movement of the particles are inferred from the observable particle density over a time interval. The calculated velocity field is then modeled by the vortex model of the 2D Navier-Stokes equation with a learned approximation of the kernel of the Biot-Savart Law. The trajectory module of the vortices is trained so that the predicted velocity field matches the ones derived from the training data (the density image). Further, this paper considers the prediction of the evolution of the particle density based on the learned vortex dynamics.",
            "strength_and_weaknesses": "Strength: \nThis paper proposes a fluid dynamics representation with differentiable vortex particles so that the observed particle densities and be used jointly with the underlying vortex model (the vorticity formulation of the 2D Navier-Stokes equation with the Biot-Savart kernel) to learn the particle trajectory and the vorticity-to-velocity mapping, i.e. an approximated Biot-Savart kernel. The empirical results are impressive compared with previous SOTA of the domain. \n\nWeakness:\nSince we exactly know the dynamics of the vortices, why do we need data to help to learn their trajectories? Given the initial distribution of the vortices, the following dynamics can be derived by solving the 2D Navier Stokes equation, right?",
            "clarity,_quality,_novelty_and_reproducibility": "This paper is well written and easy to follow.\n\nIn terms of quality, this paper presents some novel empirical results, but the underlying theoretical model is standard to the literature.",
            "summary_of_the_review": "The empirical results are impressive. However, it is not clear why the data are needed given that the underlying dynamics is already modeled by the 2D Navier Stokes equation. Is it for the purpose of estimating the viscosity parameter and the initial vortex distribution? ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper3948/Reviewer_W2do"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper3948/Reviewer_W2do"
        ]
    }
]