[
    {
        "id": "rVl8KX7JPkk",
        "original": null,
        "number": 1,
        "cdate": 1666553165473,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666553165473,
        "tmdate": 1666553165473,
        "tddate": null,
        "forum": "O7x_ldrlaO7",
        "replyto": "O7x_ldrlaO7",
        "invitation": "ICLR.cc/2023/Conference/Paper2565/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This paper proposes an method that aims to protect the privacy of sharing a graph structure.\nA claim is made that an entire graph is to be privately shared, without a clear definition of how such whole-graph privacy would arise.\nThe type of noise addition following constitutes the addition of nodes sampled from a set by a local-differentially private clustering algorithm, while the added noise is compensated for by a Kprop method, derived from previous work, that aggregates the representatives of neighbor up to k hops away.\nAn experimental study claims to examine the tradeoff between privacy and accuracy.",
            "strength_and_weaknesses": "Stength:\nProposes a reasonable method for graph sharing by noise addition.\n\nWeakness:\nDoes not offer intelligible and consequential privacy guarantees for sharing the whole graph structure as claimed.\nNo results on the privacy side of privacy-accuracy tradeoff.",
            "clarity,_quality,_novelty_and_reproducibility": "The paper does not present results that could be reproduced on the privacy side of the accuracy-privacy tradeoff.",
            "summary_of_the_review": "This paper proposes an method that aims to protect the privacy of sharing a graph structure.\nA claim is made that an entire graph is to be privately shared, without a clear definition of how such whole-graph privacy would arise.\nThe type of noise addition following constitutes the addition of nodes sampled from a set by a local-differentially private clustering algorithm, while the added noise is compensated for by a Kprop method, derived from previous work, that aggregates the representatives of neighbor up to k hops away.\nAn experimental study examine the tradeoff between privacy and accuracy.\n\nHowever, it is not clear what privacy guarantees the proposed method offers in practice. The differential privacy guarantee, in a graph context, would imply that a difference of one graph element would not be noticeable to an adversary under noise addition. However, this guarantee says nothing about the ability to derive large-scale graph properties, which could threaten the privacy of individual indeed. Past research has shown [CIKM 2012] that most graph measures can be recovered under noise addition, and that it is hard to even obscure the length of a path in a graph structure. This paper appears to be incognizant of such concerns, as well as of the limitations of differential privacy when it comes to sharing correlated structural idea. Thus, it is not clear what consequences the proposal local differentially privacy algorithms have in effect. A discussion of these concerns is due.",
            "correctness": "1: The main claims of the paper are incorrect or not at all supported by theory or empirical results.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2565/Reviewer_nZ2k"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2565/Reviewer_nZ2k"
        ]
    },
    {
        "id": "Tv9AHcKV8k",
        "original": null,
        "number": 2,
        "cdate": 1666597952457,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666597952457,
        "tmdate": 1666597952457,
        "tddate": null,
        "forum": "O7x_ldrlaO7",
        "replyto": "O7x_ldrlaO7",
        "invitation": "ICLR.cc/2023/Conference/Paper2565/-/Official_Review",
        "content": {
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully.",
            "summary_of_the_paper": "This paper investigates the problem of preserving the privacy of edges in the training graph in GNNs. The authors propose to perturb the edges of each node to achieve local differential privacy. ",
            "strength_and_weaknesses": "Strength:\n\n1) The problem of preserving the privacy of the graph structure is an interesting problem and may be practically useful.\n\n2) According to the claim of this paper, this is the first work trying to investigate the structural privacy problem in GNNs.\n\n\nWeaknesses:\n\n1) The proposed method and analysis do not seem to be specific to GNNs. It is weird that one can claim the privacy of the GNN training algorithm without involving the GNN in the analysis.\n\n2) The lemma and theorem are essentially stated without proof. Either they are incorrect or they are direct applications of existing results. In either case, there is little novel technical contribution.\n\n3) The clarity can be improved. Below are some concrete cases that are unclear in writing.\n\n- Section 4.1.3 states that \"We use the randomized response as the randomization mechanism\". The \"randomized response\" method should be explained with citations. \n- Algorithm 1 states that randomization will be applied to edges to the neighborhood of each node plus lambda nodes. But section 4.1.3 states that randomization will be applied to every edge. \n- Lambda is defined as an integer in Algorithm 1 indicating a number of nodes. In section 4.4, there is a phrase \"lambda percentage of nodes\", which is confusing.\n\n4) Typos.\n\n- Page 5. \"... is too less, ...\" -> is too small\n- Page 5 and Algorithm 1. A_v not defined. There seems to be a change of notation from N(v) to A_v.\n\n\n",
            "clarity,_quality,_novelty_and_reproducibility": "See strength and weaknesses.",
            "summary_of_the_review": "While this paper investigates an interesting problem, the proposed method and analysis seem trivial or wrong.",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "empirical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2565/Reviewer_Q4eW"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2565/Reviewer_Q4eW"
        ]
    },
    {
        "id": "Btk7HAUdbp",
        "original": null,
        "number": 3,
        "cdate": 1667312309675,
        "mdate": null,
        "ddate": null,
        "tcdate": 1667312309675,
        "tmdate": 1667312309675,
        "tddate": null,
        "forum": "O7x_ldrlaO7",
        "replyto": "O7x_ldrlaO7",
        "invitation": "ICLR.cc/2023/Conference/Paper2565/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This paper proposes a strategy to add noise / privacy to the structure of a graph.",
            "strength_and_weaknesses": "The writing, the formalization and the English language used are rather poor, making it often hard or impossible to infer the meaning of the text.\n\nIn general, the paper may have interesting ideas, but it is hard to appreciate then given the current writing.  Also, it is unclear whether the proposed result is very deep, it may be a direct application of earlier work by Dwork (lemma 4,1).\n",
            "clarity,_quality,_novelty_and_reproducibility": "Algorithm 1 (which if referred to in Sec 4,1) :\n- the symbol \\sqsubseteq is often used to express a relation, rarely to denote a set of neighboring nodes.  why dont you use the common notation N_v ? \n- “… extra nodes to be added to a.” : the variable “a” is not defined yet\n- V_{C_v} : why do you need a double subscript?  C_v on itself is not yet given a meaning.  \n- cluster containing v: where is this cluster defined?\n- line 1: “ Sample a set of nodes the set” -> … from the set \n- V_{C_v} \\setminus \\mathbb{A}_v : the variable \\mathbb{A}_v is not yet defined\n- line 2: “apply randomization mechanism on” : what randomization mechanism should be applied?\n- line 3: “ return set N ′(v) as the noisy neighborhood set” : the variable N’(v) is not yet defined.\n\nIn conclusion, at the point alg 1 is referred to and in its current form, it is very hard to understand alg 1,  Similar concerns hold for other parts of the text.",
            "summary_of_the_review": "My main concern is that the paper is insufficiently clear.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "details_of_ethics_concerns": "—",
            "recommendation": "1: strong reject"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2565/Reviewer_nodK"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2565/Reviewer_nodK"
        ]
    }
]