[
    {
        "id": "csYKfA7k-pr",
        "original": null,
        "number": 1,
        "cdate": 1666162840012,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666162840012,
        "tmdate": 1666162840012,
        "tddate": null,
        "forum": "PuEOL1hhyrF",
        "replyto": "PuEOL1hhyrF",
        "invitation": "ICLR.cc/2023/Conference/Paper3276/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "The authors propose a technique to prioritize which samples to select next in an active learning setting for node attribute completion in graphs. The proposed method uses metrics related to the \"density\" of a data point as well as its centrality in the graph. The proposed approach is used as input to SAT, a previously-proposed model for node attribute learning.",
            "strength_and_weaknesses": "Strengths:\n- The criteria designed by the authors to select the next point to train on is well-motivated\n- The authors leverage on a state of the art model for node attribute detection\n\nWeaknesses:\n- Lack of novelty. The main contribution is a method to prioritize training points in an active learning setting. However, the model that actually learns node attributes (which is arguably the crux of the problem) has been proposed before.\n- Incremental empirical results. It is not surprising that the proposed approach marginally improves performance over SAT and GAT. Any sensible heuristic to select data points would be better than not doing anything.",
            "clarity,_quality,_novelty_and_reproducibility": "The technical description was clear overall. I think the introduction would benefit from some additional editing. At the moment, it reads as if it were  written in a rush.",
            "summary_of_the_review": "I think that the proposed approach is rather incremental in the literature of learning node attributes in graphs. My main criticism of the paper is that the authors rely on an existing model for the bulk of the machine learning task, and their contribution can be summarized as a heuristic method to suggest new data points in an active learning framework. \n\nSince the work is empirical in nature, I also think that the authors could provide more evaluation on why their particular metric is of value over potential alternatives. While I agree with the authors that density and centrality are important criteria for this task, there are numerous metrics that one could come up with. For instance, instead of PageRank, we could consider node centrality or betweeness centrality.\nThe authors instead spend decide to report a comparison of competitors for SAT. In my opinion, this takes away from their contribution, since it makes SAT the focus of the paper. I would reframe the experiments to show how the proposed metric is superior to other density/centrality alternatives, all in the context of SAT (and potentially GAT).\n\nLastly, as I mentioned above, the empirical results are not surprising, since the authors are choosing points in an intelligent way. It is obvious that one should expect an improvement from this, and I don't see how the proposed work or results add much to the existing literature.\n\nI would recommend this work to be published as a short paper, but I cannot recommend it to be featured as a full research paper.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper3276/Reviewer_TF65"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper3276/Reviewer_TF65"
        ]
    },
    {
        "id": "Y6IAQ5hrmW1",
        "original": null,
        "number": 2,
        "cdate": 1666709383440,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666709383440,
        "tmdate": 1666709383440,
        "tddate": null,
        "forum": "PuEOL1hhyrF",
        "replyto": "PuEOL1hhyrF",
        "invitation": "ICLR.cc/2023/Conference/Paper3276/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper considers the problem of imputing the missing attributes of nodes in a network.This is done by identifying the most informative nodes for renewing the training set after each training epoch. Some uncertainty and representativeness metrics are proposed to achieve the task of identification. Their method achieves improved performance on node classification and profiling tasks with 4 real datasets.\n\n",
            "strength_and_weaknesses": "Strengths: the paper tackles an important problem known to be of interest in practice (e.g. attributes of individuals are often missing due to confidentiality or privacy settings); improved performance compared to some state of the art techniques. \n\nWeaknesses: Specifically, what is the ` node attribute completion problem' - this is clear at a high level but the complexities concerning the exact problem are never discussed (type of missing attributes, proportion of missing attributes and how it links with properties of the network). The intuition and reasoning behind some of the key choices and assumptions is not explained and remains unclear. For example, why is a shared latent space assumption required for the node attribute completion problem (second para in Section 4.1)? What do you mean by 'information density'? Is this somehow linked to network edge density? Is `structural centrality' linked to network centrality measures commonly studied in this area?\nThere are many vague statements here, for example (second para in Section 4.1, line 3): `If there is a dense distribution of representation vectors in a local region of the latent space, the corresponding nodes will have more similar features ..'\nWhat does this mean exactly and why? Some mathematical notation here could have helped in stating things more precisely. \nUnder equation (4): 'The larger \\phi_density is, the more representative the node is ....' : How does this follow from the formula above and what exactly is the node representative of and why? \nWhy is the PageRank score specifically used as structural centrality?\n ",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is clearly written in some parts (e.g. the literature review and in high level description of the methodology), however, lacks clarity in the technical description. I feel that important mathematical details are missing. I am unable to comment on the originality of the work as I am not very familiar with literature on this problem. ",
            "summary_of_the_review": "The paper tackles an interesting problem and leads to improved performance, however, the assumptions and choices made for the implementation (e.g. why these are optimal/intuitive in any way) of the proposed method are not clear. Also links with existing literature on networks seems to have been ignored. ",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper3276/Reviewer_RsqE"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper3276/Reviewer_RsqE"
        ]
    },
    {
        "id": "nHLqL1sLC8j",
        "original": null,
        "number": 3,
        "cdate": 1666932864972,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666932864972,
        "tmdate": 1666932864972,
        "tddate": null,
        "forum": "PuEOL1hhyrF",
        "replyto": "PuEOL1hhyrF",
        "invitation": "ICLR.cc/2023/Conference/Paper3276/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This paper proposed an active sampling method to improve an existing approach called SAT for graph node attribute completion. It claims that the observed nodes are not equally important, and they designed several metrics to measure the nodes’ representativeness and uncertainty and use them for active sampling. To better control the weighting scheme, it further proposed to use Beta distribution to adjust the metric weights. Experiments show that the proposed method achieve superior performance on node classification and profiling tasks. ",
            "strength_and_weaknesses": "There are some interesting points in the paper, e.g. the importance metric of the nodes. However, its overall quality is not good enough for ICLR. \n1.\tMotivation. First of all, the scope of the paper is too small. Node attribute completion is not a standard task, and SAT is not a well-known base model. Only designing a specific sampling method to improve the SAT model looks very trivial.   \n2.\tI do not see the necessity of active sampling. As described in the related works, active sampling is originally used for sampling new data to label, but this paper mainly used it to adjust the training sample weights. I do not understand why they should start from a small portion of observations. They can just train a SAT using the full data, and then resample all the data to adjust the weights. \n3.\tDatasets. All datasets are manually made but not from a real problem (the four datasets all have full attributes). That makes the “node attribute completion” task look like a toy problem. But we know that in real world there should be such tasks. If possible real data and tasks will be much better.\n4.\t Evaluation. Using the node classification task for evaluation is not reasonable. Take a very simple example, for each label we just generate a one-hot vector and use it as the missing node feature, the node classification accuracy will be 100%, but that does not mean the feature completion is good.\n5.\tAblation study. The node metric has three components. I think an ablation study which removes one or two components will be necessary to show the importance of each metric component.\n\n",
            "clarity,_quality,_novelty_and_reproducibility": "Other minor issue: \nTypo in Equation(2). The second z_p \\sim p(z) should be z_a\n",
            "summary_of_the_review": "The solved problem is not significant, and the approach and evaluation have something unreasonable. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "empirical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "1: strong reject"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper3276/Reviewer_P86Z"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper3276/Reviewer_P86Z"
        ]
    },
    {
        "id": "sfZmDT_D9mj",
        "original": null,
        "number": 4,
        "cdate": 1667062612222,
        "mdate": null,
        "ddate": null,
        "tcdate": 1667062612222,
        "tmdate": 1667062612222,
        "tddate": null,
        "forum": "PuEOL1hhyrF",
        "replyto": "PuEOL1hhyrF",
        "invitation": "ICLR.cc/2023/Conference/Paper3276/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "While the completion of missing node attributes is an important problem, the Structure-Attribute Transformer (SAT) is recent work that tackles that problem with leveraging all the observed attributes equally. The authors challenge the part of using all the observed attributes in an equal manner, and propose the SAT learning strategy based on active node sampling. For the active sampling, authors propose the the representativeness and the uncertain measurements for nodes on a graph and use them for active sampling. When the proposed sampling strategy is combined with SAT, it shows better performance in node classification tasks compared to the other baseline models, including the original SAT.",
            "strength_and_weaknesses": "* Strengths\n- The proposed node measurements are clear and reasonable to represent the importance for active sampling.\n- The manuscript is easy to follow.\n- The proposed method combined with SAT shows the better performance compared to baseline models\n\n* Weakness\n- The objective of the active sampling-based strategy would be great if it is clearly defined. The efficiency is described as the objective, but it needs to be further clarified and better-defined.\n- Despite aiming the efficiency, the experiments or evaluations with respect to efficiency or training time are missing.\n- The proposed active sampling is very tightened with SAT. It is not clear why the sampling should be coupled with SAT, not some general embedding-based learning. More generalization of the proposed method or clear explanation specific to SAT would be great to have. \n- Experiments could be more enforced. The ablation study with respect to learning speed would be great to have. For example, when the same learning strategy is applied (starting from 1% training and expanding the training size over epochs), how soon does the proposed method achieve a reasonable performance as opposed to the uniform sampling? Or, how different is the learning algorithm's convergence speed when gradually expanding the training node set as opposed to directly training on the entire dataset?\n",
            "clarity,_quality,_novelty_and_reproducibility": "- The manuscript is straightforward to follow and the proposed method and experiments are clearly present.\n- The proposed method is incremental in the sense that some common measurements are used for active sampling and it is applied to only a certain kind of method.",
            "summary_of_the_review": "Despite the clearness and fair performance of the proposed method, the proposed method needs to be 1) more generalized, 2) evaluated on the matters of interests, and 3) more studied to the role of each strategy part to understand the impact of proposed methods better.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper3276/Reviewer_Yxf6"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper3276/Reviewer_Yxf6"
        ]
    }
]