[
    {
        "id": "85B2xT0bqt",
        "original": null,
        "number": 1,
        "cdate": 1666551752139,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666551752139,
        "tmdate": 1666551752139,
        "tddate": null,
        "forum": "r9fX833CsuN",
        "replyto": "r9fX833CsuN",
        "invitation": "ICLR.cc/2023/Conference/Paper6485/-/Official_Review",
        "content": {
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully.",
            "summary_of_the_paper": "This paper proposes a novel curriculum-based co-design method for evolving soft voxel-based robots. The main contributions are:\n- A novel curriculum mechanism that effectively evolves robots from simple to large design spaces.\n- A transformer-based control policy representation, enabling adaptation to arbitrary dimensional observations due to morphology changes.\n- A novel design policy based on Neural Cellular Automata (NCA), making end2end training of both design and control policy possible.\n- Impressive visual behavior and empirical performance compared to baseline methods with abundant ablation studies.",
            "strength_and_weaknesses": "Strengths:\n- A novel and sound technical approach. Each component of the approach is intuitive and effective (curriculum, transformer-based generalizable control policy, NCA-based design policy).\n- Good empirical performance with abundant ablation studies (Sec 5.4), which explains the necessity of all the algorithmic components.\n\nWeaknesses:\n- This paper only performs evaluations on 4 environments/tasks from Evolution Gym [Bhatia et al. 2021], which is not sufficient enough in my opinion to show the generalizability of the proposed approach. I would suggest at least evaluate on 6-10 environments from Evolution Gym, to convince people that the results are not cherry-picked.\n- Limitations or failure cases are not discussed well in the paper, and I think this is crucial. Is there any case in which CuCo fails to beat the baselines? \n\nQuestions:\n- By looking at the results, CuCo tends to produce regular shapes for the robot design compared to GA. It does not appear to evolve robots with some thin limb structures. However, my intuition tells me that for some complex tasks (such as climbing/throwing/lifting in environments), thin structures like limbs or fingers are the key to success. Could you please evaluate your method on those environments in Evolution Gym as well and report the performance?\n- Could you show the performance/convergence curves for the baseline methods as well?",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is clearly written and sufficiently novel, with reasonable technical approaches. For reproducibility, it's not clear to me - depending on if the authors are willing to release the source code.",
            "summary_of_the_review": "This paper proposes a novel method with sufficiently new insights into soft robot co-design. While the approach is theoretically sound, on the practical side, I still have several concerns (evaluations on more environments, discussions on limitations and failure cases).",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper6485/Reviewer_vM9V"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper6485/Reviewer_vM9V"
        ]
    },
    {
        "id": "gY-9RZKle-",
        "original": null,
        "number": 2,
        "cdate": 1666608189258,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666608189258,
        "tmdate": 1666619123126,
        "tddate": null,
        "forum": "r9fX833CsuN",
        "replyto": "r9fX833CsuN",
        "invitation": "ICLR.cc/2023/Conference/Paper6485/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper investigates the effectiveness of using a predefined curriculum over the size of a Voxel-Based Soft Robot (VSR) in co-training design and control policies simultaneously using RL (PPO). Their results in training a target 7x7 VSR configuration provides strong evidence that such curricula over VSR body size is effective for producing more performant morphologies and associated control policies on 4 environments in simulation. The architectural and training procedure used in this paper is largely taken from Yuan et al, 2022 (Transform2Act).",
            "strength_and_weaknesses": "### Strengths\n- The paper is overall well-written with clear figures and diagrams.\n- The experimental setting and baselines are clearly communicated and seem appropriate for addressing their research question about whether body-size curricula is useful for co-designing VSR control and morphology.\n- The experiments comprehensively ablate each component of the proposed method: the use of a curriculum, the use of self-attention, and whether the morphology or design policy are inherited across curriculum stages.\n\n### Weaknesses\n- The study can benefit from an ablation of the choice of using an NCA architecture for the design policy.\n- Several key details are left unclear in the current paper, as detailed in the Clarity section.\n- A primary weakness with this work is that the results are only validated in simulation. The goal of VSR is to transfer to real robots, and the so the study would be much more impactful if the authors can demonstrate the effectiveness of the learned morphologies and controllers in a sim2real setting.\n\nLastly, there is important related work around automatic curriculum learning that the authors should cite, especially around unsupervised environment design, which describes the same problem setting that the authors investigate (where the environment is the combination of the task and morphology):\n- Matiisen, Tambet, et al. \"Teacher–student curriculum learning.\" IEEE transactions on neural networks and learning systems 31.9 (2019): 3732-3740.\n- Portelas, Rémy, et al. \"Teacher algorithms for curriculum learning of deep rl in continuously parameterized environments.\" Conference on Robot Learning. PMLR, 2020.\n- Jiang, Minqi, Edward Grefenstette, and Tim Rocktäschel. \"Prioritized level replay.\" International Conference on Machine Learning. PMLR, 2021.\n- Dennis, Michael, et al. \"Emergent complexity and zero-shot transfer via unsupervised environment design.\" Advances in neural information processing systems 33 (2020): 13049-13061.\n- Jiang, Minqi, et al. \"Replay-guided adversarial environment design.\" Advances in Neural Information Processing Systems 34 (2021): 1884-1897.\n- Parker-Holder, Jack, et al. \"Evolving Curricula with Regret-Based Environment Design.\" International Conference on Machine Learning. PMLR, 2022.\n\n\n",
            "clarity,_quality,_novelty_and_reproducibility": "### Clarity\nA few points in the paper are unclear:\n- The paper uses the term \"open-loop controller\" for describing prior works. However, how exactly this term is used in this setting and how the proposed method differs from an \"open-loop controller\" is not clear.\n- It is not clear whether the morphology is inherited by inheriting the exact previous design or the design policy weights. This seems like a significant distinction since it seems the design policy can be stochastic.\n- Related to the previous point, it is not clear whether the control and design policies are deterministic or stochastic.\n- Finally, the paper seems to base their architecture and training procedure on Transformr2Act. The authors could make it clearer which aspects of this paper are novel contributions and which are prior work, on which they build.\n\n### Quality\nOverall, this paper is well written with clear figures.\n\n### Novelty\nThis paper validates the effectiveness of pre-defined curriculum over robot size in VSR design. This is a useful, novel contribution that can inform applications and future research in this area, e.g. applying curricula over other parameters of the design space or applying automatic curriculum learning methods to VSR. \n\n### Reproducibility\nThe algorithm, architecture, and hyperparameters are clearly detailed in this paper, making this work, in principle, reproducible.",
            "summary_of_the_review": "Overall, this paper provides a clean investigation of the impact of body-size curricula in co-training morphology design and control policies for VSR. The experiment setting is sound, including several VSR environments, key ablations, and sensible baselines. The main finding—that body-size curricula lead to improved morphologies and control policies in simulation—seems valuable in informing future work in this area. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper6485/Reviewer_iFUz"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper6485/Reviewer_iFUz"
        ]
    },
    {
        "id": "DcXFq7SCn3y",
        "original": null,
        "number": 3,
        "cdate": 1666753537320,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666753537320,
        "tmdate": 1666753537320,
        "tddate": null,
        "forum": "r9fX833CsuN",
        "replyto": "r9fX833CsuN",
        "invitation": "ICLR.cc/2023/Conference/Paper6485/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This paper introduces a new curriculum-based method for co-designing morphology and control of voxel-based soft robots. This curriculum-based method expands the design space from a small size to the target size using reinforcement learning with a predefined curriculum. To address incompatible state-action spaces, local observations of robot voxels are modeled as a sequence and self-attention is used to control the voxels.",
            "strength_and_weaknesses": "Strength: \n\n+ The paper addresses an important problem on co-design of morphology and control with the potential to greatly impact voxel-based soft robots.\n\n+ The paper identifies several interesting challenges for soft robot co-design, such as the high dimensionality of the joint design and control space and the difficulty in generalizability. Methods are designed to address these specific challenges.\n\n+ The paper is well organized and well written.\n\nWeakness:\n\n- The goal of the paper is the co-design of morphology and control. However, the approach assumes that \"The morphology of the robot is unchangeable during the interaction with the environment\". While the control policy uses the learned morphology, but how does the control inform or help morphology design?\n\n- In the related work section, the paper argues that methods such as Transform2Act by Yuan et al (2022) have \"the limitation of aggregating multi-hop information\". In the experiment section, the paper states that CuCo-NCU (CuCo without the curriculum component) is similar to Transform2Act. How is this multi-hop information aggregated by CuCo. Other than the curriculum, what are the key differences between CuCo and Transform2Act?\n\n- While simulators such as Evolution Gym and MuJoCo are helpful to evaluate theories, out of curiosity, how are these simulators, the proposed method, and the experimental results applicable to real soft robots? For example, what are the existing prototypes of real voxel-based soft robots that can use the proposed method for co-design?\n",
            "clarity,_quality,_novelty_and_reproducibility": "This paper introduces a new solution for co-design of morphology and control for soft robots, and originally addresses several key challenges. The paper is well written, and the ideas are clearly justified. The experimental results could be reproduced using the Evolution Gym simulator.",
            "summary_of_the_review": "Although several technical details need to be clarified, this paper proposes a new method and addresses several specific challenges for morphology and control of simulated voxel-based soft robots.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper6485/Reviewer_Qe3n"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper6485/Reviewer_Qe3n"
        ]
    }
]