[
    {
        "id": "-EuaVD_GbyR",
        "original": null,
        "number": 1,
        "cdate": 1666306464593,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666306464593,
        "tmdate": 1666306464593,
        "tddate": null,
        "forum": "sPCKNl5qDps",
        "replyto": "sPCKNl5qDps",
        "invitation": "ICLR.cc/2023/Conference/Paper2886/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper proposes a unified framework for Ollivier-Ricci curvature on hyper-graphs, by incorporating and generalising existing approaches to hyper-graphs. It can be regarded as the first attempt towards defining RC curvature, based on rigorous theoretical and empirical analysis of the resulting curvature formulation.",
            "strength_and_weaknesses": "strength:  1. they use several ways to generalize graph Ricci curvature into hypergraphs based on general features of hypergraphs. \n2. They derive the bound of the newly defined curvatures.  3. using the newly defined curvatures to show its empirical advantanges compare to single node information.",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is well drafted.I think the innovation is good, and it is the first few papers to generalize curvature to hyper-graphs.",
            "summary_of_the_review": "The paper is in excellent shape and worth for an acceptance.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2886/Reviewer_LgSf"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2886/Reviewer_LgSf"
        ]
    },
    {
        "id": "4PnfK7Z3s2B",
        "original": null,
        "number": 2,
        "cdate": 1666358820080,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666358820080,
        "tmdate": 1666601779005,
        "tddate": null,
        "forum": "sPCKNl5qDps",
        "replyto": "sPCKNl5qDps",
        "invitation": "ICLR.cc/2023/Conference/Paper2886/-/Official_Review",
        "content": {
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "The paper provides a framework for computing Olivier-Ricci curvature (ORC) on hypergraphs. In order to extend ORCs to hypergraphs, it provides multiple notions of probability measures and Similarity measures (extension to Wasserstein distance in graphs). The non-redundancy of these notions is shown through experiments on data from various domains.",
            "strength_and_weaknesses": "The paper is quite dense (especially for a non-expert in graph theory) but well-written. It seems that the proposed notions are diverse and maybe separately important in various applications. The experimental validation seems to be appropriate.\n\nWhat is missing is that how other curvature measures on hypergraphs, such as FRCs, compare to the proposed extension of ORCs. Since the framework does not extend FRCs, it might have been interesting to see how differently it act, if that is the case.\n",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is well written. The contributions seem to be quite novel. All the codes and data is made publicly available. ",
            "summary_of_the_review": "The novelty of the contributions overweigh the minor weaknesses.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "empirical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2886/Reviewer_Bvqz"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2886/Reviewer_Bvqz"
        ]
    },
    {
        "id": "d1AbqzZdpec",
        "original": null,
        "number": 3,
        "cdate": 1666594172871,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666594172871,
        "tmdate": 1666594172871,
        "tddate": null,
        "forum": "sPCKNl5qDps",
        "replyto": "sPCKNl5qDps",
        "invitation": "ICLR.cc/2023/Conference/Paper2886/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper introduces a unified framework called Ollivier-Ricci Curvature for Hypergraphs In Data (ORCHID). This framework is the first to generalize the Ollivier-Ricci curvature (ORC) of graphs to hypergraphs and yields a notion of curvature consistent with geometric intuition. This work provides rigorous theoretical and empirical analysis of the resulting curvature formulations and demonstrates the utility of these concepts in practice through extensive experiments.",
            "strength_and_weaknesses": "Strength:\nThis paper analyzes three probability measures based on random walks on hypergraphs. The related formulas and definitions of ORC in graphs are extended to hypergraphs, making their concepts consistent with geometric intuitions and rigorous proofs.\n\nWeaknesses:\n1. Figure 1 needs to be more clear and intuitive. For example, too many directed edges are used in Figure 1(d) to describe the random walk of weighted edges. It is recommended to use the relationship between the weighted edge and the hyperedge cardinality to represent, so that would be more concise.\n2. The definition of AGG(s) in Eq. (14) is ambiguous. In this paper, it is said that Eq.(14) is consistent with the previously defined hyperedge curvature. But should we understand it as the sum of AGG for nodes in subset s or  understand it as AGGM(s) ?\n3. In Corollary6, only Equal-Nodes Random Walk is analyzed, but Equal-Edges Random Walk and Weighted-Edges Random Walk are not analyzed.\n4. In Figure 3a, the shapes and colors in the legend indicate errors, languages should be represented by upper triangles, and Nerds should be represented by dots.\n5. This paper uses unlabeled datasets for experiments and then uses the Wasserstein Clustering Coefficient to measure the results. We recommend using a labeled dataset, so that ground truth can be accurately obtained, allowing for more intuitive comparison of results.\n6. This paper generalizes the Ollivier-Ricci curvature of graphs to hypergraphs, and the experimental part should focus on the advantages of using hypergraph curvature and compare ORCHID with methods which using Ollivier-Ricci curvature for graphs.",
            "clarity,_quality,_novelty_and_reproducibility": "The paper focuses on analyzing the three random walks of Equal-Nodes, Equal-Edges, and Weighted-Edges, but many higher-order correlations in the hypergraph cannot be generalized by these three methods. Many details in the paper need to be improved, such as the definition and expression of the formulas, the information in the figures, etc. This article is the first to generalize the Ollivier-Ricci curvature of graphs to hypergraphs, which is original. A rigorous and clear proof of the theorem is given in the paper.",
            "summary_of_the_review": "The sufficiency and necessity of the paper are the important part and generalization from graphs to hypergraphs should focus on considering higher-order associations of hypergraphs, as well as highlighting the advantages compared to graph-based frameworks.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2886/Reviewer_x9Zy"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2886/Reviewer_x9Zy"
        ]
    },
    {
        "id": "Ys-MWoIaTM",
        "original": null,
        "number": 4,
        "cdate": 1666803013737,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666803013737,
        "tmdate": 1669850711419,
        "tddate": null,
        "forum": "sPCKNl5qDps",
        "replyto": "sPCKNl5qDps",
        "invitation": "ICLR.cc/2023/Conference/Paper2886/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "The paper introduces a notion of curvature on hypergraphs. It is related to Ollivier's notion, which works for metric spaces with Markov chains on them. In that case, curvature is (basically) the curvature describes the contraction of the map from points x to the transition probabilities from x. \n\nThere is a \"canonical\" choice of Markov chain for graphs -- (lazy) random walk -- but there's no obvious choice for hypergraphs, so the paper explores three possibilities. It also proves some bounds and intuitive properties of these definitions. \n\nOne motivation for introducing a new notion of curvature is to have a \"local\" (and thus simple to compute) parameter that is indicative of \"global\" features of the network. This idea is tested in an exploratory empirical study, where the newly introduced curvatures seem to function as meaninful features for clustering and hypergraph exploration/node differentiation. ",
            "strength_and_weaknesses": "*Strengths*\n\n- The paper presents a principled method for defining curvature parameters in hypergraphs. \n- Some mathematical results and properties are presented.\n- These new parameters seem to serve as good features for clustering and other tasks, as demonstrated in an experimental study. Figure 3 and Table 2 are compelling.\n\n*Weaknesses*\n\n- Although I am happy with some experiments, I found it hard to draw conclusions from the experiments in general. For instance, I do not understand to what the authors are comparing Table 13 to. \n- More broadly, since are other notions of curvature for hypergraphs, and other methods for extracting hypergraph features, I would like to understand how the new notion introduced here compares to the alternatives in practice. What is the state of the art? ",
            "clarity,_quality,_novelty_and_reproducibility": "*Clarity*\n\nI found the paper easy to read and parse. The things that were not clear in my mind seem to be limitations of the paper itself.\n\n*Novelty*\n\nThe present approach to curvature seems genuinely novel.\n\n*Quality*\n\nThe results of the article are quite intriguing, but I feel they are somewhat incomplete. To my mind, the most compelling empirical results are the ones in Figure 3 and Table 2, which allow for quick comparisons of different features. \n\nI think a few other directions could be discussed with respect to the exploratory analysis. For instance, what is the geometric meaning of curvature in examples (eg. are highly cited articles extremal for curvature because the literature \"diverges\" in many different directions away from them?). \n\n*Reproducibility*\n\nI did not check this carefully but it seems possible to reproduce everything with the material given.",
            "summary_of_the_review": "The paper offers an intriguing new notion of curvature for hypergraphs that seems to perform well in practice. My main misgivings are about the lack of more systematic comparisons with other approaches. \n\n-- \n\nUPDATE on Nov 30th: \n\nI am a bit more positive about the comparison with other approaches, and have raised my score accordingly.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2886/Reviewer_22tj"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2886/Reviewer_22tj"
        ]
    }
]