[
    {
        "id": "fXJJifW9JKG",
        "original": null,
        "number": 1,
        "cdate": 1666529005576,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666529005576,
        "tmdate": 1666529005576,
        "tddate": null,
        "forum": "tFvr-kYWs_Y",
        "replyto": "tFvr-kYWs_Y",
        "invitation": "ICLR.cc/2023/Conference/Paper1480/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "The paper is dedicated to a theoretical analysis of the saturation effect, that is the gap between information theoretical lower bound on the generalization error of KRR and the actual error. This effect has been widely observed in practices. The main result of the paper is given in Theorem 3.1, that deduces a lower bound on the accuracy of KRR under assumptions (A) eigenvalues decay rate, 1) smoothness of kernel and 2) lower bound on the variance of noice. ",
            "strength_and_weaknesses": "I have not checked mathematical proofs completely, though major arguments seems to be correct. \n\nFirst general question that appears after reading the article is: can the condition (2) be weakened. Does the saturation effect disappear is we have zero noise? E.g. what changes if we set sigma=0 in numerical experiments of Section 4? From the bias-variance decomposition formula on page 4 it seems that the effect should disappear, because the variance term will disappear. Could you comment on that.",
            "clarity,_quality,_novelty_and_reproducibility": "A narrative is clear and justified. For me it is hard to judge the originality, because I am not familiar with earlier papers on the saturation effect. ",
            "summary_of_the_review": "A paper is theoretical. Statements are justified. Since ICLR is more oriented towards experiments, a paper needs to enhance experimental section. Is everything understood with the saturation effect after that theory was built, or something is still present in experiments that was not covered by theory?",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper1480/Reviewer_VSqD"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper1480/Reviewer_VSqD"
        ]
    },
    {
        "id": "OMYF2Ifh1q5",
        "original": null,
        "number": 2,
        "cdate": 1666542804611,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666542804611,
        "tmdate": 1666543169593,
        "tddate": null,
        "forum": "tFvr-kYWs_Y",
        "replyto": "tFvr-kYWs_Y",
        "invitation": "ICLR.cc/2023/Conference/Paper1480/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper studies the saturation effect of KRR. Under some additional assumptions, the paper provides a lower bound of the rate of generalization error for the case where $f\\in[\\mathcal{H}]^\\alpha$ for some $\\alpha>2$. The proposed lower bound matches the existing upper bound when $\\alpha>2$ and verifies the saturation effect of KRR.",
            "strength_and_weaknesses": "The paper is well-written and easy to follow. The authors provide proof of a long-standing conjecture about the information-theoretical lower bound of KRR. The theoretical contribution is significant.\n\nHowever, I still have some concerns about the assumptions. The lower bound is obtained under different assumptions than the upper bound. The upper bound (prop 2.2) requires the distributions satisfying conditions (B') and (C), while the proposed lower bound (thm 3.1) requires Assumption 1 and 2. Thus I do not think this paper completely proves the conjecture since it is still unknown whether the proposed lower bound can be obtained under condition (B') and (C).\n\nI'm also confused about the assumptions on the noise. Notice that condition (C) assumes the momentum of the noise is upper bounded but Assumption 2 requires the noise to be non-vanishing. These two assumptions seem somewhat opposite. I hope the authors can provide a detailed discussion of the required assumptions.\n\nminors:\n\nLine 2 of thm 3.1: \"satisfies the that\" -> \"satisfies that\"",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is mostly clear and of high quality. The theoretical contributions are novel.",
            "summary_of_the_review": "Overall, I think this paper provides an important contribution to the saturation effect of KRR. But the authors need to provide more discussions on the additional assumptions.\n",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper1480/Reviewer_iDfT"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper1480/Reviewer_iDfT"
        ]
    },
    {
        "id": "MgM0fvYv7s5",
        "original": null,
        "number": 3,
        "cdate": 1666652604694,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666652604694,
        "tmdate": 1666652604694,
        "tddate": null,
        "forum": "tFvr-kYWs_Y",
        "replyto": "tFvr-kYWs_Y",
        "invitation": "ICLR.cc/2023/Conference/Paper1480/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "The paper studies the saturation effect of kernel ridge regression (KRR), providing a proof of the conjecture. The main result is a lower bound on the generalization error which suggests that KRR cannot achieve the information theoretical lower bound when the smoothness of the underground truth function exceeds certain level.",
            "strength_and_weaknesses": "The paper presents new insights into the saturation phenomenon: the optimally tuned KRR can achieve the minimax rate $n^{-\\alpha/(\\alpha+\\beta)}$ when the smoothness of the underlying truth function is within certain threshold; however, the rate for the estimator is bounded from below by $n^{-2/(2+\\beta)}$ if the smoothness exceeds the threshold. This could be a useful contribution to learning theory.",
            "clarity,_quality,_novelty_and_reproducibility": "- Novelty: the paper proves a commonly observed conjecture which has impact on the theoretical understanding of KRR.\n- Clarity: I found the paper well-written and easy to follow. \n- Quality: the theoretical proof looks solid.\n\n",
            "summary_of_the_review": "Overall, I think this is an interesting paper with solid theoretical contributions to kernel methods.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper1480/Reviewer_1PPr"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper1480/Reviewer_1PPr"
        ]
    },
    {
        "id": "FtckJcP0udT",
        "original": null,
        "number": 4,
        "cdate": 1666675048446,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666675048446,
        "tmdate": 1666675048446,
        "tddate": null,
        "forum": "tFvr-kYWs_Y",
        "replyto": "tFvr-kYWs_Y",
        "invitation": "ICLR.cc/2023/Conference/Paper1480/-/Official_Review",
        "content": {
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "The authors explain the slow convergence of the Nonparametric Kernel regression with ridge regularization in the regime where the true prediction function is too smooth compared with that of the kernel. \n\nTwo parameters have been introduced: although not explicitly explained, \\beta controls the span of the kernel in the RKHS, and \\alpha controls the smoothness of the true prediction function compared with the used kernel. When \\alpha=2, the smoothness is equal to the that of the kernel, and if \\alpha > 2, the prediction function is smoother than the used kernel. In this case, the convergence can be slow even though generally the smooth functions are preferred for generalization.\n\nThe authors provided an analysis on this regime and showed some experiments confirming the derivation.",
            "strength_and_weaknesses": "The paper is partially interesting in terms of considering an unexplored regime where our model is too complex compared with the true prediction function. I am not an expert who can look into the details of the proof, but the derived result seems to provide a clear interpretation and the coincidence with the experiments.\n\nHowever in practice, the proposed saturation effect can be addressed by changing the kernel functions.\n",
            "clarity,_quality,_novelty_and_reproducibility": "In terms of the clarity and novelty, the paper is fine.\n",
            "summary_of_the_review": "The focus of the paper is on the regime where the prediction function is too smooth compared with that of the kernel function. I find the paper  interesting and think the paper can be published at ICLR, but I am not an expert to provide reviews for the quality of the proof techniques.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper1480/Reviewer_s1WT"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper1480/Reviewer_s1WT"
        ]
    }
]