[
    {
        "id": "nNBAkdjzL5",
        "original": null,
        "number": 1,
        "cdate": 1666153026965,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666153026965,
        "tmdate": 1666153026965,
        "tddate": null,
        "forum": "tPKKXeW33YU",
        "replyto": "tPKKXeW33YU",
        "invitation": "ICLR.cc/2023/Conference/Paper6480/-/Official_Review",
        "content": {
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper proposes to employ a differentiable neural ray tracer for wireless channel modeling. It models the time-angle channel impulse response as a superposition of multiple paths, and the wireless characteristics of each path are a result of multiple evaluations of an implicit neural network. The proposed framework achieves strong performance in multiple tasks.",
            "strength_and_weaknesses": "Strength:   \n1. This paper is well-written and the ideas are clearly illustrated.   \n2. It is interesting to find the similarity between wireless channel modeling and neural ray tracing.   \n3. It is good to see that WiNeRT achieves encouraging results on time-of-flight prediction and user location tasks.    \n\nWeakness:   \n1. For the baseline method, the paper only compares with KNN and MLP. What are the comparative results with other channel modeling methods?    \n2. What is the efficiency of the proposed method?    \n3. Are WI3ROOMS and WIRPLAN two standard benchmarks?   \n4. In figure 4, the legends and the rays have different colors, it is difficult to know which are GT and which are predictions.\n",
            "clarity,_quality,_novelty_and_reproducibility": "This paper is well-written, and the overall quality is good. I think it is novel and reproducible.",
            "summary_of_the_review": "I am not an expert in wireless channel modelling, therefore it is not straightforward for me to evaluate the significance of this work in this field. Given the encouraging results and novelty, I think this paper is above the borderline.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper6480/Reviewer_emnY"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper6480/Reviewer_emnY"
        ]
    },
    {
        "id": "f8AJjezER5",
        "original": null,
        "number": 2,
        "cdate": 1666366413463,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666366413463,
        "tmdate": 1666366764746,
        "tddate": null,
        "forum": "tPKKXeW33YU",
        "replyto": "tPKKXeW33YU",
        "invitation": "ICLR.cc/2023/Conference/Paper6480/-/Official_Review",
        "content": {
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper proposed a method for wireless channel modelling inspired from NeRF-based neural scene representation. Different from previous works which explicitly model the ray surface interaction, it tries to learn and map the environment configuration to a wireless channel directly through a neural network. The proposed method is evaluated using multiple indoor scenes and demonstrate significant improvements over the baselines.",
            "strength_and_weaknesses": "Strength: The application of using NeRF-based method for wireless channel modelling is somewhat novel and the proposed implicit method for ray surface interaction seems to be effective.\n\nWeakness: The proposed method seems to assume the reconstructed scene is perfect without any noise. However, in practice, such ideal reconstruction is rarely happens especially for sparse input setting. The proposed method is evaluated using only synthetic data which also raise a concern about the robustness of the proposed method when it is applied to real world scenarios. How does the proposed method avoid overfitting when the training and testing are both under ideal configurations? The proposed method is only compared with kNN and MLP which are very simple baseline methods. How about the comparisons with other SOTA that using explicit methods for ray surface interaction modelling?",
            "clarity,_quality,_novelty_and_reproducibility": "I think the paper writing is generally clear, but can be improved with more ablation studies about the proposed architecture of neural network. The experimental section should also include some real world scenarios. As pointed out above, how sensitive/robust is the proposed method towards the scene reconstruction noise/errors?",
            "summary_of_the_review": "Please check my comments above. I think the studied problem and the proposed method is somewhat novel, but the experimental evaluations are lacking in some aspects such as lack of ablation studies on network architectures, lack of robustness of the proposed method towards scene noise, lack of real world scenario examples. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper6480/Reviewer_YoPQ"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper6480/Reviewer_YoPQ"
        ]
    },
    {
        "id": "Sf5c7x6Q8Mz",
        "original": null,
        "number": 3,
        "cdate": 1666426939555,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666426939555,
        "tmdate": 1670856041919,
        "tddate": null,
        "forum": "tPKKXeW33YU",
        "replyto": "tPKKXeW33YU",
        "invitation": "ICLR.cc/2023/Conference/Paper6480/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "Update; I have read the rebuttal and decided to increase the score.\n--------\n\nThis paper proposes a neural surrogate (WiNeRT) for a ray tracer that models the propagation of wireless signals. WiNeRT is a hybrid heuristic/learned ray tracer that replaces some heuristic ray tracing functionality, especially the Ray-Surface Interaction with a neural network. The authors claim that this is the first wireless neural ray tracer and in addition to simulating ray-tracing results, it will allow solving inverse problems via differentiating through the model. The paper experimentally validates the accuracy of the model against simple baselines and shows initial results on inverse problem of localization.",
            "strength_and_weaknesses": "Strengths:\n\n—-------------------\n\nThe paper has many strengths and is tackling an important problem. For the sake of time  I am only writing about weaknesses in this review, since those are the ones that should be actioned upon.\n\nWeaknesses (and questions) (W)\n\n—--------------------------------------------\n\nW: The method is a hybrid method that utilizes both typical ray tracing and neural ray marching features. It would be good if the authors could write more precisely which parts of the algorithm are same/similar as normal full ray-tracing and which parts contain learned functions. As far as I understand the main learned part is the Ray-Surface Interaction, and it would be important to describe how this is normally done to understand what the neural surrogate is approximating.\n\nW: Give more details on the end-to-end model, e.g., in an appendix for reproducibility. As it stands it might be difficult to re-implement or improve the current method.\n\nW: The authors should describe more clearly what are the target use cases for the system. It seems to be that the system requires training data from the same/similar environment from an existing ray tracer, so what would be the biggest reasons for using the neural surrogate since an existing ray tracing simulation is anyway needed?\n\nW: The main reason (in addition to inverting) of using a neural surrogate is to improve the inference time simulation speed and computational complexity. As far as I can see this discussion is missing from the paper and it would be very important to discuss it.\n\nW: (See above). If the computational complexity is not reduced much, then the main benefit of the model is the invertibility, which is briefly discussed in the localization experiment. How good is the localization result? It should be compared to other localization approaches in the same environment (without using the trained model). In addition, it would be important to discuss more use cases of the model inversion and more inversion experiments of the neural surrogate should be performed.\n\nW: The paper might find a relatively narrow audience in machine learning and might be even more suitable for publishing in the wireless domain. For ICLR, the authors should discuss which parts could be generalizable to other domains than wireless ray tracing.\n\nW: While there are extensive tests of generalization in the same space as in training (different Rx and Tx locations, etc.), the generalization to new spaces would be interesting to study further in addition to F′ in Figure A3. It will be important to see also the failure cases where there is a big enough change in the environment in the test set, ie., how general ray tracing algorithm it has learned.\n\nW: The authors do not discuss non-linear effects of the channel, such as doppler shift or spread and how this could be modeled for highly mobile UEs.\n\nW: The baselines 1-NN and MLP should be described more carefully. Are they replacing the ray-marching part or the general processing. What parts of a normal ray-tracer are the baselines utilizing (different from the main model)\n\nW: How is diffraction handled in the model?\n\nW: How is penetration handled in the model?\n\nW: Regarding inverse problems, could the authors state which kinds of inverse problems would be solvable using the model and which would lie outside of the current model. For example, could one design changes in the environment geometry using the current model or is it currently restricted only to the trained geometry.\n",
            "clarity,_quality,_novelty_and_reproducibility": "The clarity of the writing and the quality and the novelty of the paper are good. There are some issues with reproducibility since the method contains both learned and non-learned parts and not all details are sufficiently described in the paper.\n",
            "summary_of_the_review": "Well-written practical paper that has good empirical evaluation, but would need some more work. Once improved and with detailed end-to-end description of the method it might serve also as a baseline for further works.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper6480/Reviewer_oi9G"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper6480/Reviewer_oi9G"
        ]
    },
    {
        "id": "94UJMJccxH",
        "original": null,
        "number": 4,
        "cdate": 1666628800793,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666628800793,
        "tmdate": 1666629092950,
        "tddate": null,
        "forum": "tPKKXeW33YU",
        "replyto": "tPKKXeW33YU",
        "invitation": "ICLR.cc/2023/Conference/Paper6480/-/Official_Review",
        "content": {
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper proposes a neural network based solution to heuristically solve a wireless signal (physics) rendering problem. Given the environment set-up and configurations of the transmitter and receivers, the pre-trained network is able to simulate the wireless signal propagation in the confined environment instead of physically computing the ray-tracing function, which costs the computational power extremely. In addition, this approach enables the reverse rendering applications. \n\n",
            "strength_and_weaknesses": "Strengths\n1. This paper creates a new area that is simulating / predicting wireless signal propagation problem (or more generally: a ray-tracing simulation). This method explores a new topic and expands the boundary of computer vision applications. \n2. The proposed paper has thorough study with signal propagation problem. It provides detailed mathematical definition of the problem, casts the physics ray-tracing computation to a network simulation problem. It also come with solidate experiments to demonstrate the effectiveness of the proposed method. \n3. The paper also proposes two new databases / datasets that allow the community to benchmark further new methods. This could bring more impact to the community of computer vision. \n\nWeaknesses\n1. This paper does not discuss about the non-linear surface or interactions of wireless signals. It assumes the operations are all linear. The authors are suggested to provide a limitation of the method\n2. In the introduction part, the goal of the proposed method is to reduced the inference time. The authors are suggested to make a comparison between the current method and ray-tracing computation. ",
            "clarity,_quality,_novelty_and_reproducibility": "This paper has clearly described the motivation of wireless signal propagation, the necessity of simulating wireless signals. It also has provided a comprehensive literature review, although no previous research in this line.  The method is clearly written with the aid of using mathematical formulas. The novelty is quite strong because this is a new topic with no pre-existing solutions.  \n\nThe code is provided and the reproducibility and originality of the work is good. ",
            "summary_of_the_review": "In summary, this paper proposes a new topic of simulating wireless signal propagation in a confined configurable environment. The paper systematically defines and solves the problem with comprehensive experiments. ",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "empirical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper6480/Reviewer_sfBb"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper6480/Reviewer_sfBb"
        ]
    }
]