[
    {
        "id": "ixEFMoDNl93",
        "original": null,
        "number": 1,
        "cdate": 1666257220605,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666257220605,
        "tmdate": 1666257220605,
        "tddate": null,
        "forum": "u0aNcjqhEJ",
        "replyto": "u0aNcjqhEJ",
        "invitation": "ICLR.cc/2023/Conference/Paper4021/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "Authors provide a method for \"consciousness-aware\" reinforcement learning that consists on several modules that provide attention and cooperation between agents to provide a solution for the varying partial observability. In particular, these modules are defined as \"consciousness-aware\" in an analogy to actions that a \"consciousness-aware\" human being do. However, we can not say that this system  possess awareness, nor phenomenal consciousness, just because of that. Hence, the title of the paper is misleading. It is a good paper but several terms must be changed. I would talk about attention or access consciousness but not awareness. ",
            "strength_and_weaknesses": "Strengths: Rigorous, style. \nWeaknesses: Mainly the biggest is not knowing what is consciousness.",
            "clarity,_quality,_novelty_and_reproducibility": "Clarity: Some sections need more explanations and better organization.\nQuality: The method section is good, the experimental section is average. \nNovelty: It is an engineering enhanced version of multi-agent reinforcement learning. Maybe better than the threshold.\nReproducibility: They did not provide a link to the code. ",
            "summary_of_the_review": "The main issue of this paper is their use of the words consciousness and awareness. Consciousness is a property that we cannot assign freely to machines without accepting lots of assumptions that can not be validated with the scientific method like multiple realizability and functionalism. Those can be reviewed in a philosophy of mind manual or even studied from a neuroscientific point of view. Even, Roger Penrose provides strong arguments against the emergence of consciousness in machines. Why is this algorithm in particular conscious, or aware, about itself? If it would, it need to catch qualia, and this assumption does not hold for a simple information processing algorithm such as the one present here. One thing is to talk about attention layers, which is valid, and another is just putting the title \"Consciousness-aware multi-agent reinforcement learning\". I can not accept the paper and need to recommend a strong reject, although technically is not that bad, just because of this. This seems to be a great multi-agent reinforcement learning algorithm from an engineering perspective but it is not aware of itself. Please review the literature about philosophy of mind to learn more about this. We can hardly assume that this algorithm would simulate features about access-consciousness, but not awareness which is the same as phenomenal consciousness. Consequently, the title can not include \"consciousness\" nor the name of the modules. \n\nOutside of the discussion about consciousness:\n\nMultiple terms such as varying partial observability vs slight partial observability need to be better defined. \nI find a lack of cohesion between multiple parts of the paper, sections are written in a very straight-forward style. They need to be better introduced. \n\"Consciousness-learning\" does not make sense. \nThe related work section deliberately ignores work on consciousness, which is OK if the paper does not talk about consciousness.\nIt would be interesting to describe an example of observation function.\nFormalize the concept of dynamic team. \n\"mulit\" -> multi\nThe experiment section is repeated just with 6 different seeds. I recommend to repeat it using 25 different seeds or more to make the results  statistically more solid. ",
            "correctness": "1: The main claims of the paper are incorrect or not at all supported by theory or empirical results.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "Yes, Other reasons (please specify below)"
            ],
            "details_of_ethics_concerns": "The paper talks about \"consciousness and awareness\" when it does not really talk about this. This can be misleading making the people believe that computers are aware about itself. I consider it dangerous.",
            "recommendation": "1: strong reject"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper4021/Reviewer_xWNF"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper4021/Reviewer_xWNF"
        ]
    },
    {
        "id": "q6T_j_TU_E",
        "original": null,
        "number": 2,
        "cdate": 1666409919113,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666409919113,
        "tmdate": 1666418004059,
        "tddate": null,
        "forum": "u0aNcjqhEJ",
        "replyto": "u0aNcjqhEJ",
        "invitation": "ICLR.cc/2023/Conference/Paper4021/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This papers propose a “consciousness-aware” method to coordinate between multiple RL agents.  The authors state that individual may have attention distraction, and CAMA is good to address the issue to achieve better performance.",
            "strength_and_weaknesses": "Strengths:\n1. The problem is well stated, and it is a realistic problem to tackle.\n2. The proposed method and its modules are well organized and proved.\n3. The empirical study justifies the claim of SOTA against other methods.\n\nWeaknesses:\n1. The name CAMA uses the term consciousness but it is not clear what this term means in this context.  Consciousness is one of the most misunderstood terms. And when it is used, which parts of the system are unconscious?  \n2. Figures are well drawn and can be presented and explained in greater details. \n3. It is not clear if CAMA requires higher volume of training data? ",
            "clarity,_quality,_novelty_and_reproducibility": "Overall a good piece of work.  The presentation is clear; algorithms, modules, theories, experiments are all properly done.  It is just too bad that under the review framework, we cannot see live demos to evaluate its significances and pin down how and why the proposed CAMA is helpful.  \n\nThe statement in the abstract is repeated also in the main text and conclusion.  It would be good to remark on the cost to pay and added complexity by adding CONSCIOUSNESS on top to coordinate all involved agents.  ",
            "summary_of_the_review": "The paper is well structured and the proposed method and modules appear to be sound.  However, it is really hard to assess the impact of this work based on just a couple of examples.  It is not clear about its data complexity and limitations.  It is also good to thoroughly justify the use of the term “consciousness” and explain why “coordinated” or “supervised” can do a justified job.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper4021/Reviewer_g4aW"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper4021/Reviewer_g4aW"
        ]
    },
    {
        "id": "41_flvreKX7",
        "original": null,
        "number": 3,
        "cdate": 1666451146930,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666451146930,
        "tmdate": 1666451146930,
        "tddate": null,
        "forum": "u0aNcjqhEJ",
        "replyto": "u0aNcjqhEJ",
        "invitation": "ICLR.cc/2023/Conference/Paper4021/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "The paper describes a solution for improving performance in multi-agent reinforcement learning. The term \"consciousness\" in this work essentially refers to attention based mechanisms and to the fact that the authors adopt and approach that resides in the idea of dividing the general problem into sub-parts in order to tackle it. The work is evaluated by means of a series of experiments with testbeds, namely an apple picking task with obstacles, a resource collection task, a traffic junction navigation task and the StarCraft environment. \n\nThe paper is evaluated using a variety of tasks and this is definitely commendable. However, the evaluation does not show the actual contributions of the three key components/mechanism of the proposed solution, namely the entity dividing module, the consciousness enhancement for the local agent and the consciousness replacement.\n\nThe main contribution of the work is essentially in putting together a series of existing mechanisms in order to achieve better performance in the tasks under consideration. \n\n\n",
            "strength_and_weaknesses": "This paper considers the difficult problem of coordination of teams of agents for the execution of a complex task. The main mechanism used by the authors is the \"classic\" divide-and-conquer strategy. The goal is to deal with the problem of \"attention distraction\" in partially observed environments.\n\nThe use of term \"consciousness-aware\" is probably out of place, since the mapping to the concept of consciousness is actually very weak. Moreover, \"consciousness\" itself is about awareness, so the use of the term \"consciousness-aware\" might also be questionable. Some expressions should be really removed from the text such as \"...CAMA empowers agents with purposeful consciousness\". However, the reviewer believes that this is not the most important concern related to this work. One of the major weakness of this work is the fact that it looks like a composition of existing \"components\", which has somehow renamed and adapted. This would be fine, but the actual need for each of them is not supported by sufficient evidence.\n\nThe design of the different components is not completely new. They are essentially mechanisms that are mapped to existing work  in the area, which are correctly cited by the authors. \n\nA key problem that is essentially not tackled in a general way is the decomposition of the general problem into subproblems. The presentation of these mechanisms is very high level in the paper. It is difficult to understand how this is performed in general (and I would say also in the environments considered by the authors).\n\nThe authors present some theoretical results about the \"consciousness replenishment mechanism by local coach\", but they appear rather disjoint from the main text. It is not completely clear why they are relevant for this work. In particular, the relevance of Theorem 4.1 to this specific work is not apparent. In fact, the theorem considers a property of a system of 3 random variables. How is this mapped to the situations and environments under consideration?\n\nThe reviewer would like to suggest the authors to improve their evaluation by showing the actual contributions of the different mechanisms separately (and in composition) from the point of view of the actual performance obtained in the system. Ideally, a discussion about the generalizability of the approach would really contribute to make this work stronger.\n\n",
            "clarity,_quality,_novelty_and_reproducibility": "The reviewer is aware that the authors describe a very complex work with many moving parts. However, it is very difficult to understand how the different mechanisms used in the paper are put together. The choice of the values of the different parameters is also not completely justified, except for some of them. In general, the paper appears hard to reproduce.\n\nThe reviewer has also concerns in relation to the originality of this work, since it appears as a composition of a series of different mechanisms that have been studied in the literature before. There is value in studying how to integrate different mechanisms, but in my opinion, the paper does not provide sufficient evidence for showing the contributions of each of them. The theoretical results presented in the work appear as somehow disjoint from the rest of the paper.",
            "summary_of_the_review": "The contribution of this work is limited - the proposed solution is essentially a composition of existing components. This is not a problem per se, but the design choices and the actual evidence supporting the need for these components is not satisfactory. The evaluation is not satisfactory since it does not really show the contributions in terms of performance of the different mechanisms. The theoretical foundations of this work are also not completely convincing. The authors include some theoretical results that are not key for the actual contribution of this work. For this reason, the reviewer cannot recommend this work for publication.",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "details_of_ethics_concerns": "N/A",
            "recommendation": "3: reject, not good enough"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper4021/Reviewer_zvuV"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper4021/Reviewer_zvuV"
        ]
    },
    {
        "id": "RENoHvOZCM",
        "original": null,
        "number": 4,
        "cdate": 1666463608786,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666463608786,
        "tmdate": 1666463608786,
        "tddate": null,
        "forum": "u0aNcjqhEJ",
        "replyto": "u0aNcjqhEJ",
        "invitation": "ICLR.cc/2023/Conference/Paper4021/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper presents an architecture which divides entities into two groups, one of locally relevant entities passed directly to the agent's utility network and another of less relevant entities which are passed into a global coach which compresses global information. This architecture produces improved performance on multi-agent tasks with varying quantities of agents.",
            "strength_and_weaknesses": "# Strengths\n* Strong results on a variety of domains. The consistent performance as the number of agents increases shown in figure 9bc is especially impressive. it would be interesting to see if this extends beyond the number of agents seen during training.\n\n# Weaknesses\n* The paper is rife with excessive anthropomorphizing language, down to the title (\"consciousness\"). I would recommend that the authors tone this down.\n* The \"consciousness replenishment module\" is conceptually similar to the coach in COPA [1], though it is presented as a novel contribution with significant exposition dedicated to it. It should be described more in relation to the existing work to emphasize what the differences are.\n* Figure 3 is averaging attention across time steps and (presumably) attention heads, so it would be expected to be dispersed over the whole set of agents and entities (since many varying interactions may happen over the course of an episode). If one were to plot attention at a single time step from a single head and it still looked this dispersed, it would be a more effective argument for what the authors are describing. The reason it looks less dispersed in the SR=3 case is likely that agents spend many time steps in this setting only being able to observe themselves.\n* A thorough ablation study is needed to understand the significance of each component. For example, the loss functions that are unique to each module could be ablated.\n\n# Questions\n* From Figure 2, it seems like the entities in the complement of the selected mask are still used in computing the agent utilities, so why are they described as \"out-of-sight-range\"?\n\n[1] Liu, Bo, et al. \"Coach-player multi-agent reinforcement learning for dynamic team composition.\" International Conference on Machine Learning. PMLR, 2021.",
            "clarity,_quality,_novelty_and_reproducibility": "Clarity: The description of the problem setting and methods are relatively clear\n\nQuality: It's not clear that the proposed architecture is solving the problems detailed by the introduction since the empirical justification is weak (see point 3 of weaknesses above) and a thorough ablation study is missing.\n\nOriginality: Most components of the method are similar to existing work, though they are arranged in a novel fashion to solve a novel problem.\n\nReproducibility: The architecture is complex and no code is provided, so this work may be difficult to reproduce.",
            "summary_of_the_review": "While the results presented are impressive, the proposed architecture is complex and could use more justification for the individual components. It's not clear to me that the improved results are a result of addressing the problems laid out in the introduction or some other emergent properties of the architecture.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper4021/Reviewer_UtXQ"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper4021/Reviewer_UtXQ"
        ]
    }
]