[
    {
        "id": "OVhJkhgruu",
        "original": null,
        "number": 1,
        "cdate": 1666277094969,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666277094969,
        "tmdate": 1670541030474,
        "tddate": null,
        "forum": "u_pS0sDr95-",
        "replyto": "u_pS0sDr95-",
        "invitation": "ICLR.cc/2023/Conference/Paper5480/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "The paper presents a model and sampling method for de novo drug design. The model consists of\n-  multi-layer perceptron that outputs an 'energy' as a function of a latent vector\n- LSTM that generates SELFIES strings conditional on the latent vector\n- multi-layer perceptrons to predict molecule properties given latent vectors\n\nThe model is first trained on a large set of molecules and their properties. Then, it is fine-tuned to generate molecules with desired properties using a new method that the authors name 'sampling with gradual distributional shifting'.\n",
            "strength_and_weaknesses": "- As far as I know, this model architecture has not previously been used for this problem, and it gets good results on the presented metrics compared to the presented baselines.\n-  Related work is not correctly described. In section 2 '... learn a surrogate function to predict properties, and then use Bayesian optimization' is not an accurate description of the molecular swarm optimization in Winter et al. (2019) nor the simulated design-synthesis-test cycles in Segler et al. (2018).  In 3.2 and 4.2 the authors fail to note that Segler et al. (2018) also generated a very high percentage of valid SMILES strings using an LSTM. It would be a good baseline to include.\n- Langevin dynamics is notoriously slow to sample multimodal distributions. Is this a problem for MolEBM? \n- What happens to validity, novelty, and uniqueness of generated molecules after SGDS?\n- Could the model be evaluated on the GuacaMol benchmarks (Brown et al., 2019)?\n- Good scores on the presented metrics may not indicate usefulness for de novo drug design. For example, Figure 2 shows that several of the molecules corresponding to bold numbers in table 4 are not reasonable drug candidates (large cycles etc.).\n",
            "clarity,_quality,_novelty_and_reproducibility": "Code and trained models are available to download.\n\nRegarding clarity -\n- what does ‘expressive’ latent space mean? I think it means that points which are close together in latent space correspond to molecules with similar properties, but this should be clarified.\n- 3.3 is hard to make sense of. We are told first that y is a deterministic function of x, and then that x and y are conditionally independent given z. This can only be true if y is a deterministic function of z, but in equation (7) we’re told that y has Gaussian distribution given z.  Instead, one could just say that the model fits a distribution of the form given in equation (6) to approximate p(x,y). The authors say that because the latent space is expressive, we can assume (6), but I think this argument is the wrong way round: because of the choice of model (6) and negative log-likelihood loss, the latent z is forced to encode information about y.\n- what does ‘top-down’ as in ‘top-down generator model’ mean?\n- Which molecular properties are given as regression targets during pretraining, and which are only introduced during SGDS?\n",
            "summary_of_the_review": "The paper introduces a new model architecture and sampling strategy for de novo drug design. It gets good results on some metrics, compared to the presented baselines, but I am not sure if the work represents a practically useful advance. The authors do not adequately reference and describe prior work on the same problem.",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper5480/Reviewer_vKUH"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper5480/Reviewer_vKUH"
        ]
    },
    {
        "id": "ZdCiWkO9kwM",
        "original": null,
        "number": 2,
        "cdate": 1666362101872,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666362101872,
        "tmdate": 1666362101872,
        "tddate": null,
        "forum": "u_pS0sDr95-",
        "replyto": "u_pS0sDr95-",
        "invitation": "ICLR.cc/2023/Conference/Paper5480/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "The paper presents a method for conditional generation of molecular structures, formulated as a joint latent variable generative model of the molecular structure and one or more properties. The latent variable are modelled using an energy based model, and the molecular structure is an LSTM neural network that generates a SELFIES string representation. Conditionaly sampling molecules with novel values of the desired properties is not likely to work well, since the generative model has not seen any training data in that region. To combat this issue, a procedure is proposed where additional data at the boundary is gradually added, and the model is finetuned.",
            "strength_and_weaknesses": "Strenghts\n\nThe proposed method is fairly simple and seems to work well.\n\nWeaknesses\n\nThe sampling with gradual distribution shifting (SGDS) requires that the properties of interest can be easily computed on the fly. This could be a limiting factor, if the computing the properties cannot be computed quickly. It would be nice with a more detailed discussion of how this (a few comments are included in the appendix).",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is clear and appears technically solid.\nFigure 2 is not referenced in the text.\nIt is not clear to me what specific top 3 molecules were found in the PlogP experiment. \n\nSource code implementing the method is provided, which is very good! The structure and documentation of the code could be improved.\n",
            "summary_of_the_review": "An interesting paper. Limited technical novelty. Fairly good results.\n",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper5480/Reviewer_gP5J"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper5480/Reviewer_gP5J"
        ]
    },
    {
        "id": "dSCv2gJHqEp",
        "original": null,
        "number": 3,
        "cdate": 1666628141964,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666628141964,
        "tmdate": 1666628141964,
        "tddate": null,
        "forum": "u_pS0sDr95-",
        "replyto": "u_pS0sDr95-",
        "invitation": "ICLR.cc/2023/Conference/Paper5480/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "The aim of this paper is the generation of molecules with desired chemical and biological properties learning the joint distribution of molecules and properties . In order to achieve this the authors propose an energy based generative model that augments a top down generative model (conditional autoregressive model) with a latent space learnt via EBM and a property regression model for each of the properties. Then, to sample molecules with desired properties they design an algorithm to shift the learned distribution iteratively. \n",
            "strength_and_weaknesses": "Strength: \nThe paper seems to perform better than state of the art models for unconditional generations using smiles. Especially for unconditional generations it achieves 95.5% validity with 100% novelty using SMILES with the ZINC dataset. Moreover, the sampling with gradual distribution shifting (SGDS) is an interesting suggestion for out of distribution sampling. \n\nWeaknesses: \nThe paper is clearly written but is missing some more explanation about the sampling procedure and the theory behind it.  Even though to estimate the expirations MCMC sampling of the prior and the posterior is required the method is described as \"maximum likelihood”.  \nResults are not compelling enough. Event though the model is proposed for conditional generations given desired properties in the experimental results we see results only for property optimisation. So more experiments should be added to prove the capability for conditional molecule generation like\n- experiments with properties targeted to a predefined range, providing the percent of generated molecules within the target range and the diversity\n- experiments aiming to generate new molecules with a optimised property but similar to the original molecules (similarity-constrained Optimisation)\n\nMoreover, a comparison of the generation time of the proposed model with the other models would be useful. \n\nThe authors should not bold the best values only when they correspond to your model (Table3 GCPN, MolDQN, MARS, GraphDF achieve same QED 1st with the proposed model, MARS, GraphDF achieve same QED 2nd and 3rd with the proposed model)\u2028",
            "clarity,_quality,_novelty_and_reproducibility": "Clarity: The paper is well written, but in order to understand some parts of theory one needs to go back to the [Pang2020] paper. \n\nNovelty : The paper is an extension of the  LLSEBprior model [Pang2020] with which parts of the text are shared. This work differs by adding a property regression model on the latent space of the LLSEBprior model which is trained jointly and proposing the gradual distribution shifting (SGDS) to extrapolate the data distribution and sample from the region supported by molecules with high property values. Moreover, the method is applied to molecular data instead of images and text.  The use of the property predictor in the latent space has also used in [Goméz-Bombarelli2018] and [Jin2018] where also is trained jointly as in the proposed model.\n\nReproducibility: Yes\n\nPang2020]:  Learning Latent Space Energy-Based Prior Model, NeurIPS 2020 \n[Gomez-Bombarelli2018]: Automatic chemical de- sign using a data-driven continuous representation of molecules, ACS Cent. Sci. 2018\n[Jin2018]: Learning multimodal graph-to-graph translation for molecular optimisation, ICLR 2019\u2028\n",
            "summary_of_the_review": "The paper extends the LLSEBprior model with a property predictor on the latent space in order to generate molecules with desired chemical and biological properties. \nThe contribution of the paper is limited and more experiments are needed in order to illustrate the capability of the proposed model to generate molecules with specific properties (see Weaknesses).  \n",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper5480/Reviewer_mgPa"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper5480/Reviewer_mgPa"
        ]
    }
]