[
    {
        "id": "iGM1iwSydOB",
        "original": null,
        "number": 1,
        "cdate": 1666281016997,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666281016997,
        "tmdate": 1666342020299,
        "tddate": null,
        "forum": "WyXH_H0Pdtv",
        "replyto": "WyXH_H0Pdtv",
        "invitation": "ICLR.cc/2023/Conference/Paper2454/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This paper presents a learning-based method for computing geodesics on a triangulated mesh. The algorithm is similar to fast marching cubes with O(NlogN) complexity, except the distance updating step which is the one of the two main contributions of the paper.\nThe proposed distance update step encodes the 3-ring neighbors along with distances from the source (normalised such that norm of distances is 1) using Pointnet (existing method for encoding 3d data) to get a representation of each neighborhood. Then the method tries to train this encoder on ground truth data in a supervised fashion.\nThe second main contribution is that, since the method is computing local geodesics, it is trained on spherical surfaces (simple analytical surfaces)  where an exact computation of geodesics is possible. The training is completely supervised. It is very easy to see that once trained on this data, the method can be easily extended to any complex shape.\nThe experiments demonstrate superior geodesic computation wrt main sota methods.",
            "strength_and_weaknesses": "Strengths:\n1. The method is simple. Can generalise to complex shapes easily.\n2. The paper is well-written. The proposed concepts are well-explained. There are enough details in the paper to reproduce the method.\n3. The results show a huge improvement over sota.\n\nWeakness:\n1. The technical novelty is limited to using pointnet features to learn geodesic distances. \n2. My main concern is the experiment section. The complexity of the method is mentioned but the concrete timing performance of the method is never talked about. I understand that the distance update steps is going to expensive but it is important to see the difference.\n3. The quantitative evaluation is missing on TOSCA dataset. The authors should have reported the geodesic computation accuracy on this dataset and should have compared with other methods such as FMM, MMP and Lichtenstein et al. Perhaps, MMP can be used as baseline.\n4. Since the method is trained on spheres of arbitrary radii (assuming that they vary between extremely small and large), it would have been nice to see the localised performance comparison on the sharp regions such as cat ears, dog-tails etc.\n5. FMM is missing from table 1.",
            "clarity,_quality,_novelty_and_reproducibility": "see the strength section.",
            "summary_of_the_review": "I think that the technical novelty is limited and the lack of experimental evaluation does not allow me to overlook that part. Had it been a (learning-based) method X times faster and X times more accurate (accuracy has been demonstrated partially on polynomial surfaces) on real data (TOSCA, but some other datasets. should have been used as well), my opinion could have been different as it could have been a method with limited novelty but significantly improved performance.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2454/Reviewer_58bg"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2454/Reviewer_58bg"
        ]
    },
    {
        "id": "h1iDQkF38W",
        "original": null,
        "number": 2,
        "cdate": 1666677903738,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666677903738,
        "tmdate": 1666677903738,
        "tddate": null,
        "forum": "WyXH_H0Pdtv",
        "replyto": "WyXH_H0Pdtv",
        "invitation": "ICLR.cc/2023/Conference/Paper2454/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "The paper formulates a third-order accurate fast-marching style algorithm for finding geodesic distances on surfaces embedded in 3D. The local solver is a trained neural network which operates on the 3-ring of the point in question. The algorithm has quasilinear complexity ultimately. For training, a multi-resolution approach is used, resulting in a method that can find distances on coarse meshes that are more accurate than would be possible with exact methods.\n\nThe method is compared to an exact solver, MMP, and a related work Liechtenstein et al. which looks at the 2-ring and forms a second-order accurate scheme. The comparisons are favorable. Ablation studies show that increasing the neighborhood support further does not improve the accuracy of the method.",
            "strength_and_weaknesses": "Strengths:\n- Well-written and clear\n- The approach clearly improves upon existing methods, including one with a related approach (Liechtenstein et al.).\n- A simple and sensible neural network architecture is used.\n\nWeaknesses:\n- As Liechtenstein et al. considered a very similar idea already, it could be argued that the method does not have sufficient novelty.\n- The work does not explore the use of other neural network architectures for the local solver, or at least does not comment on it.\n- It is unclear if the experiments show robustness to the quality of the triangulations for the underlying meshes. Certainly, it seems that the training set triangulations are well-conditioned, so it'd be curious to see its behavior on poorly conditioned meshes. ",
            "clarity,_quality,_novelty_and_reproducibility": "I found the quality of writing to be great. A very understandable work.",
            "summary_of_the_review": "The strengths and weaknesses above summarize my main thoughts on the work. I feel that the work is well-written and investigated, with clear motivation and rationale behind the method. Moreover, it improves upon existing methods, so I am for acceptance.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2454/Reviewer_ssEx"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2454/Reviewer_ssEx"
        ]
    },
    {
        "id": "5oq2CukoZIC",
        "original": null,
        "number": 3,
        "cdate": 1666769658237,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666769658237,
        "tmdate": 1666769658237,
        "tddate": null,
        "forum": "WyXH_H0Pdtv",
        "replyto": "WyXH_H0Pdtv",
        "invitation": "ICLR.cc/2023/Conference/Paper2454/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This paper extends the Deep Eikonal Solver of Liechtenstein et al. It achieves higher empirical accuracy by allowing the local solver to see a 3-ring rather than 2-ring neighborhood, and by training against ground truth distances computed on a finer mesh. The results display generalization from polynomial surfaces to surfaces from the TOSCA dataset.",
            "strength_and_weaknesses": "## Strengths\n- The method is presented fairly clearly.\n- The few results that are presented look good—namely Figure 4 showing empirical distance accuracy of order $h^3$ on meshes of a sphere, and Figure 6 showing better accuracy than competing methods on a dog mesh.\n## Weaknesses\n- The method is claimed to be 3rd-order accurate, i.e., $\\mathcal{O}(h^2)$ throughout the paper. However, this appears to be only an empirical statement based on evaluation on spheres. If you want to claim this accuracy, more evaluation is necessary, especially on real data surfaces from TOSCA. The evaluation of generalization from polynomial surfaces to TOSCA surfaces is very quick and only visual. A more careful and comprehensive numerical evaluation of generalization to the TOSCA dataset is necessary to make a convincing case that this method is highly accurate.\n- The paper claims that \"exact geodesic distances computed on a polygonal mesh approximating a continuous surface would be at most a second order approximation,\" and Appendix A provides an argument to that effect. However, the argument is restricted to a very special case (polygonal approximation of circles in the plane), and it is not a proof. Moreover, no proof is cited. To make a strong claim like this, proof or citation should be given.\n- Section 3.3 (bottom of page 6) claims that the bootstrapping approach can achieve arbitrary accuracy. This seems like it would only be true if the generalization error of your learned local solver is zero. Please provide further justification or else remove these claims.",
            "clarity,_quality,_novelty_and_reproducibility": "## Clarity\nThe paper is mostly clear.\n- The first paragraph of section 3.1 could be reworked a bit. You have \"It can replace the distance approximation method...,\" but no other method is presented to be replaced. \"The neighboring points ... are defined by the distance of the connectivity graph\" is a bit confusing, suggesting that the neighborhood depends on the distances being computed. It should be enough to say that the neighborhood includes all vertices connected to $p$ by a path of at most 3 edges, and leave out the rest of the paragraph.\n- In section 3.2 and elsewhere, you refer to \"the causal nature of our algorithm,\" but what you mean by \"causal\" is never explained. I am assuming you mean the local solver should only consider points that would have been previously visited by the Dijkstra-like algorithm. Please state this more clearly or don't use the word \"causal.\"\n\n## Quality and Novelty\nThe only differences from Liechtenstein et al. appear to be (1) the size of local neighborhood considered; and (2) the multiresolution bootstrapping scheme for training. While these are not huge innovations, they seem to lead to significantly better accuracy. However, more extensive evalutaion is necessary.",
            "summary_of_the_review": "The paper shows some very accurate results in limited evaluations, building on the work of Liechtenstein et al. However, it makes some very strong and unsubstantiated claims that would require more extensive empirical evaluation of generalization performance to justify.",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2454/Reviewer_UqX8"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2454/Reviewer_UqX8"
        ]
    }
]