[
    {
        "id": "JeewcUDIVy",
        "original": null,
        "number": 1,
        "cdate": 1666627463189,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666627463189,
        "tmdate": 1670170750189,
        "tddate": null,
        "forum": "xfqDe72zh41",
        "replyto": "xfqDe72zh41",
        "invitation": "ICLR.cc/2023/Conference/Paper6321/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This paper develops a theory to understand the grid cell responses by combining ingredients from existing studies. They articulate three properties that are needed for the grid responses to appear when representing space: actionable, functional, and biological.\nThis paper contains some quite interesting ideas. But at the same time,  it is also highly problematic in multiple ways.  These concerns greatly diminished my enthusiasm for this paper. ",
            "strength_and_weaknesses": "Strengths:\n\nThe attempt to unify a somewhat messy literature is ambitious and should be applauded.\nThe proposed three key requirements for the grid patterns, if true, would be a useful finding.\nThe argument in Section 3.1 seems to be quite insightful.\n\n\nWeaknesses:\n\n** The idea of “actionable representation” and the use of representation theory and group theory to study the grid cell system is not a new one (e.g., see a recent line of research in Gao et al, ICLR, 2019; Gao et al., NeurIPS, 2021). The current paper did refer to Gao et al 2021 in the Introduction and had a detailed comparison to that paper in the SI. But it did not acknowledge that using group theory to study the grid cell was a key idea in that line of work. \n\n** The math presented in the paper is not rigorous. Eq. (5) actually is a strong assumption. The paper seems to say that it is a necessary consequence of Eq. (3), thus misleading. Assuming matrix T consists of 1-by-1 and 2-by-2 blocks is a critical assumption that greatly simplified the problem.\n\n** The writing needs to be improved. Various statements need to be toned down. The math in the SI needs to be better organized. Phrases such as “big result” should probably be removed.\n\n** The comparison to the data is rather preliminary and unconvincing.\n\n** Eq. (1) needs to be better motivated. The second and third terms together lead to a band-pass filter— this seems to be rather post-hoc. Previously, it was known that band-pass filtering can lead to grid patterns (Sorscher, Mel, et al, NeurIPS 2019). Some previous studies used the different-of-Gaussian place fields as inputs to the grid cell network, leading to band-pass filtering. This connection needs to be explained.  How the present theory is different from Sorscher, Mel, et al, NeurIPS 2019 also needs to be better explained. \n\n** The study will benefit by treating neural noise more carefully.  It is unclear what assumption the model makes about the neural noise.\n\n** how are Eq (3) and the positivity constraint compatible theoretically? The author seems to impose positivity after using Eq (3). If that is the case, Eq. (3) is no longer satisfied. I’d appreciate further clarification on this point.\n\n\n---Other comments:\n**It is unclear what the next paragraph really means:\n “To motivate our current rabbit hole further, this is exactly the result we hinted towards in Section 2. We discussed T(∆θ), and, in 2-dimensions, argued it was, up to a linear transform, the 2-dimensional rotation matrix. Further, we discussed how every extra two neurons allowed you to add another frequency, i.e. another rotation matrix. These rotation matrices are the irreps of the rotation group, and adding two neurons allows you to create a larger T (∆θ) by stacking rotation matrices on top of one another. Now including the invertible linear transform, S, we can state the 4-dimensional version of equation 4.” \nI interpreted that the authors were making an important assumption here according to their math, but from the text,  it read like there is no assumption involved and everything just follows from the rule of deduction.\n\n**The following might be a useful paper to discuss. While the authors assume that the grid cells are representing one space, there is work suggesting that grid cells may represent multiple spaces.\nSpalla, Davide, et al. \"Can grid cell ensembles represent multiple spaces?.\" Neural Computation 31.12 (2019): 2324-2347.\n",
            "clarity,_quality,_novelty_and_reproducibility": "The clarity and quality would need some major improvement.  The novelty and significance were over-stated in the current version.\nOverall, it feels that the work is a bit incremental. ",
            "summary_of_the_review": "An ambitious attempt to unify grid coding theory with several major concerns. Various improvements could be made to strengthen the paper.\n\n==========\nThe revision addressed some of concerns and improved the paper, although some of my conerns remain. In my view, the revision has turned this into a borderline paper. I've increased my score from 3 to 5. ",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper6321/Reviewer_7jav"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper6321/Reviewer_7jav"
        ]
    },
    {
        "id": "gAxlEvtaJm",
        "original": null,
        "number": 2,
        "cdate": 1666692484728,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666692484728,
        "tmdate": 1670249774640,
        "tddate": null,
        "forum": "xfqDe72zh41",
        "replyto": "xfqDe72zh41",
        "invitation": "ICLR.cc/2023/Conference/Paper6321/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper seeks to explain the properties of grid cells. Linear group representation consideration leads to the superposition of sine and cosine plane waves. A specially designed loss function is proposed to explain the emergence of hexagon grid patterns under the constraints of non-negative and bounded firing rate. The paper makes several predictions based on the proposed theory. ",
            "strength_and_weaknesses": "Strengths: \n\n(1) The proposed loss function is new and reasonable. \n\n(2) The explanation of the emergence of hexagon grid patterns is sound. \n\n(3) The predictions seem to be supported by empirical evidence. \n\nWeaknesses: \n\n(1) The mathematical analysis in the main text is not very rigorous, although it is quite insightful and intuitive. \n\n(2) The superposition of sine and cosine waves seems too restrictive, and may not model biological neurons. \n\n(3) The proposed loss function, although reasonable, is not simple enough to serve as a first principle. \n\n(4) The linear transformation model does not cover the continuous attractor network. \n\n\n",
            "clarity,_quality,_novelty_and_reproducibility": "About novelty, the group representation perspective has been previously investigated by Gao et al. (2021) and earlier Gao et al. (Learning grid cells as vector representation of self-position coupled with matrix representation of self-motion. ICLR 2019). \n\nAbout actionable, any RNN that transforms the hidden vector based on the input action is an actionable representation, including the state space model in control, as well as latent space model-based RL, such as the dreamer model. The hidden vectors in most RNNs are actionable if you interpret the input as an action. As long as the transformation depends on the action, it does not need to be linear. In fact, the linear transformation or matrix group is not entirely biologically plausible because the recurrent connection weight matrix depends on the action. \n\nThe paper is clearly written, and the results and predictions are clearly explained. \n\nThe mathematical reasoning is good, but not very rigorous, at least in the main text. \n\nAssuming Fourier plane waves is too specific and restrictive, with little biological plausibility. The continuous attractor network seems more biologically plausible. \n\nAbout nonnegativity constraint, it is biologically true. But it is unclear if it is entirely necessary theoretically. Gao et al (2019, 2021) learned hexagon patterns without this constraint. ",
            "summary_of_the_review": "The paper provides an interesting explanation of the emergence of hexagon grid patterns of the grid cells. However, the loss function is not minimalistic and the superposition of Fourier plane waves is not generic enough. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper6321/Reviewer_XxrH"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper6321/Reviewer_XxrH"
        ]
    },
    {
        "id": "n0e4WxLHil",
        "original": null,
        "number": 3,
        "cdate": 1666716850898,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666716850898,
        "tmdate": 1666716850898,
        "tddate": null,
        "forum": "xfqDe72zh41",
        "replyto": "xfqDe72zh41",
        "invitation": "ICLR.cc/2023/Conference/Paper6321/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "In this paper, the authors provided a solution of how to parametrically hard code grid cells with learnable parameters in order to be functional, actionable, and biological by minimizing the objective function. Under these three constraints, they showed that hexagonal grid cells are the optimal representation of locations in 1D angular and 2D euclidean space.",
            "strength_and_weaknesses": "Strength:\n- To-date, most computational models on grid cell emergence have focused on training a neural network to solve path-integration tasks and selecting grid cells based on their known neuroscientific properties. This creates a possibility, which also applies to other EC-HPC representations, that the neural representations are simply due to correlation with different behavioral variables (i.e. “you see what you’re looking for”). In this paper, the authors only imposed normative constraints rather than assumptions about known properties of grid cells, and still observed grid cells, which fills the gap in the literature on why EC-HPC representations exist in the first place.\n\nMajor weaknesses:\n- Though it provides a good model for grid cell emergence, this framework is somewhat isolated in that it doesn’t consider the interactions between MEC (where grid cells are observed) and other regions in the EC-HPC circuit. For example, under this framework, do grid cells still help explain place cell remapping (Whittington et al., 2020)?\n- The metric described in this paper (i.e. functional, biological, actionable) still does not account for whether the grid cells representations are useful for behavior, which in my opinion is what “functional” should mean. I think it would make the paper even stronger if you could show the connection between your model and path integration behavior, or some other behavioral task, eg. train model on path integration task and do lesion study.\n- As raised in Schaeffer et al., 2022, grid cell emergence depends on hyperparameters and implementation choices. Is that also the case here? Eg. What happens when you increase the number of neurons? Or other hyperparameters listed in section B.3? It would be interesting to see whether the claim from Schaeffer et al. still holds when grid cells emerge from not path-integration but mathematical optimization.\n- One can also see grid cells in non-spatial settings (Whittington et al., 2020), where a different set of constraints may apply (eg. the resolution of representation does not necessarily follow a Goldilocks of frequency). And grid cells have been shown to represent other behaviourally relevant variables besides location, such as time and distance [(Kraus et al., 2015)](https://www.cell.com/neuron/fulltext/S0896-6273(15)00820-X?_returnURL=https%3A%2F%2Flinkinghub.elsevier.com%2Fretrieve%2Fpii%2FS089662731500820X%3Fshowall%3Dtrue) . How can your model account for this? Or is it only applicable to spatial location?\n\n\nMinor weaknesses:\n- Please remake all hand drawn figures, including the ones in appendix, with computer softwares\n- Page 5 first paragraph: “... and $\\theta$ dependent parts (equation 6; Figure 3A)”: 1) Adding a hyphen, i.e. $\\theta$-dependent, might be helpful for readers. 2) Do you mean equation 5?\n- Page 5 first paragraph: “...This effect is limited by the firing rate bound: $||a_0||^2 - 2 L_0 = N$...\"\nDo you mean $1/2 L_0$ ?\n\n",
            "clarity,_quality,_novelty_and_reproducibility": "Among the EC-HPC models, the paper is quite novel in terms of technicality. The ideas are clearly communicated, and as long as the simulation codes are released it should be reproducible.",
            "summary_of_the_review": "I’d recommend accepting this paper for ICLR, as it provides a normative explanation for why the multi-module representation of grid cells is the optimal representation of space. The paper is well-written and clearly communicated, but also please remake your hand-drawn figures.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper6321/Reviewer_i5nn"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper6321/Reviewer_i5nn"
        ]
    }
]