[
    {
        "id": "upeRb_jBQU",
        "original": null,
        "number": 1,
        "cdate": 1666660126933,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666660126933,
        "tmdate": 1666660126933,
        "tddate": null,
        "forum": "ZaQrYalGFIh",
        "replyto": "ZaQrYalGFIh",
        "invitation": "ICLR.cc/2023/Conference/Paper5499/-/Official_Review",
        "content": {
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper extends LINKX by considering the monophily with monophilous label propagation. A graph is monophilous if the label of a node is similar to that of its neighbors’ neighbors.  To this end, it proposes two stages label propagations to meet the monophily property. Experimental evaluations show the marginal performance improvement.\n",
            "strength_and_weaknesses": "Strength\n- It is interesting to make LINKX both inductive by using label propagation.\n\nWeaknesses \n- This is not the first to consider monophily in GNNs, such as H2GCN and EvenNet, although this may be the first to imcorporate it with label propagation.\n- The writing and organization are poor. Many components are redundant, such as the propagation formula in main body, algorithm and figure 1.\n- Some parts of the paper is not clear, such as the meaning of Figure 3.\n- The experimental evaluations are insufficient. The employed datasets are too little. Besides, the performance improvements is marginal compared with LINKX.",
            "clarity,_quality,_novelty_and_reproducibility": "- The novelty, clarity should be improved. \n- The reproducibility is acceptable.",
            "summary_of_the_review": "My main concerns are the weak novelty, poor writing and insufficient evaluations.\n",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper5499/Reviewer_E2RU"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper5499/Reviewer_E2RU"
        ]
    },
    {
        "id": "cS1BWfULl01",
        "original": null,
        "number": 2,
        "cdate": 1666660749898,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666660749898,
        "tmdate": 1666660749898,
        "tddate": null,
        "forum": "ZaQrYalGFIh",
        "replyto": "ZaQrYalGFIh",
        "invitation": "ICLR.cc/2023/Conference/Paper5499/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This paper studies the problem of GNNs under homophily and heterophily and the authors propose a scalable unified framework named GLINKX for this problem. The proposed GLINKX works in three separate stages:\n- Making use of KEG to learn positional embeddings.\n- Propagating information about labels from node's neighbors.\n- Propagating the predicted labels and making final predictions.\n\nGLINKX is also guaranteed with theories. Experimental studies on large-scale homophilous and heterophilous graphs demonstrate the effectiveness and efficiency of the proposed method.",
            "strength_and_weaknesses": "Strengths:\n- The paper is well-organized and easy to follow and the target problem of GNNs for homophilous and heterophilous graphs is very important.\n- The proposed method is effective and efficient in handling homophily and heterophily of large-scale graphs with some theoretical guarantee.\n- Extensive experiments have been conducted to demonstrate the superiority of the proposed method from different aspects.\n\nWeakness:\n- The novelty of this paper is limited: the proposed framework is the combination of KGEs and LP.\n- There are different ways to get positional embeddings, i.e., the embeddings that can preserve global/local structures of graphs. For example, traditional structural role discovery methods such as RolX [1] and network embedding methods such as node2vec [2]. So the questions are:\n1) what are the reasons to make use of KGEs as PEs?\n2) it is possible to compare different PEs?\n- If there are errors/noises from the 1st stage of PEs, is it possible to handle the noises in the following stages?\n\nThere are also some minor concerns:\n- Page 3: what is the meaning of \\epsilon?\n- Page 4: circumventing the to do\n- Page 5: Alg. 1 (??)\n\n[1] RolX: Structural Role Extraction & Mining in Large Graphs\n\n[2] node2vec: Scalable Feature Learning for Networks\n",
            "clarity,_quality,_novelty_and_reproducibility": "Clarity: This paper is well-organized and easy to follow.\n\nQuality: This paper is of good quality with detailed discussion and comprehensive experiments.\n\nNovelty: Technically, the novelty of this paper is limited because the proposed framework is a combination of existing methods, e.g., KEGs and LP.\n\nReproducibility: it should be possible to implement the method and reproduce the results from the description given in the paper.",
            "summary_of_the_review": "This paper studies an interesting and important problem. Overall this paper is well-organized and easy to read. Experiments from different aspects have been conducted. However, I have some concerns about the novelty and the selection of one component. Therefore, I will recommend a weak rejection of the paper, which I am willing to turn into an acceptance if all issues are addressed.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper5499/Reviewer_XQ6r"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper5499/Reviewer_XQ6r"
        ]
    },
    {
        "id": "VMpw5oQ9G-W",
        "original": null,
        "number": 3,
        "cdate": 1666699211010,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666699211010,
        "tmdate": 1666699211010,
        "tddate": null,
        "forum": "ZaQrYalGFIh",
        "replyto": "ZaQrYalGFIh",
        "invitation": "ICLR.cc/2023/Conference/Paper5499/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "The paper proposes an extension of LINKX to be robust on both heterophilic and homophilic graphs.",
            "strength_and_weaknesses": "# Strengths:\n1. Building scalable shallow method is a very important problem in the area of Graph Neural Networks.\n# Weaknesses:\n1. The paper and the algorithm are both difficult to follow and understand.\n2. Since scalability is the primary goal, some information on training time, memory usage etc. would have been useful.\n3. Albeit, the related work cites several papers, but comparison seems to drop them due to the fact that these methods are not scalable. However, there are a few datasets of fairly small size in the experiment, so at least for those, the numbers for these other methods can still be reported, if only to understand whether there is a trade-off involved between accuracy and scalability, and how much is it?",
            "clarity,_quality,_novelty_and_reproducibility": "The paper writing can be improved significantly. \n1. How is a graph treated as a Knowledge Graph? Simply saying that one learns Pytorch Biggraph embedding seems to be pointless. Why does it make sense to treat a general graph as a Knowledge Graph? How does it encode positional information? \n2. Many odd typos. For example, Algorithm 1 says Loss is maximized. I am assuming it should be minimized. Also, the notations can be improved to understand what they are. For example, Algorithm 1 says \"learn distribution of a node's neighbors\", but the y's are still running over the training data. So, it is extremely confusing, where is the neighbor information? What is backward label propagation in stage 3? the expression seems identical to the stage 2.\n3. Why does this method capture long range information which is required for heterophily? There seems to some justification in Theorem 2, but the Theorem 2 statement is hard to follow and understand. However, it still seems that the model is utilizing 2 hop information. However, does that mean that the paper is claiming that 2-hop information is sufficient for heterophily? How does one prove this?\n4. Comparisons with non-scalable models can still be done for smaller datasets, if only to understand the trade-off between scalability and accuracy.\n5. Include training time, memory usage etc. information to show the scalability aspect of the model.\n\nThe novelty aspects are difficult to determine and lack of clarity makes the work hard to reproduce.",
            "summary_of_the_review": "The paper proposes an extension of LINKX model to address both heterophily and homophily. However, the paper requires significant rewrite to clearly highlight how the algorithm works and why should we expect it to work for heterophilic scenario. The experiment should still compare with non-scalable methods on datasets which are small enough. Also, the paper should report training time, memory usage etc. to understand the scalability aspect of the model.\n\nAs it stands, I am inclined to reject the paper.",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "empirical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper5499/Reviewer_gBBT"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper5499/Reviewer_gBBT"
        ]
    },
    {
        "id": "sjeYPqhtmZ0",
        "original": null,
        "number": 4,
        "cdate": 1667373814866,
        "mdate": null,
        "ddate": null,
        "tcdate": 1667373814866,
        "tmdate": 1667373814866,
        "tddate": null,
        "forum": "ZaQrYalGFIh",
        "replyto": "ZaQrYalGFIh",
        "invitation": "ICLR.cc/2023/Conference/Paper5499/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "The paper proposes a method GLINKX that combines knowledge graph embedding, ego embeddings, and label propagation to tackle node classification on both homophily and heterophily graphs. Experiments are conducted on several OGB benchmarks and show some effectiveness.",
            "strength_and_weaknesses": "Strength:\n- The proposed method is light-weight and thus can be used for large graphs.\n\nWeaknesses:\n- The proposed method is not applicable to many graphs as it requires knowledge graph embeddings to provide node positional encodings. \n- The novelty of the paper is quite limited. It's a incremental combination of the existing methods.\n- Experimental results do not show better performance on homophily graphs.\n- On heterophily graphs, there are lots of many other approaches that need to be compared with.",
            "clarity,_quality,_novelty_and_reproducibility": "Novelty is quite limited. The proposed method is a direct combination of several existing works, e.g., GCN, LINKX, Label propagation.\n\nClarity needs improvements. The motivations of the paper are not quite clear. Some existing works can already automatically balance the homophily and heterophily while learning for the downstream tasks. Authors need to justify what's new against these existing works.\n\nWritings of this work needs to be polished a lot, addressing the typos, grammar issues, and better presentations.\n",
            "summary_of_the_review": "Regarding the details of some weaknesses above:\n- Using knowledge graph embeddings as the pre-trained position encodings does not make sense, especially on the datasets where no knowledge can be used for pre-training, e.g., Cora, Citeseer, etc. There's no relation semantic at all.\n- On homophily graphs, the proposed method actually does not perform better even than a two-layer GCN. On heterophily graphs, the proposed method performs better than the baseline methods used in the paper, but there are many other more powerful GNN models in the literature and the authors are suggested to compare with those methods.\n\n",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper5499/Reviewer_shiF"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper5499/Reviewer_shiF"
        ]
    }
]