[
    {
        "title": "Sample-Efficient Learning of POMDPs with Multiple Observations In Hindsight"
    },
    {
        "review": {
            "id": "9wXtZYQqYc",
            "forum": "1hsVvgW0rU",
            "replyto": "1hsVvgW0rU",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission1153/Reviewer_jqb5"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission1153/Reviewer_jqb5"
            ],
            "content": {
                "summary": {
                    "value": "This work studies the problem of sample-efficient learning in POMDP. Especially, a new feedback model is discussed, i.e., multiple observations in hindsight, where instead of one observation in canonical POMDP setting, after one trajectory, multiple extra observations can be obtained. This feedback model extends the canonical single-observation feedback model in POMDP and is suitable to capture applications such as game-playing where replaying or loading is enabled.\n\nBased on this new feedback model, one new revealing condition is presented, i.e., multi-observation revealing, which is extended from canonical revealing conditions in POMDP. Based on this condition, the k-OMLE design is first proposed, which is demonstrated to be sample efficient. Then, a second class of POMDP, defined as distinguishable POMDP, is also introduced, which relies on the intuition that different states should have distinct observation generation. The relationship between multi-observation revealing POMDP and distinguishable POMDP is established. Furthermore, leveraging the techniques from closeness testing and POMDP with hindsight observation, a new design, OST, is proposed, which is also demonstrated to be sample efficient."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "- The POMDP problem has received growing interest in recent years and this work is a valuable investigation following the line of identifying learnable subclass of POMDP, which makes reasonable contribution.\n\n- The overall motivation is also clear, i.e., having a class of POMDP with stronger feedback than single observation while still weaker than directly revealing the true state. Having multiple observations is also a valid and practical consideration in my view as indeed replaying or loading is often allowed in settings such as game-playing.\n\n- The paper is organized well and the overall flow is quite clear. Although being technically heavy, the key points and main intuitions are explained well."
                },
                "weaknesses": {
                    "value": "- The major concern that I have is that this work mainly rely on techniques from previous works. Especially, k-OMLE, as the authors stated, is a different instantiation of the OMLE algorithm, and the proof is also extended rather straightforwardly. While I do believe using closeness testing and the notion of distinguishable POMDP are interesting, the OST design is then about returning to the POMDP design with exact hindsight observability."
                },
                "questions": {
                    "value": "- First, it would be really helpful if the authors can illustrate more on the technical innovation of this work. Especially, I would love to know whether the authors believe the main contribution of this work is to identify new subclasses of POMDP while the leveraged techniques are mostly same as previous works.\n\n- Also, in the design of OST, as stated in Theorem 11, the value of \\alpha is required to determine the value of k, which seems to be a rather stringent condition. I would love to hear about the authors' opinion on this."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission1153/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698401258817,
            "cdate": 1698401258817,
            "tmdate": 1699636041572,
            "mdate": 1699636041572,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "IQdoDRNMp6",
                "forum": "1hsVvgW0rU",
                "replyto": "9wXtZYQqYc",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1153/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1153/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer jqb5"
                    },
                    "comment": {
                        "value": "We thank the reviewer for the valuable feedback on our paper. We respond to the specific questions as follows.\n\n>... the technical innovation of this work. Especially, I would love to know whether the authors believe the main contribution of this work is to identify new subclasses of POMDP while the leveraged techniques are mostly same as previous works.\n\nAt a high level, we agree with the reviewer that identifying the two new subclasses (k-MO-revealing POMDPs, distinguishable POMDPs) is a main contribution, and constructing the algorithms build on existing works once they are identified. \n\nHowever, besides just identifying the two classes, we also studied their relationship in Proposition 8 and Theorem 9. In particular, Theorem 9 which shows that any $\\alpha$-distinguishable POMDP is $k$-MO-revealing for a certain $k$, is shown by “embedding” distribution tests to construct left inverses of the $k$-fold emission matrix. Such an argument is new to the RL literature and we believe is technically interesting as well. \n\n> In the design of OST, as stated in Theorem 11, the value of \\alpha is required to determine the value of k, which seems to be a rather stringent condition. I would love to hear about the authors' opinions on this. \n\nWe agree that, algorithmically, if all we know for the POMDP is it’s $\\alpha$ distinguishable, then we need to choose $k$ based on $\\alpha$. In practice, if $\\alpha$ is known to have a lower bound $\\alpha_0$, then we can choose $k$ based on $\\alpha_0$. \n\nOn the other hand, if we do not have knowledge about $\\alpha$, then we can always choose any fixed $k$ to learn, and we can still achieve good sample complexity if the POMDP is $k$-MO revealing."
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1153/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700267248167,
                "cdate": 1700267248167,
                "tmdate": 1700267248167,
                "mdate": 1700267248167,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "UEhTDwjcup",
            "forum": "1hsVvgW0rU",
            "replyto": "1hsVvgW0rU",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission1153/Reviewer_q33U"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission1153/Reviewer_q33U"
            ],
            "content": {
                "summary": {
                    "value": "The paper introduces two new subclasses of POMDP, multi-observation revealing POMDPs and distinguishable POMDPs. The paper shows a connection between the two classes of POMDPs and shows that sample-efficient learning in both classes is possible."
                },
                "soundness": {
                    "value": "4 excellent"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "The work builds on the ongoing effort to establish classes of POMDPs for which sample efficient learning is possible. The new classes of POMDPs are formally and rigorously defined, and their introduction is backed by practical motivation. Bounds on sample efficiency are established and proved, with some proofs using less common techniques of distribution testing embedded in the algorithm. I have read and I believe I understood the proofs, although I cannot swear that the proofs are correct."
                },
                "weaknesses": {
                    "value": "It is not clear to me whether MO revealing POMDPs are novel --- see my question below. \n\nIt is not clear to me from the paper how hindsight observations are related/required. It seems that MO revealing POMDPs are defined independently of hindsight observability. Definition 2 does not require or that the observations are obtained in the hindsight.\n\nThe significant results of the work seems to be only applicable to tabular POMDPs, which only becomes clear deep into the paper. I believe that should be stated early.\n\nMinor: the bibliography is not properly capitalized. Abbreviations (POMDP, PAC etc.) and names should be capitalized."
                },
                "questions": {
                    "value": "1. What is the difference between k-MO revealing POMDPs in this work and MO revealing POMDPs in https://proceedings.mlr.press/v202/chen23ae.html, Definition 1?\n\n2. How does obtaining multiple observations in **hindsight** affect the learnability/sample efficiency? Why the same sample efficiency cannot be achieved with the observations obtained online?\n\n3. Shouldn't learnability for alpha-distinguishable POMPDs be established in a PAC setting rather than absolutely?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission1153/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698815462512,
            "cdate": 1698815462512,
            "tmdate": 1699636041480,
            "mdate": 1699636041480,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "TohO9Bmfog",
                "forum": "1hsVvgW0rU",
                "replyto": "UEhTDwjcup",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1153/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1153/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer q33U"
                    },
                    "comment": {
                        "value": "We thank the reviewer for the valuable feedback on our paper. We respond to the specific questions as follows.\n\n> It is not clear to me from the paper how hindsight observations are related/required. It seems that MO revealing POMDPs are defined independently of hindsight observability. Definition 2 does not require or that the observations are obtained in the hindsight.\n\nIndeed, Definition 2 is merely a property of the POMDP itself (revealing from $k$ observations), and does not require specification of when these $k$ observations are received by the learner. However, this setting is still related to hindsight observability, as they are both feedback models that enhance the standard POMDP feedback (observations and rewards only), and our later algorithm OST builds on techniques from the hindsight observability setting.\n\n> The significant results of the work seems to be only applicable to tabular POMDPs, which only becomes clear deep into the paper. I believe that should be stated early.\n\nThank you for the suggestion, the results for distinguishable POMDPs and the OST algorithm are indeed only for tabular POMDPs. We have highlighted that in the abstract and contribution list in our revision.\n\n> What is the difference between k-MO revealing POMDPs in this work and MO revealing POMDPs in https://proceedings.mlr.press/v202/chen23ae.html, Definition 1?\n\nThe difference between k-MO revealing POMDPs and the $m$-step revealing POMDPs e.g. in Chen et al. (2023) is **multi-observation** revealing vs. **multi-step** revealing:\n*  $k$-MO revealing require $k$ repeated observations at each time step to reveal some information about the current latent state,\n* $m$-step revealing requires observations and actions at $m$ consecutive steps (i.e $(o_h, a_h, \\dots, o_{h+m-1})$) to reveal some information about the current latent state $s_h$.\n\n> How does obtaining multiple observations in **hindsight** affect the learnability/sample efficiency? Why the same sample efficiency cannot be achieved with the observations obtained online?\n\nWe chose this setting merely to avoid a potential confusion about *policies*---Restricting the main trajectory to still have 1 observation restricts the policy itself to still be a standard POMDP policy, and prevents it from utilizing more observations to do better. We’d like to keep the policy class to be still the standard POMDP policy class, and only use the $k-1$ observations to help the learning within this class, hence we chose this setting. \n\n> Shouldn't learnability for alpha-distinguishable POMPDs be established in a PAC setting rather than absolutely?\n\nWe’d like to clarify what the reviewer meant by \"absolutely\"? Our Theorem 11 is indeed a PAC result, where the algorithm returns a policy that is an $\\epsilon$ near-optimal policy with probability at least $1-\\delta$.\n\n> The bibliography is not properly capitalized. Abbreviations (POMDP, PAC etc.) and names should be capitalized.\n\nThanks for the suggestion. We have updated the bibliography accordingly in our revision."
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1153/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700267204012,
                "cdate": 1700267204012,
                "tmdate": 1700267204012,
                "mdate": 1700267204012,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "XXGd7OuEau",
                "forum": "1hsVvgW0rU",
                "replyto": "IQdoDRNMp6",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1153/Reviewer_q33U"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1153/Reviewer_q33U"
                ],
                "content": {
                    "comment": {
                        "value": "I acknowledge that I have read the authors' response and other reviews."
                    }
                },
                "number": 10,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1153/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700651694009,
                "cdate": 1700651694009,
                "tmdate": 1700651694009,
                "mdate": 1700651694009,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "akdJN3cY8m",
            "forum": "1hsVvgW0rU",
            "replyto": "1hsVvgW0rU",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission1153/Reviewer_se9m"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission1153/Reviewer_se9m"
            ],
            "content": {
                "summary": {
                    "value": "This paper studied how to achieve sample-efficient learning in POMDPs, which have been known to be exponentially hard in the worst case. How to identify efficient feedback model and provide efficient learning algorithms for the challenging POMDP problem has been an important problem in the community. This paper studied the settings with additional observations generated by the latent unknown states at the end of the episode. With these additional observations and the additional assumptions, i.e., definition 2 and definition 7, this paper proposed efficient learning algorithms with performance guarantees."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "1. This paper studied the important and challenging POMDP problem, and showed two new subclasses where efficient learning is possible.\n\n2. This paper provided efficient learning algorithms for the new subclasses with performance guarantees."
                },
                "weaknesses": {
                    "value": "1. The model and assumptions are not well-justified.\n\n2. The solution seems to be a simple extension of the existing results for weakly-revealing settings."
                },
                "questions": {
                    "value": "1. Could you provide one or more practical examples for the model with multiple observations?\n\n2. Could you explain the practical meaning of the assumptions, e.g., definition 2 and definition 7?\n\n3. Could you give a clearer explanation for the differences between your results and those for weakly-revealing settings, since it seems the algorithm developments and performance analyses are quite similar?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission1153/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission1153/Reviewer_se9m",
                        "ICLR.cc/2024/Conference/Submission1153/Senior_Area_Chairs"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission1153/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698843245747,
            "cdate": 1698843245747,
            "tmdate": 1700668040489,
            "mdate": 1700668040489,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "3qQNk5zgSx",
                "forum": "1hsVvgW0rU",
                "replyto": "akdJN3cY8m",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1153/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1153/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer se9m"
                    },
                    "comment": {
                        "value": "We thank the reviewer for the valuable feedback on our paper. We respond to the specific questions as follows.\n\n> Could you provide one or more practical examples for the model with multiple observations?\n\nOne example is in gaming problems (cf. the bottom paragraph on Page 1), where a player can load (reset to) a previously saved game state, and re-play from there. By doing that the player can make additional observations (such as results of a battle), but not observe the latent states (such as the true status/properties of the characters).\n\nAnother example is a medical imaging problem, where we usually take multiple images per time step to measure the latent state (true status of the patient) that cannot be directly observed, and the problem is sequential (need to repeat this along the treatment process).\n\n> Could you explain the practical meaning of the assumptions, e.g., definition 2 and definition 7?\n\nIn a more practical sense, Definition 2 ($k$-MO revealing) means that the collection of $k$ iid observations can reveal some information about the latent state, whereas Definition 7 (distinguishable) means that different latent states have different emission distributions. \n\nIn the above game example, Definition 2 means that by playing the same battle $K$ times we can gain information about the true game state, whereas Definition 7 means that different game states must yield different (distributions of) battle results. We remark that Definition 2 implies Definition 7 (Proposition 8) and we show the converse is also true in a certain sense (Theorem 9).\n\n\n> Could you give a clearer explanation for the differences between your results and those for weakly-revealing settings, since it seems the algorithm developments and performance analyses are quite similar?\n\nOur results consist of two settings, k-MO-revealing POMDPs, and distinguishable POMDPs. \n* For k-MO-revealing POMDPs, our algorithm indeed builds on existing work on weakly-revealing POMDPs such as the OMLE algorithm. \n* For distinguishable POMDPs, our algorithm is quite different from weakly-revealing settings, as it builds on techniques from distribution testing and hindsight observability, and the algorithm is very different from OMLE. Further, for distinguishable POMDPs, OST gives a sharper result than a direct reduction to k-MO-revealing POMDPs (cf. the paragraph after Theorem 11)."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1153/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700267067461,
                "cdate": 1700267067461,
                "tmdate": 1700267067461,
                "mdate": 1700267067461,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "eqVYiIk8qX",
                "forum": "1hsVvgW0rU",
                "replyto": "3qQNk5zgSx",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1153/Reviewer_se9m"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1153/Reviewer_se9m"
                ],
                "content": {
                    "comment": {
                        "value": "I acknowledge that I have read the authors' response and other reviews. I am not very convinced by the medical image example, e.g., what would the episode and initial state distribution $d_0$ mean in such an example? However, I agree with the strengths pointed out by other reviewers. I have increased my rate to a 6."
                    }
                },
                "number": 11,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1153/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700668012449,
                "cdate": 1700668012449,
                "tmdate": 1700668012449,
                "mdate": 1700668012449,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "DajkIhyZFK",
            "forum": "1hsVvgW0rU",
            "replyto": "1hsVvgW0rU",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission1153/Reviewer_FWjL"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission1153/Reviewer_FWjL"
            ],
            "content": {
                "summary": {
                    "value": "Summary: \n\nThe papers consider learning in POMDPs, where in addition to receiving a single observation along the trajectory as is the case for standard POMDP setting, the learner can also get K additional observations from the corresponding latent states at every timestep (but at the end of the trajectory). The authors consider structural assumptions under which learning with K-observations is statistically tractable and provide algorithms to tackle them. The main results are as follows: \n1. First, the authors show via a lower bound that even under the K observation model, we need additional assumptions to make learning tractable. \n2. Then they consider additional structural called multi-observation revealing POMDPs and distinguishable POMDPs under which statistically efficient learning is possible. The former considers a rank-type assumption on the observation matrix whereas the latter considers a separability assumption on the columns. The two assumptions are equivalent to each other up to polynomial factor blow-up in k. \n3. They provide algorithms for efficient learning under the above assumptions."
                },
                "soundness": {
                    "value": "4 excellent"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "1. A new framework to consider POMDPs, and get statistically efficient algorithms. \n2. Easy-to-understand analysis. The paper is only 20 pages long which is rare in the modern RL theory literature. This is primarily because the approach heavily builds on the OMLE algorithm from Liu et. al. 2022a. \n3. A complete set of results."
                },
                "weaknesses": {
                    "value": "1. The considered approaches are only statistically efficient. Can the authors provide a discussion on the possibility of getting computationally efficient or oracle-efficient algorithms? \n2. I am not yet convinced by the motivation for considering k-observation settings, or natural problem settings where one can get k-observations in hindsight at the end of the trajectory. Can the authors provide examples of settings where (a) one can get k-observations, but (b) we do not have the ability to reset to the latent state (or generative model)? My worry is that the ability to reset to the latent state needs knowledge of the latent state which is practically equivalent to hindsight observability (in the game playing example provided in the paper one seems to need knowledge of the latent state to reset).  \n\n\nAnother related work to compare to: \"Agnostic Reinforcement Learning with Low-Rank MDPs and Rich Observations\", Dann et. al. 2021. Their algorithm seems to work for POMDP settings with low-rank dynamics - while the dependence on d is exponential, their work does not seem to require any lower bound on \\alpha and thus could be applicable when d is small/constant but \\alpha could be arbitrarily small. I am pointing this out because the authors seem to portray \\alpha-distinguishable POMDPs as the largest class of POMDPs that could be solvable statistically efficiently, however,  Dann et. al. 2021 gives another example which is solvable under orthogonal assumptions."
                },
                "questions": {
                    "value": "Apart from the ones listed in the weaknesses above. I have a few more questions: \n\n1. Can the authors provide examples / settings where there is a computational or statistical separation between K = 1 and K > 1. I am guessing that proposition 3 already captures this, but can you please provide more intuition on why we can expect such separation. \n2. Are there settings where one can get k-observations but only at the end of the episode? In particular, one needs to wait to terminate to get more observations. \n3.  From what I understand, it is a feature of the algorithm that only needs full trajectory information to construct MLEs. Hence, there is no separation between getting k-observations in real-time or at the end of the episode. Is there a fundamental separation between the two settings? \n4. What is the dependence on H in the sample complexity bound?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission1153/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699061321579,
            "cdate": 1699061321579,
            "tmdate": 1699636041338,
            "mdate": 1699636041338,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "cY28PxV8A6",
                "forum": "1hsVvgW0rU",
                "replyto": "DajkIhyZFK",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1153/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1153/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer FWjL"
                    },
                    "comment": {
                        "value": "We thank the reviewer for the valuable feedback on our paper. We respond to the specific questions as follows.\n\n> The considered approaches are only statistically efficient. Can the authors provide a discussion on the possibility of getting computationally efficient or oracle-efficient algorithms?\n\nOur algorithm OST is actually oracle-efficient given the POMDP planning oracle POP. It only makes $T$ calls to POP, and the rest of the algorithm runs in ${\\rm poly}(H, S, A, O, T, k)$ time, as all the main operations (computing bonus, closeness testing) runs in polynomial time. We have added a remark about this (in the paragraph before Theorem 11) in our revision. Further, if POP has an efficient approximate implementation (such as the quasi-polynomial approximate planning algorithm of Golowich et al. (2022) for observable POMDPs), then the whole algorithm can be made (quasi-)efficient.\n\nGolowich, N., Moitra, A., & Rohatgi, D. (2022). Planning in observable pomdps in quasipolynomial time. arXiv preprint arXiv:2201.04735.\n\nOur other algorithm $k$-OMLE is indeed only statistically efficient. How to make these OMLE type algorithms computationally more efficient is an important open problem, which we would like to leave as future work.\n\n> I am not yet convinced by the motivation for considering k-observation settings… Can the authors provide examples of settings where (a) one can get k-observations, but (b) we do not have the ability to reset to the latent state (or generative model)?\n\nTo give an example, consider a medical imaging problem, where we usually take multiple images per time step to measure the latent state (true status of the patient) that cannot be directly observed, and the problem is sequential (need to repeat this along the treatment process). In this problem, we have multiple observations at each state, but we don’t have the ability to reset. \n\n> … My worry is that the ability to reset to the latent state needs knowledge of the latent state which is practically equivalent to hindsight observability (in the game playing example provided in the paper one seems to need knowledge of the latent state to reset).\n\nWe agree that in the game playing example, the ability to reset is similar to having access to the latent state. However, a key difference here is that only the *environment* has access to the latent state, and the *learner* can still only learn about it from the (multiple) observations. In game playing, multiple observations could still be qualitatively different from the latent state — For example, the latent state could be the true status/properties of the characters, whereas the observations could be like results of a battle that could be played multiple times by saving/loading. \n\nWe also remark that, in our setting, the value of $k$ matters and encodes a cost of making observations, which also makes it perhaps more realistic than hindsight observability. Even though by taking large $k$ one gets very close to hindsight observable, we do count it as $k$ samples when counting the sample complexity (e.g. in the previous medical imaging example, taking more measurements at each time step costs more time and resource). \n\n> Another related work to compare to: \"Agnostic Reinforcement Learning with Low-Rank MDPs and Rich Observations\", Dann et. al. 2021. Their algorithm seems to work for POMDP settings with low-rank dynamics - while the dependence on d is exponential, their work does not seem to require any lower bound on \\alpha and thus could be applicable when d is small/constant but \\alpha could be arbitrarily small. I am pointing this out because the authors seem to portray \\alpha-distinguishable POMDPs as the largest class of POMDPs that could be solvable statistically efficiently, however, Dann et. al. 2021 gives another example which is solvable under orthogonal assumptions.\n\nWe thank the reviewer for pointing out this related work. Using the reduction in that paper, they give an $\\exp(d)$-samples algorithm for learning the best *reactive* policy in any tabular POMDP without further structural assumptions. However, we feel reactiveness makes the problem very different from—and arguably easier than—the standard problem of learning the (overall) best policy (which is in-general history dependent) considered in this work. \n\nAs another minor remark, we did not mean to portray \\alpha-distinguishable POMDPs as the largest class of statistically efficiently solvable in the standard setting; it is rather under our enhanced feedback model ($k$-observation feedback). But if any of our statements sound like portraying such a claim, we would be happy to revise."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1153/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700266913703,
                "cdate": 1700266913703,
                "tmdate": 1700266913703,
                "mdate": 1700266913703,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "tFW2q6KrTS",
                "forum": "1hsVvgW0rU",
                "replyto": "DajkIhyZFK",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1153/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1153/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer FWjL (cont'd)"
                    },
                    "comment": {
                        "value": "> Can the authors provide examples / settings where there is a computational or statistical separation between K = 1 and K > 1. I am guessing that proposition 3 already captures this, but can you please provide more intuition on why we can expect such separation.\n\nThanks for the insightful question. As mentioned, (taking $K=2$ as an example), Proposition 3 is already a result along this line, where it gives examples of POMDPs that are revealing with 2 observations but not 1 observation. \n\nBuilding on that example, we may be able to further obtain a formal statistical separation, i.e. construct a family of POMDPs that can be solved in polynomial samples with 2 observations, but not so with 1 observation. As an initial idea, we can consider a combination lock with three latent states '+', '-', and '0', where the emission of '0' is a linear combination of those of '+' and '-', so that the problem is not revealing at $K=1$ but revealing at $K=2$, similar as the example in Proposition 3. Further designing the transitions and rewards may yield a statistical separation where with $K=1$ observations it requires $\\exp(H)$ samples to solve, but with $K=2$ we can do with polynomially many samples since it is a revealing POMDP. We will think about this further.\n\n> Are there settings where one can get k-observations but only at the end of the episode? In particular, one needs to wait to terminate to get more observations.\n\nIf we understood correctly, the reviewer means to ask why *we* reveal k-observations at the end of episodes rather than at each step? We chose this merely to avoid a potential confusion about *policies*---Restricting the trajectory to still have 1 observation restricts the policy itself to still be a standard POMDP policy, and prevents it from utilizing more observations to do better. We’d like to keep the policy class to be still the standard POMDP policy class, and only use the $k-1$ observations to help the learning within this class, hence we chose this setting. Of course, learning a policy to make use of all $k$ observations is also a sensible problem (e.g. in the medical imaging example mentioned earlier), which we did not pursue in this paper.\n\n> From what I understand, it is a feature of the algorithm that only needs full trajectory information to construct MLEs. Hence, there is no separation between getting k-observations in real-time or at the end of the episode. Is there a fundamental separation between the two settings?\n\nRight, once the policy class is fixed (to be the standard POMDP policy class), for the algorithms it does not make a difference when these observations are received.\n\n> What is the dependence on H in the sample complexity bound?\n\nThe ${\\rm poly}(H)$ is $H^5$ in Theorem 5, $H^6$ in Theorem 6, and $H^6$ in Theorem 11. We have updated the proofs correspondingly in our revision to show these."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1153/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700267001253,
                "cdate": 1700267001253,
                "tmdate": 1700267023241,
                "mdate": 1700267023241,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]