[
    {
        "title": "Mastering Memory Tasks with World Models"
    },
    {
        "review": {
            "id": "ajND9EiCWR",
            "forum": "1vDArHJ68h",
            "replyto": "1vDArHJ68h",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission2796/Reviewer_fFhp"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission2796/Reviewer_fFhp"
            ],
            "content": {
                "summary": {
                    "value": "This paper introduces state space models (SSM), in particular S4, into world models in the framework of model-based RL to improve its long-term memory and long-horizon credit assignment, as well as computational efficiency. Specifically, RSSM in Dreamer is replaced with SSM (S4), resulting in the proposed R2I agents. Design decisions to do so are carefully chosen, and empirical studies demonstrate improved performance in memory-demanding domains, including POPGym, bsuite, and Memory Maze."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. Improved MBRL performance with S4-based world models has been validated in memory-demanding domains.\n2. Careful designs of S4-based world models, including non-recurrent representation model and SSM computational modeling.\n3. Extensive experiments in a number of domains.\n4. Well written with sufficient experimental details."
                },
                "weaknesses": {
                    "value": "1. Limited contribution. It is notable that there already exists a S4-based world model, namely S4WM [1]. Despite minor design choices, the major difference of this paper is that it conducts MBRL experiments while S4WM only conducts world model learning (e.g. imagination and reward prediction). However, in my humble opinion, it is not surprising that improvements in long-term memory can lead to improved MBRL performance in memory-demanding domains.\n2. Three kinds of actor and critic inputs are introduced, namely, output state, hidden state and full state, which results in a critical design choice to be tuned for each domain. Although the authors provide some takeaways to select between them, it is not always true. For instance, output state policy is utilized in memory-demanding environments, Bsuite, while hidden state policy is used in non-memory environments, DMC.\n3. The authors claim that R2I does not sacrifice generality for improved memory capabilities. However, there is a clear trend in Figure 6, that R2I performs worse than Dreamer in standard RL tasks. \n4. Some inaccurate statements. For example, the authors say R2I's 'objective differs from ELBO in three ways', but to my knowledge, these three points are all borrowed from DreamerV3 but without explicitly being mentioned in the text.\n\n[1] Deng et al. Facing off world model backbones: Rnns, transformers, and s4."
                },
                "questions": {
                    "value": "The authors should properly resolve my concerns mentioned in the weakness part.\n\nThere are also some minor questions:\n\n1. Dreamer is compared in Memory Maze tasks. Does this Dreamer baseline include the TBTT technique proposed by Pasukonis et al., which improves the memory of RSSM?\n2. Why not include Transformer-based world models as baselines? Transformers are also widely believed to well model long-horizon dependencies."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission2796/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission2796/Reviewer_fFhp",
                        "ICLR.cc/2024/Conference/Submission2796/Senior_Area_Chairs"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission2796/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1697785758376,
            "cdate": 1697785758376,
            "tmdate": 1700204873935,
            "mdate": 1700204873935,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "pMyWevWkOu",
                "forum": "1vDArHJ68h",
                "replyto": "ajND9EiCWR",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2796/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2796/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Author Response"
                    },
                    "comment": {
                        "value": "Thank you for your insightful feedback on our paper. We are encouraged by your recognition of the strengths in our work, including the improved performance of model-based RL with SSMs world models in memory-intensive settings, the careful design for non-recurrent representation and computational modeling, the breadth of our experimental validation across various domains, and the clarity and detail provided in our writing. We appreciate your comments and are eager to address your concerns and questions that you indicated.\n\n---\n\n> Limited contribution. It is notable that there already exists a S4-based world model, namely S4WM.\n\nIndeed, another recent work that constructs an SSM-based world model, namely S4WM, appeared on Arxiv on **July 5th, 2023**, which is **2.5 months** before the ICLR paper deadline. However, we would like to highlight the fact that according to the ICLR public review guidelines, **all papers made available online within 4 months of the paper deadline are considered contemporaneous** (and authors are not required to compare with those papers). Despite this, we wish to provide an analytical comparison between R2I and S4WM, demonstrating that these are significantly different algorithms. We believe S4WM makes a valuable contribution to world modeling, which is a subtask of MBRL. **Improved world modeling quality is neither necessarily nor sufficiently linked to an improved expected reward in MBRL**. To support this claim, we have added a new section (please refer to the newly added **Section Q of the Appendix**) to the Appendix, with the following discussion: First, we present both theoretical and experimental evidence from existing literature that suggests the likelihood of the world model does not directly translate to reward [1, 2, 3], and sometimes a negative correlation is observed. Second, we conduct an experiment in Memory Maze environments, which is a task of primary interest in both S4WM and R2I, where we demonstrate cases of negative correlation between the return and image MSE (i.e., the expected return improves while image MSE worsens). We also interpret how this result relates to S4WM's experimental outcomes. Third, we provide a detailed table comparing all architectural choices made by R2I and S4WM, noting there are 9 non-trivial architectural differences, excluding network sizes and depths (although these also vary). For each difference, we interpret our understanding of its impact on policy learning. Please note that our comparison is with the S4WM version that was publicly available on Arxiv on July 5th, 2023, not the Arxiv version from November 9, 2023, and not the camera-ready version from NeurIPS 2023 (whose deadline was October 27, 2023)—one month after the ICLR paper deadline. Finally, S4WM reports metrics on offline RL datasets collected by agents assumed to be nearly optimal. However, in MBRL, the world model and policy commence training with data produced by a random agent. In summary, we believe R2I and S4WM are distinct models designed to solve different (but related) tasks, released concurrently online, with no evidence that S4WM will function out-of-the-box for reinforcement learning problems—on the contrary, there is evidence suggesting that significant modifications are necessary for S4WM to operate as an MBRL algorithm.\n\n---\n\n> The authors claim that R2I does not sacrifice generality for improved memory capabilities. However, there is a clear trend in Figure 6, that R2I performs worse than Dreamer in standard RL tasks.\n\nWe appreciate your attention to the details presented in the paper. We understand your concerns with the phrase “not sacrificing generality” and agree that our claim may benefit from moderation to more accurately reflect the experimental results. In the revision, we have adjusted our language to better communicate the nuanced performance outcomes (please refer to **Section 4.3**). Please also refer to the newly added **Appendix R** where we provide a more deep statistical analysis of the results on Standard RL tasks.\n\nWhile it's true that there are some tasks where DreamerV3 shows slightly better performance, our aggregated metrics suggest that the performance of DreamerV3 is preserved in the majority of environments. We employed the RLiable [4] package in the revision to show that the difference between them is negligible. It is worth noting that there are 64 such environments with diverse properties such as the type of control, reward sparsity, dynamics stochasticity, and more which is why preserving them all is extremely non-trivial.\n\n**References**\n\n[1] Joseph et al. Reinforcement learning with misspecified model classes. ICRA, 2013.\n\n[2] Lambert et al. Objective Mismatch in Model-based Reinforcement Learning. L4DC, 2020.\n\n[3] Nikishin et al. Control-oriented model-based reinforcement learning with implicit differentiation. AAAI, 2022.\n\n[4] Agarwal et al. Deep Reinforcement Learning at the Edge of the Statistical Precipice, NeurIPS 2021."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2796/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700093765361,
                "cdate": 1700093765361,
                "tmdate": 1700093765361,
                "mdate": 1700093765361,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "A5W0x6CzXK",
                "forum": "1vDArHJ68h",
                "replyto": "ajND9EiCWR",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2796/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2796/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Author Response (Cont.)"
                    },
                    "comment": {
                        "value": "> Three kinds of actor and critic inputs are introduced, namely, output state, hidden state and full state, which results in a critical design choice to be tuned for each domain. Although the authors provide some takeaways to select between them, it is not always true.\n\nThank you for your feedback. We respectfully have a different view that we would like to clarify. To this end, we believe the policy input type should be chosen based on the type of partial observability exposed by the environment.\n\nAs a reminder, the SSM network has a hidden vector \\$x_t\\$ (passing between steps of SSM) and output vector \\$h_t\\$ (passed to the observation and reward heads). For instance, consider the \\$\\texttt{Memory Length}\\$ task in the BSuite. The agent observes the query vector in the first step and is then tasked to output an action corresponding to that query in the last step of the episode. The reward is only given in the last step of the episode and only in the case when the action aligns with the initial query. We therefore hypothesize that this provides an incentive for \\$h_T\\$ to represent everything necessary for the policy, which is why the output state policy works best there. In contrast, BSuite’s \\$\\texttt{Discounting Chain}\\$ is a credit assignment problem where the rewards are delayed. Thus, we hypothesize that there is no such incentive for \\$h_t\\$ to represent everything needed by the policy, hence the hidden state policy works better.\n\nLastly, despite DMC not being a memory task, the visual benchmark of DMC is a partially observable (PO) environment (since images do not showcase the velocity vectors). An empirical testimony for this fact (PO property of DMC-vision) can be found in the original DeepMind Control paper (see **Figure 6**). The same RL algorithm with an MLP or CNN backbone is applied to DMC environments with vector (full) and image (partial) observations. There exists a constant gap between these two variants, and the performance is lower for the image observation model. In the case of R2I, the best policy in DMC-proprio is the output state, since it is a fully observable environment and \\$h_t\\$ is tasked to predict this full observation. However, since DMC-vision is a PO domain, we found the hidden state policy to work better there.\n\n---\n> The authors say R2I's 'objective differs from ELBO in three ways', but to my knowledge, these three points are all borrowed from DreamerV3 but without explicitly being mentioned in the text.\n\nWe'd like to clarify that the integration of SSMs with DreamerV3's world model was explicitly stated at the beginning of **Section 3**. However, it is true that we did not explicitly mention that our objective is the same as in DreamerV3. Despite this, each time we mentioned any changes in the objective function in relation to ELBO, we properly cited DreamerV3 and other related works which initially proposed those changes. In order to avoid any future confusion, we have updated our paper to explicitly state that our objective is borrowed from the DreamerV3 algorithm.\n\n---\n**Questions**\n\n---\n> Dreamer is compared in Memory Maze tasks. Does this Dreamer baseline include the TBTT technique proposed by Pasukonis et al., which improves the memory of RSSM?\n\nYes, to facilitate a more fair comparison, we included the TBTT version of the Dreamer in the initial submission. To avoid any future confusion, we have marked the Dreamer algorithm as **Dreamer (TBTT)**.\n\n---\n> Why not include Transformer-based world models as baselines? \n\nThank you for the suggestion to include Transformer-based world models as baselines. We did assess off-the-shelf Transformer models but found they performed poorly on desired tasks, without extensive hyperparameter tuning (which falls a bit outside the scope of this work). On another note, we also threw these models onto the evaluation for a speed test, which as expected, they were slower.\n\n---\n**In conclusion, your constructive criticisms have been valuable in enhancing the quality and clarity of our research. We hope the revisions and clarifications provided have resolved your concerns. If your major questions and concerns have been addressed, we would appreciate it if you could support our work by increasing your score. If there are more questions/concerns, please let us know.**"
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2796/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700094206077,
                "cdate": 1700094206077,
                "tmdate": 1700094664344,
                "mdate": 1700094664344,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "BizAXtjBPV",
                "forum": "1vDArHJ68h",
                "replyto": "ajND9EiCWR",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2796/Reviewer_fFhp"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2796/Reviewer_fFhp"
                ],
                "content": {
                    "comment": {
                        "value": "Many thanks for the detailed response!\n\nThe authors have excellently addressed my concerns w.r.t. a concurrent work, S4WM. \n\nDespite that, I still think that introducing different kinds of actor and critic inputs, which need to be tuned or selected by your insights into specific environments, is a regretful deficiency. \n\nMoreover, a more deep statistical analysis actually supports the slightly inferior performance of R2I on standard RL benchmarks. Note that in the revision, the authors claim 'outside of this interval (500-900), the difference between R2I and DreamerV3 diminishes significantly' and conclude that 'R2I and DreamerV3 display comparable levels of performance\nacross the majority of tested environments.' In contrast, there is a clear gap (\\~10%) in the interval of 0~500, on the DMC-vision domain (Fig. 25a).\n\nOverall, I think this paper is worth accepting, and I decide to change my score to 6. I highly encourage the authors to consider my latest feedback and refine their claims further."
                    }
                },
                "number": 10,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2796/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700204835994,
                "cdate": 1700204835994,
                "tmdate": 1700204857056,
                "mdate": 1700204857056,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "HP4yncJuQ2",
                "forum": "1vDArHJ68h",
                "replyto": "ajND9EiCWR",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2796/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2796/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "We sincerely appreciate increasing the score for our paper and your recognition of our efforts in addressing the concerns.\n\nWe understand your point about the performance gap between R2I and DreamerV3. We have taken your remarks into serious consideration and would like to clarify the performance narrative based on comprehensive evaluations across various environments. Specifically, DreamerV3 and R2I are on par in 41 environments **(1)**. Our definition of \"on par\" is that the median (for a fixed game) performance of one method is within the confidence interval of the other algorithm, and **vice versa**. At the same time, there are 15 environments where R2I and DreamerV3 are insignificantly different **(2)**. Our definition of \"insignificantly different\" is that only one algorithm's median lies within the confidence interval of the other, while the other's median performance may lie outside of the first one algorithm - upper or lower. This is so because there are multiple different cases for the relation of scores between R2I and DreamerV3. Finally, if the median performance of R2I lies outside of DreamerV3's confidence, and DreamerV3's median performance lies outside of R2I's confidence, we say that they are significantly different. For R2I and DreamerV3, there are only 8 such environments **(3)**, and in one of them (Bank Heist of Atari 100K), R2I is significantly better than DreamerV3.\n\nIn summary, there are 41 + 15 + 1 = 57 environments where R2I is not significantly worse than DreamerV3, and in the majority of these environments (41 out of 57), they perform on par. Out of all environments, the remaining 7 are the ones where DreamerV3 is significantly better than R2I, which is only approximately **10%** of all standard RL tasks considered (7/64).\n\nIn light of these observations, we believe the generality claim in the paper is still correct. We propose to add the following to the text: “While R2I outperforms DreamerV3 in certain environments and vice versa, the overall performance analysis suggests that they offer similar behavior across a wide array of standard RL benchmarks, differing in only a small subset of these.”\n\nWould this articulation align with your insights, or would you advise further refinement? We appreciate any further guidance you may offer to help us align our revisions with your suggestions.\n\n---\n**P.S.** We believe the issue of convincing the community that a certain method is not different from some other method comes from the lack of statistical methodology for RL. There exists only one notable work [1] which mainly focuses on determining if the methods are different but not if the methods perform comparably (these two questions assume different null hypotheses, and statistically answering one does not statistically answer the other). We are aware that certain statistical tests exist that answer questions similar to ours; however, we believe that a certain adaptation of these methods should be done to apply them to report results in RL.\n\n\n**(1)** Environments are DMC-proprio: Finger Spin, Pendulum Swingup, Walker Stand, Finger Turn Hard, Walker Run, Cartpole Balance, Cup Catch, Walker Walk, Hopper Stand, Reacher Hard, Hopper Hop, Finger Turn Easy, Cheetah Run, Cartpole Balance; DMC-vision: Walker Stand, Quadruped Run, Cup Catch, Cartpole Swingup Sparse, Quadruped Walk, Cartpole Balance Sparse, Cartpole Balance, Hopper Hop, Walker Walk, Finger Turn Easy, Reacher Easy; Atari100k: Alien, Asterix, Battle Zone, Boxing, Crazy Climber, Demon Attack, Freeway, Gopher, Hero, James Bond, Kung Fu Master, Ms Pacman, Qbert, Seaquest, UpNDown.\n\n**(2)** Environments are DMC-proprio: Cartpole Swingup, Cartpole Swingup Sparse; DMC-vision: Finger Turn Hard, Cheetah Run, Finger Spin, Finger Turn Easy, Pendulum Swingup; Atari100k: Amidar, Assault, Breakout, Chopper Command, Frostbite, Kangaroo, Private Eye, Road Runner.\n\n**(3)** Environments are DMC-proprio: Acrobot Swingup; DMC-vision: Walker Run, Acrobot Swingup, Cartpole Swingup, Reacher Hard;  Atari100k: Bank Heist, Krull, Pong.\n\n\n---\n**Reference**\n\n[1] Agarwal et al. Deep Reinforcement Learning at the Edge of the Statistical Precipice, NeurIPS 2021."
                    },
                    "title": {
                        "value": "Thank you!"
                    }
                },
                "number": 14,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2796/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700600382733,
                "cdate": 1700600382733,
                "tmdate": 1700600400602,
                "mdate": 1700600400602,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "xn2F3yqpf5",
            "forum": "1vDArHJ68h",
            "replyto": "1vDArHJ68h",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission2796/Reviewer_pPqM"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission2796/Reviewer_pPqM"
            ],
            "content": {
                "summary": {
                    "value": "This work proposes Recall to Imagine (R2I), a Model-Based Reinforcement Learning (MBRL) agent that integrates the Dreamer framework with State Space Models (SSMs), in order to alleviate the well-known challenges of long-term dependencies regarding memory and credit assignment. This integration works by replacing the GRU-based representation model with the SSM, which enables parallel predictions and improves the capabilities for capturing long-term dependencies. The paper presents a rich empirical analysis in a variety of memory environments, achieving state-of-the-art results in them while incurring a small drop in performance in the standard benchmarks. Furthermore, the paper provides an extensive ablation analysis of diverse design choices and hyperparameters in this integration."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "- The paper addresses the problem of long-term dependencies for World Models, which is an issue for RNNs and Transformers on handling sequences in representational models. Therefore, it is very relevant to the community. \n\n    - Furthermore, employing SSMs to replace the aforementioned backbones for learning temporal dependencies is sound and well-motivated.\n\n- The proposed architecture establishes new state-of-the-art performance for several tasks in the considered environments (BSuite, POPGym, and Memory Maze), with a noticeable improvement in computational efficiency, as shown in Figure 2.\n\n- The work brings extensive and insightful ablation studies in many design decisions in the R2I architecture. These are presented as a systematic evaluation in Appendices M to P and helps understanding how the proposed method works."
                },
                "weaknesses": {
                    "value": "- Despite the conducted ablation in Appendix O, the question on why the different input variations work differently across environments still remains open. And the raised hypothesis on “feature instability” sounds vague and not properly backed up by a solid argument. It would be great to provide a better understanding of this challenge to give more clarity on how the method works, but I understand this is a difficult open problem that demands a careful investigation.\n\n- The work adopts SSMs to address the challenge of handling long-term dependencies in RL (memory and credit assignment). Nevertheless, it does not motivate the employment of Dreamer (or, more generally, Model-Based RL). I think it is important to describe and motivate why Dreamer was used instead of Model-Free RL, as it is not clear why MBRL would be better than MFRL for these memory tasks (unless there is another motivation besides asymptotic performance, such as sample efficiency).\n\n    - In the same line, Figure 4 brings some “memory-augmented” Model-Free baselines, but it lacks “PPO + SSMs”. This baseline would definitely clarify my concern. If there is no constraint in the sample budget, it is possible (perhaps expected) that the MFRL agent would perform better.\n\n- In Section 4.3, the claim of “not sacrificing generality” is questionable. There is a small drop in performance. For instance, in Appendix J (DMC-proprio), DreamerV3 is (at least) slightly better in 6 tasks.  In Appendix K (DMC-Vision), 8 environments. In Appendix L (Atari), 10 environments. I suggest rephrasing the claim to account what is observed in the Appendices.\n\n- The work from Deng et.al [1], proposing S4WM, looks very similar to the proposed one. Indeed, both works propose replacing the RSSM with SSMs with the same motivation: improving memory capabilities. The work on S4WM was publicly released approximately 2.5 months before this submission, which can be seen as concurrent work. Nevertheless, I believe the work is almost overlooked by the proposed paper, which has a small citation in Section 5. Given the similarity, it would be crucial to provide a more detailed comparison contrasting both works, in terms of methodology and evaluation, perhaps in the Introduction or in a separate Appendix.\n\n**Minor Concerns**\n\n- In Appendix H, task Autoencode: the episode length for the Hard task is 156. Is that right? I believe it is supposed to be 256.\n\n**References**\n\n[1] Deng et. al. Facing off World Model Backbones: RNNs, Transformers, and S4. NeurIPS, 2023.\n\n**Summary of the Review**\n\nThe work brings an effective improvement on World Models due to a well-motivated employment of State Space Models. This validates this architecture and extends its effectiveness in dealing with sequences in RL. The work does a great job in empirical analysis, anticipating many questions and answering them with extensive experiments and ablations. On the other hand, I believe the paper could be improved if the aforementioned concerns were addressed. Nevertheless, these concerns are not critical enough to prevent acceptance."
                },
                "questions": {
                    "value": "- In Appendix G (BSuite environment), is there any hypothesis on why sometimes harder environments (longer memory steps) present better performance than easier ones? For instance, R2I’s performance on 31 memory steps is better than 15 memory steps. Similarly, the performance in 81 memory steps seems better (or more stable) than 41 memory steps.\n\n\n\n\n\n\n\n\n\n\n===================== **POST-REBUTTAL** ==================================\n\nDear authors,\n\nThanks for putting so much effort on addressing my concerns. I believe they led to substantial improvements in an already good work, so I am raising my scores towards acceptance.\n\nSpecifically:\n\n- I appreciate the efforts on formulating hypotheses on why the different input variations work differently across environments. I believe the raised hypotheses are valid and potential venues for future work. As I mentioned before, this seems to be a difficult problem that requires careful investigation. It would be interesting to bring this rebuttal discussion into the paper, as I believe this could also be an important question for other readers. This is also valid to the point related to Appendix G.\n\n- I also would like to thank you for adding the new PPO + SSMs baseline. Turns out to be very different from what I expected, and given the discussion on Appendix T, I think it should require careful tuning to work with PPO (which is, indeed, a very sensible algorithm). But this is an argument in favor of the proposed method and perhaps another open question to be addressed (i.e., how to make SSM to work with PPO)\n\n- Thanks for addressing the tone of the claim in Section 4.3 and providing more evidence regarding it. I agree that given the diversity of environments, it is hard to ensure that all of them will attain the same performance, and the new wording also better reflects the presented results.\n\n- Lastly, the Appendix Q is great. I think this was one common concern from many reviewers and it was well addressed with many details. For sure the strongest reason to increase the scores."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission2796/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission2796/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission2796/Reviewer_pPqM"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission2796/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698096807535,
            "cdate": 1698096807535,
            "tmdate": 1700655302322,
            "mdate": 1700655302322,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "UU098BCqFY",
                "forum": "1vDArHJ68h",
                "replyto": "xn2F3yqpf5",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2796/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2796/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Author Response"
                    },
                    "comment": {
                        "value": "Thank you for the constructive feedback on our submission. We appreciate your recognition of our approach to handling long-term dependencies in world models using SSMs and are pleased to note the acknowledgment of our extensive ablation studies. The new state-of-the-art performance and improved computational efficiency are key contributions of our work, which we are glad to have been highlighted. We believe these establish the significance and practical value of our research. \n\nWe have carefully considered the concerns raised and would like to address them as follows:\n\n---\n> Despite the conducted ablation in Appendix O, the question on why the different input variations work differently across environments still remains open.\n\nWe acknowledge the reviewer's point on different policy inputs. To address this, we believe the policy input type should be chosen based on the type of partial observability exposed by the environment.\n\nAs a reminder, the SSM network has a hidden vector \\$x_t\\$ (passing between steps of SSM) and output vector \\$h_t\\$ (passed to the observation and reward heads). For instance, consider the \\$\\texttt{Memory Length}\\$ task in the BSuite. The agent observes the query vector in the first step and is then tasked to output an action corresponding to that query in the last step of the episode. The reward is only given in the last step of the episode and only in the case when the action aligns with the initial query. We therefore hypothesize that this provides an incentive for \\$h_T\\$ to represent everything necessary for the policy, which is why the output state policy works best there. In contrast, BSuite’s \\$\\texttt{Discounting Chain}\\$ is a credit assignment problem where the rewards are delayed. Thus, we hypothesize that there is no such incentive for \\$h_t\\$ to represent everything needed by the policy, hence the hidden state policy works better.\n\n---\n> It does not motivate the employment of Dreamer (or, more generally, Model-Based RL).\n\n> In the same line, Figure 4 brings some “memory-augmented” Model-Free baselines, but it lacks “PPO + SSMs”. This baseline would definitely clarify my concern.\n\nThank you for pointing out the need for a more explicit rationale regarding our choice of MBRL and Dreamer. In response to your request, we wish to explain our motivation for concentrating on MBRL over MFRL. Our focus on MBRL stems from its potential in sample efficiency, reusability, transferability, and safer planning, along with the advantage of more controllable aspects due to its explicit supervised learning component (i.e., world modeling). \n\nIn line with your feedback, we have integrated the “\\$\\texttt{PPO + SSMs}\\$” baseline into our evaluations in POPGym (please refer to **Section 4.1** and **Figure 4**). All empirical results from our experiments on POPGym and Memory Maze speak to the aforementioned advantages of MBRL, suggesting the superiority of MBRL in these domains. Within the realm of MBRL methodologies, we decided to build upon the SOTA DreamerV3 framework, which has proven capacities for generalization, sample efficiency, and scalability. \n\nWe acknowledge the need for an explicit comparison and motivation and have accordingly addressed this in the revised version of our paper in **Appendix B**, highlighting the rationale for choosing MBRL.\n\n---\n> In Section 4.3, the claim of “not sacrificing generality” is questionable. There is a small drop in performance.\n\nWe appreciate your attention to the details presented in the appendix. We understand your concerns with the phrase “not sacrificing generality” and agree that our claim may benefit from moderation to more accurately reflect the experimental results. In the revision, we have adjusted our language to better communicate the nuanced performance outcomes (please refer to **Section 4.3**). Please also refer to the newly added Appendix **section R** where we provide a more deep statistical analysis of the results on Standard RL tasks.\n\nWhile it's true that there are some tasks where DreamerV3 shows slightly better performance, our aggregated metrics suggest that the performance of DreamerV3 is preserved in the majority of environments. We employed the RLiable [1] package in the revision to show that the difference between them is negligible. It is worth noting that there are 64 such environments with diverse properties such as the type of control, reward sparsity, dynamics stochasticity, and more which is why preserving them all is extremely non-trivial.\n\n---\n> In Appendix H, task Autoencode: the episode length for the Hard task is 156. Is that right? I believe it is supposed to be 256.\n\nThank you for your careful reading of Appendix H. We have double-checked our experimental settings and can verify that the episode length specified for Autoencode-Hard is correct at 156. This is because the lengths in the Autoencode environments are multiple of 52 (the number of cards in a standard deck)."
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2796/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700095733767,
                "cdate": 1700095733767,
                "tmdate": 1700095733767,
                "mdate": 1700095733767,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "uTdyiSWTi2",
                "forum": "1vDArHJ68h",
                "replyto": "xn2F3yqpf5",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2796/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2796/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Author Response (Cont.)"
                    },
                    "comment": {
                        "value": "> Given the similarity, it would be crucial to provide a more detailed comparison contrasting both works, in terms of methodology and evaluation, perhaps in the Introduction or in a separate Appendix.\n\nThank you for suggesting a thorough comparison between R2I and S4WM. We understand the importance of distinguishing our contribution within the field, especially when similarities are present. To address this concern, we wish to provide an analytical comparison between R2I and S4WM, demonstrating that these are significantly different algorithms. We believe S4WM makes a valuable contribution to world modeling, which is a subtask of MBRL. **Improved world modeling quality is neither necessarily nor sufficiently linked to an improved expected reward in MBRL**. To support this claim, we have added a new section (please refer to the newly added **Section Q of the Appendix**) to the Appendix, with the following discussion: First, we present both theoretical and experimental evidence from existing literature that suggests the likelihood of the world model does not directly translate to reward [2, 3, 4], and sometimes a negative correlation is observed. Second, we conduct an experiment in Memory Maze environments, which is a task of primary interest in both S4WM and R2I, where we demonstrate cases of negative correlation between the return and image MSE (i.e., the expected return improves while image MSE worsens). We also interpret how this result relates to S4WM's experimental outcomes. Third, we provide a detailed table comparing all architectural choices made by R2I and S4WM, noting there are 9 non-trivial architectural differences, excluding network sizes and depths (although these also vary). For each difference, we interpret our understanding of its impact on policy learning. Please note that our comparison is with the S4WM version that was publicly available on Arxiv on July 5th, 2023, not the Arxiv version from November 9, 2023, and not the camera-ready version from NeurIPS 2023 (whose deadline was October 27, 2023)—one month after the ICLR paper deadline. Finally, S4WM reports metrics on offline RL datasets collected by agents assumed to be nearly optimal. However, in MBRL, the world model and policy commence training with data produced by a random agent. In summary, we believe R2I and S4WM are distinct models designed to solve different (but related) tasks, released concurrently online, with no evidence that S4WM will function out-of-the-box for reinforcement learning problems—on the contrary, there is evidence suggesting that significant modifications are necessary for S4WM to operate as an MBRL algorithm.\n\n---\n**Questions**\n\n---\n> In Appendix G (BSuite environment), is there any hypothesis on why sometimes harder environments (longer memory steps) present better performance than easier ones?\n\nWhile our paper did not explicitly hypothesize about the reasons behind this particular phenomenon, we can suggest a plausible explanation. **The observed behavior could be linked to the performance patterns of the DreamerV3 algorithm**; notably, at episode lengths 21, 26, and 31, DreamerV3 encounters similar challenges—this is evidenced by the variance arising from a subset of runs failing to converge to a substantial reward. Consequently, the distribution of final success rates for DreamerV3 exhibits bimodality in these instances, with certain final success rates achieving 1, while others remain at 0. R2I inherits this property of DreamerV3 but, due to its extended memory capabilities—which result in a higher number of successful cases—experiences greater fluctuations in the median success rate. This is the reason we opted for 10 seeds per episode length.\n\nTo potentially resolve the issues, we can increase the number of seeds (which currently stands at 10). Stabilizing can be a good potential future direction to explore in R2I and Dreamer. Note that such instability has not been observed in any other environment tested in this study, with either DreamerV3 or R2I.\n\n---\n**To wrap up, we appreciate your insightful observations and have diligently applied them to better our work. We hope that the revisions and elaborations made meet the high standards expected by the conference. If we have adequately responded to your key concerns and questions, we kindly ask for your consideration in enhancing the score you've allotted to our submission. However, if you still have any additional queries or concerns, we invite you to share them with us.**\n\n---\n**References**\n\n[1] Agarwal et al. Deep Reinforcement Learning at the Edge of the Statistical Precipice, NeurIPS 2021.\n\n[2] Joseph et al. Reinforcement learning with misspecified model classes. ICRA, 2013.\n\n[3] Lambert et al. Objective Mismatch in Model-based Reinforcement Learning. L4DC, 2020.\n\n[4] Nikishin et al. Control-oriented model-based reinforcement learning with implicit differentiation. AAAI, 2022."
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2796/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700096127594,
                "cdate": 1700096127594,
                "tmdate": 1700096274613,
                "mdate": 1700096274613,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "HZbJwiETyu",
                "forum": "1vDArHJ68h",
                "replyto": "uTdyiSWTi2",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2796/Reviewer_pPqM"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2796/Reviewer_pPqM"
                ],
                "content": {
                    "title": {
                        "value": "Thanks for the efforts during rebuttal"
                    },
                    "comment": {
                        "value": "Dear authors,\n\nThank you for the efforts during the rebuttal. I believe the rebuttal discussion and updates in the work addressed my concerns, and I am raising my score. Please check the updated review."
                    }
                },
                "number": 15,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2796/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700655374567,
                "cdate": 1700655374567,
                "tmdate": 1700655374567,
                "mdate": 1700655374567,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "W47fWeUTFL",
            "forum": "1vDArHJ68h",
            "replyto": "1vDArHJ68h",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission2796/Reviewer_Emy3"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission2796/Reviewer_Emy3"
            ],
            "content": {
                "summary": {
                    "value": "This paper introduces a new Model-based RL algorithm Recall to Imagine (R2I) that upgrades DreamerV3 by non-trivially incorporating S4 networks in substitutions of the RSSMs that have been commonly used since PlaNet. The paper provides abundant evidence to support the main claim that R2I outperforms DreamerV3 and is significantly more computationally efficient"
                },
                "soundness": {
                    "value": "4 excellent"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "4 excellent"
                },
                "strengths": {
                    "value": "While employing S4 as an alternative to RSSMs was a natural step to come, I think the authors do a very good work here. The paper is very well presented and easy to follow. Authors do a very detailed theoretical analysis of the approach, building up intuition and making it very easy to follow. It is remarkable that they even include in-depth discussions on why they discarded alternative features when designing their algorithm, which should be a more common practice. The empirical analysis is also extensive and provides solid ground with the numerous ablations and the varied array of benchmarks where the R2I vs Dreamer comparison is drawn. R2I proves to be significantly faster to train while being a better performer, specially in challenging long-term dependencies\n\nI believe that this paper will be very relevant for the ICLR community."
                },
                "weaknesses": {
                    "value": "My biggest concern is the lack of an explicit literature review/ related work section, which I would suggest to include in the appendix. Specifically, I believe that it is of special relevance to include a more in-depth comparison between R2I and S4WM -currently briefly mentioned in the conclusions- since both combine DreamerV3 with SSMs.\n\nAlso, I noticed there are no mentions about making the code available. Thus, it would be specially benefitting for reproducibility if authors include a summary of the alg in pseudocode at the appendix.\n\n-- After Rebuttal --\n\nAuthors addressed very well all my concerns, the paper now presents clearly its differences with respect prior work and with a well documented code reproducibility should be easy to reproduce. I believe this will be a very relevant work for the RL community"
                },
                "questions": {
                    "value": "Correctly addressing the two points above is what can change the most my opinion. Additionally, there are a couple of minor things I noticed:\n* Appendix N Figure 14, the second plot is missing the expected error\n* Section 3.1 line 4 where x_t is \"a\" hidden state and f_θ is a sequence model with \"a\"  SSM\nnetwork"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "10: strong accept, should be highlighted at the conference"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission2796/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission2796/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission2796/Reviewer_Emy3"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission2796/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698499291669,
            "cdate": 1698499291669,
            "tmdate": 1700507679950,
            "mdate": 1700507679950,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "c8meXzplgG",
                "forum": "1vDArHJ68h",
                "replyto": "W47fWeUTFL",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2796/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2796/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Author Response"
                    },
                    "comment": {
                        "value": "Thank you for your positive and encouraging feedback on our submission. Your acknowledgment of the strong points in our paper is very uplifting, including the adept use of SSMs in MBRL, the clear and well-structured presentation, the detailed theoretical analysis, the transparency in our design choices, the extensive empirical analysis, and the performance of R2I on long-term dependencies. It is especially gratifying to know your belief that our work will be highly relevant to the ICLR community. We have reviewed the concerns expressed and are prepared to respond to each point in the following manner.\n\n---\n> My biggest concern is the lack of an explicit literature review/ related work section.\n\nWe acknowledge the need for an explicit related work section and added it to the appendix accordingly (**Section B** in the appendix). Notably, in the previous version, some literature review already exist in **Section 2** and **Appendix C**. \n\n---\n> I believe that it is of special relevance to include a more in-depth comparison between R2I and S4WM.\n\nWe appreciate your recommendation for an in-depth comparative analysis between R2I and S4WM, which is a concurrent work to ours. Recognizing the necessity to highlight the distinctiveness of R2I amidst S4WM, we acknowledge the value of such an evaluation. To address this concern, we wish to provide an analytical comparison between R2I and S4WM, demonstrating that these are significantly different algorithms. We believe S4WM makes a valuable contribution to world modeling, which is a subtask of MBRL. **Improved world modeling quality is neither necessarily nor sufficiently linked to an improved expected reward in MBRL**. To support this claim, we have added a new section (please refer to the newly added **Section Q of the Appendix**) to the Appendix, with the following discussion: First, we present both theoretical and experimental evidence from existing literature that suggests the likelihood of the world model does not directly translate to reward [1, 2, 3], and sometimes a negative correlation is observed. Second, we conduct an experiment in Memory Maze environments, which is a task of primary interest in both S4WM and R2I, where we demonstrate cases of negative correlation between the return and image MSE (i.e., the expected return improves while image MSE worsens). We also interpret how this result relates to S4WM's experimental outcomes. Third, we provide a detailed table comparing all architectural choices made by R2I and S4WM, noting there are 9 non-trivial architectural differences, excluding network sizes and depths (although these also vary). For each difference, we interpret our understanding of its impact on policy learning. Please note that our comparison is with the S4WM version that was publicly available on Arxiv on July 5th, 2023, not the Arxiv version from November 9, 2023, and not the camera-ready version from NeurIPS 2023 (whose deadline was October 27, 2023)—one month after the ICLR paper deadline. Finally, S4WM reports metrics on offline RL datasets collected by agents assumed to be nearly optimal. However, in MBRL, the world model and policy commence training with data produced by a random agent. In summary, we believe R2I and S4WM are distinct models designed to solve different (but related) tasks, released concurrently online, with no evidence that S4WM will function out-of-the-box for reinforcement learning problems—on the contrary, there is evidence suggesting that significant modifications are necessary for S4WM to operate as an MBRL algorithm.\n\n---\n> I noticed there are no mentions about making the code available. Thus, it would be specially benefitting for reproducibility if authors include a summary of the alg in pseudocode at the appendix.\n\nThank you for pointing out the need for enhanced reproducibility. We currently have a solid codebase, and we plan to open-source a well-documented repo along with the paper to facilitate replication of R2I. Our implementation leverages the **Jax** framework, chosen for its simplicity and efficiency. While Jax was our framework of choice, we acknowledge that the core component of our algorithm—the SSM inference with parallel scan — could potentially be implemented in pure PyTorch as well with the same efficiency as in Jax, without the need to use custom CUDA kernels, which is the case for convolution mode. Bearing this in mind and with an aim to enhance reproducibility, in the revised version, we included a detailed pseudocode for our algorithm (please refer to **Appendix S**).\n\n---\n\n**References**\n\n[1] Joseph et al. Reinforcement learning with misspecified model classes. ICRA, 2013.\n\n[2] Lambert et al. Objective Mismatch in Model-based Reinforcement Learning. L4DC, 2020.\n\n[3] Nikishin et al. Control-oriented model-based reinforcement learning with implicit differentiation. AAAI, 2022."
                    }
                },
                "number": 8,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2796/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700096675353,
                "cdate": 1700096675353,
                "tmdate": 1700096675353,
                "mdate": 1700096675353,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "gjUCla2Cy6",
                "forum": "1vDArHJ68h",
                "replyto": "GBcPjceMNR",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2796/Reviewer_Emy3"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2796/Reviewer_Emy3"
                ],
                "content": {
                    "title": {
                        "value": "Rebuttal response"
                    },
                    "comment": {
                        "value": "I want to thank the authors for putting so much work in the response of our comments and addressing my concerns. \n\nSpecifically, regarding S4WM, since it was a concurrent work with similar \"ideas\" but towards a different objective within model-based RL, I was simply asking for a longer discussion (in the fashion to the response to my comment), since the previous brief comment in the last section was leaving the reader puzzled about the differences. Nevertheless, the authors went a few extra miles with a detailed and in-depth theoretical and empirical analysis included in the extended version, which is very insightful. I believe this plus the additional related work section helps to picture better the role of this work.\n\nI am raising my score since, as an RL researcher, this is the kind of work I wouldn't want to miss when attending ICLR, and that I am very happy to have had the chance to review. Congratulations to the authors, I am keen to see that code released and start using R2I."
                    }
                },
                "number": 11,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2796/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700507389272,
                "cdate": 1700507389272,
                "tmdate": 1700507389272,
                "mdate": 1700507389272,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "IFncVI98KY",
                "forum": "1vDArHJ68h",
                "replyto": "wRqvRywfT3",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2796/Reviewer_Emy3"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2796/Reviewer_Emy3"
                ],
                "content": {
                    "title": {
                        "value": "Small thing"
                    },
                    "comment": {
                        "value": "Just a small typo I just saw, equation 5 one of the z is missing a hat since should be the KL diff between the encoded and the predicted z as correctly reflected in Figure 1"
                    }
                },
                "number": 16,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2796/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700669816569,
                "cdate": 1700669816569,
                "tmdate": 1700669816569,
                "mdate": 1700669816569,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]