[
    {
        "title": "Conformal Risk Control"
    },
    {
        "review": {
            "id": "9H7we1noff",
            "forum": "33XGfHLtZg",
            "replyto": "33XGfHLtZg",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission1833/Reviewer_GsY4"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission1833/Reviewer_GsY4"
            ],
            "content": {
                "summary": {
                    "value": "This paper generalizes the tools of the Conformal Prediction framework to achieve prediction sets satisfying general criteria, including the traditional coverage criteria. They provide an adaptation to Split Conformal Prediction that achieves this new \"risk\" metric. They demonstrate empirically that such a method indeed holds similar risk guarantees to the known coverage guarantee over a host of real datasets."
                },
                "soundness": {
                    "value": "4 excellent"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "4 excellent"
                },
                "strengths": {
                    "value": "1. The intuition of the paper is strong. Developing a method to generalize Conformal Prediction to different loss functions is a clear improvement on existing literature, and the contribution is clear.\n2. The experiments are very well done. The experiments over several loss functions are clear and convincing. \n3. The paper's motivation is clear, and the impact of such work is immediately evident. \n4. The extensions are strong and of good breadth. This framework is evidently useful for providing guarantees under different risk settings, not just the initial canonical setting of risk presented first. \n\nOverall, I vote for acceptance of this paper. I have several questions on computability and the writing, but these can be fixed and explained for the camera-ready version."
                },
                "weaknesses": {
                    "value": "1. Some motivating examples of cases where such conformal risk control would be desirable over the traditional coverage guarantee. One can think of cases where F1-score is more appropriate to measure than coverage. It would be great to mention these examples in the introduction so that the reader understands more the motivation of this generalization. \n2. Why is a bounded loss function reasonable? What examples of loss functions violate this or satisfy this? Obviously, a coverage guarantee satisfies this, but what other metrics satisfy this? \n3. The $\\Lambda$ operator is quite confusing. You do not explicitly define it and still say $L_i$ is a map from $\\Lambda$ to another set. You should have defined $\\Lambda$ before. You also say $\\sup \\Lambda \\in \\Lambda$. Is $\\Lambda$ the set of possible $\\lambda$, so the set of real numbers?\n4. In the buildup of section 1.1, I find the intuitive explanation of the method and why it works lacking. I believe a strong reason of why conformal prediction is so popular is its intuitiveness. I find these definitions unintuitive and the provided explanation lacking. I would spend more time describing the intuition of the constants and claims defined. \n5. One of my main concerns is the computability of $\\hat{\\lambda}$. This seems highly nontrivial to calculate. This seems like the most important point of the paper. Could you describe how to compute this? Moreover, does this formalization make it easier to compute than other similar methods doing conformal risk control? \n6. Does the guarantee of $\\alpha -\\frac{2B}{n+1}$ in Section 1.1 match that of conformal prediction? In that case, the known guarantee is $\\geq \\alpha$, which is loose by $\\frac{2}{n+1}$. Does this method recover the tightest guarantees of Split Conformal Predictions when the loss function is set to be miscoverage?\n7. In the related works section, I find the differences between existing and current work confusing. You mention the guarantee in this paper is in expectation. Why is this better than existing works? Do existing works do worst-case analysis or high probability analysis? The technical similarity between different methods is not a sufficient difference in my opinion. In the second paragraph, I miss what the existing conformal risk works do. Is it possible that existing conformal risk works do not directly generalize conformal predictions or are often less tight? I believe more details on the differences between existing conformal risk papers and this paper are needed. \n8. I find the theoretical section again void of any intuition presented. I would highly encourage the authors to provide more intuition on the proof as to the meaning of each step in section 2.1. I found it very difficult to parse. Moreover, the notation in the proof of Theorem 1 is difficult to read. I believe a little cleaning up of this proof would be helpful. An example is that using $\\hat{\\lambda}'$ and $\\hat{\\lambda}$ are poor notation choices and create a lack of clarity. \n9. The assumption in Theorem 2, i.e. $\\mathbb{P}(J(L_i, \\lambda) > 0) = 0$ is provided without sufficient explanation. What set of loss functions satisfies such a definition and why? Which loss functions do not satisfy this assumption? Providing this analysis will help give intuition as to what Theorem 2 shows and when it works."
                },
                "questions": {
                    "value": "Please see above."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission1833/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission1833/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission1833/Reviewer_GsY4"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission1833/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698357368502,
            "cdate": 1698357368502,
            "tmdate": 1699636113148,
            "mdate": 1699636113148,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "OWkxlvn0yA",
                "forum": "33XGfHLtZg",
                "replyto": "9H7we1noff",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1833/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1833/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "We thank the reviewer for their careful review and thoughtful comments. We provide answers to specific questions and remarks (quoted) below.\n\n> Some motivating examples of cases where such conformal risk control would be desirable over the traditional coverage guarantee. One can think of cases where F1-score is more appropriate to measure than coverage. It would be great to mention these examples in the introduction so that the reader understands more the motivation of this generalization.\n\nGreat idea; thanks for the suggestion! Another reviewer agreed here, and we have bolstered the motivating example to the introduction.\n\n> Why is a bounded loss function reasonable? What examples of loss functions violate this or satisfy this? Obviously, a coverage guarantee satisfies this, but what other metrics satisfy this?\n\nIn our Examples section, we give several instances of such loss functions, including the best-in-set F1 score (lower-bounded by 0, so that 1 - F1 is lower-bounded by 1), the false negative rate (upper bounded by 1), graph distance (upper bounded by the depth of the graph), as well as any other clipped loss, such as Tukey's biweight loss. \n\nFurthermore, any unbounded loss can be transformed to a bounded loss. For example, any unbounded loss on the positive reals can be transformed by taking the inverse tangent. As long as the transformation is monotone, a loss of $\\alpha$ on the original loss corresponds exactly to a loss of $\\alpha’$ on the new loss; thus, controlling the transformed risk may be enough in practice.\n\nWe added text to the paper to make this clear; see page 2, footnote 1.\n\n> The  operator is quite confusing.\n\nWe introduced $\\Lambda$ in a confusing way. $\\Lambda$ is just the space of all inputs (‘thresholds’) to the function $L(\\lambda)$. It is usually a subset of the real line, but can also be a discretized grid (for example, np.linspace(0, 1, 100)). We have clarified this in the paper.\n\n> In the buildup of section 1.1, I find the intuitive explanation of the method and why it works lacking. I believe a strong reason of why conformal prediction is so popular is its intuitiveness. I find these definitions unintuitive and the provided explanation lacking. I would spend more time describing the intuition of the constants and claims defined. Provide more intuition on the proof as to the meaning of each step in section 2.1. I found it very difficult to parse. \n\nThanks for another good suggestion. We have added more intuition to the explanation of the method in Section 1.1, which hopefully will help with the proof intuition as well. We would appreciate any further guidance from the reviewer as to what was unintuitive. (It is hard to add much more content to the proof due to the page constraints.)\n\n> One of my main concerns is the computability of $\\hat{\\lambda}$.\n\nIt is computationally trivial to compute $\\hat{\\lambda}$ (in our new experiments, it takes a fraction of a second). Since the loss is monotonic, it is simple to find  by binary search to arbitrary precision. Usually this requires fewer than ten evaluations of the empirical risk.\n\nWe added an explanation of this fact in text (see page 2).\n\n> In the related works section, I find the differences between existing and current work confusing. You mention the guarantee in this paper is in expectation. Why is this better than existing works? Do existing works do worst-case analysis or high probability analysis? The technical similarity between different methods is not a sufficient difference in my opinion. In the second paragraph, I miss what the existing conformal risk works do. Is it possible that existing conformal risk works do not directly generalize conformal predictions or are often less tight? I believe more details on the differences between existing conformal risk papers and this paper are needed.\n\nThank you for this important criticism, which we took very seriously. Please see the [main response comment]() for a detailed discussion. See also the related work section and Appendix B of the updated paper.\n\nThe practical difference between our approach and the existing ones is massive --- it is **substantially more effective, sample-efficient, simpler, and provides a direct theoretical contribution to conformal prediction** as opposed to the existing risk-control algorithms. As the reviewer mentioned, the other approaches are high-probability bounds that do not generalize or build on the standard theory of conformal prediction."
                    }
                },
                "number": 8,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1833/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700520381224,
                "cdate": 1700520381224,
                "tmdate": 1700520404233,
                "mdate": 1700520404233,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "WAAMR9xCx3",
                "forum": "33XGfHLtZg",
                "replyto": "OWkxlvn0yA",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1833/Reviewer_GsY4"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1833/Reviewer_GsY4"
                ],
                "content": {
                    "title": {
                        "value": "Response to Authors"
                    },
                    "comment": {
                        "value": "I'd like to thank the authors for their response. I'd like to keep my vote to accept this paper."
                    }
                },
                "number": 9,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1833/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700542823380,
                "cdate": 1700542823380,
                "tmdate": 1700542823380,
                "mdate": 1700542823380,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "zmItawzpxd",
            "forum": "33XGfHLtZg",
            "replyto": "33XGfHLtZg",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission1833/Reviewer_fQpV"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission1833/Reviewer_fQpV"
            ],
            "content": {
                "summary": {
                    "value": "This paper extends conformal prediction to control the expected value of any monotone loss function. This type of guarantee called conformal risk control can be seen as a generalization of CP and includes CP as a particular case. Authors prove that for bounded loss, the conformal risk procedure provides a bound for any given $\\alpha$ and this bound is tight up to a $\\mathcal{O}(1/n)$ factor. The paper also explores different settings/problems such as distribution shift, quantile risk control, adversarial risk control, and expectations of U-statistics. Finally, experiments highlight the soundness of their proposals."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "This is a clever and promising idea to generalize conformal prediction guarantees.\n\nThis problem is of particular interest to the conformal prediction community.\n\nThe paper is very well written and easy to follow. This is a real pleasure to read it."
                },
                "weaknesses": {
                    "value": "It seems to me that the paper is more a collection of lots of theoretical results (c.f. Section 4. \"Extensions\": distribution shift, quantile risk, adversarial risk..)  than a real important contribution to a particular problem. This somewhat blurs the main contribution of the paper, which might have benefited from presenting only the risk control in a standard setting, but with a much more in-depth theoretical analysis.\n\nThe experimental results are not analyzed at all. In addition, the extensions in section 4 have not been the subject of any experiments.\n\nNo limits are indicated in the conclusion. In my opinion, comments on the limitations of the proposed approach are lacking.\n\nMinor:\n\nThe proof of Theorem 1 should be in the appendix with all the other proofs.\n\n\"In this case, conformal risk control finds...the expected value is...\" , hat on $\\lambda$ is missing in the right part of the equality.\n\nTypos: Examining (??),"
                },
                "questions": {
                    "value": "Under the distribution shift setting, the weights need to be estimated. How this can be done? and what is the impact on the control of the risk when $w$ is replaced by an estimate?\n\nIs there a link between quantile risk control and training-conditional guarantee in standard conformal prediction?\n\nCan you give a real situation where we want to control risks defined by adversarial perturbations?\n\nThe assumption that $P(J(L_i, \\lambda) > 0) = 0$ appears to be the CP equivalent of the continuous score assumption. Is this true?\n\nIt is said in the paper that in \"monotonizing\" a loss will only be powerful if the loss is near-monotone. Although this seems intuitive, do you have any numerical evidence for this? (or/and a basic example)."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission1833/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission1833/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission1833/Reviewer_fQpV"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission1833/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698831942758,
            "cdate": 1698831942758,
            "tmdate": 1700563516371,
            "mdate": 1700563516371,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "BZ2fCZPBfX",
                "forum": "33XGfHLtZg",
                "replyto": "zmItawzpxd",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1833/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1833/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "We thank the reviewer for their careful review and thoughtful comments. We provide answers to specific questions and remarks (quoted) below.\n\n> ...the paper is more a collection of lots of theoretical results (c.f. Section 4. \"Extensions\": distribution shift, quantile risk, adversarial risk..) than a real important contribution to a particular problem. This somewhat blurs the main contribution of the paper...\n\n**Theorems 1 and 2 are our main contributions, and we believe they are substantial contributions to the theory of conformal prediction.** The main observation is that conformal-type proof strategies leveraging exchangeability can be extended to a broader mathematical setting; specifically, they can be used for any bounded, monotone loss function, not just coverage.\n\nSection 4 is a bit more scattered, but shows the generality the approach by demonstrating its application to a few popular settings elsewhere in the conformal literature.\n\nWe don’t feel it is fair to say that our paper is not an important contribution to a particular problem. Theorems 1 and 2 are fundamental contributions; the rest are extensions. If the reviewer feels we have muddied our contribution by including Sec. 4, we are happy to discuss moving it to the appendix.\n\n> The experimental results are not analyzed at all. In addition, the extensions in section 4 have not been the subject of any experiments.\n\nWe have added analyses of our experimental results, and an example of covariate shift to Appendix D.\n\n> No limits are indicated in the conclusion. In my opinion, comments on the limitations of the proposed approach are lacking.\n\nWe have added a new limitations section, as mentioned in the [main response comment](https://openreview.net/forum?id=33XGfHLtZg&noteId=Y1zeKwutId). It is copied below for convenience.\n\n> Under the distribution shift setting, the weights need to be estimated. How can this be done? \n\nWe now include an experiment that estimates the covariate shift weights in Appendix D. It is done by training a binary probabilistic classifier to distinguish the training (Y=0) and test data points (Y=1). The LR estimate is taken to be $f(x)/1-f(x)$. This approach tends to work fairly well in practice (see our new experiment and those in [3]), but further theory on this topic would be very interesting.\n\n[3] Tibshirani, R. J., Foygel Barber, R., Candes, E., & Ramdas, A. (2019). Conformal prediction under covariate shift. Advances in neural information processing systems, 32.\n\n> Is there a link between quantile risk control and training-conditional guarantee in standard conformal prediction?\n\nThere is no link between these topics. This is because expectations and quantiles are fundamentally different objects and cannot be related without distributional assumptions.\n\nTraining conditional guarantees, give bounds on the conditional distribution of $\\mathbb{E}[L_{n+1}(\\hat{\\lambda}) \\mid L_1, \\ldots, L_n]$.  Quantile risk control gives a guarantee of the form $\\mathrm{Quantile}(L_{n+1}(\\hat{\\lambda})) \\leq \\alpha$. Relating these two guarantees is not generally possible.\n\n> Can you give a real situation where we want to control risks defined by adversarial perturbations?\n\nAn example could be when a machine learning system is serving exchangeable user queries, but, during deployment, adversaries may have injected bounded perturbations to the test queries. A real such situation might be an image recognition system guiding a car, with a threat of adversarially placed markings on road signs. The adversarially-robust version of conformal risk control maintains exchangeability of the worst case risk in this class of perturbations.\n\n> The assumption that P(J(Li, ) > 0) = 0 appears to be the CP equivalent of continuous score assumption. Is this true?\n\nYes, these assumptions are analogous. We previously noted this in Appendix A, and edited the main text to include this as well.\n\n> It is said in the paper that in \"monotonizing\" a loss will only be powerful if the loss is near-monotone. Although this seems intuitive, do you have any numerical evidence for this? (or/and a basic example).\n\nWe are happy to present a basic example. Consider the example loss function where $L(\\lambda) = 0$ if $\\lambda > 1 - \\epsilon$, $L(\\lambda) = B$ if $\\lambda \\in [a_i, 1  - \\epsilon]$, and $L(\\lambda) = 0$ if $\\lambda < a_i$. Then we have that $\\hat{\\lambda} = 1 - \\epsilon$, regardless of the distribution of $a_i$. The intuition here is that if there are big, non-monotone blips in the loss for certain $\\lambda$, the $\\sup_{\\lambda' \\geq \\lambda} L(\\lambda')$ version of the loss will be driven high early on, and can remain very conservative relative to the non-monotone $L(\\lambda)$ at lower values of $\\lambda$."
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1833/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700520079531,
                "cdate": 1700520079531,
                "tmdate": 1700520079531,
                "mdate": 1700520079531,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "NNzBauyQEa",
                "forum": "33XGfHLtZg",
                "replyto": "BZ2fCZPBfX",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1833/Reviewer_fQpV"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1833/Reviewer_fQpV"
                ],
                "content": {
                    "comment": {
                        "value": "I would like to thank the authors for their detailed response. I would also like to stress that I found the main contribution (Theorem 1 and 2) of the article very interesting and useful for the CP community. \n\nI maintain my score in favor of accepting the article."
                    }
                },
                "number": 10,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1833/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700563478776,
                "cdate": 1700563478776,
                "tmdate": 1700563478776,
                "mdate": 1700563478776,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "b6iBTvRl7J",
            "forum": "33XGfHLtZg",
            "replyto": "33XGfHLtZg",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission1833/Reviewer_pT4W"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission1833/Reviewer_pT4W"
            ],
            "content": {
                "summary": {
                    "value": "The paper offers a generalization of split conformal prediction, from its standard coverage-type guarantees to producing (threshold-based) set-valued predictions which bound, in expectation, arbitrary monotonic (in the threshold selected) loss functions (i.e. risks). The guarantees are very similar to conformal prediction (up to knowing an upper bound on the risk function), and the method flexibly generalizes some other important extensions of conformal prediction, such as e.g. the distribution shift conformal modeling of Tibshirani et al."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "The paper considers a productive generalization of conformal prediction, and easily extends the same proof technique as in vanilla conformal to handle relevant monotonic risks that are not coverage indicators. This leads to a host of both worked-out, and potential, applications to provably bounding useful risks (such as e.g. the running example of FNR) in various settings.\n\nThe useful extensions, to quantile control, multiple risks, and covariate shift among others, are also quite easy to derive from this generalized framework.\n\nThe experiments are (for the most part) cleanly formulated and executed, confirming that relevant risks are easily bounded in practice as predicted from the theory. \n\nThe paper is overall pleasantly written, and surveys all its contributions in a transparent manner.\n\nAs a result, I believe this paper would be a nice contribution to the conference, for both its theoretical soundness and simplicity as well as for its potential to be used in applications as diverse as split conformal prediction itself."
                },
                "weaknesses": {
                    "value": "1. A relatively significant point is that, while theoretical bounds here are given in expectation, as compared to existing PAC-type guarantees on general risks developed in other recent related papers, but in practice it would still make a lot of sense to establish good empirical performance of conformal risk prediction relative to those --- and in particular, to Learn-then-Test, which appears both very tractable just as the proposed framework here, but also handles arbitrary losses, not just ones that are monotonic, and thus seems to offer better flexibility in practical settings (without having to resort to discussions of near-monotonicity like the present manuscript does). Since the displayed metrics about the conformal risk control method are agnostic to whether in-expectation or PAC-style guarantees are given, it should be easy to make this comparison quite direct, from a practical standpoint.\n\n2. As a very minor point, the experiment on F1 score control in open-domain question answering, in contrast to other experiments in this paper, seems less useful and set up in a somewhat stylized way that doesn't seem to aim to capture any of the linguistic difficulties in tackling open domain question-answering --- which makes the plotted performance graph seem not very interesting. The F1 score is computed over a rather simplistic bag-of-tokens similarity between predictions and answers, and is not justified by the authors as the risk measure of choice here; moreover, a shift to alpha = 0.3 happens with the scant explanation that this is the best empirical choice such that almost all answers are typically correct. Recognizing that this is just a toy example to support the validity of the proposed method, I would still have liked to see a somewhat deeper discussion of what monotonic risks one could/should use when dealing with natural language; this would be very useful in the context of recent developments in LLMs."
                },
                "questions": {
                    "value": "As stated above, I would like to see an experimental comparison to other methods offering guarantees on generalized risks; in particular Learn-then-Test."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission1833/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission1833/Reviewer_pT4W",
                        "ICLR.cc/2024/Conference/Submission1833/Senior_Area_Chairs"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission1833/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698839682198,
            "cdate": 1698839682198,
            "tmdate": 1700594962048,
            "mdate": 1700594962048,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "zXlwTGJgFj",
                "forum": "33XGfHLtZg",
                "replyto": "b6iBTvRl7J",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1833/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1833/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "We thank the reviewer for their careful review and thoughtful comments. We provide answers to specific questions and remarks (quoted) below.\n\n> ...establish good empirical performance of conformal risk prediction relative to Learn-then-Test, which appears both very tractable just as the proposed framework here, but also handles arbitrary losses... it should be easy to make this comparison quite direct, from a practical standpoint.\n\nThank you for your suggestion; please cross-reference the [main response comment](https://openreview.net/forum?id=33XGfHLtZg&noteId=Y1zeKwutId). We took this comment quite seriously and added a new subsection to the paper on this comparison, as well as a new experiment showing substantial practical advantages to our approach; see Appendix B. The practical gains are _massive_ compared to RCPS/LTT.\n\n> As a very minor point, the experiment on F1 score control in open-domain question answering, in contrast to other experiments in this paper, seems less useful and set up in a somewhat stylized way that doesn't seem to aim to capture any of the linguistic difficulties in tackling open domain question-answering --- which makes the plotted performance graph seem not very interesting...\n\nWe tend to agree that the F1 score that we compute for open-domain QA is simplistic, though it is a common metric in the QA literature (see, e.g., Table 3.7 in the GPT-3 paper, and the definition of F1 evaluation in the popular SQuAD dataset); which is the reason for why we use it. That said, we note that many other metrics relevant to natural language are possible to use instead of F1 similarly. These include things like BERTScore, or the output of a Bradley-Terry style reward model trained from human feedback, as is commonly used in RLHF. Unfortunately, translating from such real-valued scores to what constitutes a desirable target risk score is less intuitive than things like false negative rate, however, and typically requires domain expertise getting a feel for the perceived \"quality\". Alternatively, we can also directly use human ratings based on Likert scales, though these are more expensive to annotate on a calibration set."
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1833/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700519819666,
                "cdate": 1700519819666,
                "tmdate": 1700519819666,
                "mdate": 1700519819666,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "KPj7XWILbY",
                "forum": "33XGfHLtZg",
                "replyto": "zXlwTGJgFj",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1833/Reviewer_pT4W"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1833/Reviewer_pT4W"
                ],
                "content": {
                    "title": {
                        "value": "Response to Authors"
                    },
                    "comment": {
                        "value": "Thank you to the authors for their effort in addressing all reviewers in this thread, including my concerns. I appreciated both the clarifying and the substantive changes to the manuscript, which are quite extensive and will no doubt be useful to future readers. Importantly, the main concern of lacking comparison to LTT has been addressed; having further experiments on that front would be even better, but the added one does convey the point that LTT may give much less tight practical performance with respect to the expected coverage metric. (As a side note here, of course I do concur with the conceptual points relating to the fact that the PAC-style and the expectation guarantees are mathematically different objects, and that the present paper is a much more direct extension to the core conformal theory, but to me the main differentiator between the methods is precisely the practical performance for various monotonic risks --- especially since from a practitioner's perspective, both methods provide guarantees that have very similar verbal descriptions.)\n\nGiven the nice responses to the raised issues, I continue to support the present paper towards acceptance, and raise my score to 8."
                    }
                },
                "number": 11,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1833/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700594912793,
                "cdate": 1700594912793,
                "tmdate": 1700594912793,
                "mdate": 1700594912793,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "Zp7qxrwqnq",
            "forum": "33XGfHLtZg",
            "replyto": "33XGfHLtZg",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission1833/Reviewer_nYbV"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission1833/Reviewer_nYbV"
            ],
            "content": {
                "summary": {
                    "value": "This work generalizes the conformal prediction guarantees for coverage to controlling the risk of general monotone (or near monotone) losses, validating the proposed method on various real-life examples."
                },
                "soundness": {
                    "value": "4 excellent"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "4 excellent"
                },
                "strengths": {
                    "value": "I think this is an exciting work with many strengths\n- Method: generalize the CP method to arbitrary monotone loss functions, with extensions & modifications in distributional shift, controlling risk of multiple tasks, adversarial risks, etc.\n- Theory: provide the guarantee for the proposed method, and demonstrating the need for monotone functions (Proposition 2) and how to monotonie loss functions (Corollary 1) for the same guarantee\n- Experiment: provide extensive and useful illustration of the method in various tasks."
                },
                "weaknesses": {
                    "value": "I think the only weaknesses lie in the experimental comparison.\n1. In all examples presented in section 3, the authors only show the satisfactory performance of the proposed method. No comparison against other baselines is provided. If this is due to a lack of existing methods for similar tasks, it would be helpful to highlight this, explain why this is the case, and include doing so as future directions.\n2. For tasks mentioned in the extensions, it would be helpful to also illustrate the effectiveness of the proposed method on a subset of them."
                },
                "questions": {
                    "value": "What are limitations and future directions? It would be helpful to discuss these in the conclusion as well."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission1833/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699033922275,
            "cdate": 1699033922275,
            "tmdate": 1699636112923,
            "mdate": 1699636112923,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "bnheYlX0vK",
                "forum": "33XGfHLtZg",
                "replyto": "Zp7qxrwqnq",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1833/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1833/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "We thank the reviewer for their careful review and thoughtful comments. We provide answers to specific questions and remarks (quoted) below.\n\n> In all examples presented in section 3, the authors only show the satisfactory performance of the proposed method. No comparison against other baselines is provided. If this is due to a lack of existing methods for similar tasks, it would be helpful to highlight this, explain why this is the case, and include doing so as future directions.\n\nThank you for the good point; we have used this as an opportunity to implement a comparison to LTT/RCPS [1,2], which are high-probability versions of our technique. See the [main response comment](https://openreview.net/forum?id=33XGfHLtZg&noteId=Y1zeKwutId) for details.\n\nInitially, we had not included them because they will clearly be much more conservative than conformal risk control. However, we agree that it is good to understand the gains of our new procedure. We have made major efforts towards understanding this in the revision.\n\nIt is worth noting that no other existing methods provide guarantees of risk control in expectation. The main purpose of Section 3 is to demonstrate the flexibility and empirical effectiveness (i.e., validity and tightness) of the proposed algorithm as a tool for risk control, as there are no competing strategies. We have clarified this in the related work.\n\n> For tasks mentioned in the extensions, it would be helpful to also illustrate the effectiveness of the proposed method on a subset of them.\n\nAgreed; to deal with the space constraints, we have added an experiment on covariate shift to Appendix D. It includes estimated covariate weights.\n\n> What are limitations and future directions? It would be helpful to discuss these in the conclusion as well.\n\nWe have added a section on the limitations of our work in the discussion; it is copied below for convenience.\n\nThis generalization of conformal prediction broadens its scope to new applications, as shown in Section 3. Still, two primary limitations of our technique remain: firstly, the requirement of a monotone loss is difficult to lift. Secondly, extensions to non-exchangeable data require knowledge about the form of the shift. This issue affects most statistical methods, including standard conformal prediction, and ours is no different in this regard. Finally, the mathematical tools developed in Sections 2 and 3 may be of independent technical interest, as they provide a new, and more general, language for studying conformal prediction, along with new results about its validity.\n\n[1] Angelopoulos, A. N., Bates, S., Candès, E. J., Jordan, M. I., & Lei, L. (2021). Learn then test: Calibrating predictive algorithms to achieve risk control. arXiv preprint arXiv:2110.01052.\n\n[2] Bates, S., Angelopoulos, A., Lei, L., Malik, J., & Jordan, M. (2021). Distribution-free, risk-controlling prediction sets. Journal of the ACM (JACM), 68(6), 1-34.\n\n[3] Tibshirani, R. J., Foygel Barber, R., Candes, E., & Ramdas, A. (2019). Conformal prediction under covariate shift. Advances in neural information processing systems, 32."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1833/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700519655561,
                "cdate": 1700519655561,
                "tmdate": 1700519655561,
                "mdate": 1700519655561,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "9JbTGvQThc",
            "forum": "33XGfHLtZg",
            "replyto": "33XGfHLtZg",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission1833/Reviewer_TBcZ"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission1833/Reviewer_TBcZ"
            ],
            "content": {
                "summary": {
                    "value": "The paper extends conformal prediction to conformal risk control for any monotone loss function, which can be applied to different tasks more generally, such as token-level F1 scores. They also consider distribution shifts quantified by TV distribution distance and provide evaluations to validate the results."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. The research question is important for many perspectives, such as trustworthiness ML.\n2. The paper is comprehensive and includes multiple perspectives besides the main result, including distribution shifts and discussions of different types of losses."
                },
                "weaknesses": {
                    "value": "1. I suggest adding detailed discussions of differences to related work [1,2].\n\n[1] Learn then test: Calibrating predictive algorithms to achieve risk control. arXiv preprint arXiv:2110.01052, 2021\n\n[2]  Distribution-free, risk-controlling prediction sets. Journal of the ACM (JACM), 68(6):1–34, 2021\n\n2. The preview (sec 1.1) is clear, but theorem 1 is not well presented. $\\lambda_{\\text{max}}$ and $L_i$ are not defined or referred to in the context.\n\n3. It is interesting to discuss whether we can have inverse relations of theorem 1? Specifically, given a parameter $\\lambda$, can we inversely compute $\\alpha$ to control the risk of $\\lambda$?\n\nI'll raise the scores once the problems are well discussed."
                },
                "questions": {
                    "value": "Please refer to the weakness part."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission1833/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission1833/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission1833/Reviewer_TBcZ"
                    ]
                }
            },
            "number": 5,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission1833/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699398056570,
            "cdate": 1699398056570,
            "tmdate": 1700693172469,
            "mdate": 1700693172469,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "7cloHQVjk9",
                "forum": "33XGfHLtZg",
                "replyto": "9JbTGvQThc",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1833/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1833/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "We thank the reviewer for their careful review and thoughtful comments. We provide answers to specific questions and remarks (quoted) below.\n\n> I suggest adding detailed discussions of differences to related work [1,2].\n\nThank you for your suggestion; please cross-reference the [main response comment](https://openreview.net/forum?id=33XGfHLtZg&noteId=Y1zeKwutId). We took this comment quite seriously and added a new subsection to the paper on this comparison, as well as a new experiment showing the advantages of our approach. The edits are extensive and we hope they satisfy your concern.\n\n> Theorem 1 is not well presented.\n\nWe appreciate the comment. We have defined $\\lambda_{\\mathrm{max}}$ and $L_i$ in the theorem for the purpose of clarity and rigor, so a reader can understand the result without having to comb through surrounding text. Hopefully this addresses your concern.\n\n> It is interesting to discuss whether we can have inverse relations of Theorem 1?\n\nWhile we cannot bound $\\mathbb{E}[L_{n+1}(\\lambda)]$ directly, we can give a probabilistic bound. For example, given a fixed $\\lambda$, we can show that $\\mathbb{P}(L_{n+1}(\\lambda) \\leq \\mathrm{Quantile}(1 - \\delta, \\{L_1(\\lambda), \\ldots, L_{n}(\\lambda), B\\}) \\geq 1 - \\delta$. The proof is analogous to that of standard conformal prediction.\n\nEstimating risk functions like $E[L_{n+1}(\\lambda)]$ is a well-studied problem in the area of empirical process theory. It is well-known to be an intrinsically $1/\\sqrt{n}$ problem (by the Central Limit Theorem, for example), and can be addressed by various concentration inequalities, but not by any conformal method, because they do not estimate population parameters of the data distribution."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1833/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700519366726,
                "cdate": 1700519366726,
                "tmdate": 1700519366726,
                "mdate": 1700519366726,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "mA1b4NfEHW",
                "forum": "33XGfHLtZg",
                "replyto": "9JbTGvQThc",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1833/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1833/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Discussion?"
                    },
                    "comment": {
                        "value": "We are hoping to have a discussion today before the deadline passes. Have we addressed your comments? \n\nThank you again for the review."
                    }
                },
                "number": 13,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1833/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700685483436,
                "cdate": 1700685483436,
                "tmdate": 1700685483436,
                "mdate": 1700685483436,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "kN8mYRGK3P",
                "forum": "33XGfHLtZg",
                "replyto": "9JbTGvQThc",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1833/Reviewer_TBcZ"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1833/Reviewer_TBcZ"
                ],
                "content": {
                    "title": {
                        "value": "Reviewer response"
                    },
                    "comment": {
                        "value": "Thank you for the clarifications. My concerns are addressed. I raised my score to 6."
                    }
                },
                "number": 15,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1833/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700693160176,
                "cdate": 1700693160176,
                "tmdate": 1700693160176,
                "mdate": 1700693160176,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "vU2BWllA6F",
            "forum": "33XGfHLtZg",
            "replyto": "33XGfHLtZg",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission1833/Reviewer_tJUM"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission1833/Reviewer_tJUM"
            ],
            "content": {
                "summary": {
                    "value": "The paper extends CP coverage guarantees to risk upper bounds. Under the assumption that the risk function is monotone, the authors derive a finite-sample and distribution-free bound on the risk expectation. Extensions and applications of the idea are also provided."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "Extending the finite-sample and distribution-free coverage guarantees of CP to more general risk minimization problems may have a great practical impact. The experiments section contains a nice series of practical applications. I appreciate the authors included a full proof in the main text."
                },
                "weaknesses": {
                    "value": "The relevance and novelty of the theoretical parts may be stated better in the introduction. The authors should \n- clarify why obtaining expectation-based bounds is more challenging than applying existing risk-control algorithms, e.g. the\nhypothesis testing strategy of [1], and \n- specify what is different and what is taken from other works, e.g. some of the definitions are similar to [1], where the setup is slightly different.\n\nUnder the monotonicity assumption, Theorem 1 seems to be a straightforward reformulation of the standard validity proof for CP prediction intervals. Indeed, Section 4.2 outlines a much simpler formulation of the proposed algorithm. The authors may consider moving and discussing that section before Theorem 1 and adding a practical example where Theorem 1 is needed."
                },
                "questions": {
                    "value": "- The algorithm's main parameter, $\\lambda$, is introduced in an example. It would be better to have a formal definition of it.\n- A motivation is mentioned at the end of page 2: \"it is generally impossible to recast risk control as coverage control\". The statement is not proven or supported by examples. \n- Why does $R_n$ carrry an index? Are $R_1, ..., R_{n-1}$ used anywehere? This seems similar to [1], where the index refers to a specific value of $\\lambda$.\n- Can $R(\\lambda)$ be interpreted as a parameterized conformity score and $\\lambda$ as the quantile of the corresponding empirical distribution?\n- [1] addresses the case of non-monotonic risks. How is this compatible with Proposition 2?\n- Does the method apply to the outputs of a regression model?\n- Are the extensions of Section 4 straightforward consequences of Theorem 1 and existing CP theory? \n\n[1]\n\"Learn then Test: Calibrating predictive algorithms to achieve risk control\"."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "details_of_ethics_concerns": {
                    "value": "NA"
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission1833/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission1833/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission1833/Reviewer_tJUM"
                    ]
                }
            },
            "number": 6,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission1833/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699440083763,
            "cdate": 1699440083763,
            "tmdate": 1700735443975,
            "mdate": 1700735443975,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "v8EeQMHCM1",
                "forum": "33XGfHLtZg",
                "replyto": "vU2BWllA6F",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1833/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1833/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "We thank the reviewer for their careful review and thoughtful comments. We provide answers to specific questions and remarks (quoted) below.\n\n> clarify why obtaining expectation-based bounds is more challenging than applying risk-control algorithms, e.g. [1].\n\nPlease cross-reference the [main response comment](https://openreview.net/forum?id=33XGfHLtZg&noteId=Y1zeKwutId) for a detailed comparison of our approach against [1,2].\n\nThe expectation bounds in this paper are a novel and direct contribution to the theory of conformal prediction. From that perspective, we believe they are valuable. The high-probability bounds of [1]  rely on extensive existing theory for deriving concentration bounds (e.g. the Hoeffding bound). Our manuscript *contributes more directly to the theoretical foundations of conformal prediction* than [1,2], which are applications of empirical process theory/multiple testing and not standard conformal prediction.\n\n> Compare to other works; clarify similarity of setup to [1]\n\nSee the [main response comment](https://openreview.net/forum?id=33XGfHLtZg&noteId=Y1zeKwutId) and edits to related work Basically, the setups are almost the same, but the algorithms and theory are entirely different and the proofs are mathematically unrelated.\n\n> Theorem 1 seems to be a straightforward reformulation of the standard validity proof for CP prediction intervals.\n\n**Theorem 1 is not a reformulation of the validity theorem of conformal prediction, and the extension of conformal prediction to this setting is mathematically nontrivial.** Our algorithm handles a strictly larger class of problems. When the loss function is binary, it reduces exactly to conformal prediction; see Appendix A for a detailed explanation.\n\nIn the writing of the proof of Theorem 1, highlighted the similarities to the original conformal validity proof for pedagogical reasons; however, **this proof is not the same as the standard proof of conformal prediction’s validity involving score functions**.  For non-binary loss functions, **no score function exists**; hence the standard proof is inapplicable.\n\n> “Impossible to recast risk control as coverage control.” The statement is not proven or supported by examples.\n\nThank you for raising the point. **All examples in Sec. 3 are impossible to equivalently cast in terms of coverage control.**\n\nIt is not hard to see that risk control is not the same as coverage control. Comparing the form of equations (2) and (1),  if you take $\\ell$ to be any non-indicator function, (2) cannot be rewritten in the same form as (1). This is because (1) measures the probability of a miscoverage event, and when $\\ell$ is not an indicator, there is no such event to measure.\n\nHowever, (2) recovers (1) in the case of a binary loss (see intro+Appendix A).\n\n> Why does $\\hat{R}_n$ carry an index?\n\n$\\hat{R}_n = \\frac{1}{n}(L_1 + \\ldots + L_n)$ is a standard notation from empirical process theory for an empirical risk on $n$ points ($L_1, \\ldots, L_n$).\n\n> Can $R(\\lambda)$ be interpreted as a parameterized conformity score and $\\hat{\\lambda}$ as the quantile of the corresponding distribution?\n\nGood question; no, it cannot. The conformal score only exists for binary losses.\n\nIf $L_i$  is binary, the conformity score can be equivalently expressed as a discontinuity in the indicator function, $s_i = \\inf \\{ \\lambda : L_i(\\lambda)  = 0 \\}$. In that case, $\\hat{\\lambda}$ is the standard conformal quantile, as in Appendix A. In this setup, $R(\\lambda)$ can be interpreted as the empirical miscoverage when sets are constructed using parameter $\\lambda$. \n\nHowever, when $\\ell$ is not an indicator function, the conformity score can no longer be defined at all, and this correspondence ceases to exist. To see this, suppose there is a conformity score; then the corresponding loss function has at most one turning point at the threshold of the conformity score. Clearly, this does not hold for general monotone loss functions. \n\n> [1] addresses the case of non-monotonic risks. How is this compatible with Proposition 2?\n\nProposition 2 does not apply to the algorithm in [1], which is different (much more conservative and complicated) and applies to non-monotonic risks. See the [main response comment](https://openreview.net/forum?id=33XGfHLtZg&noteId=Y1zeKwutId) for a full comparison of these algorithms.\n\n> Does the method apply to the outputs of a regression model?\n\nCertainly! See Appendix D.\n\n> Are the extensions of Section 4 straightforward consequences of Theorem 1 and existing CP theory?\n\nNone of the extensions in Section 4 are literally corollaries of existing results + Theorem 1. Some are straightforward to an expert, and some are not.\n \nMost of the results in Section 4 follow by arguing that some modified loss function satisfies the conditions required for Theorem 1 to hold. Propositions 4 and 8, however, use different proof techniques. Of all the propositions, we believe that 4 and 8 are the least straightforward."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1833/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700519220978,
                "cdate": 1700519220978,
                "tmdate": 1700519220978,
                "mdate": 1700519220978,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "2K8VxUZxy7",
                "forum": "33XGfHLtZg",
                "replyto": "vU2BWllA6F",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1833/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1833/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Discussion?"
                    },
                    "comment": {
                        "value": "We are hoping to have a discussion today before the deadline passes. Have we addressed your comments?\n\nThank you again for the review."
                    }
                },
                "number": 12,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1833/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700685463698,
                "cdate": 1700685463698,
                "tmdate": 1700685463698,
                "mdate": 1700685463698,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "8sRb4W6HCo",
                "forum": "33XGfHLtZg",
                "replyto": "2K8VxUZxy7",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1833/Reviewer_tJUM"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1833/Reviewer_tJUM"
                ],
                "content": {
                    "title": {
                        "value": "Thank you for your answers"
                    },
                    "comment": {
                        "value": "Thank you for the detailed answers and explanations. I raised my score to 6. What do you mean by \"the corresponding loss function has at most one turning point at the threshold of the conformity score\"?"
                    }
                },
                "number": 16,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1833/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700736585742,
                "cdate": 1700736585742,
                "tmdate": 1700736585742,
                "mdate": 1700736585742,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]