[
    {
        "title": "Step-Back Prompting Enables Reasoning Via Abstraction in Large Language Models"
    },
    {
        "review": {
            "id": "VFEhG6sCIW",
            "forum": "3bq3jsvcQ1",
            "replyto": "3bq3jsvcQ1",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission2214/Reviewer_XiDg"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission2214/Reviewer_XiDg"
            ],
            "content": {
                "summary": {
                    "value": "The authors introduce a new form of guided prompting for Q&A settings in which a model 1) *Abstracts* (takes a step back) the key concepts relevant to answering a given question and then 2) *Reasons* by using the Step-back answer in conjunction with the original question to produce a final answer. The authors demonstrate the efficacy of this method other other multi-shot (In-context learning) prompting schemes and Chain-of-Though (CoT) reasoning with PaLM-2L on various datasets. They also compare against vanilla GPT-4."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "The methodology is conceptually very clearly explained and motivated. The experiments are extensive, and some useful ablations are carried out. Besides a few points raised below, there is little to critique from the standpoint of methodology or presentation. \n\nThe method itself appears to be quite effective, at least for PaLM-2L. It is simple and novel enough to warrant dissemination, given that there is precedent for the publication of prompting methodologies at top-tier conferences (to offer no comment on the scientific merits of this)."
                },
                "weaknesses": {
                    "value": "One consistent issue with the paper is the use of incorrect grammar (plurals, subject references etc.) - this issue should be easily remedied through the use of grammar checkers (e.g. Grammarly) or native proof-reading. Notably, in spite of the somewhat jarring errors in English grammar, the sentences are well-structured and the paper has a clear narrative, such that it remains easily comprehensible.\n\nOn a related note, the authors consistently use the terms \"learn\" and \"teach\" in relation to the step-back question, and the knowledge it provides. This is somewhat confusing, as I don't think any models are fine-tuned etc. to provide this knowledge. Whilst I realise that few-shot prompting is referred to as \"in-context *learning*\", I would recommend steering clear of this language unless you perform actual updates to the model weights at some stage of the Step-Back Prompting process.\n\nThere are two potential methodological weaknesses, which may in fact reflect a misunderstanding on the part of the reviewer.\n1) *Baselines might lack useful conditioning in the prompt*. In particular, in section D.2 you state that the baseline prompts only take the question and initial query, whereas Table 11 shows that Step-Back prompting includes the lines e.g. \"You are an expert at Physics. You are given a Physics problem\". If these are not included in the baseline, then this would appear to be an unfair comparison. Table 15 suggests that the baseline may actually have this information too, so perhaps this is not a concern and section D.2 just omitted this detail. \n2) The fact that the methodology is evaluated only on PaLM-2L. I appreciate that GPT-4 calls are not cheap, and Figure 1. provides some evidence for the consistent behaviour of GPT-4 and PaLM-2L. Nonetheless, it is conceivable that this method would not work equally well on other models, and this concern has not been ruled out by the existing experiments."
                },
                "questions": {
                    "value": "Three other things that bear clarifying:\n1) How many exemplars are provided for the standard Step-Back experiments (those shown in table 1 etc.). Ablations in Figure 3. suggest it doesn't matter too much, but it would be good to be clear (from Figure 3 one might infer 1 or 5 exemplars are provided, and of course 5 would seem unfair to the baselines)\n2) The fact that the step-back question is not generic, but rather already conditions on the context of the dataset (e.g. \"What are the physical principles\") is worth making more explicit in the methodology. (On a side-note, It would also be interesting to know how a generic prompt such as \"Abstract the general principles relevant to this query\" would have worked)\n3) Why was Step-Back prompting not attempted on GPT-4?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "details_of_ethics_concerns": {
                    "value": "None of note"
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission2214/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission2214/Reviewer_XiDg",
                        "ICLR.cc/2024/Conference/Submission2214/Senior_Area_Chairs"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission2214/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698653277710,
            "cdate": 1698653277710,
            "tmdate": 1700642923234,
            "mdate": 1700642923234,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "HS9qIIWXa9",
                "forum": "3bq3jsvcQ1",
                "replyto": "VFEhG6sCIW",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2214/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2214/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Official response to Reviewer XiDg"
                    },
                    "comment": {
                        "value": "Dear Reviewer XiDg,\n\nWe sincerely appreciate your comments and feedback which helps to improve our paper. We are grateful for your recommendation to accept our paper! We hope our replies and revisions effectively address your concerns, and please feel free to let us know if you have any further concerns or questions.\n\nBelow are our details replies to your comments:\n\n=================================================================  \n*One consistent issue with the paper is the use of incorrect grammar (plurals, subject references etc.) - this issue should be easily remedied through the use of grammar checkers (e.g. Grammarly) or native proof-reading. Notably, ..., the sentences are well-structured and the paper has a clear narrative, such that it remains easily comprehensible.*\n\nA: Thanks for the feedback. We have done a thorough grammar and fluency check, and updated the paper accordingly. We appreciate the positive feedback that the paper is “well-structured”, and “easily comprehensible”.\n\n=================================================================  \n*On a related note, the authors consistently use the terms \"learn\" and \"teach\" in relation to the step-back question, and the knowledge it provides. This is somewhat confusing, as I don't think any models are fine-tuned etc. to provide this knowledge. Whilst I realise that few-shot prompting is referred to as \"in-context learning\", I would recommend steering clear of this language unless you perform actual updates to the model weights at some stage of the Step-Back Prompting process.*\n\nA: Thanks for the feedback, and you are right that no model is fine-tuned. We have updated the paper to stick with the terminology of \"in-context learning\" for the term \"learn\", and have replaced the term \"teach\" to \"demonstrate\".\n\n=================================================================  \n*Baselines might lack useful conditioning in the prompt. In particular, in section D.2 you state that the baseline prompts only take the question and initial query, whereas Table 11 shows that Step-Back prompting includes the lines e.g. \"You are an expert at Physics. You are given a Physics problem\". If these are not included in the baseline, then this would appear to be an unfair comparison. Table 15 suggests that the baseline may actually have this information too, so perhaps this is not a concern and section D.2 just omitted this detail.*\n\nA: Thanks for the feedback, and yes, you were correct that we used the same prompting. To make it clear we updated section D.2 to reflect the point that all baselines share the same prompting preamble “You are an expert at Physics. You are given a Physics problem”.\n\n=================================================================   \n*The fact that the methodology is evaluated only on PaLM-2L. I appreciate that GPT-4 calls are not cheap, and Figure 1. provides some evidence for the consistent behaviour of GPT-4 and PaLM-2L. Nonetheless, it is conceivable that this method would not work equally well on other models, and this concern has not been ruled out by the existing experiments.*\n\nA: Thanks for the suggestion, we included additional experiments using Llama2-70B and GPT-4 in the updated paper and observed that step-back prompting continues to be competitive against all baseline methods. This demonstrates that our proposed method is model agnostic.\n\n=================================================================  \n*How many exemplars are provided for the standard Step-Back experiments (those shown in table 1 etc.). Ablations in Figure 3. suggest it doesn't matter too much, but it would be good to be clear (from Figure 3 one might infer 1 or 5 exemplars are provided, and of course 5 would seem unfair to the baselines)*\n\nA: Thank you for pointing out the potential confusion. We used 1 exemplar for the results throughout the paper, and we explicitly stated this in the updated paper Section 4.3: “Therefore, we use a single exemplar for few-shot prompting throughout the paper except the ablation studies.”\n\n=================================================================  \n*The fact that the step-back question is not generic, but rather already conditions on the context of the dataset (e.g. \"What are the physical principles\") is worth making more explicit in the methodology. (On a side-note, It would also be interesting to know how a generic prompt such as \"Abstract the general principles relevant to this query\" would have worked)*\n\nA: Thank you for the feedback, and we updated the paper to explicitly state that the step-back question is unique to the task by design in Section 2.\n\nRegarding the point of using a generic prompt, we note that while such a prompt can be helpful for tasks in MMLU, it won’t be applicable to other benchmarks such as TimeQA. For example, a general question of \"Abstract the general principles relevant to this query\" would not help “Estella Leopold went to which school between Aug 1954 and Nov 1954?\""
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2214/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700598586879,
                "cdate": 1700598586879,
                "tmdate": 1700598586879,
                "mdate": 1700598586879,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "GV7U9T3yyc",
                "forum": "3bq3jsvcQ1",
                "replyto": "HS9qIIWXa9",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2214/Reviewer_XiDg"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2214/Reviewer_XiDg"
                ],
                "content": {
                    "title": {
                        "value": "Response to Clarification and Changes"
                    },
                    "comment": {
                        "value": "Thank you for your detailed response and clarifications. With the addition of the experiments on Llama2-70B, and clarification on the fairness of the prompting in Section D.2, I am now much more convinced that the methodology's effectiveness is sufficiently substantiated to warrant dissemination.\n\nAdditionally, the paper reads more fluidly now, though there are still instances of grammatical issues (below two randomly chosen examples) - but these are much less jarring than before and do not hamper the flow of reading. As such, I would say that the paper is sufficiently well-written to meet the standards of publication in Machine Learning. \n\nI have updated my scores accordingly.\n\nExamples of common mistakes:\n* \"The first step is to show LLMs how to step back in-context learning, and **add:to** derive high-level abstractions such as concepts and principles from the specific example\" this is a problematic sentence because there are multiple subjects and actions, and it is not clear which is being referred to at varying points. For example, is \"deriving high-level abstractions...\" part of \"the first step\" or is it part of what we are showing LLMs by using in-conext learning? Also, which example is *\"the\"* specific example? We haven't explicitly referred to an example, so this should be \"a given example\" etc.. Incorporating these changes would yield a sentence more like \"The first step is to show LLMs how to take a step-back by using in-context learning - prompting them to derive high-level abstractions and principles for a given example\"\n* \"We conduct a variety of analysis **(analyses)** and find that STEP-BACK PROMPTING has **(provides)** strong performance\nimprovements (up to 36%) over chain of thought (CoT) prompting (Wei et al., 2022b) and **(\")**take a\ndeep breathe**(\")** (TDB) prompting (Yang et al., 2023)\"\n\nAs you can tell these are fairly pedantic corrections - I just wanted to provide some illustrative examples of minor errors that many authors make; crucially, these don't significantly impact readability in most places though."
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2214/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700642898937,
                "cdate": 1700642898937,
                "tmdate": 1700642898937,
                "mdate": 1700642898937,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "jcTR8zciTF",
            "forum": "3bq3jsvcQ1",
            "replyto": "3bq3jsvcQ1",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission2214/Reviewer_FiKx"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission2214/Reviewer_FiKx"
            ],
            "content": {
                "summary": {
                    "value": "This work proposes step-back prompting, which prompts the LLM to ask a question about a higher-level concept/principles first. This works as a \"retrieval step\" which allows it to retrieve relevant facts on which the subsequent reasoning can be grounded. \n\nThe model shows good performance on a variety of knowledge-intensive tasks which are typically effectively tackled with RAG methods."
                },
                "soundness": {
                    "value": "4 excellent"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "4 excellent"
                },
                "strengths": {
                    "value": "The idea of ground reasoning on higher-level abstractions (abstracting away low-level details) is interesting as a principle. It is clear that this kid of reasoning strategy helps on knowledge-intensive tasks, where it helps to retrieve the high-level principles first before proceeding with reasoning."
                },
                "weaknesses": {
                    "value": "While the idea of reasoning from abstract to low level is interesting, the approach explored in the paper is arguably rudimentary - A generic question that asks for a higher-level abstraction only works as a byproduct of the fact that LLM already has near perfect knowledge of such concepts (In Fig 4. the low principle error points to this). \n\nWithout a further study of what the kind of abstractions LLM excels at and is still lacking in, my impression is that the method largely functions as better prompt for retrieving relevant facts for knowledge-based (mostly scientific) questions. In my view, the paper would benefit from broadening the exploration of abstraction upon a wider set of tasks."
                },
                "questions": {
                    "value": "1. Is it possible to extend the evaluated tasks to ones involving more broader cases of reasoning, such as GSM8k [1] or bAbi [2]?\nThat is, do tasks exist in which LLM can fail at deriving the higher-level principle?\n\n2. The paper mentions decomposed prompting in the relate works - It it possible to compare with any such methods other than CoT\n\n3. I'm also curious about the possibility of combining such methods with step-back prompting.\n\n4. Is it possible to study the effect of applying abstraction more than once or in a multi-step manner?\n\n\n\n[1] Training Verifiers to Solve Math Word Problems, Cobbe et al., arXiv, 2021\n[2] Towards ai-complete question answering: A set of prerequisite toy\ntasks. Weston et. al, ICLR, 2016."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "details_of_ethics_concerns": {
                    "value": "n/a"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission2214/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission2214/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission2214/Reviewer_FiKx"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission2214/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698856782598,
            "cdate": 1698856782598,
            "tmdate": 1700644802019,
            "mdate": 1700644802019,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "n6uTFJ8Urr",
                "forum": "3bq3jsvcQ1",
                "replyto": "jcTR8zciTF",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2214/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2214/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Office response to Reviewer FiKx"
                    },
                    "comment": {
                        "value": "Dear Reviewer FiKx,\n\nWe sincerely appreciate your comments and feedback which helps to improve our paper. We are grateful for your recommendation to accept our paper! We hope our replies and revisions effectively address your concerns, and please feel free to let us know if you have any further concerns or questions.\n\nBelow are our details replies to your comments:\n\n=================================================================  \n*Without a further study of what the kind of abstractions LLM excels at and is still lacking in, my impression is that the method largely functions as better prompt for retrieving relevant facts for knowledge-based (mostly scientific) questions. In my view, the paper would benefit from broadening the exploration of abstraction upon a wider set of tasks.*\n\nA: We explored a wide set of reasoning tasks in the paper: STEM, Knowledge QA, Multi-hop Reasoning covering 6 tasks. Nonetheless, we appreciate the suggestion of broadening the exploration of abstraction and have included additional experiments on the GSM8K benchmark, as suggested by the reviewer. \n\n=================================================================  \n*Is it possible to extend the evaluated tasks to ones involving more broader cases of reasoning, such as GSM8k or bAbi? That is, do tasks exist in which LLM can fail at deriving the higher-level principle?*\n\nA: Yes, we included additional experiments on GSM8K following the reviewer’s suggestion. For bAbi, we found that models such as GPT-4 have a nearly perfect accuracy (93.3% and 100% ,Tables 2-3 in [1]), and hence there is little headroom for evaluating new techniques on improving bAbi anymore.\n\nRegarding the failure mode of step-back prompting, yes, there do exist tasks in which LLMs can fail at deriving high-level principles and facts. We observe that step-back can have two failure modes discussed in Section 5.3: \n1. Step-back can fail at deriving the higher-level facts as shown in Figure 5. After step-back, there are still 45% errors due to failure to find the relevant higher-level facts. \n2. Even with the relevant facts retrieved after step-back, LLMs can still fail the task due to Reasoning errors as in Figure 5: 52% of errors are due to LLMs failing to reason through the facts retrieved from step-back.\n\n[1] GPT-3.5, GPT-4, or BARD? Evaluating LLMs Reasoning Ability in Zero-Shot Setting and Performance Boosting Through Prompts, Espejel, et al., arXiv, 2023\n\n=================================================================  \n*The paper mentions decomposed prompting in the relate works - Is it possible to compare with any such methods other than CoT. I'm also curious about the possibility of combining such methods with step-back prompting.*\n\nA: Thanks to the reviewer for the suggestion, we have reached out to the authors of the decomposed prompting to get clarification on how to reproduce their method. We will update the paper once we have a comparison with decomposed prompting.\n\nWe appreciate the interesting idea of combining step-back with decomposition, such as using decomposition to help answer the step-back question. We leave this for future explorations.\n\n=================================================================  \n*Is it possible to study the effect of applying abstraction more than once or in a multi-step manner?*\n\nA: We believe it is possible. However, in the tasks we studied, we didn’t find it necessary to do multi-step abstractions. Given the potential error compounding effect, doing multi-step step-back may not be helpful if the task complexity doesn’t necessarily require multi-step step-back."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2214/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700598128211,
                "cdate": 1700598128211,
                "tmdate": 1700598128211,
                "mdate": 1700598128211,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "uiHbcvhF1b",
                "forum": "3bq3jsvcQ1",
                "replyto": "n6uTFJ8Urr",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2214/Reviewer_FiKx"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2214/Reviewer_FiKx"
                ],
                "content": {
                    "comment": {
                        "value": "I appreciate the authors' response and additional experiments. With the additional results, my understanding is clearer that step-back prompting (abstraction to a higher-level principle) is orthogonal to step-by-step reasoning. I have raised my rating to accept.\nI hope the final version can discuss the differences and necessity of such disparate \"reasoning strategies\" induced by different prompting methods."
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2214/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700644813766,
                "cdate": 1700644813766,
                "tmdate": 1700644813766,
                "mdate": 1700644813766,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "asDSVymYhI",
            "forum": "3bq3jsvcQ1",
            "replyto": "3bq3jsvcQ1",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission2214/Reviewer_xaDx"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission2214/Reviewer_xaDx"
            ],
            "content": {
                "summary": {
                    "value": "This paper aims to improve the reasoning ability of large language models, especially for complex tasks that require a large amount of prior knowledge and details. The proposed step-back prompting, first asks a relevant high-level question (called stepback question) and then uses the answer for the following reasoning steps. This stepback question could remind LLM of some principles that are fundamental of the question, and thus improve the reasoning process. Extensive experiments are done on several benchmarks that demonstrate the effectiveness of the step-back prompting compared to the CoT baselines."
                },
                "soundness": {
                    "value": "4 excellent"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "- Step-back is a reasonable improvement over the existing LLM reasoning prompting strategy. It is especially helpful for tasks that need complex prior information to do reasoning, which broadens LLM's reasoning ability. \n\n- The step-back prompting approach is evaluated with extensive and complementary experiments.\n\n-  The proposed step-back prompting shows significant improvements over several variants of chain-of-thought, including the recent \"take a deep breath\" on several benchmarks."
                },
                "weaknesses": {
                    "value": "- The step-back prompting is only evaluated on Google's PaLM2. Though it shows significant improvements, it would be difficult for the community to reproduce the results. It would be great to evaluate the proposed prompting approach also on open source LLMs, such as LLaMA2-70B.\n\n-  The step-back question is pretty unique on each benchmark. It seems the specific stepback questions are designed for each benchmark. How to ensure the stepback questions is neat and how to design a perfect stepback question is not clear.\n\n- I feel the stepback question is a special case of the least to most prompting [1], which decomposes complex questions into subquestions and solves them order by order. The stepback questions can also be considered as a subquestion for the following reasoning steps. Can the author further clarify their difference from a principled perspective?\n\n[1] Least-to-Most Prompting Enables Complex Reasoning in Large Language Models, Zhou et al 2023"
                },
                "questions": {
                    "value": "Please refer to the previous section."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "details_of_ethics_concerns": {
                    "value": "n/a"
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission2214/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission2214/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission2214/Reviewer_xaDx"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission2214/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699180895223,
            "cdate": 1699180895223,
            "tmdate": 1699636155067,
            "mdate": 1699636155067,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "XIITXMVMdl",
                "forum": "3bq3jsvcQ1",
                "replyto": "asDSVymYhI",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2214/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2214/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Official response to Reviewer xaDx"
                    },
                    "comment": {
                        "value": "Dear Reviewer xaDx,\n\nWe sincerely appreciate your comments and feedback which helps to improve our paper. We are grateful for your recommendation to accept our paper! We hope our replies and revisions effectively address your concerns, and please feel free to let us know if you have any further concerns or questions.\n\nBelow are our detailed replies to your comments:\n\n=================================================================  \n*The step-back prompting is only evaluated on Google's PaLM2. Though it shows significant improvements, it would be difficult for the community to reproduce the results. It would be great to evaluate the proposed prompting approach also on open source LLMs, such as LLaMA2-70B.*\n\nA: We thank the reviewer for the suggestion, and include in the update paper additional experiments using LLaMA2-70B and GPT-4 on MMLU demonstrating the model-agonistic aspect of our proposed method.\n\n=================================================================  \n*The step-back question is pretty unique on each benchmark. It seems the specific stepback questions are designed for each benchmark. How to ensure the stepback questions is neat and how to design a perfect stepback question is not clear.*\n\nA: We appreciate your question of \"how to design a perfect stepback question\": it is indeed a very interesting question, as to what is the right abstraction for a particular task. In principle, there could be many ways to do abstraction. For the tasks studied in our papers, we didn’t find it challenging to come up with few-shot demonstrations and make the abstraction idea work.\n\nThe step-back question is unique by design in our paper to capture the uniqueness of each benchmark. One potential way of improving the generation of stepback questions could be building a specialized expert fine-tuned model. \n\n=================================================================  \n*I feel the stepback question is a special case of the least to most prompting [1], which decomposes complex questions into subquestions and solves them order by order. The stepback questions can also be considered as a subquestion for the following reasoning steps. Can the author further clarify their difference from a principled perspective?*\n\nA: While we agree with the reviewer that the stepback question might look similar to some of the sub questions generated in decomposition methods, here are the key differences: \n\n1. Step-back questions are abstract and higher level, which are different from least-to-most decompositions that are often low level breakdowns of the original question. \n2. Abstract questions are often generic in nature with a many-to-one mapping since many questions can have the same abstract questions. This is in contrast to decomposition where there is often a one-to-many mapping since there are multiple decomposed sub-problems necessary to solve a given question.\n3. Methodology wise, step-back prompting is following a different framework for problem-solving: abstracting to a higher-level to ground reasoning, rather than breaking the problem down into sub-problems in decomposition.\n\nTo clarify the differences, we included an illustration example and further explanations in Section 8.2 in the updated paper. We hope this helps clarify the confusion."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2214/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700597766013,
                "cdate": 1700597766013,
                "tmdate": 1700598199103,
                "mdate": 1700598199103,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "ORhAC0lior",
                "forum": "3bq3jsvcQ1",
                "replyto": "XIITXMVMdl",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2214/Reviewer_xaDx"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2214/Reviewer_xaDx"
                ],
                "content": {
                    "title": {
                        "value": "Post-rebuttal"
                    },
                    "comment": {
                        "value": "I appreciate the authors for the further discussion and new experiments in rebuttal. I believe having experiments on open-sourced LLM really benefits the community.  My initial review is high, so I'll just keep the score."
                    }
                },
                "number": 10,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2214/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700706622992,
                "cdate": 1700706622992,
                "tmdate": 1700706622992,
                "mdate": 1700706622992,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]