[
    {
        "title": "Decomposition Ascribed Synergistic Learning for Unified Image Restoration"
    },
    {
        "review": {
            "id": "5lbZbOqYuQ",
            "forum": "6W35Wcs077",
            "replyto": "6W35Wcs077",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7129/Reviewer_5Pyv"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7129/Reviewer_5Pyv"
            ],
            "content": {
                "summary": {
                    "value": "The paper introduces a new method called Decomposition Ascribed Synergistic Learning (DASL) for restoring multiple image degradations using a single model. DASL decomposes the image into singular vectors and singular values. The decomposition allows to learn the relationship between different restoration tasks and to optimize the degraded singular vectors and singular values. The method  comprises two operators: a Singular Vector Operator (SVEO) and Singular Value Operator (SVAO). The method can be integrated into existing convolutional image restoration models.  The idea is exemplified on on several image restoration tasks (image deraining, dehazing, denoising, deblurring, and low-light enhancement)."
                },
                "soundness": {
                    "value": "1 poor"
                },
                "presentation": {
                    "value": "1 poor"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "* The paper addresses an important problem: how to handle multiple image degradations with a single model.\n* The proposed ideas can be incorporated into existing convolutional models with minimal additional overhead."
                },
                "weaknesses": {
                    "value": "* The paper is poorly organized and presented.\n* The theoretical basis of the paper is unclear.\n* The experimental results are limited. In a practical setup, we observe a combination of degradations such as blur, noise, and compression (all together within the same observation). It is not clear how the decomposition works in this scenario (consider the degradation pipeline in RealESRGAN)."
                },
                "questions": {
                    "value": "In its current form, the presentation is poor, and the technical soundness and rigor are questionable. Many important aspects are left unanswered or poorly explained. The writing needs to be significantly improved before the paper can be fairly evaluated.\n\nHere are some specific comments:\n\n* The abstract mentions singular value decomposition (SVD) but does not explain what is the entity that its decomposed. The paper later reveals that SVD is used to represent the input image as a matrix.\n* The paper discusses Fourier analysis, but these concepts are not well-explained and their connection to what the authors are proposing is not clear.\n* Many sentences, paragraphs, and sections are difficult to understand. For example, the sentence \"Basically, one straightforward way to implement our idea is to directly perform the decomposition of latent high-dimensional tensor, and conduct the optimization of the decomposed singular vectors and singular value, respectively.\" is unclear and does not explain what the paper is proposing to do.\nSection 3.1, which is supposed to be an overview, is also unclear.\n* The first sentence of Section 3.2 states that \"The singular vector operator is proposed to optimize the degraded singular vectors of the latent representation.\" This sentence is unclear because it does not specify what element is being decomposed or what the latent representation is.\n* The experimental results do not address simultaneous degradations, such as blur + noise + compression. It is not clear how the model would perform in such cases. Additionally, many of the tested degradations are synthetically simulated.\n* Equation (1) does not define the variable W.\n* Equation (4) appears to be a reconstruction loss that enforces the decomposition of the clean image to be close to the decomposition of the degraded image. However, it is not clear if this is the case. Additionally, it is not clear how this equation would be different if Fourier decomposition were used instead of SVD.\n* The paper states that training is done for 1200 epochs. This is an unusually long training in epochs, and it is not clear why it is necessary. \n\nOverall, in its current form, its hard to fairly judge the paper contributions."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7129/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698445506985,
            "cdate": 1698445506985,
            "tmdate": 1699636843788,
            "mdate": 1699636843788,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "uGjLEr2TW8",
                "forum": "6W35Wcs077",
                "replyto": "5lbZbOqYuQ",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7129/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7129/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer 5Pyv"
                    },
                    "comment": {
                        "value": "Thank you so much for your valuable comments. Actually, the well presentation of the paper has been widely appreciated by other three reviewers, and the attractive and compelling insight has also been broadly acknowledged. We suggest the dear reviewer to reconsider the contribution of this paper. Your kind suggestions have been carefully incorporated in the revised version. In the following, we first revisit the main contribution of our paper and then followed by point-by-point responses, which hope address your concerns well.\n\n**Recall the main contribution of the paper.**\n\n[1] The observed SVD-ascribed degradation analysis presents that the decomposed singular vectors and singular values of the image naturally undertake the different types of degradation information, ascribing various restoration tasks into two groups, i.e., singular vector dominated degradations, such as *rain, noise, blur,* and singular value dominated degradations, such as *low-light, haze.*\n\n[2] The intention of the proposed DASL is to support the decomposed optimization of singular vectors and singular values of the degraded signal, through two developed operators, i.e., SVEO and SVAO. Note that both of them decently evade the explicit time-consuming SVD on signals. Therefore, the proposed DASL can achieve superior performance with even accelerated inference time, compared to baseline models (Tab. 5 of the paper).\n\n[3] SVEO only optimize the singular vectors of the signal without touching singular values. We perform this by the fact that the orthogonal matrices multiplication only impacts singular vectors (Theorem 1 in sec. 3.2).\n\n[4] SVAO only optimize the singular values of the signal which is decoupled from the optimization of singular vectors. We perform this by resort to the Fast fourier transform (FFT) as the transformed fourier coefficients undertake the same role as singular values in terms of signal formation principle, i.e., the combined coefficients for a set of basis (detailed in sec. 3.3). Note that FFT is substantially faster than SVD (516x), as shown in Tab. 1 of the paper.\n\nBriefly, the proposed decomposed optimization in DASL built upon SVD-ascribed degradation analysis could greatly benefit the multiple degradation processing within a single model, where the potential degradation relationship within ascribed groups and the conflict between groups could be inherently utilized and alleviated.\n\n**About SVD entity and how SVD represents the image.**\n\nThe proposed SVD-ascribed degradation analysis is performed in image space, namely, the decomposed singular vectors and singular values of the image naturally undertake the different types of degradation information.\nIn fact, SVD operation provides us $ X=U\\Sigma V^T $ for signal decomposition. In the opposite, we can also represent the original signal $X$ with decomposed singular vectors $U$, $V$, and singular values $\\Sigma$, which are two sides of SVD.\n\n**About Fourier analysis and how related to DASL.**\n\nThe fourier transform has been widely applied in image processing for a long term [1] and is also prevailing in existing low-level vision investigation [2], which is supposed to be common sense. Basically, fourier analysis transforms the signal to the frequency space through Discrete Fourier Transform (DFT), and reverses back to the spatial space through Inverse Discrete Fourier Transform (IDFT).\nThe most relevant form to our method, i.e., the Inverse Discrete Fourier Transform (IDFT) is presented in Eq. (3) of the paper, in comparison with the signal formation principle of SVD in Eq. 2, where both of them can be regarded as a weighted sum on a set of basis. And the transformed fourier coefficients $G(u, v)$ in Eq. (3) and decomposed singular values $\\sigma_{i}$ in Eq. 2 undertake the same role, i.e., the combined coefficients for the set of basis. Therefore, the unattainable singular value optimization can be translated to the accessible and efficient fourier coefficients optimization, which is the main idea behind the SVAO.\n\n[1] RC Gonzales, Digital image processing, Addison-Wesley Longman Publishing Co., Inc., 1987.\n\n[2] Fourmer: An Efficient Global Modeling Paradigm for Image Restoration, ICML, 2023."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7129/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700639563566,
                "cdate": 1700639563566,
                "tmdate": 1700639563566,
                "mdate": 1700639563566,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "tp15ylNWI0",
            "forum": "6W35Wcs077",
            "replyto": "6W35Wcs077",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7129/Reviewer_vj9U"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7129/Reviewer_vj9U"
            ],
            "content": {
                "summary": {
                    "value": "This paper mainly proposes Decomposition Ascribed Synergistic Learning (DASL) for multi-degradation removing task. This work conducts Singular Value Decomposition (SVD) to take different types of degradation information, such as rain, blur, noise, haze, and low-light. The proposed SVEO can optimize the degraded singular vectors of the latent representation, while another SVAO approximates inherently inaccessible singular values by moving to Inver Discrete Fourier Transform operation. With the proposed components, DASL outperformed state-of-the-art image restoration networks, in all-in-one manner."
                },
                "soundness": {
                    "value": "4 excellent"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "4 excellent"
                },
                "strengths": {
                    "value": "[S1] The motivation in the introduction is well-written and compelling. In particular, the visual results of SVD analysis are very intuitive. The observation of different properties depending on distortion types by employing SVD for solving multiple image restoration is interesting.\n\n[S2] The correct proof for Theorems, which underlies the proposed SVEO and SVAO, is thoroughly provided. It makes this paper both theoretically and empirically sound.\n\n[S3] The way to approximate the inaccessible singular values using IDFT is an interesting point. Thanks to moving to familiar Fourier domain, it becomes easier to optimize the networks in terms of both time complexity and network size.\n\n[S4] The developed decomposition loss is technically sound, which is empirically proven to be effective.\n\n[S5] Multi-degradation removal task is improved by the proposed DASL when compared to not only the baselines but also other SOTA methos. The performance gains are significant and can contribute to this domain."
                },
                "weaknesses": {
                    "value": "[W1] In some cases, such as MPRNet on deraining and DGUNet on deblurring/low-light enhancement, there are some inferiorities than baselines, while average scores show obvious performance gain on multiple tasks. If evaluation results on other benchmarks of the above tasks are provided and support the effectiveness of DASL, it will make this paper more compelling."
                },
                "questions": {
                    "value": "[Q1] Why did you define decomposition loss as Eq.(4)? I think the terms of this loss function can be divided into three terms like $\\lVert U_{rec} - U_{cle} \\rVert_1$ + $\\lVert V_{rec} - V_{cle} \\rVert_1$ + $\\lVert \\Sigma_{rec} - \\Sigma_{cle} \\rVert_1$. Is there any flaw in the above case, or did you conduct other experiments on decomposition loss variants?\n\n[Q2] In Tab.2, the baselines chosen are CNN-based models. However, other networks, such as SwinIR and Restormer, are Transformer-based methods. Could DASL mechanism be applied to Transformer-based image restoration methods? Or is it limited to only CNN-based model?\n\n[Q3] How could you get the results of other general image restoration methods presented in Tabs.2,3? Did you train all the models on multiple-degradation restoration settings? Or did you get them from other literatures?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7129/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698766066070,
            "cdate": 1698766066070,
            "tmdate": 1699636843664,
            "mdate": 1699636843664,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "1p2Vm3Q080",
                "forum": "6W35Wcs077",
                "replyto": "tp15ylNWI0",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7129/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7129/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer vj9U"
                    },
                    "comment": {
                        "value": "Thank you so much for your constructive comments and positive feedback, and we are really encouraged from that. Your suggestions have been carefully incorporated in the revised paper. In the following, we hope our point-by-point responses address your concerns well.\n\n**Performance on other benchmarks.**\n\nThanks for pointing that out. Basically, considering the decomposed optimization of DASL for respective singular vector/value dominated degradations, the optimal intra-group optimization pattern will be favored in developed operators, i.e., SVEO and SVAO, for overall performance improvement, which may slightly decline the baseline in few cases. \nTo further verify the effectiveness of DASL, we provide more comparison results of DASL integration and vanilla baselines below.\n|Method|Rain100L|BSD68|GoPro|SOTS|LOL|Average|Params|\n|:---|:---:|:---:|:---:|:---:|:---:|:---:|:---:|\n|NAFNet|\t35.56|\t31.02|\t26.53|\t25.23|\t20.49|\t27.76|\t17.11M|\n|MIRNetV2|\t33.89|\t30.97|\t26.30|\t24.03|\t21.52|\t27.34|\t5.86M|\n|DASL+NAFNet|\t35.92|\t31.27|\t26.92|\t25.50|\t20.63|\t28.05|\t16.84M|\n|DASL+MIRNetV2|\t33.98|\t31.16|\t26.52|\t24.29|\t21.64|\t27.52|\t5.71M|\n\nThe metric is reported as PSNR, where DASL brings consistent performance gain on all tasks with reduced model complexity, further validating the effectiveness of the proposed method.\n\n**Concern about the form of the decomposition loss.**\n\nWe present the comparison experiments below, where $L_{Tdec}$ denotes the above three terms formulation in [Q1], and $L_{dec}$ denotes the form of Eq. (4) in the paper.\n\n|Form|Rain100L|\tBSD68|\tGoPro|\tSOTS|\tLOL|\tAverage|\n|:---|:---:|:---:|:---:|:---:|:---:|:---:|\n|$L_{Tdec}$|\t32.35|\t29.46|\t25.03|\t23.88|\t19.77|\t26.10|\n|$L_{dec}$|\t38.02|\t31.57|\t26.91|\t25.82|\t20.96|\t28.66|\n\nExperimentally, $L_{dec}$ is more appealing than $L_{Tdec}$ for decomposition regularization. Particularly, considering that any signal can be regarded as a weighted sum on a set of basis from the SVD perspective, i.e., $ X=U\\Sigma V^T=\\sum_{i=1}^{k}\\sigma_{i}u_{i}v_{i}^T$. The SVD-ascribed degradation analysis proposed in DASL revealed that different types of degradation information primarily distribute in different portion of the signal, i.e., singular vectors (base components $\\cup_{i=1}^k\\\\{u_{i}v_{i}^T\\\\}$) and singular values (combined coefficients $\\cup_{i=1}^k\\\\{\\sigma_{i}\\\\}$). Therefore, the regularization on base components in forms of $L_{dec}$ is sufficient, as we merely concentrate on whether the corrupted based components have been recovered regardless of how it is composed. While $L_{Tdec}$ further delve into the base components is unnecessary which may harm the performance with undesirable strengthened regularization.\n\n**Could DASL be applied to transformer-based restoration methods.**\n\nWe present comparison results of DASL integration and baseline in transformer-based methods below, including SwinIR and Restormer.\n\n|Method| Rain100L|\tBSD68|\tGoPro|\tSOTS|\tLOL|\tAverage|\tParams|\n|:---|:---:|:---:|:---:|:---:|:---:|:---:|:---:|\n|SwinIR|\t30.78|\t30.59|\t24.52|\t21.50|\t17.81|\t25.04|\t0.91M|\n|Restormer|\t34.81|\t31.49|\t27.22|\t24.09|\t20.41|\t27.60|\t26.13M|\n|DASL+SwinIR|\t33.53|\t30.84|\t25.72|\t24.10|\t20.36|\t26.91|\t0.88M|\n|DASL+Restormer|\t35.79|\t31.67|\t27.35|\t25.90|\t21.39|\t28.42|\t15.06M|\n\nIt is worth noting that DASL is not only favorable for CNN-based models, but also applicable to transformer-based methods. The concerned architecture incompatibility problem is not come to be an obstacle. Note that we replace the projection layer at the end of the attention mechanism with developed decomposed operators for transformer-based methods. Thanks so much for pointing that out, which makes improvement to our paper.\n\n**How to get the results presented in Tabs.2, 3?**\n \nAll comparison methods in Tab. 2 have been retrained on the same mixed dataset as DASL with their default settings for fair comparison. Results in Tab. 3 are derived from the models in Tab. 2 by simply testing on image denoising datasets across different noise ratio.\n\nWe hope our response address your concerns well, and we are delightful to receive feedbacks if there exist any questions. \n\nThank you so much again for your precious time and valuable comments."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7129/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700639234614,
                "cdate": 1700639234614,
                "tmdate": 1700639234614,
                "mdate": 1700639234614,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "oDXGKaZ5yl",
                "forum": "6W35Wcs077",
                "replyto": "1p2Vm3Q080",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7129/Reviewer_vj9U"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7129/Reviewer_vj9U"
                ],
                "content": {
                    "title": {
                        "value": "comments for the author rebuttal"
                    },
                    "comment": {
                        "value": "The authors sincerely addressed my concerns. The supplemented experiments have shown significance of the proposed method. In particular, DASL+[NAFNet, MIRNetV2] notably improved the performance on every task. Furthermore, the proposed DASL could significantly enhance Transformer-based networks, which shows larger gains than those of CNN-based MPRNet, DGUNet, and AirNet. The result that the proposed DASL is not limited to CNN-based models but extended to recent Transformer-based methods makes this paper more effective. At last, the proposed loss function was demonstrated more sound than other design. I believe that the tables reported in this rebuttal must be included in the revised paper, which will make this paper more contribute to the research field.\n\nTherefore, I will maintain my first rating (8: accept, good paper), and thank for your magnificent research. Good luck."
                    }
                },
                "number": 8,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7129/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700641518898,
                "cdate": 1700641518898,
                "tmdate": 1700641518898,
                "mdate": 1700641518898,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "odpf3YgMlt",
            "forum": "6W35Wcs077",
            "replyto": "6W35Wcs077",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7129/Reviewer_Ym8K"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7129/Reviewer_Ym8K"
            ],
            "content": {
                "summary": {
                    "value": "In this paper, authors propose a novel multiple degradation restoration methods by exploiting the relationship between different degradations. Specifically, authors observe that the decomposed singular vectors and singular values naturally undertake the different types of degradation information, which dividing various restoration tasks into two groups, i.e., singular vector dominated and singular value dominated. Based on above observation,  the Decomposition Ascribed Synergistic Learning (DASL) is proposed to optimize aforementioned components and then integrate them into existing convolutional image restoration backbone to achieve image restorations. In the experimental part, the proposed method outperforms other baselines in both quantitative and qualitative comparisons, which verifies its effectiveness."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "There are several strengths here:\n\n1. The basic idea of the paper, i.e., leveraging the relationship between different degradations, is attractive and meaningful, which could give more insightful obversations from it.\n2. The observation of the paper is elegant and easy to follow, which may inspire other works.\n3. The paper is well-writing and origanized."
                },
                "weaknesses": {
                    "value": "There are several concerns here:\n\n1. As shown in Table 6, adopting different components, i.e., SVAO, SVEO and L_dec respectively, will benefit different restoration tasks. For instance, SVEO will boost the performance on deblurring and SVAO will boost the low-light enhancement. I am wondering the reason about it. It would be better to give more discussions about it. \n2. I am wondering the reason why the proposed DASL could reduce the computations of baseline model in Table 5. In the common sense, integrating extra modules into existing network would introduce extra computations. It would be better to give more details information about it.\n3. Will the proposed methods sensitive to the hyper-parameters, e.g., \\lambda_orth and \\lambda_dec, which will influence the reproducibility of the model? \n4. Partial figures are needed to be improved. For instance, unexpected lines are shown in the bottom of Figure 2. It would be better to improve the figures in the paper."
                },
                "questions": {
                    "value": "More detailed could be referred to Weakness."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "details_of_ethics_concerns": {
                    "value": "This paper is not related to the ethics concerns."
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission7129/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission7129/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission7129/Reviewer_Ym8K"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7129/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698770397687,
            "cdate": 1698770397687,
            "tmdate": 1701065579432,
            "mdate": 1701065579432,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "nsl8E8eFmk",
                "forum": "6W35Wcs077",
                "replyto": "odpf3YgMlt",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7129/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7129/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer Ym8K"
                    },
                    "comment": {
                        "value": "Thank you so much for your valuable comments and encouraging feedback, and we really appreciate that. Your suggestions have been carefully incorporated in the revised paper. In the following, we hope our point-by-point responses address your concerns well.\n\n**A Deeper understanding of SVEO and SVAO.**\n\nRecall that the SVD ascribed degradation analysis presents that the decomposed singular vectors and singular values naturally undertake the different types of degradation information. In this way, the intention of the proposed DASL is to support the decomposed optimization of singular vectors and singular values of the degraded signal, through developed operators, i.e., SVEO and SVAO. Particularly, SVEO merely optimizes singular vectors and is decoupled from the optimization of singular values, while SVAO operates in the opposite way. Without interference from the degradation-irrelevant portion of the signal, the decomposed operators, i.e., SVEO and SVAO, are capable of concentrating more on degradation processing, which interprets that SVEO is capable of boosting the performance on singular vector dominated degradations, including deblurring, and SVAO is capable of boosting the performance on singular value dominated degradations, including low-light image enhancement.\n\n>Tips: What the SVEO and SVAO truly focused on?\n\nIf we reexamine the singular vector dominated degradations, including *rain, noise, blur,* and singular value dominated degradations, including *hazy, low-light,* it can be conjectured that the singular vectors responsible for the spatial content information and texture details, and the singular values represent the global statistical properties of the image. The above conjecture can also be derived from the signal formation principle of SVD in theory, where singular vectors rerpesent the base components of the signal and singular values rerpesent the combined coefficients, as show in Eq. (2) of the paper.\nTherefore, SVEO is concentrated on the content corruption through the orthogonal regularized convolution for impacting singular vectors (Theorem 1 in sec. 3.2), while SVAO is concentrated on the global statistical corruption through approximated fourier coefficients for affecting singular values (homogeneous signal formation principle in sec. 3.3).  From this point, the decomposed operators are developed precisely for respective singular vector/value dominated degradations.\n\n\n**Why DASL could reduce the computations of baseline model?**\n\nThanks for your question. Actually, DASL replaces the basic calculation units of the baseline model with developed lightweight decomposed operators, instead of introducing extra modules into baseline model. Basically, we substitute half of the convolution layers in baseline model with SVEO, and only perform SVAO at the bottleneck layers of the backbone network, considering the global statistical properties of singular values and non-negligible overhead of Fast Fourier Transform (FFT). We present the integration layout of DASL in sec. 3.1, and the detailed unit reformulation strategy is provided in Appendix B.\n\n**Whether the proposed method sensitive to the hyper-parameters?**\n\nFaithfully, the proposed DASL is supposed to be sensitive to the involved two hyper-parameters, i.e., $\\lambda_{orth}$ and $\\lambda_{dec}$, due to the large number of $L_{orth}$ and $L_{dec}$. Concretely, $L_{orth}$ is related to tremendous network parameters for orthogonal regularization, and $L_{dec}$ is related to the decomposition space error, especially the huge discrepancy in singular values. \n\nWe present the ablation experiments for hyper-parameters $\\lambda_{orth}$ and $\\lambda_{dec}$ below. The metrics are reported on average of all tasks with MPRNet baseline.\n\n|$\\lambda_{orth}$|$\\lambda_{dec}$|PSNR|SSIM|\n|:---|:---:|:---:|:---:|\n|1e-3|0.1|27.93|0.884|\n|**1e-4**|**0.1**|**28.66**|**0.893**|\n|1e-5|0.1|28.24|0.889|\n|1e-4|1|28.56|0.892|\n|1e-4|0.01|28.32|0.890|\n\nNote that the default setting is marked in bold. We further present the ablation experiment of hyper-parameters with DGUNet baseline below.\n\n|$\\lambda_{orth}$|$\\lambda_{dec}$|PSNR|SSIM|\n|:---|:---:|:---:|:---:|\n|1e-3|\t0.1|\t28.06|\t0.885|\n|**1e-4**|\t**0.1**|**28.51**|**0.892**|\n|1e-5|\t0.1|\t28.28|\t0.888|\n|1e-4|\t1| 28.46|\t0.890|\n|1e-4|\t0.01|\t28.35|\t0.889|\n\nComfortingly, the hyper-parameters in DASL are agonistic to the baseline model, which exhibit the similar effect tendency as variation. Therefore, it is convenient to utilize the same hyper-parameter setting for various baseline models without cumbersome selection. And it is suggested that the DASL is best used with recommended hyper-parameters for promising performance. \n\nThanks so much for pointing this out.\n\nThe figure of the paper has been accordingly revised. We hope our response address your concerns well, and we are delightful to receive feedbacks if there exist any questions. \n\nThank you so much again for your time and constructive comments."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7129/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700638080465,
                "cdate": 1700638080465,
                "tmdate": 1700638080465,
                "mdate": 1700638080465,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "7i4gtWBw66",
            "forum": "6W35Wcs077",
            "replyto": "6W35Wcs077",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7129/Reviewer_4FV9"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7129/Reviewer_4FV9"
            ],
            "content": {
                "summary": {
                    "value": "This work proposes an interesting method for unified image restoration via SVD based on the observation that some degradations are related to SVD values and some are to SVD vectors. These observations led to the proposed DASL, with SVEO and SVAO. The proposed method was demonstrated in multiple image restoration tasks, yielding state-of-the-art performance."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "SVD based analysis for multiple degradations looks neat and novel.\nGreat performance in multiple image restoration is promising."
                },
                "weaknesses": {
                    "value": "SVD is known to be slow, so the practicality of the proposed method may not be strong. Computation time must be reported for fair comparisons in the benchmarks.\nAccording to the analysis, the dehaze does not seem to work well with singular values and vectors (see Fig 2 (a)). The degradation model using a linear SVD may be too simple to capture complex degradations that were not investigated in this work."
                },
                "questions": {
                    "value": "Q1. There are a number of works related to unified image restoration this year, but there was no discussion in terms of recent works as follows. Please discuss and clarify to ensure the novelty and superiority of the proposed method over them (I will not put any work from ICCV 2023 since it was after the submission, but comparing with CVPR 2023 works seems reasonable):\n- Z Yang et al., Visual Recognition-Driven Image Restoration for Multiple Degradation with Intrinsic Semantics Recovery, CVPR 2023\n- J Zhang et al., Ingredient-oriented Multi-Degradation Learning for Image Restoration, CVPR 2023\n- D Park et al., All-in-one Image Restoration for Unknown Degradations Using Adaptive Discriminative Filters for Specific Degradations, CVPR 2023\nIt will be great if the proposed method somehow outperform some of these, which will make this work stronger.\n\nQ2. In fact, SVD has been used in multiple image restoration works a long time ago, so relating the proposed method with them will be beneficial (and properly acknowledging them seems important).\n\nQ3. Please discuss the computation complexity and its practicality in terms of computation over other prior works. While employing SVD was an interesting idea, its practical computation issue may make this work obsolete.\n\nQ4. It is unclear if most degradations will fall into one of the two proposed methods - see Fig. 2(a) : dehaze yielded similar error for both singular vector and singular value, which may imply that the proposed method may not capture other degradations well including haze."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7129/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698842884755,
            "cdate": 1698842884755,
            "tmdate": 1699636843450,
            "mdate": 1699636843450,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "xDrDOjkq9s",
                "forum": "6W35Wcs077",
                "replyto": "7i4gtWBw66",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7129/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7129/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer 4FV9"
                    },
                    "comment": {
                        "value": "Thank you so much for your valuable comments, and we really appreciate that “SVD based analysis for multiple degradations looks neat and novel”. Your suggestions have been carefully incorporated in the revised paper. In the following, we hope our point-by-point responses address your concerns.\n\n**Computation complexity.** The intension of the proposed DASL is to utilize the property of “SVD based degradations analysis” without explicitly performing the time-consuming SVD. We present the computation overhead of the proposed DASL below, which is also provided in Tab. 5 of the paper. Note that DASL achieves advanced performance compared to incorporated baselines with considerable inference acceleration, e.g.12.86% accelerated on MPRNet and 58.61% accelerated on AirNet. \n|Method|Params (M)|FLOPs (B)|Inference Time (s)|\n|:---|:---:|:---:|:---:|\n| MPRNet | 15.74 / 15.15 | 5575.32 / 2905.14 | 0.241 / 0.210|\n|DGUNet|17.33 / 16.92| 3463.66 / 3020.22 |0.397 / 0.391|\n|AirNet|8.93 / 5.41| 1205.09 / 767.89 |0.459 / 0.190|\n\n(The metrics are reported as baseline / DASL integrated for comparison.)\n\n>Tips: Why faster and how to sidestep the time-consuming SVD?\n\nDASL comprises two lightweight operators, i.e., SVEO and SVAO, to replace the basic calculation units of the baseline network for decomposed optimization of singular vectors and singular values, while both of them decently evade the time-consuming SVD. Conceptually, SVEO takes the fact that the *simple orthogonal matrices multiplication* can impact singular vectors of the signal without touching singular values (Theorem 1 in sec. 3.2). SVAO resorts to the *Fast fourier transform (FFT)* as the transformed fourier coefficients undertake the same role as singular values in terms of signal formation principle (detailed in sec. 3.3). Albeit efficient compared to SVD (516x faster as shown in Tab. 1 of the paper), the consequent overhead of FFT is also been considered, and we adopt the SVAO merely in bottleneck layers of the backbone considering the examined global statistical properties of singular values. Therefore, the decomposed optimization in DASL can be performed decently with efficiency.\n\nDetails about the integration layout of DASL is presented in sec. 3.1, and the unit reformulation strategy is provided in Appendix B. \n\n**Whether more degradations conform to the proposed SVD-based analysis, and the concern about dehazing.**\n\nWe provide more degradation analysis in Appendix F to verify the generality of the proposed SVD-based analysis, including downsampling, compression, sharpness, underwater enhancement, and sandstorm enhancement. While the former three types are ascribed into singular vector dominated degradations and the latter two types are ascribed into singular value dominated degradations. Together with five deteriorations presented previously, SVD-based degradation analysis has been successfully applied to ten types of degradation!\n\n>Tips: A deeper understanding of the proposed SVD-based degradation analysis.\n\nExperimentally, if we reexamine the two groups of degradation ascribed by SVD-based analysis, namely, *rain, noise, blur, downsampling, compression, sharpness* in singular vector dominated and *hazy, low-light, underwater, sandstorm* in singular value dominated, it can be concluded that the singular vectors responsible for the spatial content information, while the singular values represent the global statistical properties of the image. Note that degradations ascribed by such analysis, i.e., content corruption and global corruption, inevitably cover most of scenes.\n\nTheoretically, the above conjecture can also be derived from the signal formation principle of SVD, where any signal can be regarded as a weighted sum on a set of basis, i.e., $X=U\\\\Sigma V^T=\\\\sum_{i=1}^{k}\\\\sigma_{i}u_{i}v_{i}^T$. From this perspective, the singular vectors $\\cup_{i=1}^{k}\\\\{u_iv_i^T\\\\}$ represent the base components of the signal for content composition, and singular values  $\\cup_{i=1}^{k}\\\\{\\sigma_i\\\\}$ represent the combined coefficients for statistical properties. We are confident that most degradations will conform to the proposed SVD-based analysis in virtue of the closed form of signal formation principle. \nThe above discussion have been accordingly incorporated into the revised version.\n\nDehaze case: The MSE reconstruction error in Fig. 2 (a) may not suitable for the dehaze due to the sensitivity to global corruption, which may yield both large error for singular vectors and singular values regardless of visual effect. However, the disparate singular value distribution in Fig. 2 (b) and the lowest singular vector difference in Fig. 2 (c) indicate that the dehaze is definitely ascribed into singular value dominated degradation. The visual analysis of the dehazing in Fig. 1 and Appendix F are more intuitive and evident, validating that SVD-based degradation analysis capturing the dehaze well, and support the generality of the proposed method."
                    }
                },
                "number": 1,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7129/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700635255656,
                "cdate": 1700635255656,
                "tmdate": 1700635255656,
                "mdate": 1700635255656,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "hraqboo5Ne",
                "forum": "6W35Wcs077",
                "replyto": "7i4gtWBw66",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7129/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7129/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer 4FV9"
                    },
                    "comment": {
                        "value": "**Relating the proposed method with recent unified image restoration methods.**\n\nThanks very much for pointing that out which makes improvement to our paper.\n\nVRD-IR [1] concentrated on low-for-high problem and proposed to align various degradations in semantic space for consequent recognition-driven enhancement, which is originally different from our method in spirit. Methodologically, they handle diverse degradations through forced normalization for potential conflicts, compared to our natural SVD-based degradation analysis.\n\nIDR [2] and ADMS [3] concentrated on unified image restoration with diametrically opposite perspective. IDR proposed to correlate various degradations through underlying degradation ingredients, while ADMS advocated to separate the diverse degradations processing with specific attributed discriminative filters. Note that multiple tasks-specific models have to be trained in ADMS for filter attribution, which is excessively inconvenient.\n\nWe present the comparison results with IDR below, which is the most relevant to our method. Compared to DASL, IDR correlates various degradations from microcosmic perspective with underlying degradation ingredients, such as directionality and unnatural image layering. While DASL performs the correlation from macroscopic perspective through SVD-based degradation analysis, ascribing various degradations into two groups. Despite the parallel motivation, the SVD-based analysis may benefit more other low-level vision problems for its generality, and the experimental comparisons are presented below.\n\n|Method|Rain100L|BSD68|GoPro|SOTS|LOL|Average|Params|\n|:---|:---:|:---:|:---:|:---:|:---:|:---:|:---:|\n|IDR|35.63|31.60|27.87|25.24|21.34|28.34|15.34M|\n|DASL|35.79|31.67|27.35|25.90|21.39|28.42|15.06M|\n\nThe metric is reported as PSNR, where our DASL is integrated with Restormer baseline which is the same as IDR for fair comparison, and the superior performance verifying the effectiveness of the proposed method.\n\nThe above discussion and comparison results have been accordingly incorporated into the revised version.\n\n**Relating the proposed method with previous SVD-based image restoration methods.**\n\nThanks so much for bringing our attention to previous SVD-based image restoration works.\n\nGenerally, SVD has been widely applied for a range of restoration tasks, such as image denoising, image compression, etc., attributing to the attractive rank properties [1] including truncated energy maximization and orthogonal subspaces projection. Particularly, the former takes the fact that SVD provides the optima low rank approximation of the signal in terms of dominant energy preservation, which greatly benefiting the signal compression. The latter exploits the fact that the separate order of SVD decomposed components are orthogonal, which inherently partition the signal into independent rank space, e.g., signal / noise space or range / null space for further manipulation, supporting the application of image denoising or even prevailing inverse problem solvers [2]. We acknowledge the great efforts the pioneer works made in cultivating the SVD potential for restoration problems.\n\nApart from above rank-based SVD methods, SVD-based degradation analysis proposed in DASL excavates another promising property that SVD possessed from the vector-value perspective, which is essentially different and has never been explored. Encouragingly, the above two SVD perspectives have the potential to collaborate well and the separate order properties are supposed to be incorporated into the DASL for sophisticated degradation relationship investigation in future works, as presented in sec. 4.4.\n\nWe hope our response address your concerns well, and we are delightful to receive feedbacks if there exist any questions. \n\nThank you again for your time and constructive comments.\n\n[1] Yang et al. Visual Recognition-Driven Image Restoration for Multiple Degradation with Intrinsic Semantics Recovery, CVPR 2023\n\n[2] Zhang et al. Ingredient-oriented Multi-Degradation Learning for Image Restoration, CVPR 2023\n\n[3] Park et al. All-in-one Image Restoration for Unknown Degradations Using Adaptive Discriminative Filters for Specific Degradations, CVPR 2023\n\n[4] R. Sadek. SVD Based Image Processing Applications: State of The Art, Contributions and Research Challenges, IJACSA, 2012.\n\n[5] Wang et al. Zero-Shot Image Restoration Using Denoising Diffusion Null-Space Model, ICLR, 2023."
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7129/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700636358705,
                "cdate": 1700636358705,
                "tmdate": 1700638397409,
                "mdate": 1700638397409,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]