[
    {
        "title": "Towards Optimal Regret in Adversarial Linear MDPs with Bandit Feedback"
    },
    {
        "review": {
            "id": "d38FuFDwUB",
            "forum": "6yv8UHVJn4",
            "replyto": "6yv8UHVJn4",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7647/Reviewer_eGft"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7647/Reviewer_eGft"
            ],
            "content": {
                "summary": {
                    "value": "The paper studies the problem of learning in online adversarial linear Markov decision processes in the presence of partial feedback. The authors propose two algorithms. The first one achieves optimal $\\sqrt{K}$ regret bound while being computationally inefficient. The second one achieves a regret bound of order $K^\\frac{3}{4}$, while being computationally efficient."
                },
                "soundness": {
                    "value": "4 excellent"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "4 excellent"
                },
                "strengths": {
                    "value": "The paper is clear and well-written. The setting the paper studies is of interest both from a theoretical and a practical perspective, and it has gained lots of attention in the last few years. The theoretical results, both for the efficient setting and the inefficient one, are surely improving the state-of-the-art. Indeed, the paper answers different questions raised by prior work (e.g., whether the $\\sqrt{K}$ regret bound was achievable). From an algorithmic perspective, even if the authors employ many existing techniques such as dilated bonus and FTRL with logdet barrier, the novelty is clear. The theoretical analysis is interesting and non-trivial, even if part of it is partially adapted from existing work."
                },
                "weaknesses": {
                    "value": "- The MDP has a layered structure. Indeed, this is standard in the literature of online learning in Markov decision process and it is without loss of generality. Nevertheless, the dependency on the decision space could be worse than the one presented in the paper for not loop-free MDPs.\n- The dependency of the regret bound on the horizon and the feature vector dimension is far from being good."
                },
                "questions": {
                    "value": "I am interested in understanding why the adversary is assumed to be oblivious. In online episodic adversarial MDP research area, the adversary can be adaptive."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission7647/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission7647/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission7647/Reviewer_eGft"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7647/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698436630233,
            "cdate": 1698436630233,
            "tmdate": 1699636929796,
            "mdate": 1699636929796,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "NoHzdpbKVe",
                "forum": "6yv8UHVJn4",
                "replyto": "d38FuFDwUB",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7647/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7647/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for the support and the valuable feedback. Please see our response below.\n\n**Q1:** Why the adversary is assumed to be oblivious?\n\n**Reply:** This is mostly for simplicity. Our analysis can directly obtain a *pseudo regret* bound for adaptive adversary, where pseudo regret is defined as \n$$\\mathbb{E}\\left[\\sum_{k=1}^K V^{\\pi_k}\\left(s_1, \\ell_k\\right)\\right] - \\min_{\\pi} \\mathbb{E}\\left[\\sum_{k=1}^K V^{\\pi}(s_1; \\ell_k)\\right]. $$\nIf we would like to obtain the stronger *expected regret*: \n$$\\mathbb{E}\\left[\\sum_{k=1}^K V^{\\pi_k}\\left(s_1, \\ell_k\\right)\\right] - \\mathbb{E}\\left[\\min_{\\pi} \\sum_{k=1}^K V^{\\pi}(s_1; \\ell_k)\\right]$$\nfor adaptive adversary, then the standard technique is to first obtain a *high probability* bound for the algorithm, and then take expectations [1]. Overall, to obtain an expected regret bound for adaptive adversary, it suffices to prove a high-probability bound for the algorithm. \n\nThe standard technique to obtain a high-probability bound is to add a bonus in the update to compensate the deviation in the concentration bound. This is based on the same idea of our current algorithm (which already incorporates some bonus term to compensate the bias), but may require extra bonus terms. We do not pursue in this direction to focus the exposition more on our key contributions. We point out that the regret notion in our work is the same as those in previous work (Luo et al. 2021, Dai et al. 2023, Sherman et al. 2023b, Kong et al. 2023), and the cases the algorithms can be applied to are also the same. \n\n[1] Julian Zimmert and Tor Lattimore. Return of the bias: Almost minimax optimal high probability bounds for adversarial linear bandits. In Conference on Learning Theory, pages 3285–3312. PMLR, 2022"
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7647/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700294726055,
                "cdate": 1700294726055,
                "tmdate": 1700294726055,
                "mdate": 1700294726055,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "k3vj9EETmG",
            "forum": "6yv8UHVJn4",
            "replyto": "6yv8UHVJn4",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7647/Reviewer_B4ir"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7647/Reviewer_B4ir"
            ],
            "content": {
                "summary": {
                    "value": "This work establishes the first rate-optimal algorithm for adversarial linear MDPs with bandit feedback, though it is computationally inefficient. Besides, this work also provides a computationally efficient policy optimization (PO)-based algorithm with $\\widetilde{O}(K^{3/4})$ regret, improving previous SOTA result of order $\\widetilde{O}(K^{6/7})$."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "4 excellent"
                },
                "strengths": {
                    "value": "1. Results: The problem of rate optimal results for learning adversarial linear MDPs with bandit feedback has been open since [1]. It is exciting to see an algorithm, though not computationally efficient, obtaining the rate optimal result for this challenging problem.\n2. Novelty: The rate optimal algorithm takes the same viewpoint that reducing the adversarial linear MDP problem as an adversarial linear bandit problem as [2], but new algorithmic designs are proposed to achieve the rate optimal result, which might be of independent interest. I think the combination of existing techniques to devise a computationally efficient PO-based algorithm with $\\widetilde{O}(K^{3/4})$ regret also has its merits.\n3. Writing: In general, this paper is well-written, with sufficient discussions on the algorithm designs.\n\n[1] Luo et al. Policy optimization in adversarial mdps: Improved exploration via dilated bonuses. NeurIPS, 2021.\n\n[2] Kong et al. Improved regret bounds for linear adversarial mdps via linear optimization. arXiv, 2023."
                },
                "weaknesses": {
                    "value": "1. In this work, Algorithm 1 used to estimate $ \\hat{\\mu}^\\pi $ for policy $\\pi $ needs to solve a complicated optimization problem, which might be less appealing for practitioners in the RL community. However, I think this is not a fatal weakness, given both the hardness of this problem and the technical novelty in the design of the first algorithm.\n2. Giving a table that shows the comparisons of regret bounds with most related works might further benefit the readers, in my opinion."
                },
                "questions": {
                    "value": "1. Can the authors give a brief discussion about the possibility or the main barriers to achieving the rate-optimal result for PO-based methods?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7647/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698582616094,
            "cdate": 1698582616094,
            "tmdate": 1699636929691,
            "mdate": 1699636929691,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "LUEn322flw",
                "forum": "6yv8UHVJn4",
                "replyto": "k3vj9EETmG",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7647/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7647/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for the support and the valuable feedback. We have added a table to compare the regret bounds. Please see Appendix A. Other questions are addressed below.\n\n**Q1:** Can the authors give a brief discussion about the possibility or the main barriers to achieving the rate-optimal result for PO-based methods?\n\n**Reply:** We believe that it is possible to achieve optimal rate with PO-based methods. Currently, the main challenge lies in how to efficiently reuse previous data to create an covariance matrix estimator $\\hat{\\Sigma}_k$, and bound the bias of the loss estimator due to the error in $\\hat{\\Sigma}_k$. Below we give a high-level explanation on why our inefficient exponential weight algorithm is able to achieve an optimal rate, while the PO approach still faces difficulties.  \n\nNotice that the main difference between the inefficient exponential weight algorithm and the PO algorithm is that, the former runs a \"global\" linear bandit algorithm over all policies, while the latter runs a \"local\" linear bandit algorithm on every state. This difference leads to a difference in their loss estimator construction. The loss estimator in the exponential weight case is \n\n$$M_k^{-1}\\hat{\\phi} _k^{\\pi_k}L _k$$\n\nwhere \n\n$$M_k = \\mathbb{E}_{\\pi\\sim q_k}[\\hat{\\phi}_k^\\pi\\hat{\\phi}_k^{\\pi\\top}],$$\n\nwhile the loss estimator for the PO case is  \n\n$\\hat{\\Sigma}\\_{k,h}^{-1} \\phi (s\\_{k,h}, a\\_{k,h}) L\\_{k,h}$\n\n\nwhere \n\n$$\\hat{\\Sigma}\\_{k,h} = \\lambda I + \\hat{\\mathbb{E}}\\_{s\\_h\\sim \\pi\\_k}\\left[\\sum\\_a \\pi\\_k(a|s\\_h)\\phi(s\\_h,a)\\phi(s\\_h,a)^\\top \\right]$$\n\nand $\\hat{\\mathbb{E}}\\_{s\\_h\\sim \\pi\\_k}$ means that we have to use empirical data to estimate the state distribution of $s_h$ under $\\pi_k$. For exponential weights, the bias comes from the error of $\\hat{\\phi}^\\pi_k$, while its covariance matrix $M_k$ can be computed exactly (since $q_k$ is known to the learner). For PO, on the other hand, the bias mainly comes from the error in the covariance matrix $\\hat{\\Sigma}\\_{k,h}$. In exponential weights, bounding the error $\\hat{\\phi}^\\pi\\_k - \\phi^\\pi\\_k$ is relative easier, while in PO, bounding the error $\\hat{\\Sigma}\\_{k,h}^{-1} - \\Sigma\\_{k,h}^{-1}$ is more challenging because concentration inequalities for inverse matrices are more difficult to establish. Currently, we use fresh on-policy samples to estimate $\\hat{\\Sigma}\\_{k,h}$ in epoch $k$, which is expensive. A more sample efficient option would be to reuse previously collected data to estimate $\\hat{\\Sigma}\\_{k,h}$ in an off-policy manner. However, currently we do not know how to bound the estimation error $\\hat{\\Sigma}\\_{k,h}^{-1} - \\Sigma\\_{k,h}^{-1}$ tightly if adopt this approach."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7647/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700294543502,
                "cdate": 1700294543502,
                "tmdate": 1700294543502,
                "mdate": 1700294543502,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "i33uOUqfZF",
                "forum": "6yv8UHVJn4",
                "replyto": "LUEn322flw",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7647/Reviewer_B4ir"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7647/Reviewer_B4ir"
                ],
                "content": {
                    "title": {
                        "value": "Reply"
                    },
                    "comment": {
                        "value": "Thanks for the detailed response. I have no further questions."
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7647/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700625582006,
                "cdate": 1700625582006,
                "tmdate": 1700625582006,
                "mdate": 1700625582006,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "rSYXCIdaaj",
            "forum": "6yv8UHVJn4",
            "replyto": "6yv8UHVJn4",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7647/Reviewer_QJAu"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7647/Reviewer_QJAu"
            ],
            "content": {
                "summary": {
                    "value": "The paper studies the linear Markov decision processes(MDP) with adversarial losses and bandit feedback. This paper first 1) introduces a computationally inefficient algorithm that achieves a regret of $\\tilde{O}(\\sqrt{K})$, for $K$ as the number of episode in this MDP, and then 2) introduces a second algorithm that is computationally efficient and achieves $\\tilde{O}(K^{3/4})$ regret. The first algorithm is nearly optimal, and the second algorithm significantly improves the state-of-the-art."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "- The presentation of this paper is good, and display a relatively clean and timely literature review.\n- This paper clearly presents the intuition behind the results presented in this paper, as well as the similarities and differences between the algorithm and the state-of-the-art (SOTA), and where SOTA offers further improvement on regret, e.g. paragraphs in section 3.1\n- The result of this paper is a significant improvement of state-of-the-art."
                },
                "weaknesses": {
                    "value": "- The pseudo-code of algorithm 1 lacks explanations. \n- This paper is purely theoretical, and hence doesn't have empirical evaluations."
                },
                "questions": {
                    "value": "- What is the practical motivation of this problem? \n- With the help of simulators, K^{2/3} regret can be obtained, what is changed when the simulator of the environment is available?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission7647/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission7647/Reviewer_QJAu",
                        "ICLR.cc/2024/Conference/Submission7647/Senior_Area_Chairs"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7647/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698826679871,
            "cdate": 1698826679871,
            "tmdate": 1700458719389,
            "mdate": 1700458719389,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "1ei9L1ROZ8",
                "forum": "6yv8UHVJn4",
                "replyto": "rSYXCIdaaj",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7647/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7647/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for the support and the valuable feedback. Please see our response below. \n\n**Q1:** The pseudo-code of algorithm 1 lacks explanations. \n\n**Reply:** The explanation of Algorithm 1 is provided in Page 5 between Eq.(6) and Lemma 5. Please feel free to let us know if the exposition there requires further improvement. \n\n**Q2:** What is the practical motivation of this problem?\n\n**Reply:** Our work follows the line of research by (Luo et al. 2021, Dai et al. 2023, Sherman et al. 2023b, Kong et al. 2023) that investigate the intersection of function approximation, non-stationary reward, and the design of exploration bonus on top of them. The main goal of this line of research is to improve the weak part of traditional policy-based algorithms --- having low sample efficiency, only performing local policy search --- through the use of exploration bonus, while keeping its strength of being robust to non-stationarity. Indeed, simultaneously ensuring sample efficiency and robustness in changing environments is crucial for fields such as robotics. We agree that currently this line of research is theory-oriented, but some techniques that have been developed (e.g., the use of the initial exploration phase to reduce the required exploration bonus, and the recursive construction of the exploration bonus) could provide insights for future empirical study. \n\n**Q3:** With the help of simulators, $K^{2/3}$ regret can be obtained, what is changed when the simulator of the environment is available?\n\n**Reply:** We point out that the state-of-the-art regret bound with a simulator is $\\sqrt{K}$ by Algorithm 1 in [1]. \n\nWith the help of a simulator, the learner can learn the transition directly from the simulator without interacting with the environments (assuming the simulator is unbiased). This saves the number of interactions with the environments. Specifically, for our Algorithm 2, if there is a simulator, the estimation of the covariance matrix can be free and with low error. This also eliminates the need for the initial exploration phase because the original goal of the initial phase is to reduce the bias caused by the covariance matrix estimation error. Overall, if there is a simulator, our policy optimization algorithm can actually achieve a $\\sqrt{K}$ regret, like in [1]. \n\n[1] Yan Dai, Haipeng Luo, Chen-Yu Wei, and Julian Zimmert. Refined regret for adversarial mdps with linear function approximation. In International Conference on Machine Learning, 2023."
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7647/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700293686717,
                "cdate": 1700293686717,
                "tmdate": 1700293743076,
                "mdate": 1700293743076,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "a9Y9S4Ndab",
                "forum": "6yv8UHVJn4",
                "replyto": "1ei9L1ROZ8",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7647/Reviewer_QJAu"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7647/Reviewer_QJAu"
                ],
                "content": {
                    "comment": {
                        "value": "Thanks for the feedback, I raised my score accordingly."
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7647/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700458778934,
                "cdate": 1700458778934,
                "tmdate": 1700458778934,
                "mdate": 1700458778934,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "uzJRPdl772",
            "forum": "6yv8UHVJn4",
            "replyto": "6yv8UHVJn4",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7647/Reviewer_vRkG"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7647/Reviewer_vRkG"
            ],
            "content": {
                "summary": {
                    "value": "This work studies RL on adversarial MDPs with bandit feedback. In detail, the authors proposed the first algorithms for linear MDPs with the standard $\\sqrt{K}$ regret. Although with a $\\sqrt{K}$ regret, such algorithms are not computationally efficient since the computation complexity depends on the state complexity $|\\cS|$. The authors also proposed computationally efficient algorithms with a $K^{3/4}$ regret, which is also the SOTA result."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "The improvement of the existing regret results for linear MDP with adversarial loss is very important for the research community. The presentation of this paper is also very clear."
                },
                "weaknesses": {
                    "value": "I do not find any obvious weaknesses in this work."
                },
                "questions": {
                    "value": "1. Can the authors discuss the possibility of designing an algorithm with a minimax-optimal regret guarantee? Such a result has already been established in [1,2] for linear mixture MDPs with/without adversarial losses, with the full information feedback. [2] also established a lower bound of regret which depends on $\\log|\\cS|$ and $\\log|\\cA|$. Does the same lower bound also hold for the bandit feedback setting?\n\n[1] Zhou, Dongruo, Quanquan Gu, and Csaba Szepesvari. \"Nearly minimax optimal reinforcement learning for linear mixture markov decision processes.\" Conference on Learning Theory. PMLR, 2021.\n[2] Ji, Kaixuan, et al. \"Horizon-free Reinforcement Learning in Adversarial Linear Mixture MDPs.\" arXiv preprint arXiv:2305.08359 (2023)."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7647/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699061836883,
            "cdate": 1699061836883,
            "tmdate": 1699636929447,
            "mdate": 1699636929447,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "JQNfzIm4qv",
                "forum": "6yv8UHVJn4",
                "replyto": "uzJRPdl772",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7647/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7647/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for the support and the valuable feedback. Please see our response below. \n\n**Q1:** Can the authors discuss the possibility of designing an algorithm with a minimax-optimal regret guarantee? Such a result has already been established in [1,2] for linear mixture MDPs with/without adversarial losses, with the full information feedback. [2] also established a lower bound of regret which depends on $\\log{|\\mathcal{S}|}$ and $\\log{|\\mathcal{A}|}$. Does the same lower bound also hold for the bandit feedback setting?\n\n\n\n**Reply:** The main differences between our setting and those of [1, 2] are the following: \n\n(1)  They study full-information loss feedback, while we study bandit loss feedback; \n\n(2) Their *linear mixture MDP* only assumes linear structure on the transition ($\\mathbb{P}(s'|s,a) = \\phi(s'|s,a)^\\top \\psi$), while our *linear MDP* assumes linear structures both on the transition ($\\mathbb{P}(s'|s,a) = \\phi(s,a)^\\top \\psi(s')$) and the loss ($\\ell_k(s,a) = \\phi(s,a)^\\top \\theta_k$). Notice that the assumptions on the transition are different -- in linear mixture MDP, it's possible to use a model-based algorithm to estimate the the transition, while in linear MDP this is not allowed.  \n\nThe algorithmic techniques required for linear mixture MDPs and linear MDPs are quite different due to the different assumptions. Therefore, the bounds obtained in one setting cannot be translated or compared to the other setting in general. We note that a concurrent work [2] studied a more comparable setting of adversarial linear MDPs with full-information loss feedback. They obtained a regret of $\\sqrt{d^4H^6 K}$ (also the first rate-optimal result), while ours in the bandit setting is $\\sqrt{d^7H^7 K}$. Clearly, in both works, there is still a significant gap between the upper bounds and the currently best lower bound $dH\\sqrt{K}$. We believe that the lower bound is tight. Potential ways to improve our upper bound include: \n\n- In Algorithm 1, try NOT to control the estimation error for all functions in the function set $\\mathcal{F}_\\pi$ (which requires an union bound over an exponentially large function set); instead, just control the error for those $f$ that are relevant to the estimation of $\\phi^\\pi$. \n\n- Improve the upper bound for the bias term in Lemma 10 -- we believe that a more refined and complicated analysis could improve the $d$ dependence there. \n\nTo implement these ideas, significant changes in the analysis and the algorithm may be required, so we leave it as future work.  \n\nNext, we remark on the $\\log|\\mathcal{S}|$ and $\\log|\\mathcal{A}|$ lower bound established in [2]. The key reason that they have explicit $|\\mathcal{S}|$ and $|\\mathcal{A}|$ dependencies is that in their linear mixture MDP model, there is NO structural assumption on the loss function $\\ell_k(s,a)$ (see (2) above). Therefore, their $\\ell_k(s,a), \\ell_k(s',a')$ can be arbitrarily different even if $\\phi(s,a)=\\phi(s',a')$. This makes the intrinsic dimension of their $\\ell_k(s,a)$ scales with $|\\mathcal{S}||\\mathcal{A}|$ (though the full-information assumption make their regret dependency only logarithmic). On the other hand, in our linear MDP model, $\\ell_k(s,a)$ can be represented as a  $d$ dimensional linear function. Therefore, our bound can only depend on $d$ but not on $|\\mathcal{S}|$ or $|\\mathcal{A}|$.   \n\n[1] Zhou, Dongruo, Quanquan Gu, and Csaba Szepesvari. Nearly minimax optimal reinforcement learning for linear mixture markov decision processes. Conference on Learning Theory. PMLR, 2021.\n\n[2] Ji, Kaixuan, et al. Horizon-free Reinforcement Learning in Adversarial Linear Mixture MDPs. arXiv preprint arXiv:2305.08359 (2023).\n\n[3] Uri Sherman, Alon Cohen, Tomer Koren, Yishay Mansour. Rate-Optimal Policy Optimization for Linear Markov Decision Processes. arXiv preprint arXiv:2308.14642 (2023)."
                    }
                },
                "number": 1,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7647/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700292945173,
                "cdate": 1700292945173,
                "tmdate": 1700296264678,
                "mdate": 1700296264678,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]