[
    {
        "title": "Complexity of Formal Explainability for Sequential  Models"
    },
    {
        "review": {
            "id": "vO0cYYvLyD",
            "forum": "73lu1yw6At",
            "replyto": "73lu1yw6At",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission8310/Reviewer_XaKE"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission8310/Reviewer_XaKE"
            ],
            "content": {
                "summary": {
                    "value": "This purely theoretical paper is devoted to formal explainability of\nsequential ML models, e.g. RNNs and Transformers. Namely, the paper\nlifts the apparatus of formal XAI (FXAI) to sequential models and\nstudies the problem of checking whether there exists a single formal\nabductive explanation or a single formal contrastive explanation for\nsuch a model's prediction and offers a few theoretical results\ndemonstrating the complexity of this problem. Then the authors discuss\nthe complexity of the same problem for various types of automata\nshowing some negative (intractability) and some positive (polytime)\nresults in this domain."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "- This paper discusses the complexity of testing whether there exists\n  a formal explanation for a sequential ML model. Although this is not\n  the first work on the subject (I've already reviewed a few this\n  year), but the theoretical contributions seem clearly novel to me.\n\n- The paper looks rigorous in terms of the problems studied and\n  propositions claimed. I haven't checked the proofs but the results\n  make sense to me."
                },
                "weaknesses": {
                    "value": "- This is a purely theoretical paper with a list of propositions and\n  proof sketches but with absolutely no practical side of things. No\n  experimental evidence is provided either. As a result, whether or\n  not FXAI is usable in the context of such models is left unclear.\n  (Recall that AXp's and CXp's are known to be in general intractable\n  to compute for non-sequential models; so no big deal.) This makes me\n  wonder why this line of work can be deemed relevant for a conference\n  like ICLR. (KR would be a nice fit but ICLR is hard to justify.)\n\n- On a similar note: overall presentation could and should be\n  significantly improved. Definitions of abductive and contrastive\n  explanations in the context of sequential models are given in a\n  somewhat lazy way. (The models are defined similarly.) Also, the\n  paper gives no examples whatsoever that would demonstrate how these\n  explanations look like for sequential models. As this paper claims\n  to be the first of its kind, such examples should be provided.\n\n- No algorithms to be used for computing such explanations are\n  proposed (even in theory). This exacerbates the issue of the venue\n  choice above.\n\n- Minor: on p9 there is a sentence: \"This type of explainability falls\n  within the category of post-hoc local model-agnostic explanations\".\n  No, it does not. Both abductive and contrastive explanations are\n  global. None of them are model-agnostic as you have to reason about\n  the model's behavior formally and hence require access to its\n  original representation."
                },
                "questions": {
                    "value": "- Can you show a clear example of an RNN model, some of the instances\n  it takes as input and also exemplify abductive and contrastive\n  explanations for some of the model's decisions?\n\n- Are the algorithms originally proposed for AXp and CXp computation\n  are directly usable in this setting? If not, how should one compute\n  them?\n\n- Can you summarize the differences between the complexity of these\n  problems for non-sequential and sequential models? This way, can you\n  contrast your results with what is already known to hold in general?\n\n- Why do you need 1 ** k in the informal definition of a CXp? It\n  doesn't seem to be used anywhere, does it?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission8310/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698728952588,
            "cdate": 1698728952588,
            "tmdate": 1699637033737,
            "mdate": 1699637033737,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "myPpszag7D",
                "forum": "73lu1yw6At",
                "replyto": "vO0cYYvLyD",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8310/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8310/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Q: No algorithms to be used for computing such explanations are proposed (even in theory). \nA: Thank you for bringing up the question of computing explanations. We have stated our positive results as polynomial-time algorithms for decision problems. However, the algorithms can actually generate (counterfactual) explanations in polynomial-time. We apologize for not making this explicit, which we have corrected in the revised version.\n\nQ: How are they related to machine learning, FXAI, and ICLR? \nA: We thank you for your questions and comments. We would like to convince you that our results are of interests to those working in FXAI and ML. In the revised version, we have placed a stronger emphasis on the connection to model generation (learning) and explanation generation. Note that our results concern the latter, so we mention relevant existing results on the former to put the results in contexts. We summarize the connection to ML below.\n\nOur work was actually very much motivated by the machine learning work on the extraction of DFA from RNN using automata learning algorithms (e.g. Angluin's L*), e.g., see the ICML paper by Weiss et al. (2018) and the AAAI paper by Okudono et al. (2020). This work hinges on the assumption that DFA is *more interpretable* than RNN, but it was never really clear what this means. Following the work for non-sequential models, we associate interpretability with the computational tractability (following standard complexity theoretic assumptions) to compute abductive and counterfactual explanations. In this technical sense, we showed that DFA is more interpretable than RNN and transformers.\n\nSo, a fuller working (F)XAI schema for could be as follows: (1) train RNN R, (2) extract DFA A out of R (e.g. using Weiss et al.), and (3) use our algorithm on A to generate explanations. \n\nNote that (1) could perhaps be replaced directly by an algorithm that extracts a DFA A directly from the datasets. Note also that although we deal with decision problems, the polynomial-time algorithms can be used to extract an explanation (we have clarified this in the new version).\n\nThe aforementioned concentrates on a finite alphabet. Since time series (e.g. stock price chart) is ubiquitous in applications, we went one step further to look at sequential models that may take *data sequences* as input (i.e. sequences of rationals). Two prominent extensions of DFA in this setting are interval automata and k-deterministic register automata, for both of which automata learning algorithms (e.g. Moerman et al. (2017); Howar et al. (2012); Cassel et al. (2016); Drews & D’Antoni (2017); Argyros & D’Antoni (2018)) are available. In the new version, we have also expanded our small examples in the previous version on stock price signals, and how they can be captured by Interval Automata and 2-DRA. Finally, our results are a fundamental building block that enables a similar working schema to the aforementioned case of finite alphabet.\n\nQ: Are your explanations local and model agnostic?\n\nA: Local explanations refer to less complex solution subspaces (e.g. specific inputs), e.g., see survey https://arxiv.org/abs/1910.10045. We believe that both abductive and counterfactual explanations are local explanations since they refer to a specific input instance. The same claim was also made in previous works on such explanations (e.g. see the citation Barcelo et al. (2020) in our paper).\n\nModel-agnostic explanations treat the model as a blackbox, as far as the explanations. See the survey https://www.frontiersin.org/articles/10.3389/fdata.2021.688969/full. They explicitly pinpoint that counterfactual explanations are model-agnostic.\n\nQ: a clear example of a model with AXp and CXp explanations?\n\nA: In the new version, we have expanded our small examples in the previous version (Example 1 to Example 3). They concern a simple document identification task (using DFA over finite alphabets) and a simple stock trading signal (using interval automata/k-DRA). We show how counterfactual/abductive explanations mean in this context.\n\nQ: Are the algorithms originally proposed for AXp and CXp computation are directly usable in this setting? If not, how should one compute them?\n\nA: Existing algorithms for AXp and CXp concern non-sequential models, so cannot be used in our setting. Our polynomial-time algorithms can generate the counterfactuals in polynomial-time. We made this explicit in the revised version.\n\nQ: Differences between the complexity of these problems for non-sequential and sequential models? \n\nA: From existing works (e.g. by Izza et al. and Barcelo et al.), the complexity of explainability is typically decidable (within PSPACE) for non-sequential models. In contrast, the same problems are undecidable in the sequential setting, owing to Turing-completeness of RNN and Transformers.\n\nQ: 1 ** k in the informal definition of a CXp?\n\nA: This means the number is represented in unary. We clarified in this in the revised version."
                    }
                },
                "number": 8,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8310/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700613444763,
                "cdate": 1700613444763,
                "tmdate": 1700613444763,
                "mdate": 1700613444763,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "hwVg0E0X49",
                "forum": "73lu1yw6At",
                "replyto": "vO0cYYvLyD",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8310/Reviewer_XaKE"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8310/Reviewer_XaKE"
                ],
                "content": {
                    "title": {
                        "value": "Reply to the authors"
                    },
                    "comment": {
                        "value": "#### **On relevance to FXAI and ICLR:**\n\nI did not say the paper was irrelevant to FXAI. What I say is that this purely theoretical contribution is completely detached from practice and hence is beyond the scope of ICLR. There are other conferences where this line of work would be a perfect fit. And I still believe that.\n\n#### **On newly added examples:**\n\nThank you. Based on a brief look, abductive explanations seem to be defined to replicate the exact meaning of those for classification models, i.e. *as long as these features are included in the instances, the prediction is going to stay*. Unfortunately, there is no example of contrastive explanation but I presume it would look again similarly to the case of classification models.\n\n#### **On local and model-agnostic explanations:**\n\nWell, abductive explanations are global in the sense that they represent a prime implicant of the classification function despite being defined for a given instance. They are perfectly applicable to any other instance they are compatible with. The same hold for contrastive explanations. This assuming we are talking about formal XAI. As for model-agnostic, you have to formally reason about your ML model of interest and so you certainly need to have *white-box* access.\n\n#### **On inapplicability of existing algorithms:**\n\nWhy can't they be used assuming you can represent your model logically and have a reasoner for it? Granted the complexity of the problem is different and this will affect how difficult the reasoning calls would be, the algorithms should still be applicable.\n\n#### **On everything else:**\n\nThank you for the comments."
                    }
                },
                "number": 10,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8310/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700627116450,
                "cdate": 1700627116450,
                "tmdate": 1700627196238,
                "mdate": 1700627196238,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "ylWEXAbdoK",
            "forum": "73lu1yw6At",
            "replyto": "73lu1yw6At",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission8310/Reviewer_ynBt"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission8310/Reviewer_ynBt"
            ],
            "content": {
                "summary": {
                    "value": "This paper studies the computational complexity of explainability questions, both abductive and counterfactuals, over sequential models ranging from finite automata to Transformers.  All questions are computationally hard for RNNs and Transformers, but some are tractable for DFAs, and the paper shows that DFAs can be extended while keeping polynomial time complexity."
                },
                "soundness": {
                    "value": "4 excellent"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "- The paper is well written and it is easy to read; the structure flows well and the body presents the right amount of detail about the proofs and technical aspects.\n- The appropriate work seems properly referenced and presented.\n- The paper presents novel results and focuses on sequential models, which are arguably one of the most important classes of models at the moment, and yet most formal XAI focuses on classification models.\n- Proofs seem to be sound; I fully checked a couple of them and skimmed through the rest and they all seemed to be correct."
                },
                "weaknesses": {
                    "value": "- In terms of presentation I think a small table summarizing all results would be helpful; the complexity landscape of the different queries is spread through the text right now.\n- The main weakness of the paper in my opinion is that the complexity analysis doesn't seem to provide much new insight into the models or the explanations themselves. The counter to this point is that the presented extensions to DFAs seem like an interesting direction inspired by the complexity analysis. Nonetheless, there is no experimental evidence showing that they can be useful in practical prediction tasks, or directions towards making them more practical."
                },
                "questions": {
                    "value": "I don't have particular questions besides the points mentioned as weaknesses. Perhaps something that could help the evaluation of the paper is some justification for this work being fit for the venue; at least superficially it seems of a slightly different nature than most ICLR work."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission8310/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission8310/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission8310/Reviewer_ynBt"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission8310/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698810097194,
            "cdate": 1698810097194,
            "tmdate": 1699637033626,
            "mdate": 1699637033626,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "01WcpRvasw",
                "forum": "73lu1yw6At",
                "replyto": "ylWEXAbdoK",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8310/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8310/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Q: Perhaps something that could help the evaluation of the paper is some justification for this work being fit for the venue; at least superficially it seems of a slightly different nature than most ICLR work.\n\nA:  We thank you for your comment and question. In the new version, we have placed a stronger emphasis on the connection to model generation (learning) and explanation generation. Note that our results concern the latter, so we mention relevant existing results on the former to put the results in contexts. We summarize the connection to ICLR work below.\n\nOur work was actually very much motivated by the machine learning work on the extraction of DFA from RNN using automata learning algorithms (e.g. Angluin's L*), e.g., see the ICML paper by Weiss et al. (2018) and the AAAI paper by Okudono et al. (2020). This work hinges on the assumption that DFA is \"more interpretable\" than RNN, but it was never really clear what this means. Following the work for non-sequential models, we associate interpretability with the computational tractability (following standard complexity theoretic assumptions) to compute abductive and counterfactual explanations. In this technical sense, we showed that DFA is more interpretable than RNN and transformers.\n\nSo, a fuller working (F)XAI schema for could be as follows: (1) train RNN R, (2) extract DFA A out of R (e.g. using Weiss et al.), and (3) use our algorithm on A to generate explanations. \n\nNote that (1) could perhaps be replaced directly by an algorithm that extracts a DFA A directly from the datasets. Note also that although we deal with decision problems, the polynomial-time algorithms can be used to extract an explanation (we have clarified this in the new version).\n\nThe aforementioned work so far concentrates over strings (over a finite alphabet). Since time series (e.g. stock price chart) is ubiquitous in multiple applications, we went one step further to look at sequential models that may take \"data sequences\" as input (i.e. sequences of rationals). Two prominent extensions of DFA in this setting are interval automata and k-deterministic register automata, for both of which automata learning algorithms (e.g. Moerman et al. (2017); Howar et al. (2012); Cassel et al. (2016); Drews & D’Antoni (2017); Argyros & D’Antoni (2018)) have been developed in the last 10 years. In the new version, we have also expanded our small examples in the previous version on stock price signals, and how they can be captured by Interval Automata and 2-DRA. Finally, our results are a fundamental building block that enables a similar working schema to the aforementioned case of finite alphabet.\n\nIn the revised version, we have also expanded our small examples in the previous version (Example 1 to Example 3). They concern a simple document identification task (using DFA over finite alphabets) and a simple stock trading signal (using interval automata/k-DRA). We show how counterfactual/abductive explanations mean in this context.\n\nQ: The main weakness of the paper in my opinion is that the complexity analysis doesn't seem to provide much new insight into the models or the explanations themselves. The counter to this point is that the presented extensions to DFAs seem like an interesting direction inspired by the complexity analysis. Nonetheless, there is no experimental evidence showing that they can be useful in practical prediction tasks, or directions towards making them more practical.\n\nA: We would like to convince you that our results can in fact provide insights into the models. We have stated our positive results as polynomial-time algorithms for decision problems. However, the algorithms can actually generate (counterfactual) explanations in polynomial-time. We have made this more explicit in the revised version. \n\nAlthough the focus of our current paper is on classifying explainability of different non-sequential models and, we do agree that providing experimental evidence of polynomial-time algorithms in the paper is an important next step. Another interesting research direction is how to realize the aforementioned (F)XAI schema for sequential data, by leveraging existing automata learning algorithms for DFA, interval automata, and k-DRA.\n\n\nQ: a small table summarizing the result would be useful\n\nA: Thanks for the excellent suggestion. We will add this in the final version."
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8310/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700612361233,
                "cdate": 1700612361233,
                "tmdate": 1700612361233,
                "mdate": 1700612361233,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "GnfUp7GtcL",
            "forum": "73lu1yw6At",
            "replyto": "73lu1yw6At",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission8310/Reviewer_rsdT"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission8310/Reviewer_rsdT"
            ],
            "content": {
                "summary": {
                    "value": "This paper considers the complexity of abductive and counterfactual explanations in sequence models such as RNNs, Transformers, DFAs, interval automata, and register automata. Here an abductive explanation is a form of minimal property test that shows when the output of the sequence model would change. Similarly, a counterfactual example is a \"distance\" bounded input sequence that results in a different output. \n\nThe results for RNNs and Transformers are mostly negative, following well known issues with Turing completeness. However, motivated by work on extracting automata from neural models, the paper studies the complexity of such explanations in the aforementioned automata classes. They provide a series of theorems and proofs which characterize the complexity.\n\nThe key results are the PSPACE completeness of abductive explanations for DFAs and the efficiency of counterfactual explanations for the studied automata classes (DFAs, NFAs, interval, and register)."
                },
                "soundness": {
                    "value": "1 poor"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. The paper does a good job laying out the theoretical machinery needed to understand the abductive and counterfactual explanations. Further, when present (see below) the technical material seems to be sound, with the proofs being easy to follow.\n\n2. The topic of explainability of sequence models is certainly important.\n\n3. The classes of explanations discussed have utility and are motivated by similar definitions in the corresponding literature."
                },
                "weaknesses": {
                    "value": "1. The exposition of the paper would greatly benefit from worked examples. It took a bit of studying to fully internalize the definitions presented in the paper and that is given a fair amount of automata theoretic background.\n\n2. Unless I'm missing something, the proof of Prop 3. seems incomplete! The sentence ends with \"This is equivalent to checking\". I imagine this was an oversight during submission.\n\n3. I'm actually having a hard time reconciling Prop 3. with Prop 2. In particular,  the paper rightfully points out that interval automata strictly generalize DFAs. Then shouldn't the results of PSPACE-hardness transfer? Otherwise, I could life the properties F and target DFA to the corresponding singleton interval automata, solve. This seems like a polynomial reduction?\n\n4. Regarding the proof Prop 2, isn't DFA intersection / minimization poly time -- intersection is at product construction and minimization is polytime due to hopcroft's algorithm. So testing emptiness should be polytime. Why does the proof imply PSPACE-completeness?\n\n*Note* If these are misunderstandings or easily corrected, I'm happy to revise my score."
                },
                "questions": {
                    "value": "Additional questions:\n\n1. See points 3 & 4 in weaknesses.\n2. Do the negative results for non-determinism resolve if restricting to residual automata? They have many of the properties of DFAs while still admitting non-determinism."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission8310/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698901702207,
            "cdate": 1698901702207,
            "tmdate": 1699637033517,
            "mdate": 1699637033517,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "KdJQMmFxWx",
                "forum": "73lu1yw6At",
                "replyto": "GnfUp7GtcL",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8310/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8310/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Q: The exposition of the paper would greatly benefit from worked examples. It took a bit of studying to fully internalize the definitions presented in the paper and that is given a fair amount of automata theoretic background.\n\nA: In the revised version, we have expanded our small examples of concepts (e.g. stock price signal) that can be captured using various notions of automata, and intuitions on what abductive/counterfactual explanations mean for such examples. In the final version, we would be happy to also provide a worked example of the construction.\n\nQ: Proposition 3 is confusing\nA: We thank you for pointing this out, and sincerely apologize for the confusion. There appeared to be a problem with a LaTeX macro that caused this part (Proposition 3 and incomplete proof) to be displayed when we switched into a submission mode. Certainly, this was not meant to be there, which we have deleted in the revised version.\n\nQ: Regarding the proof Prop 2, isn't DFA intersection / minimization poly time -- intersection is at product construction and minimization is polytime due to hopcroft's algorithm. So testing emptiness should be polytime. Why does the proof imply PSPACE-completeness?\n\nA: Indeed, checking emptiness of the intersection of two DFA is solvable in polynomial-time, but this problem becomes PSPACE-complete if we want to check emptiness of n DFAs (where n is non-fixed number). This was proven by Kozen in the FOCS'77 paper titled \"Lower bounds for natural proof systems.\" \n\nQ: What happens with residual automata?\n\nA: From the point of view of learning, RFSA certainly helps because there is an extension of Angluin's L* learning algorithm for it (by Denis et al. (2001), and there is a recent result in the case of register automata in the paper titled \"Residual Nominal Automata\" by Moerman and Sammartino (2020)). However, in terms of explainability, we need to be able to complement the learned automaton in polynomial-time, and we do not know if RFSA can be complemented in polynomial-time (i.e. unlike DFA). So, it is not clear if counterfactual queries can be explained in polynomial-time as well for RFSA, which we believe is an interesting future research direction (similarly also, restrictions of NFA like unambiguous NFA), given the existence of an automata learner."
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8310/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700612283948,
                "cdate": 1700612283948,
                "tmdate": 1700612283948,
                "mdate": 1700612283948,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "lUCSixTEK0",
            "forum": "73lu1yw6At",
            "replyto": "73lu1yw6At",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission8310/Reviewer_hXKh"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission8310/Reviewer_hXKh"
            ],
            "content": {
                "summary": {
                    "value": "This paper studies the theoretical problem of generating abductive explanations and counterfactual explanations of ML models. The paper establishes negative results for extracting these explanations from RNNs and Transformers and then focuses on automata models, for which some PSPACE results can be extracted.\n\nOverall, this seems like a solid theory contribution, but I don't see the relevance to ICLR."
                },
                "soundness": {
                    "value": "4 excellent"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "Solid, clean automata theory."
                },
                "weaknesses": {
                    "value": "1. The class of explanations here fail to convince me that any of the XAI goals are achieved. \n2. Even if explanations could be generated for the purpose of checking them with formal tools, in what applications would it be helpful given the definitions of \"abductive\" and \"counterfactual\" explanations. The example on the top of page 2 does not convince me in the slightest, given that in modern applications features are basically never equipped with clean semantics as assumed here.\n3. The paper starts with some very simple negative results for RNNs and Transformers and then focuses almost entirely on automata models (DFA, NFA, and Interval Automata) that have an unclear connection to most work in ICLR.\n\nSuggestion how to make this work more relevant: The negative results here seem to (at least partially) rely on the fact that weights are rational numbers. However, in modern models the exact value of these weights does not seem to matter very much, as can be seen by the success of quantization techniques. Hence, a much more interesting model of RNNs and Transformers could be one where weights are binary or chosen from a small range (e.g. a 4-bit representation). In terms of explanations: how hard is it to extract small formulas that represent the output, perhaps with PAC guarantees?"
                },
                "questions": {
                    "value": "The paper focuses on DFAs and Interval Automata. How are they related to machine learning? Could you give examples that also motivate the class of explanations you consider in this work?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission8310/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699024980432,
            "cdate": 1699024980432,
            "tmdate": 1699637033408,
            "mdate": 1699637033408,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "0WaMuwRsej",
                "forum": "73lu1yw6At",
                "replyto": "lUCSixTEK0",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8310/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8310/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Q: The paper focuses on DFAs and Interval Automata. How are they related to machine learning and ICLR? \n\nA: We thank you for your comment. In the new version, we have placed a stronger emphasis on the connection to model generation (learning) and explanation generation. Note that our results concern the latter, so we mention relevant existing results on the former to put the results in contexts. We summarize the connection below.\n\nOur work was actually very much motivated by the machine learning work on the extraction of DFA from RNN using automata learning algorithms (e.g. Angluin's L*), e.g., see the ICML paper by Weiss et al. (2018) and the AAAI paper by Okudono et al. (2020). This work hinges on the assumption that DFA is \"more interpretable\" than RNN, but it was never really clear what this means. Following the work for non-sequential models, we associate interpretability with the computational tractability (following standard complexity theoretic assumptions) to compute abductive and counterfactual explanations. In this technical sense, we showed that DFA is more interpretable than RNN and transformers.\n\nSo, a fuller working (F)XAI schema for could be as follows: (1) train RNN R, (2) extract DFA A out of R (e.g. using Weiss et al.), and (3) use our algorithm on A to generate explanations. \n\nNote that (1) could perhaps be replaced directly by an algorithm that extracts a DFA A directly from the datasets. Note also that although we deal with decision problems, the polynomial-time algorithms can be used to extract an explanation (we have clarified this in the new version).\n\nThe aforementioned work so far concentrates over strings (over a finite alphabet). Since time series (e.g. stock price chart) is ubiquitous in multiple applications, we went one step further to look at sequential models that may take \"data sequences\" as input (i.e. sequences of rationals). Two prominent extensions of DFA in this setting are interval automata and k-deterministic register automata, for both of which automata learning algorithms (e.g. Moerman et al. (2017); Howar et al. (2012); Cassel et al. (2016); Drews & D’Antoni (2017); Argyros & D’Antoni (2018)) have been developed in the last 10 years. In the new version, we have also expanded our small examples in the previous version on stock price signals, and how they can be captured by Interval Automata and 2-DRA. Finally, our results are a fundamental building block that enables a similar working schema to the aforementioned case of finite alphabet.\n\nQ: Could you give examples that also motivate the class of explanations you consider in this work?\n\nA: In the revised version, we have also expanded our small examples in the previous version (Example 1 to Example 3). They concern a simple document identification task (using DFA over finite alphabets) and a simple stock trading signal (using interval automata/k-DRA). We show how counterfactual/abductive explanations mean in this context.\n\nQ: Features are never equipped with clearly defined semantics\nA: We agree with this. That said, we would like to convince you that regular languages (and interval automata, as well as k-DRA, in the case of data sequences) are still reasonable representations of features. Firstly, they are well-known to be sufficiently expressive to capture a variety of concepts in many applications. Secondly, a regular language representing a specific feature can itself be learned using an automata learning algorithm. For example, we have a DFA A that classifies whether an input is a spam. Features could be: (1) a DFA B that identifies if the email sender asks for money, and (2) a DFA C that identifies if there are dangerous links (a huge list of known dangerous links). Even when B does not have a clear semantics, it is possible to infer B from examples using a learning algorithm. \n\nQ: What about weights with a few bits? Extracting representations of the output with PAC guarantees?\n\nA: Thank you for this interesting idea for future work. In terms of explainability, the results from Barcelo et al. (2020) showed that small weights (with a fixed number of bits) are sufficient for obtaining NP-hardness for multilayer perceptrons (especially,  MinimumChangeRequired). This NP lower bound carries over to RNN and Transformers. As you correctly pointed out, the proofs of other negative results no longer hold (e.g. Turing-completeness of RNN and Transformers), so a better upper bound could be possible. In terms of a generation of a simplified model (or an explanation), the same working schema that we mentioned above (RNN -> Automata -> explanation) could still be used in this case, but indeed it would be interesting in the future to provide a more solid theoretical guarantee of such a method. [Incidentally, works on extraction of DFA from RNN using ideas of PAC-learning and Angluin's stochastic implementation of equivalence queries are available, e.g., Mayr and Yovine (2018,2021).]"
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8310/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700612124662,
                "cdate": 1700612124662,
                "tmdate": 1700612124662,
                "mdate": 1700612124662,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "zJAC32Mh0B",
            "forum": "73lu1yw6At",
            "replyto": "73lu1yw6At",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission8310/Reviewer_56Yr"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission8310/Reviewer_56Yr"
            ],
            "content": {
                "summary": {
                    "value": "This is a quick review given on a short notice. I did not check in details the\nproofs in the appendix.\n\nThis paper studies the complexity of two types of interpretability queries, in\nthe setting of formal interpretable AI (FXAI):\n- Computing “minimal sufficient reasons”, also called “abductive explanations”:\n  for a given model M and input x over a particular set of features, compute a\n  minimal set of features such that setting their values to those of x suffices\n  to obtain the same classification as x (i.e., all completions are in the same\n  class as x)\n- Computing “counterfactual explanations” also called “minimum change required”.\n  Here we want to know what is the minimum number of feature values to change\n  so that M changes its mind on x. In more generality, given a metric m over\n  the possible inputs, one want to find a closest input x to y according to this\n  metric so that y and x are not classified the same.\n\nThese queries have already been studied, but not for sequential models, which\nthis paper does. The models that it considers are RNNs, Transformers, and\nvariants of finite state automata (FSA) for sequences of rational numbers, with\nranges of rationals as transitions (called interval automata), and possibly\nwith registers that can do comparison (k-DFAs if the automata are\ndeterministic and k registers, k-NFAs if nondeterministic). The features are\nregular languages. Metrics considered are Hamming distance, Edit distance, and\nDynamic Time Warping Distance (DTW).\n\nThe results are:\n\n* For RNNs and Transformers\n1. minimal sufficient reason is undecidable\n2. checking the existence of a counterfactual explanation is undecidable for\n   DTW, and NP-complete for Hamming and Edit distance\n\n* For FSAs:\n3. Checking the existence of a minimal sufficient reason is PSPACE hard\n4. For a fixed k, computing the minimal distance of a counterfactual\n   explanation is PTIME over k-DFAs, for all distances mentioned above \n5. computing the minimal distance of a counterfactual explanation over k-NFAs\n   is NP-hard for Hamming and edit distance, and PSPACE for DWT."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "The idea of using complexity theory to formally compare the interpretability of\nvarious queries over various models is not new, but the originality here is in\nstudying FXAI interpretability queries for sequential models instead of models\nthat only accept inputs of a given length. The idea of using regular languages\nfor the features is interesting, but it is not clear if this is something new\nthat the authors are the first to propose, or if this has been already\nconsidered elsewhere. The paper is overall well written and relatively easy to\nread (modulo the typos). The topic and results are definitely of interest for\nICLR. I found the proof technique for result 4 is interesting."
                },
                "weaknesses": {
                    "value": "*********** Propositon 3 seems to directly contradict Proposition 2: interval automata\n  are more general than DFA, generating is harder than deciding the\n  existence... In fact the proof of Proposition 3 stops in the middle, and I could not\n  locate the proof in the appendix  **************** \nThis has to be fixed. This is why I put a soundness score of 2, but if it was only a mistake \nfrom the authors with their latex files during submission and is corrected the soundness score could go higher\n--------> This has been fixed in the updated version\n\n- results 1, 2 and 3 listed above seem to me to be straightforward translations of\n  existing folklore results. While I agree that there is value in translating and stating these results\n  into the world of FXAI, I find it weird to state these as contribution, theorem, etc, when\n  they could simply be observations that derive from existing work\n\n- p2 \"the same problems were shown to be solvable in polynomial-time for\n  decision trees and perceptrons Barceló et al. (2020)\": This is misleading.\n  According to Barceló et al. (2020), proposition 6, minimum sufficient reasons\n  is NP-hard for decision trees."
                },
                "questions": {
                    "value": "- Beware that minimUM and minimAL sufficient reasons might no have the same\n  complexity: for instance minimUM is NP-hard over decision trees, but minimAL\n  is trivially in linear time for decision trees. In the introduction you mention minimUM, but in\n  the rest of the paper you seem to use minimAL everywhere. This should be clarified (see also the comment\non NP-hardness of minimum vs ptime of minimal for decision trees)\n\n- p4 why do you forbid an abductive explanation to be empty? I think that your\n  definition is broken and should be fixed as follows: it is simply a minimal\n  (under inclusion) subset of features such that v satisfies all features and all\n  completions are classified the same. If this set turns out to be empty, this\n  just means that the model is constant, and so the \"empty\" explanation simply\n  explains this.\n\n- Proposition 2, and in general: you could also consider the setting where the\n  set of features is fixed, which would give you PTIME for DFAs. \n\nI do not really see the point in spending the\n  space to define RNNs in the main text since you are not really using it in the\n  end... This could be hidden in the appendix\n\nTypos and minors\n- In the abstract, first \"DFA\", then \"deterministic finite automata (DFA)\": swap \n- p5 \"that there exists an RNN over...”: existence is not enough I think, you\n  need to be able to compute it.\n- p6 \"let \\Psi be any intervals\": you mean the set of intervals?\n- p6 definition of a run: P is not and should be quantified\n- p6 \"An interval automaton\": missing verb\n- p6 \"is a sequence of numbers in the range...\" -> \"is the set of sequences of numbers in the range...\"\n- p6 \"of interests\" -> interest\n- p6 \"The  complexity of a counterfactual query\": what does this mean? checking\n  existence? checking if there is one with distance \\leq k with k given as\n  input?\n- p7 \"(\\infty, \\infty)\" -> ( - \\infty, \\infty) \n- p9 \"RNN and Transformers are either difficult\": English"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission8310/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission8310/Reviewer_56Yr",
                        "ICLR.cc/2024/Conference/Submission8310/Senior_Area_Chairs"
                    ]
                }
            },
            "number": 5,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission8310/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699588005080,
            "cdate": 1699588005080,
            "tmdate": 1700702383871,
            "mdate": 1700702383871,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "SldbZsXMtv",
                "forum": "73lu1yw6At",
                "replyto": "zJAC32Mh0B",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8310/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8310/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Asking for clarification of what you mean by \"Results 1, 2, and 3\""
                    },
                    "comment": {
                        "value": "Many thanks for the helpful feedback. Could you please quickly clarify what you mean by Results #1, #2, and #3 \"listed above\"? We did not see any list with this numbering in your review, and in our paper Propositions and Theorems have different counters. We would not be able to accurately respond without your clarification. Many thanks in advance."
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8310/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1699951166492,
                "cdate": 1699951166492,
                "tmdate": 1699951166492,
                "mdate": 1699951166492,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "8ut6zf0IQl",
                "forum": "73lu1yw6At",
                "replyto": "SldbZsXMtv",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8310/Reviewer_56Yr"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8310/Reviewer_56Yr"
                ],
                "content": {
                    "title": {
                        "value": "Added missing contributions summary"
                    },
                    "comment": {
                        "value": "Sorry, I misscopy-pasted my text for the \"summary\" box and some part was missing, I have updated the review"
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8310/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700015414937,
                "cdate": 1700015414937,
                "tmdate": 1700015414937,
                "mdate": 1700015414937,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "241q6mQhBw",
                "forum": "73lu1yw6At",
                "replyto": "zJAC32Mh0B",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8310/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8310/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Q: Propositon 3 seems to directly contradict Proposition 2 … interval automata are more general than DFA, generating is harder than deciding the existence... In fact the proof of Proposition 3 stops in the middle, and I could not locate the proof in the appendix **************** This has to be fixed. This is why I put a soundness score of 2, but if it was only a mistake from the authors with their latex files during submission and is corrected the soundness score could go higher\n\nA: Thanks for noticing this. There appeared to be a problem with a LaTeX macro that caused this part (Proposition 3 and incompleted proof) to be displayed when we switched into a submission mode. Certainly, this was not meant to be there, which we have deleted in the revised version. We sincerely apologize for the confusion.\n\nQ: Is the use of regular languages for features original?\n\nA: We did not mean to claim this to be our invention, but rather we believe that this is a natural choice from a theoretical perspective (owing to the central role of regular languages). In addition, from a practical perspective, regular languages subsume some standard notions of features for textual data (e.g. the existence of certain substrings in a text like \"Republicans\" and \"Democrats\"). We have rephrased this in the revised version.\n\nQ: Results 1, 2 and 3 listed above seem to me to be straightforward translations of existing folklore results. While I agree that there is value in translating and stating these results into the world of FXAI, I find it weird to state these as contribution, theorem, etc, when they could simply be observations that derive from existing work\n\nA: We indicated in the paper that these are not the main contributions, e.g., in the Intro, \"We begin by observing …\" (instead of \"proving\"). In addition, results 1, 2 and 3 are stated as \"Propositions\", instead of \"Theorems\" (our main results).\n\nOur contribution for results 1, 2, and 3 is to *observe* that they follow from the existing results, sometimes with a bit of work (the proof sometimes requires a long and tedious encoding, e.g., see Appendix). To the best of our knowledge, these results were never stated, mentioned, and proved anywhere, which is why we state them and provide a proof of them in the appendix for the sake of completeness. In the revised version, we have tried to further emphasize that these are not our main contributions by mentioning \"straightforward applications\" in the introduction.  \n\nQ: Beware that minimUM and minimAL sufficient reasons might no have the same complexity: for instance minimUM is NP-hard over decision trees, but minimAL is trivially in linear time for decision trees. In the introduction you mention minimUM, but in the rest of the paper you seem to use minimAL everywhere. This should be clarified (see also the comment on NP-hardness of minimum vs ptime of minimal for decision trees)\n\nA: Thank you for noticing this. You were right that we meant *minimal* sufficient reasons throughout the paper, which is ptime solvable for decision trees (but is NP-hard for decision lists). We have corrected this in the revised version.\n\n\nQ: p2 \"the same problems were shown to be solvable in polynomial-time for decision trees and perceptrons Barceló et al. (2020)\": This is misleading. According to Barceló et al. (2020), proposition 6, minimum sufficient reasons is NP-hard for decision trees.\n\nA: We thank you for noticing this and apologize for the confusion. Indeed, minimum sufficient reasons are NP-hard for decision trees, whereas minimal sufficient reasons are polynomial-time solvable (which is the problem we deal with in the paper). We have corrected the citations in the revised version.\n\n\n\nQ: p4 why do you forbid an abductive explanation to be empty? I think that your definition is broken and should be fixed as follows: it is simply a minimal (under inclusion) subset of features such that v satisfies all features and all completions are classified the same. If this set turns out to be empty, this just means that the model is constant, and so the \"empty\" explanation simply explains this.\nA: We have incorporated your more general definition in the revised version, noting that an empty intersection results in \\Sigma^*. The PSPACE-hardness result holds either way.\n\nQ: Proposition 2, and in general: you could also consider the setting where the set of features is fixed, which would give you PTIME for DFAs.\n\nA: Thanks for the suggestion. We have added this statement in the text.\n\nQ: I do not really see the point in spending the space to define RNNs in the main text since you are not really using it in the end... This could be hidden in the appendix\n\nA: We have relegated this to the appendix in the new version."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8310/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700611736975,
                "cdate": 1700611736975,
                "tmdate": 1700611736975,
                "mdate": 1700611736975,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "d6CbGDydoq",
                "forum": "73lu1yw6At",
                "replyto": "zJAC32Mh0B",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8310/Reviewer_56Yr"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8310/Reviewer_56Yr"
                ],
                "content": {
                    "title": {
                        "value": "Answer to authors' answer"
                    },
                    "comment": {
                        "value": "Thank you, I am overall a satisfied reviewer with the answers your made to my comments, and with the new version. Now that the problem with Proposition 3 is fixed I will update the soundness score from 2 to 3 (not 4 because I did not have time to check all the proofs). \n\nThat being said, I will not change the final score of my review. Indeed, I still consider that the only place where something technically nontrivial happens in the paper is Theorem 2 from the current version, and that the other results are rather decorative and are primarily here to form a nice and coherent story. It *is* a nice story though, and the paper is nicely written and easy to follow, and by contrast to other reviewers I do not care at all that there are no experiments (but I am not very familiar with ICLR so I will leave this to the appreciation of the PC), so that is why I put \"marginally above acceptance threshold\". But I am not ready to go higher for that reason.\n\nLast comment:\nIn the updated draft, the definition of abductive explanations still includes \"and that M (w) \\neq M (v) for some sequence\nw satisfying all features in any strict subset S' subseteq S\", which should be removed."
                    }
                },
                "number": 12,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8310/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700702306493,
                "cdate": 1700702306493,
                "tmdate": 1700702509801,
                "mdate": 1700702509801,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]