[
    {
        "title": "The (co)limit of metabeliefs"
    },
    {
        "review": {
            "id": "CSilJHLJk2",
            "forum": "8ohamFnX14",
            "replyto": "8ohamFnX14",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission5744/Reviewer_BToD"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission5744/Reviewer_BToD"
            ],
            "content": {
                "summary": {
                    "value": "The paper delves deep into the mathematical analysis of metabeliefs in machine learning. It adopts concepts from category theory, specifically colimits, to describe the structure and relationships of infinite sequences of metabeliefs. The primary objective is to offer a systematic and unified view of metabeliefs. The paper achieves this through a series of lemmas, definitions, and examples, particularly using the rock-paper-scissors game as a recurring motif."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "**Originality:** The paper's approach to metabeliefs through category theory is innovative. The use of colimits provides a fresh perspective on the subject.\n\n**Quality:** The mathematical derivations and lemmas presented are rigorous.\n\n**Clarity:** While dense, the paper is consistent in its language and presentation.\n\n**Significance:** The paper highlights the importance of understanding metabeliefs in machine learning, offering a theoretical foundation for further research."
                },
                "weaknesses": {
                    "value": "**Accessibility:** The dense mathematical language can make it challenging for a broader audience to understand and appreciate the paper's contributions.\n\n**Practical Application:** The paper leans heavily on theory, and more concrete examples or real-world applications might have bolstered its impact.\n\n**Contextualization:** The paper could benefit from a clearer positioning within the broader landscape of machine learning research, specifically in terms of how it complements or diverges from existing works."
                },
                "questions": {
                    "value": "1. Could the authors provide more concrete examples or real-world applications of their theory?\n\n2. How does this work compare and contrast with other mathematical approaches to metabeliefs or similar constructs in machine learning?\n\n3. Are there plans to test the presented theories empirically, or to develop algorithms/tools based on this framework?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission5744/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698679241322,
            "cdate": 1698679241322,
            "tmdate": 1699636602312,
            "mdate": 1699636602312,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "ZGcVPC3VHr",
                "forum": "8ohamFnX14",
                "replyto": "CSilJHLJk2",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5744/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5744/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to reviewer"
                    },
                    "comment": {
                        "value": "We thank the reviewer for their comments. \n\nTo respond to the questions: \n(1) Real-world implications of our theory, would be, for example, to choose the appropriate level of metabeliefs for specific problems, offer guarantees on approximation given a particular choice of level, and reason about compositions of problems.  \n(2) We are unaware of any comparable effort to formulate the problem of metabeliefs. If the reviewer has specific suggestions, those would be appreciated.  \n(3) Yes, we do plan to write subsequent papers on specific applications! As suggested in the introduction, we believe there are quite significant implications across learning, reinforcement learning, and social inference. In each case, engaging with the literate will require additional notion and technical machinery, and we therefore believe it best to tackle these applications in subsequent papers. If the reviewer raises their rating a bit, that would help us move faster toward that goal!\n\nThanks again!"
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5744/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700256179060,
                "cdate": 1700256179060,
                "tmdate": 1700256179060,
                "mdate": 1700256179060,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "j2eshVZ9K8",
                "forum": "8ohamFnX14",
                "replyto": "ZGcVPC3VHr",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5744/Reviewer_BToD"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5744/Reviewer_BToD"
                ],
                "content": {
                    "comment": {
                        "value": "Thanks for your response. I have a hard time connecting the theme of this paper to the scope of ICLR and my second question specifically mentioned \"in machine learning\". \nAfter reading your response to other reviewers, I also was wondering how exactly \"Beliefs are different from strategy\" (in your response to Reviewer y6tA). In one sense, beliefs are our brain's strategy to maintain a world representation that has minimum inconsistencies and fits that of the social group around us."
                    }
                },
                "number": 9,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5744/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700689764103,
                "cdate": 1700689764103,
                "tmdate": 1700689764103,
                "mdate": 1700689764103,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "NrbdlfcMk4",
            "forum": "8ohamFnX14",
            "replyto": "8ohamFnX14",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission5744/Reviewer_xqdq"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission5744/Reviewer_xqdq"
            ],
            "content": {
                "summary": {
                    "value": "This paper explores the topological and geometrical structure of a sequence of beliefs, formalized as their colimit (under final topology) of the spaces of all levels of metabeliefs, which arises when modeling the reasoning about the future among agents in reinforcement learning, Bayesian hierarchical/deep learning, and game theory and economics.\n\nThis paper shows that commonly studies topological properties (such as metrizability, paracompactness, and Hausdorffness) carry over to the colimit of the directed systems pushed by both the weak topology (Theorem 4) or the induced topology of the Wasserstein $p$-distance (whose colimits have the same final topology, Theorem 7), and such constructions carry over to the index-dependent case (Section 2, which may formalize Bayesian hierarchical models with hyperpriors or iterated game such as the iterated rock-paper-scissors or iterated prisoner dilemma).\n\nAs a running example, the paper considers the colimit of the rock-paper-scissors game, and studies its geometrical properties (under Wasserstein $p$-distance, Section 4) in addition to its topological properties."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "The categorical and topological exposition is very well written, for those familiar with such reasoning. The constructions (e.g., final topology on the colimit) are natural (in the categorical sense), and the results are somewhat intuitive and as expected."
                },
                "weaknesses": {
                    "value": "The categorical and geometrical results, while natural, do not have foreseeable applications to machine learning (that I am aware of or can imagine). This is not unexpected for an exploratory paper to propose a new modeling perspective (colimit of topological spaces), but stronger connections to machine learning definitely help."
                },
                "questions": {
                    "value": "While the authors argue that colimit of probability spaces (metrized under the Wasserstein $p$-distance) can model the geometry (and topology) of metabeliefs in co-operative and competitive games, are there examples showing that this modeling is better than other modeling for metabeliefs in terms _applications to machine learning?_"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission5744/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698817724715,
            "cdate": 1698817724715,
            "tmdate": 1699636602186,
            "mdate": 1699636602186,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "jfpuIENb1M",
                "forum": "8ohamFnX14",
                "replyto": "NrbdlfcMk4",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5744/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5744/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to reviewer"
                    },
                    "comment": {
                        "value": "We thank the reviewer for their comments. To respond to the reviewer's question, we are not aware of any comparable methods of modeling metabeliefs to which we may compare. If the reviewer has specific examples in mind, those would be appreciated. \n\nWe agree that understanding how the colimit might be useful in machine learning is important. We believe that applications are beyond the scope of the current paper, given the already significant technical content. To improve the clarity of the connection, we have elaborated the example in Section 4: Computing distance in the colimit: rock-paper-scissors. In particular, we give the solution to the $3\\times 3$ optimization problem, and simplify the integration to remove the infima. We hope this helps make potential connections more clear."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5744/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700256108193,
                "cdate": 1700256108193,
                "tmdate": 1700256108193,
                "mdate": 1700256108193,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "NUvq0Rdta4",
                "forum": "8ohamFnX14",
                "replyto": "jfpuIENb1M",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5744/Reviewer_xqdq"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5744/Reviewer_xqdq"
                ],
                "content": {
                    "comment": {
                        "value": "Thank the authors for the response. However, I maintain my original rating and scores, as I would appreciate a more concrete connection to Machine Learning."
                    }
                },
                "number": 8,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5744/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700636592196,
                "cdate": 1700636592196,
                "tmdate": 1700636592196,
                "mdate": 1700636592196,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "UnLorMepj8",
            "forum": "8ohamFnX14",
            "replyto": "8ohamFnX14",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission5744/Reviewer_cWSP"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission5744/Reviewer_cWSP"
            ],
            "content": {
                "summary": {
                    "value": "This paper studies chains of beliefs with tools from category theory. This is far outside my area of expertise."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "N/A"
                },
                "weaknesses": {
                    "value": "I am not sure if the presentation is understand able to a wider audience, so I'm leaning negative with very low confidence."
                },
                "questions": {
                    "value": "N/A"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "1: You are unable to assess this paper and have alerted the ACs to seek an opinion from different reviewers."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission5744/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699025327068,
            "cdate": 1699025327068,
            "tmdate": 1699636602098,
            "mdate": 1699636602098,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "nY4WoVunqZ",
            "forum": "8ohamFnX14",
            "replyto": "8ohamFnX14",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission5744/Reviewer_y6tA"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission5744/Reviewer_y6tA"
            ],
            "content": {
                "summary": {
                    "value": "ICLR is not an appropriate venue for venue for this paper.\n\n\n-------\nAddendum:\n\nYour last comment was \"Great. It seems we agree that beliefs of finite depth are important.\" No, I'm claiming the opposite. Belief about belief about beliefs to finite depths are not useful and are misleading. The infinite limit (equilibrium) is useful, but as in the link I provided above, stopping at any finite depth often gives beliefs that are a function of the depth, not of anything else.  Beliefs about actions are imperative for intelligent action and AI, but that is not the same.\n\n(I am not objecting to you claiming they are useful, I am objecting to you asserting they are useful without any evidence.  I'm also not clear why a category theory formalization is useful. Also, it isn't really relevant to ICLR.)\n\nIn another answer you said there wasn't a recent literature. Monte Carlo tree search (as, e.g., used in AlphaZero) can be seen as stochastic simulation through the space of belief about beliefs (where the beliefs are about the *actions* of the other agent); one reason it works is that it does not stop at an arbitrary point, but goes to the end of the episode/game. Also, (depending on what you mean by recent) Joe Halpern of Cornell has written many papers on this topic. A quick look found https://www.cs.cornell.edu/home/halpern/abstract.html#journal67"
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "None that I can see."
                },
                "weaknesses": {
                    "value": "The solution to the question at the end of the 4th paragraph after the abstract is \"yes\".  This problem was solved in 1950. The limit P^\\inf(X) is the fixed point which is the definition of a Nash equilibrium. Nash proved the existence of a fixed point, and there is a considerable literature on how to compute them and its complexity (PPAD). The Nash equilibrium has a maximization step (agent agent has a utility it is trying to maximize), which seems essential to the running example, but doesn't  appear in the paper. (One of) the brilliance(s) of Nash's result is that an agent does not need to do the recursive reasoning that this paper is about. We can compute the fixed point directly.\n\nThe rest of the running example is all nonsense. \"In order for Bob to generate his own strategy, he must consider what he knows...\" is not true. Bob doesn't need to do this recursive reasoning."
                },
                "questions": {
                    "value": "Am I wrong?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "details_of_ethics_concerns": {
                    "value": "None"
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission5744/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission5744/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission5744/Reviewer_y6tA"
                    ]
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission5744/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699129815624,
            "cdate": 1699129815624,
            "tmdate": 1700858010139,
            "mdate": 1700858010139,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "JORM8urx3v",
                "forum": "8ohamFnX14",
                "replyto": "nY4WoVunqZ",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5744/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5744/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to your question, and thank you!"
                    },
                    "comment": {
                        "value": "We wish to thank the reviewer for their question. To respond directly: The reviewer is incorrect, Nash equilibria are different from colimit spaces induced by metabeliefs. Specifically, the question at the end of paragraph 4 is ``Can we consider beliefs at all levels simultaneously?''. Beliefs are different from strategy. Nash equilibria assume away the problem of beliefs and this is one reason that such equilibria are not effective models of behavior. Our contribution is to offer a precise mathematical formalization of reasoning about metabeliefs of all levels. \n\nMore technically: \n- The reviewer mentions that ``the limit $P^{\\infty}(\\mathcal{X})$ is the fixed point which is the definition of a Nash equilibrum....\" The space $P^{\\infty}(\\mathcal{X})$ here is a topological space consisting of every distribution in $\\mathcal{P}^n(\\mathcal{X})$ for every finite $n$, as well as points of $\\mathcal{X}$, modulo identifying the embedding of each $\\mathcal{P}^n(\\mathcal{X})$ into $\\mathcal{P}^{n+1}(\\mathcal{X})$. To say that this space is a Nash equilbrium does not make sense: the space is a collection of equivalence classes with a topology imposed on them, a Nash equilibrium is a set of strategies for each player in a non-cooperative game such that each player has no preference for switching strategies.\n- The setting of Nash equilibria applies to non-cooperative games in which each player knows the equilibria strategies of the other players. Our setting is applicable to non-cooperative games, cooperative games, and things that are not games, and is focused in the rock-paper-scissors example on Bob not knowing Alice's strategy, her equilibrium strategy, or even exactly what her space of strategies might be.\n- In order to fix the confusion surrounding the rock-paper-scissors example, we have changed \"In order for Bob to generate his own strategy, he must consider what he knows....\" from the example on page 4 to the following: \"In order for Bob to generate his own strategy, he may consider what he knows....\"\n\nWe apologize for any confusion created by our wording, and thank the reviewer for their comments."
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5744/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700256032376,
                "cdate": 1700256032376,
                "tmdate": 1700256051900,
                "mdate": 1700256051900,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "QznRebOCLo",
                "forum": "8ohamFnX14",
                "replyto": "nY4WoVunqZ",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5744/Reviewer_y6tA"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5744/Reviewer_y6tA"
                ],
                "content": {
                    "title": {
                        "value": "Thinking recursively to arbitrary depths about thinking does not work."
                    },
                    "comment": {
                        "value": "The point of that Nash equilibrium is that we don't need or want to do the infinite regress of meta-beliefs. It is not as though the people who have studied this over the decades did not explore the tree of meta-beliefs; it's just that it is too difficult and not needed,  \"every distribution... for every finite n\" is the wrong thing to do. Every finite set of beliefs about beliefs can give the wrong answer!! (Rock-paper-scissors is too symmetric to explain the problem; I found a good example at https://artint.info/3e/html/ArtInt3e.Ch14.S4.html). In such examples, every finite sequence of meta beliefs gives an arbitrary answer. It's the fixed point / equilibrium, not the space of all finite parts, that forms the rational belief. An agent doesn't need to do the reasoning about meta-beliefs to arbitrary depths, which you just assume is a useful thing to do. \"Nash equilibria assume away the problem of beliefs\" - precisely because the infinite regress is the wrong thing to do (and finite subparts are even more useless). In the paper \"In practice, metabeliefs are typically truncated to a finite sequence.\" isn't true; it is typical that the equilibrium is used (discounting means  finite part is a good approximation to the equilibrium).\n\nIn a Nash equilibria an agent doesn't need to know the strategies of the other players (perhaps selecting which Nash equilibrium, but is there is only one then there is no reason to deviate). There are related equilibria (such as correlated equilibria) for other games (where \"game\" is a very general concept of multi-agent interaction).  There is a reason they rejected the explicit (infinite) regress of meta-beliefs.\n\nThe motivation of the paper seemed to be mis-guided. Perhaps there is a venue for this paper, but ICLR isn't it. (Perhaps KR or AAMAS)."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5744/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700262978574,
                "cdate": 1700262978574,
                "tmdate": 1700263016880,
                "mdate": 1700263016880,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "TSlcWBcATB",
                "forum": "8ohamFnX14",
                "replyto": "nY4WoVunqZ",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5744/Reviewer_y6tA"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5744/Reviewer_y6tA"
                ],
                "content": {
                    "comment": {
                        "value": "I don't disagree that agents need to reason about the probability of the other agents actions. The other agent has beliefs that result in a distribution over their actions. It is that distribution over actions that an agent needs to find the best response to.  None of your examples seems to justify beliefs about beliefs to an arbitrary depth.\n\nThere is a reason why there is not a recent literature on meta-beliefs to arbitrary depths. It doesn't work and we have much better (and simpler!) solutions."
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5744/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700611236958,
                "cdate": 1700611236958,
                "tmdate": 1700612456309,
                "mdate": 1700612456309,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "1urAXhZPJV",
            "forum": "8ohamFnX14",
            "replyto": "8ohamFnX14",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission5744/Reviewer_sas8"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission5744/Reviewer_sas8"
            ],
            "content": {
                "summary": {
                    "value": "This paper deals with the limit of beliefs of beliefs.\nIn a very general setting, without making many structural assumptions, the authors perform a theoretical study of the properties of the limiting space. Their first main theoretical contributions is a result guaranteeing that the limiting space is Hausdorff when the initial space is. They continue their investigation by focussing on distributions with finite p-moments (almost everywhere), which is where their second main theoretical distribution is: they identify and characterise the topology on the limiting space in this setting. Besides this, the paper shows connections between these two settings, ans well as relations with a setting of index-dependent distributions.\nThe authors end their paper with some examples of specific structures, with an summary of how to compute the distance in a simple 3-state game, and with an overview of related work."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "To the best of my knowledge, the content and problem setting are original.\n\nThis paper is well written, and contains clear definitions and results.\nI appreciate the structure of the paper.\nOverall, the paper clearly shows that the authors thought well about their presentation.\nI particularly appreciate the clear set up for each of the three settings; in particular the first and second one.\n\nThe main strength of this paper are the large number of theoretical results.\nThe authors manage to both clearly define all the objects, as well as derive many results in the main text, in a limited space, for which I want to commend them.\nI have tried and checked the proofs.\nTo the best of my knowledge, they are correct—bar two questions I have later on with hopefully minor consequences.\n\nI also like the philosophical justification for the problem under investigation. I admit that I am sceptical about many of the justifications for higher order beliefs, but the limiting approach that the authors take seem well founded, and alleviates some of my initial reservations. I like that the authors do not assume that there is a boundary of the level of uncertainty of uncertainty\n\nIn section 4, the example that shows the most promise in my opinion, is the one about hierarchical models. I like that the authors identify the relevant concepts in their setting."
                },
                "weaknesses": {
                    "value": "I don't think the paper has major weaknesses.\nIts focus certainly is on the theoretical front, so one might argue that the paper lacks applications, simulations, or computational details; however, given the large number of results I would tend to find this of minor importance here.\n\nAs I indicated above, the writing style is very clear. However, I found myself sometimes lost in Section 2, which contains abstract material. I believe that, given the page limitations, it is difficult to improve this, but perhaps some clarifications are possible.\n\nI believe that there on two technical parts, there are details missing. I'll list the details in the section Questions underneath, but they concern Lemma 2 and Lemma 6. I am hopeful, however, that even if I am right, this won't have major consequences for the rest of the story and results."
                },
                "questions": {
                    "value": "I start with my two main questions:\n\n1/ page 3, Lemma 2: I think that the authors need to be careful with the range of n. More specifically, what happens if n=0? Does the metric space {\\cal X} contain distributions?\n- If not, can we always assume that n≥1? Why?\n- If so, that is a structural assumption on {\\cal X} that seems strange, and needs to be spelled out.\nIt could be that I misunderstand something here. What could improve my understanding, is having the answer to the following question: What is the form of the equivalence class that contains an element of {\\cal X}?\n\n2/ page 5, Lemma 6: The authors don't prove that the alleged metric is positive definite (that W(mu,nu)>0 if mu≠nu). I believe that this is a requirement of the usual definition of a metric. Do the authors need this? If so, does their map W satisfy this?\n\nI conclude my review with a list of some small remarks and typos:\n\npage 1, first paragraph following the abstract: \"... to sequences of beliefs quantify uncertainty ...\" should read something like \"... to sequences of beliefs that quantify uncertainty ...\" (so sets with a \"that\", or an alternative).\n\npage 1, second paragraph: There is a dot missing after the third sentence.\n\npage 1, fourth paragraph: \"... one must play of the three options.\" should read \"... one must play one of the three options.\".\n\npage 1, fifth paragraph: \"geoemtric\" should read \"geometric\". In the following sentence, the word \"gives\" is superfluous.\n\npage 2, paragraph following Theorem 1: \"Parts (2)--(6)\" should be \"Parts (2)--(5)\", I believe, since there are only 5 parts in Theorem 1.\n\npage 3, Lemma 3: In the proof, the authors use a result that guarantees that each {\\cal P}^m({\\cal X}) is T1 if {\\cal X} is T1. While I can believe this is true, I would like to have a proof. Is this a standard \nresult? If so, it might be worth giving a reference.\n\npage 3, Lemma 5: Its proof appears in the supplementary material as well as in the paper; perhaps the copy in the paper can be omitted?\n\npage 4, proof of Theorem 4: Theorem 1 part (4) talks about *compact* spaces, and not about the weaker notion of *paracompact* spaces. Why can this be inferred? If that's not immediate, perhaps it suffices for the \nfurther applications that the spaces are compact, in addition to being paracompact?\n\npage 5, Lemma 6: There is a dot missing at the end of the lemma.\n\npage 5, right hand side of Equation (10): the part of the expression after | is not a condition, which reads a bit strangely. I suggest that the authors add that \\tilde\\nu \\in the sets shown, if that's correct.\n\npage 5, Equation (11): Why is does \\Delta^i commute with \\bigcap and \\bigcup? This must be some standard result, but I don't seem to find a reference for this.\n\npage 6, Lemma 11: The authors should define the map ev already here, as they use it in their commuting diagram. Now they only define the map ev later on in Section 2.\n\npage 8, subsection \"Competitive/Cooperative games\": There is a dot lacking between the first two sentences. Also, \"In this sense, both agents beliefs ...\" should read \"In this sense, both agents' beliefs ...\"."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission5744/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission5744/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission5744/Reviewer_sas8"
                    ]
                }
            },
            "number": 5,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission5744/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699490731590,
            "cdate": 1699490731590,
            "tmdate": 1699636601861,
            "mdate": 1699636601861,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "TAskV5cJM9",
                "forum": "8ohamFnX14",
                "replyto": "1urAXhZPJV",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5744/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5744/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Thank you for the careful read and detailed comments!"
                    },
                    "comment": {
                        "value": "We wish to thank the reviewer for their enthusiastic support and helpful and detailed feedback. We have addressed the reviewer's two main questions as follows:\n\n- On page 3 in Lemma 2, we have added the following clarification for $n=0$: In place of \"...$\\mu$ is a unique distribution in $\\mathcal{P}^n(\\mathcal{X})$ such that $\\mu$ is not a single-atom Dirac distribution.\" We replace with: \"...$\\mu$ is a unique distribution in $\\mathcal{P}^n(\\mathcal{X})$ such that $\\mu$ is not a single-atom Dirac distribution or $\\mu$ is a unique point in $\\mathcal{X}$ (recall that $\\delta^0(x)=\\delta_x$ is the Dirac distribution in $\\mathcal{P}(\\mathcal{X})$ with support equal to $\\{x\\}$).\"\n- $W_p^{\\infty}$ is indeed positive definite. We have added this proof to the proof of Lemma 6 given in the appendix: ``Let $\\mu\\in\\mathcal{P}_p^m(\\mathcal{X})$ and $\\nu\\in\\mathcal{P}_p^n(\\mathcal{X})$ with $m\\geq n$ such that $\\mu$ and $\\nu$ are not single-atom Dirac distributions (so they could be either different distributions or points in $\\mathcal{X}$). By definition, $W_p^{\\infty}([\\mu],[\\nu])=W_p^m(\\mu,\\nu_m)$, where $\\nu_m$ is the unique element in the intersection $[\\nu]\\cap\\mathcal{P}_p^m$. Then because $W_p^m$ is a metric, $W_p^m(\\mu,\\nu_m)\\geq 0$ with $W_p^m(\\mu,\\nu_m)=0$ if and only if $\\mu=\\nu_m$. However, if $\\mu=\\nu_m$, then because we have chosen $m$ so that $\\mu$ is not a single-atom Dirac distribution, $\\nu_m$ is not a single-atom Dirac distribution. Therefore since $\\nu_m\\in [\\nu]$ and $[\\nu]$ is the unique non-single-atom Dirac distribution (or point in $\\mathcal{X}$) in $[\\nu]$, we have $\\mu=\\nu_m=\\nu$.\"\n\nWe also fix all of the typos in the list provided, and wish to once again thank the reviewer for providing such a detailed list.\nHere are some more detailed responses to a few of the small remarks:\n\n- The T1 claim may be found in Parthasarathy (2005) \"Introduction to Probability and Measure\", though the statement can also be amended to change T1 to, say, locally compact and metrizable, and the statement is easy to prove directly.\n- Many of the applications (particularly to machine learning) implicitly use compact spaces; however in the statement of part 4 of Theorem 1, \"compact\" can be changed to \"paracompact,\" and the statement is still true (albeit weaker). We have amended this.\n- We have fixed the right-hand side of Equation 10 by removing the unnecessary and confusing portions of the notation: the beginning and ending curly braces and the $\\nu\\in\\mathcal{P}_p^i(\\mathcal{X})$.\n- $\\Delta^i$ commutes with $\\bigcup$ since for any function $f$ and sets $A,B$, $f(A\\cup B)=f(A)\\cup f(B)$. To make the passage from equation 11 to equation 12 more clear, we have added a few lines to the proof (including why $\\Delta^i$ commutes with $\\bigcap$). This addition begins immediately following Equation 11, \"Applying $\\Delta^i$...\" and continues until just before Equation 14, terminating with, \"Now, Equation 13 becomes:\"."
                    }
                },
                "number": 1,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5744/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700255755622,
                "cdate": 1700255755622,
                "tmdate": 1700256296113,
                "mdate": 1700256296113,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]