[
    {
        "title": "Time Fairness in Online Knapsack Problems"
    },
    {
        "review": {
            "id": "94mfT0Fz6M",
            "forum": "9kG7TwgLYu",
            "replyto": "9kG7TwgLYu",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4055/Reviewer_rQKw"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4055/Reviewer_rQKw"
            ],
            "content": {
                "summary": {
                    "value": "The authors study time fairness in online knapsack problems (OKPs). Since time-independent fairness is not achievable in OKP, they study the theoretical trade off between competitiveness and fairness with the notion of alpha-conditional time-independent fairness (alpha-CTIF). Several deterministic and randomized algorithms (including some proposed by the authors) are discussed. Numerical experiments comparing these algorithms are conducted on three OKP instances."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "The paper is well written and the results are technically sound. The notion of alpha-CTIF is new. In the deterministic case, both a lower bound on the achievable competitive ratio and an alpha-CTIF online deterministic algorithm achieving this lower bound are given."
                },
                "weaknesses": {
                    "value": "1. The definition of alpha-CTIF does not come naturally to me. Since this definition is new, I would appreciate more motivation behind its use.\n2. Numerical experiments are conducted on a limited number of instances, and therefore not very informative."
                },
                "questions": {
                    "value": "The authors mention that the notion of alpha-CTIF can be potentially adaptable to other online problems. How should one genearlize this notion to other problems? Can they give some examples?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission4055/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4055/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4055/Reviewer_rQKw"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4055/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1697929805287,
            "cdate": 1697929805287,
            "tmdate": 1699636369398,
            "mdate": 1699636369398,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "mxQpb9Y2TR",
                "forum": "9kG7TwgLYu",
                "replyto": "94mfT0Fz6M",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4055/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4055/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Thanks for your review and comments about our paper! Please find our response below:\n\n- **(motivation for α-CTIF)**  \nWe will carefully revise the presentation to clarify the definition based on feedback.\nIn Example 1.1, we describe an empirical problem of cloud resource management, which reduces to the online knapsack problem.\nOur study of the tradeoff between static and dynamic pricing (theoretically, α-CTIF) is primarily motivated by the observation that cloud resource providers almost never use dynamic pricing in the real world because it is inconvenient for and *inequitable towards* consumers.  Since the canonical optimal ZCL algorithm corresponds to a nearly fully dynamic pricing strategy, there is a disconnect between the theoretically optimal revenue maximization strategy and the static pricing which is actually used.\nStatic pricing is simple and interpretable, but has drawbacks in terms of revenue maximization and demand response.  Our work then considers how we can interpolate between these two extremes in a theoretically rigorous way, which corresponds to a formalization of the “surge pricing” model employed by e.g. ridesharing platforms.  This motivates the definition of α-CTIF, where α allows us to tune the tradeoff between these two pricing models.\n\n\n- **(adapting fairness to other online problems)**  \nWe do believe that the notion of α-CTIF can be adapted easily for other online problems, and will expand on this potential generalization.  We think the notion is flexible and natural in many other contexts, and our hope is that this work is seen to be as much about the general framework and techniques as it is about the specific OKP setting.\nIn general, α-CTIF should be applicable to any online problem where decisions are of an “accept or reject” nature.  A special case of α-CTIF has already been studied in [1] for prophet inequalities, and further generalizations may apply to online problems such as time-series search [2], interval scheduling [3], independent set [4], bipartite matching [5] or multiple knapsack [6].  \nIn each of these online problems, an irrevocable (and possibly weighted) accept/reject decision must be made at each time step. The high-level notion of time fairness then captures the concept that items should be treated fairly in the online decision-making process, regardless of their arrival position in the sequence.  \nFor instance, α-CTIF could be meaningful in a problem such as online bipartite matching [5], where the nodes in one “half” of a bipartite graph arrive online and the algorithm must make an irrevocable matching to the offline nodes, which may be weighted (e.g. of different quality). Most traditionally competitive approaches to this problem would tend to match early arrival nodes to higher-quality offline nodes, while matching late arrivals with lower-quality offline nodes, thereby violating an equitable notion of access across arrival times, and motivating our definitions of time fairness across nodes arriving at different times.\nWe believe that time fairness is a challenging, intellectually interesting, and yet empirically important constraint to consider in the context of many such online problems.\n\n[1] M. Arsenis and R. Kleinberg. *Individual fairness in prophet inequalities*. EC ’22. doi:10.1145/3490486.3538301.\n\n[2] R. El-Yaniv, A. Fiat, R. M. Karp, and G. Turpin. *Optimal search and one-way trading online algorithms*.\nAlgorithmica, 30(1):101–139, May 2001. doi:10.1007/s00453-001-0003-0\n\n[3] R. Lipton and A. Tomkins. *Online Interval Scheduling*. SODA ‘94. doi:10.5555/314464.314506\n\n[4] M. M. Halldórsson, K. Iwama, S. Miyazaki, and S. Taketomi. *Online independent sets*. Theoretical Computer Science, (289)2:953-962, 2002. doi:10.1016/S0304-3975(01)00411-X.\n\n[5] R. M. Karp, U. V. Vazirani, and V. V. Vazirani. *An optimal algorithm for on-line bipartite matching*. STOC ‘90. \n\n[6] M. Cygan, Ł. Jeż, and J. Sgall. *Online knapsack revisited*. Theory of Computing Systems 58 (2016): 153-190."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4055/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700015666591,
                "cdate": 1700015666591,
                "tmdate": 1700015666591,
                "mdate": 1700015666591,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "30hK5mw8Ll",
                "forum": "9kG7TwgLYu",
                "replyto": "mxQpb9Y2TR",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4055/Reviewer_rQKw"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4055/Reviewer_rQKw"
                ],
                "content": {
                    "comment": {
                        "value": "I appreciate the authors' detailed reply. Could you please explain to me why the fairness notion in [1] is a special case of $\\alpha$-CTIF?"
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4055/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700025272188,
                "cdate": 1700025272188,
                "tmdate": 1700025272188,
                "mdate": 1700025272188,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "4nz25W7T1q",
                "forum": "9kG7TwgLYu",
                "replyto": "6dmABxp5VR",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4055/Reviewer_rQKw"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4055/Reviewer_rQKw"
                ],
                "content": {
                    "comment": {
                        "value": "Thanks for the clarification. I intend to keep my score."
                    }
                },
                "number": 8,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4055/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700151147537,
                "cdate": 1700151147537,
                "tmdate": 1700151147537,
                "mdate": 1700151147537,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "OfHjzA8245",
            "forum": "9kG7TwgLYu",
            "replyto": "9kG7TwgLYu",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4055/Reviewer_zsDR"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4055/Reviewer_zsDR"
            ],
            "content": {
                "summary": {
                    "value": "This paper considers a variant of the online knapsack problem in which items arrive online, and the algorithm does not know the weight and value of the item before it arrives. Upon each arrival, the algorithm must make an irrevocable decision to either accept or reject the item. The goal is to accept a set of items such that (1) the total weight of the accepted item does not exceed the capacity of the knapsack; (2) the total value of the accepted items is maximized. By observing that the algorithm for the online knapsack problem may not be fair for each item, the authors include a fairness constraint to the problem, which leads to a new variant of the problem.\nThe main contribution is a fairness notation, and they show that such a fairness notation is too strong to admit a bounded competitive algorithm. They then relax the constraint and propose a deterministic algorithm that is Pareto optimal on fairness and efficiency. In addition, the authors also consider the learning-augmented algorithms. This work also includes some numerical experiments."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "1.The studied problem is generally well-motivated, i.e., it aims to include the fairness constraint to the online knapsack problem. The motivation is clear, although I think the example given in the paper is not convincing. See the weakness below.\n2.The paper is solidly technical. Although the basic idea of the algorithm comes from the classical threshold algorithm of OKP, the proposed algorithm contains sufficient new ideas and analysis.\n3.The results included in the paper are rich. The authors provide a lower bound for the studied problem. In addition, the authors show that randomness can further improve the ratio. Furthermore, the learning-augmented algorithm is also considered in the paper."
                },
                "weaknesses": {
                    "value": "1.The main weakness is that the motivation of the definition of \\alpha-CTIF is not clear. I agree that \\alpha-CTIF is a well-defined definition. I have taken a quick look at the proof of Theorem 4.3, and I also understand that such a definition plays an important role in the analysis. But the practical meaning of such a relaxation is not clear. For example, when \\alpha=0 or epsilon, what does \\alpha-CTIF stand for? This part is important since the main purpose of the work is to make the OKP’s algorithm fair. Thus, finding a suitable fairness notion is critical.\n2.It seems that the authors try to claim that fairness is important in the online knapsack problem by Example 1.1. But Example 1.1 is just a typical example of the online knapsack problem, and it does not reflect the importance of fairness. One may need to find another example to convince people about the importance of fairness."
                },
                "questions": {
                    "value": "Please see weakness above."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission4055/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4055/Reviewer_zsDR",
                        "ICLR.cc/2024/Conference/Submission4055/Senior_Area_Chairs"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4055/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698643042329,
            "cdate": 1698643042329,
            "tmdate": 1700119598030,
            "mdate": 1700119598030,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "KwWSeZKqOn",
                "forum": "9kG7TwgLYu",
                "replyto": "OfHjzA8245",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4055/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4055/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for your review and comments about our paper! Please find our response below:\n\n- **(definition of α-CTIF (1))**  \nWe will clarify the motivation behind the definition based on feedback.\nThe practical meaning of the α-CTIF constraint is simply that we maintain our desired objective of time fairness in admitting items over at least an α-fraction of the knapsack capacity.  More formally, during the entirety of this α-fair region, an item’s probability of admission is independent of its arrival time within the input sequence, *as long as* there is capacity for it. This last technical capacity condition turns out to be necessary to get absolutely any fairness guarantees whatsoever (Theorem 3.3).\nSince our motivation is to study the inherent quantitative tradeoff between the competitive ratio (performance) and fairness, we use the parameter α in the notion of α-CTIF to precisely quantify the amount of fairness: larger α corresponds to a stronger fairness constraint.\nWe note that the definition of α-CTIF is not meaningful for $\\alpha < 1/ \\ln(U/L)+1$ (including $\\alpha = 0$ or $\\alpha = \\epsilon$). For any value of $\\alpha \\leq 1/ \\ln(U/L)+1$, α-CTIF is already attained by the canonical online ZCL algorithm [1], which is optimally competitive. We discuss this point in the proof of Proposition 4.2 (in the appendix), but it is not stated explicitly in the main body of the paper – we will carefully revise and explicitly mention this observation where it is appropriate.  \nIn particular, α-CTIF is only meaningful and of interest when $\\alpha > 1/ \\ln(U/L)+1$. In practical terms, this corresponds to the case where the static pricing period is longer, compared to the dynamic but “unfair” pricing approach used by the exponential threshold function of the optimal ZCL algorithm.\n\n- **(importance of fairness (2))**  \nWe will carefully revise the presentation to clarify the following motivation.\nIt is true, as you point out, that Example 1.1 is a typical example of the online knapsack problem, but our study of the tradeoff between competitiveness and time fairness (corresponding broadly to the tradeoff between dynamic and static pricing) is motivated by the observation that cloud resource providers almost never use dynamic pricing in the real world, because it is inconvenient for and *inequitable towards* consumers.  \nTheoretical studies [2] have shown that dynamic pricing strategies (such as the ZCL algorithm) for the cloud resource management problem can improve performance.  However, these dynamic pricing strategies introduce price discrimination; clients may need to be charged different prices for the same resource to achieve the best performance bound. The long-term market impacts of such price discrimination are unclear, although dynamic pricing has seen success in airline ticket pricing and ride-sharing pricing applications.\nIn cloud resource management, the dominant paradigm used in practice is static pricing, which is simple and interpretable from the consumer perspective (and roughly corresponds to increased values of α in α-CTIF), but comes with drawbacks in terms of revenue maximization and demand response.  \nThus, we aim to study the fairness issue based on this example, proposing α-CTIF as a theoretically rigorous method to capture the trade-off between static vs. dynamic pricing (resp. fairness vs. competitive ratio), where the value of α allows us to interpolate between these two opposing pricing models.  Using such a combination of static and dynamic pricing can be interpreted as a formalization of the “surge pricing” model used by, e.g., rideshare platforms [3].  Beyond cloud resource management, we also anticipate that this tradeoff between static and dynamic pricing could be broadly applicable. \n\n[1] Y. Zhou, D. Chakrabarty, and R. Lukose. *Budget constrained bidding in keyword auctions and online knapsack problems*. WWW ’08. doi:10.1145/1367497.1367747\n\n[2] Z. Zhang, Z. Li, and C. Wu. *Optimal posted prices for online cloud resource allocation*. SIGMETRICS Perform. Eval. Rev., 45(1):60, 2017. doi:10.1145/3143314.3078529.\n\n[3] J. Hall, C. Kendrick, and C. Nosko. *The effects of Uber’s surge pricing: A case study*. The University of Chicago Booth School of Business, 2015."
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4055/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700015455433,
                "cdate": 1700015455433,
                "tmdate": 1700015688340,
                "mdate": 1700015688340,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "ElFJ49f1e1",
                "forum": "9kG7TwgLYu",
                "replyto": "KwWSeZKqOn",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4055/Reviewer_zsDR"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4055/Reviewer_zsDR"
                ],
                "content": {
                    "title": {
                        "value": "Thank you!"
                    },
                    "comment": {
                        "value": "Thank you for addressing my questions. I have read the response. Now, I got the relaxation of alpha-CTIF. It basically relaxes the probability of acceptance probability of an item so that the arrival order also has a slight impact on the acceptance probability. I think the relaxation makes sense, and I have improved my score."
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4055/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700119563092,
                "cdate": 1700119563092,
                "tmdate": 1700119563092,
                "mdate": 1700119563092,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "p2IxWtUFcD",
            "forum": "9kG7TwgLYu",
            "replyto": "9kG7TwgLYu",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4055/Reviewer_37F8"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4055/Reviewer_37F8"
            ],
            "content": {
                "summary": {
                    "value": "This paper studies the online knapsack problem (OKP) from the perspective of fairness. In particular, the authors are interested in competitive algorithms that don’t discriminate items based on when they appear in the sequence of observed items. First, they formalize the notion of time fairness. Second, they observe that previous OKP algorithms with good competitive ratios are not time-fair. Third, they show that randomization can be used to reach Pareto-optimal trade-off between fairness and competitiveness. Pareto optimality here, means that neither measure can be increased without decreasing the other. Fourth, they run empirical experiments, which show poor performance of the randomized algorithm. The authors liken this to the results of Reineke in 2014, where similarly poor empirical performance was observed on theoretically strong randomized algorithms for caching.  Fifth, they show that learning-augmented algorithms can be used to improve both fairness and competitiveness. Finally, they show the superior experimental performance of the learning-augmented algorithms."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "Originality: Online knapsack is well studied, but this paper is the first to study the fairness aspect of the problem under adversarial sequences.\n\nResult Quality: The investigation is thorough. The authors combine ideas from mathematics, economics, and experimentation effectively to produce nice theoretical contributions that are driven farther and validated by experimentation.  \n\nWriting Quality / Clarity: I am a non-expert in this field. I found the paper well-written. I was especially pleased with the clear introduction.\n\nSignificance: The result is a good quality contribution for ICLR."
                },
                "weaknesses": {
                    "value": "Originality:  If I understand correctly, there are previous papers that study fairness in OKP when the sequence is not adversarial. Not necessarily a weakness of this paper, but an observation that is relevant about the originality of the study.\n\nSignificance: Like most papers at ICLR, this paper is probably of interest to a small subcommunity at the conference. I believe this is true of most papers at the conference, so it is not a negative comment towards a paper."
                },
                "questions": {
                    "value": "Are there any Pareto-optimality claims to be made about the learning-augmented algorithms that you describe in the later part of the paper?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission4055/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4055/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4055/Reviewer_37F8"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4055/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698808027697,
            "cdate": 1698808027697,
            "tmdate": 1699636369271,
            "mdate": 1699636369271,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "acdrInd95I",
                "forum": "9kG7TwgLYu",
                "replyto": "p2IxWtUFcD",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4055/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4055/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Thanks for your review and positive comments about our paper!  Please find our response below:\n- **(Pareto-optimality of the proposed learning-augmented algorithm)**  \nWe will add a remark in the paper to clarify and highlight the following point:  in Theorem 4.13, we prove that our algorithm is on the Pareto frontier – namely, when $\\gamma \\to 1$, LA-ECT obtains the optimal consistency-robustness tradeoff.  It would be very interesting to study whether our algorithm achieves the Pareto-optimal trade-off for arbitrary values of $\\gamma$. Thank you very much for the suggestion!"
                    }
                },
                "number": 1,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4055/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700015290437,
                "cdate": 1700015290437,
                "tmdate": 1700015290437,
                "mdate": 1700015290437,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "CFVKWcNEwI",
                "forum": "9kG7TwgLYu",
                "replyto": "acdrInd95I",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4055/Reviewer_37F8"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4055/Reviewer_37F8"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for your response. I would recommend clarifying this point in the paper."
                    }
                },
                "number": 9,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4055/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700506338550,
                "cdate": 1700506338550,
                "tmdate": 1700506338550,
                "mdate": 1700506338550,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]