[
    {
        "title": "realSEUDO for real-time calcium imaging analysis"
    },
    {
        "review": {
            "id": "54iOlnkYff",
            "forum": "b7DsNJYmeo",
            "replyto": "b7DsNJYmeo",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6111/Reviewer_vjPy"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6111/Reviewer_vjPy"
            ],
            "content": {
                "summary": {
                    "value": "This paper presents a software suite for real-time extraction of neural activity from calcium imaging video data for a neural population. The general problem is one of identifying pixel/voxels that correspond to a single neuron, and the CI intensity time profile of that neuron, over all neurons in the population that has been imaged in a CI video. The difficulty of the problem is well known since neurons very close to each ther (and therefore overlapping on pixels) tend to spike approximately synchronously, and therefore their calcium imaging intensity profiles have major temporal overlaps. The problem therefore requires both clustering of pixels (corresponding to a single neuron) and demixing of time profiles of these neurons. Various objectives have been proposed over the years with different regularization terms.\n\nThis paper starts with the objective proposed by SEUDO (Sparse emulation of unused dictionary objects) which minimizes the minimum of two terms, one an L2, and the second a sum of an L2 and L1 term. Essentially making it a weighted LASSO problem. The paper then uses the FISTA (fast iterative shrinkage thresholding algorithm) algorithm for the lasso problem to solve the chosen seudo CI objective function. \nThe paper then throws in many additional software tweaks. 1) reducing the number of momentum descents 2) adding parallellism 3) optimizing smoothness parameters, etc., to get it to a point where the optimization can be done in real time,"
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "With SEUDO+FISTA+ all the additional tweaks that the authors have introduced, they do manage to solve the problem on-line from a 30 frames per second CI video. This is demonstrated both in simulated data and a real in-vivo CA1 dataset, and compared against a competing technique ONAcid."
                },
                "weaknesses": {
                    "value": "Unfortunately, all the contributions of this paper are tweaks to the already present SEUDO and FISTA; the tweaks are all listed in section 3. These include, using a fast implementation of lasso using fista in a c++ library, solving the problem in a patch based manner in parallel (since pixels corresponding to a neuron are naturally localized in a video frame), speeding up a gradient calculation which requires computing the product of a matrix with its transpose by splitting things up into two steps and assuming the matrix is sparse, realizing that gaussian kernel in seudo does not have to be too small and can be enlarged without loss of accuracy, and many many more.\n\nEach tweak can be justified only under particular situations, and moreover it was very difficult to tell what the contribution of each tweak was to the overall speed up of the technique."
                },
                "questions": {
                    "value": "It would be very helpful if the authors could run a profiler where they turn each tweak on and off and run it on several simulated datasets, so that the contribution of each tweak to the overall performance becomes clear."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6111/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698005895445,
            "cdate": 1698005895445,
            "tmdate": 1699636660426,
            "mdate": 1699636660426,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "9Ck6eAui4S",
            "forum": "b7DsNJYmeo",
            "replyto": "b7DsNJYmeo",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6111/Reviewer_11J3"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6111/Reviewer_11J3"
            ],
            "content": {
                "summary": {
                    "value": "The paper presents a new method, realSEUDO, that improves upon existing methods (e.g. CNMF, OnACID, SEUDO) for online analysis of calcium images. It runs faster than previous methods and can better handle missing cells. It is primarily based on the time-trace estimator SEUDO method."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "It is a great benefit to require no initialization (empty stack) to begin to run this algorithm online. \n\nIt is an evident strength to be able to run at faster framerates (>100 fps in some benchmarks). \n\nPaper is well-written and figures demonstrating benchmarks are clear."
                },
                "weaknesses": {
                    "value": "Numerous typos (e.g. 'optimizaiton', 'incporporation') should be addressed with a spellchecker. \n\nThe explanation of the method is a bit lacking. While it does draw heavily on previously published methods, more description and intuition beyond copying the formulas (Eqns 2-5) should be given. \nThe main text would also benefit from an overall algorithm, because it became quite confusing where each of the authors' iterative improvements fit into the method as a whole. \n\nOnly one real dataset was used for comparison, with quite small image sizes, and it did not appear to be an existing community standard (e.g. neurofinder or previously manually annotated datasets). It would be good to include these comparisons as well."
                },
                "questions": {
                    "value": "Could the authors clarify what they mean by 'FIOLA further requires GPU and CPU optimizaiton [sp], raising the computational infrastructure costs'? What optimization and how does it increase costs?\n\nFor the new cell finding from residuals, could the authors provide a comparison with how e.g. OnACID handles this? Not just a comparison of the results, but of the approach."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "Yes, Research integrity issues (e.g., plagiarism, dual submission)",
                        "Yes, Other reasons (please specify below)"
                    ]
                },
                "details_of_ethics_concerns": {
                    "value": "I suspect this is just a case of one author re-using their own figures, versus copying from someone else's work, but since this is blind I figured I'd mention it anyway. In this paper Figure 1 B is a direct copy of another paper's Figure 1 A (https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=8683375, G. Mishne and A. S. Charles, \"Learning Spatially-correlated Temporal Dictionaries for Calcium Imaging,\" ICASSP 2019 - 2019 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP), Brighton, UK, 2019, pp. 1065-1069, doi: 10.1109/ICASSP.2019.8683375.). \nI would consider this minor but needing to be addressed by the authors."
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission6111/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6111/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6111/Reviewer_11J3"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6111/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698702935105,
            "cdate": 1698702935105,
            "tmdate": 1699636660317,
            "mdate": 1699636660317,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "lrfaZN08b6",
            "forum": "b7DsNJYmeo",
            "replyto": "b7DsNJYmeo",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6111/Reviewer_26AX"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6111/Reviewer_26AX"
            ],
            "content": {
                "summary": {
                    "value": "The manuscript proposes a new real-time processing workflow for multi-photon calcium imaging (CI). The proposed workflow turns the Sparse Emulation of Unused Dictionary Objects (SEUDO) algorithm to a new on-line processing algorithm that simultaneously identifies neurons in the fluorescence video and infers their time traces. The experiments demonstrate comparable performance to offline algorithms (e.g., CNMF), and improved performance over the current on-line approach (OnACID)."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "1. The manuscript gives very detailed implementation information on how to achieve online processing speed.\n\n2. The impact of real-time inference of neural activity from streaming recordings is significant in neuroscience.\n\n3. The motivation and the existing methods are articulated very clearly."
                },
                "weaknesses": {
                    "value": "1. The manuscript is mainly about documenting implementation tricks. The changes are rather heuristic, e.g. reducing the number of times the gradient is used, without too much theoretical justification. I'm sure it works in practice, but the methodological contribution is incremental in the conventional sense.\n\n2. It is unclear why the authors would want to seek a solution that does not need any initialization data and can be run on simpler CPU machines. These are no longer bottlenecks in today's research labs. GPUs are easily accessible."
                },
                "questions": {
                    "value": "N/A"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6111/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698810065025,
            "cdate": 1698810065025,
            "tmdate": 1699636660205,
            "mdate": 1699636660205,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    }
]