[
    {
        "title": "READ: Recurrent Adaptation of Large Transformers"
    },
    {
        "review": {
            "id": "clGzIcrXOy",
            "forum": "bC50ZOyPQm",
            "replyto": "bC50ZOyPQm",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission3893/Reviewer_avag"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission3893/Reviewer_avag"
            ],
            "content": {
                "summary": {
                    "value": "In this paper, the authors proposed REcurrent ADaption (READ), a lightweight and memory-efficient fine-tuning method for pre-trained foundation models. READ inserts a small RNN network alongside the frozen backbone model, which is trained for downstream tasks. READ can achieve comparable or better accuracy compared to existing parameter-efficient fine-tuning methods on the GLUE benchmark, using less training memory and energy consumption."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "1. Firstly, the paper is generally well-written and easy to follow.\n2. There is no need for an extra step pre-training the side network due to the compact design, making the transfer learning pipeline simple. \n3. The proposed method achieves a better accuracy-energy trade-off compared to existing methods on GLUE."
                },
                "weaknesses": {
                    "value": "1. The writing quality should be improved. For example, Appendix?? and Table ??  in Sec 4. \n2. The experiments are quite restricted, only using T5 on GLUE benchmarks. It would be better to evaluate more model architectures like GPT-style (if LLaMA is too expensive for the hardware setup, maybe evaluate smaller ones like GPT-2) and more tasks. \n3. The latency evaluation in Figure 6 is confusing: why are BitFit and LoRA slower compared to vanilla fine-tuning? Both methods do not introduce extra parameters into the base model (LoRA weights can be fused). It is not reasonable that READ is faster than BitFit/LoRA. \n4. What is the non-recurrency setting in Table 2? Why are there more training parameters?\n5. The power statistics from NVIDIA's smi are highly unstable. Have you found the calculation to be stable based on a minute-level sampling?\n6. One good thing about transformers is the better training parallelism compared to RNN models. Does the design prevent parallel training due to the recursive nature? (I think it can still be parallelized if using the vanilla RNN)"
                },
                "questions": {
                    "value": "Please see the questions in the weakness sections. I will wait for the authors' feedback for the final ratings."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission3893/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698266283940,
            "cdate": 1698266283940,
            "tmdate": 1699636348197,
            "mdate": 1699636348197,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "DdjdDTkd6r",
                "forum": "bC50ZOyPQm",
                "replyto": "clGzIcrXOy",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3893/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3893/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "> The writing quality should be improved. For example, Appendix?? and Table ?? in Sec 4.\n\nThank you for spotting these errors. We will revised the paper to correct these mistakes. \n\n> The experiments are quite restricted, only using T5 on GLUE benchmarks. It would be better to evaluate more model architectures like GPT-style (if LLaMA is too expensive for the hardware setup, maybe evaluate smaller ones like GPT-2) and more tasks.\n\nThank you for your suggestion, we will run this experiment in the revised version.\n\n> What is the non-recurrency setting in Table 2? Why are there more training parameters?\nThe power statistics from NVIDIA's smi are highly unstable. Have you found the calculation to be stable based on a minute-level sampling?\n\nOne good thing about transformers is the better training parallelism compared to RNN models. Does the design prevent parallel training due to the recursive nature? (I think it can still be parallelized if using the vanilla RNN)\n\nThank you for highlighting the significance of a reliable energy consumption comparison. To ensure a fair comparison, we controlled for key factors like training code, optimization algorithm, and hardware across all experiments. Lastly, it's worth noting that the methodology we employ for measuring energy consumption using NVIDIA System Management Interface (i.e. nvidia-smi) is not new, but rather widely recognized and adopted. For example, one can refer to the following papers\n\n[1] Eva García-Martín, Crefeda Faviola Rodrigues, Graham Riley, Håkan Grahn, Estimation of energy consumption in machine learning\n\n[2] Kiran Kasichayanula; Dan Terpstra; Piotr Luszczek; Stan Tomov; Shirley Moore; Gregory D. Peterson, Power Aware Computing on GPUs\n\n[3] Gingfung Yeung, Damian Borowiec, Adrian Friday, Richard Harper, and Peter Garraghan, Towards GPU Utilization Prediction for Cloud Deep Learning\n\n[4] Joseph McDonald, Baolin Li, Nathan Frey, Devesh Tiwari, Vijay Gadepally, Siddharth Samsi, Great Power, Great Responsibility: Recommendations for Reducing Energy for Training Language Models\n\n[5] ROBERT A. BRIDGES, NEENA IMAM, and TIFFANY M. MINTZ, Understanding GPU Power: A Survey of Profiling, Modeling, and Simulation Methods"
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3893/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700581532393,
                "cdate": 1700581532393,
                "tmdate": 1700581532393,
                "mdate": 1700581532393,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "rx3n3qAvvW",
                "forum": "bC50ZOyPQm",
                "replyto": "DdjdDTkd6r",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3893/Reviewer_avag"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3893/Reviewer_avag"
                ],
                "content": {
                    "comment": {
                        "value": "Thanks to the authors for the rebuttal. However, I would like to stick to my previous ratings without further evidence. \n\n- Without further evidence, it is hard to demonstrate the generalizability of the proposed method\n- There lack a response to my question 3, 4, 6"
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3893/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700681861548,
                "cdate": 1700681861548,
                "tmdate": 1700681861548,
                "mdate": 1700681861548,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "4dtpRNkxdi",
            "forum": "bC50ZOyPQm",
            "replyto": "bC50ZOyPQm",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission3893/Reviewer_UGG1"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission3893/Reviewer_UGG1"
            ],
            "content": {
                "summary": {
                    "value": "This paper presents READ (Recurrent Adaption), a light weight and memory-efficient finetuning method by inserting a small RNN network to bypass the back propagation to the large backbone network. Results show that READ can achieve great reduction in both memory and energy consumption."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "(1) Clear description of the proposed method in Section 2.\n\n(2) Good evaluation of the proposed method on T5 model and GLUE benchmark."
                },
                "weaknesses": {
                    "value": "(1) The main result described in abstract/introduction (memory consumption reduced by 56%, and gpu energy reduced by 84%) are compared with full-tuning, not the SOTA memory/energy-efficient finetuning methods. At least we need another data point: a direct comparison to the current best SOTA. From the figure 2, I believe that the comparison with SOTA will lead to much smaller reduction percentages.\n\n(2) A drawback in figure 2 is that it’s hard to justify the advantage of the proposed READ method by just a single data point. Ideally, it’d be helpful to have multiple data points for READ, under different energy/memory consumptions, in order to build a “Pareto curve”. In this way, it’d be much easier to tell whether READ advances the whole Pareto frontier.\n\n(3) In Table 1, it is unfair to only try the proposed method on the larger T5-large. You need to also try other methods + larger T5 in order to prove your points.\n\n(4) As the authors also mentioned in limitation section, it’d be great to add evaluation on GPT-style models and corresponding downstream tasks.\n\n(5) To me, the overall proposed idea make sense but not very exciting. It seems more like an incremental work compared to existing methods (the RNN being the only main novelty)."
                },
                "questions": {
                    "value": "See the concerns I listed in weaknesses."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission3893/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission3893/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission3893/Reviewer_UGG1"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission3893/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698738112906,
            "cdate": 1698738112906,
            "tmdate": 1699636348107,
            "mdate": 1699636348107,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "zxiASIljuw",
                "forum": "bC50ZOyPQm",
                "replyto": "4dtpRNkxdi",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3893/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3893/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "(1) In Figure 1 and 2, we directly compare READ to other PEFT methods. The reduction percentage is still around 30% compared to LoRA and Adapter in terms of training memory. \n\n(2) Thank you for your suggestion, we will run this experiment in the revised version. \n\n(3) Given the same memory constraint, one can use read to fine-tune a larger model. We show the comparison between the base models and READ on T5 large to show the benefit of READ on the same memory constraint. \n\n(4)  Thank you for your suggestion, we will run this experiment in the revised version"
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3893/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700581473417,
                "cdate": 1700581473417,
                "tmdate": 1700581473417,
                "mdate": 1700581473417,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "scu5kaE6sC",
            "forum": "bC50ZOyPQm",
            "replyto": "bC50ZOyPQm",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission3893/Reviewer_BXAc"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission3893/Reviewer_BXAc"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes a efficient adaptation method, recurrent adaption (READ), for Transformers.  The idea is to use recurrent neural networks plus the so-called Joiner networks to learn the correction for the output of the original transformer backbone during fine-tuning.  The experiments verify the effectiveness of the proposed approach."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "1 poor"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "- According to the experimental result presented in this paper, the saving in memory consumption and energy usage are decent.\n\n- The idea of learning _corrections_ for the output of the original Transformer is well-motivated and looks interesting to me. That being said, given my limited familiarity with existing methods in this domain, I'm unable to ascertain the novelty of this idea.\n\n- The authors are upfront about the limitation of the current paper in Sec. 6."
                },
                "weaknesses": {
                    "value": "- I find the notion of recurrence in this paper somewhat tricky. Typically,  Recurrent neural networks process the input sequentially by taking one token as the input at a time and updating the hidden state. However, in this paper, recurrence does not occur in the sequence level. Instead, it occurs at the model layer level, which seems non-standard for me. I highly recommend the authors to clarify this to avoid confusions.\n\n- The scope of the method and experiment seems narrow. It only considers the encoder-decoder Transformers on a single natural language understanding benchmark. I believe the paper will be strengthened significantly by introducing more Transformer settings (e.g., decoder only) and/or more benchmark datasets (e.g., other NLP/vision tasks).\n\n- Training time is not reported in this experiment. I believe it is important to add this Information for a comprehensive comparison among different methods.\n\n- Currently the presentation of the paper is flawed. There are many formatting issues which impedes readability.\n  - In the abstract on OpenReview, Latex commands (`\\textbf`) are not deleted. $\\\\%$ is missing in the discussion of the reduction in memory consumption and GPU energy usage.\n  - The format of citation is bad in this paper. The authors should have used `\\citet` and `\\citep` appropriately.\n  - In the abstract, the first letter of \"Transformer\" is capitalized but in the main body of the paper it's not. The authors should make this consistent and I recommend to always capitalize the first letter of \"Transformer\".\n  - Missing references. \"Appendix ??\" and \"Table ??\" in Sec. 4.\n  - Bad notation. Eq. (4) uses $\\bar U$ to denote a cumulative sum. This can be misleading because people are more likely to interpret $\\bar U$ as an average.\n\n- Minor comments.\n  - Abstract. \"empirical evaluation of the GLUE benchmark\" $\\to$ \"empirical evaluation on the GLUE benchmark\".\n  - Page 4. \"the following equation systems gives\" $\\to$ \"the following equation system gives\"\n  - Page 4. \".\" is missing in the last sentence of the last paragraph."
                },
                "questions": {
                    "value": "Please refer to the **Weaknesses** part.\n\nOne more clarification question:\n- What does \"normalized\" mean in the caption of Fig. 1 mean? What are the original results and how are they normalized?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission3893/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission3893/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission3893/Reviewer_BXAc"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission3893/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698790872366,
            "cdate": 1698790872366,
            "tmdate": 1699636348019,
            "mdate": 1699636348019,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "eojK4W77mj",
                "forum": "bC50ZOyPQm",
                "replyto": "scu5kaE6sC",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3893/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3893/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "### Notion of Recurrency\nWe believe that using the recurency at the model hidden state level is the key behind our method effectiveness. By operating at the model hidden state level, READ does not grow the number of trainable parameters as model sizes increase like other methods, lowering inference cost and fine-tune cost compared to other PEFT methods. The recurrence nature of RNN allows information to flow from one layer to the next, which is why READ outperforms other PETL methods. Last, our\nfine-tuning is transformer-free as only RNN and Feed-Forward Network (FNN) structures are used in READ and require no transformer or attention mechanism. \n\n### Scope of experiments and method\nWe appreciate the reviewer's suggestions on extending READ to more tasks. In response to the reviewer’s valuable insights, we have extended our experimentation to include the MSCOCO dataset using T5-clip model. Notably, our findings remain consistent: READ consistently outperforms most PEFT baselines, while nearly matching the performance of the Adapter, with 68% reduction in training memory consumption. This is highlighted in the provided table below\n\n|               | Full  | Adapter | LoRA  | Prompt | BitFit | READ  |\n|---------------|-------|---------|-------|--------|--------|-------|\n| CIDEr         | 91.9  | 83.4    | 69.5  | 65.2   | 33.6   | 81.7  |\n| Train memory  | 21.20 | 13.38   | 8.16  | 8.39   | 15.77  | 3.88  |\n\n\n### Training Time\nTo provide a comprehensive understanding, we include an analysis below to show the mean and standard deviation for the sums of GPU energy, epochs to convergence, and training time across all GLUE tasks. While this analysis does reveal some variations in energy/time levels, they are not significantly substantial to alter the general trend, as READ continues to stand out as the most energy-efficient approach, with faster convergence than most baselines except for full-tuning. We believe this further supports the merits of our proposed method, and we will include this detailed analysis and clarification in our revised paper.\n\n|              | Full     | Adapter | LoRA   | Prompt | BitFit | LST     | READ  |\n|--------------|----------|---------|--------|--------|--------|---------|-------|\n| Energy (kWh) | 12.52| 6.99 | 10.58| 6.45| 7.68| 10.59 | 2.06|\n| Time (mins)  | 472.74| 485.25| 409.41| 315.35| 291.89| 984.55| 155.11|\n\n### Normalization in Figure 1\nNormalized here means to the normalized energy consumption relative to full-tuning on GLUE tasks. With full tuning as 1.0 and the PEFT methods as a fraction of full tuning energy consumption."
                    }
                },
                "number": 1,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3893/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700581415470,
                "cdate": 1700581415470,
                "tmdate": 1700581415470,
                "mdate": 1700581415470,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "4xWhRtCbZ1",
                "forum": "bC50ZOyPQm",
                "replyto": "eojK4W77mj",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3893/Reviewer_BXAc"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3893/Reviewer_BXAc"
                ],
                "content": {
                    "title": {
                        "value": "I maintain my original rating"
                    },
                    "comment": {
                        "value": "I thank the authors for the response. Some of my concerns remain:\n- For the notion of recurrency in this paper, I understand the authors' argument, but I think this should be have been made clearer in the paper presentation because this is a non-standard use of RNN. Current writing confuses not only me but also Reviewer avag, and I notice that Reviewer avag feel that the concerns on recurrency are not addressed.\n- There is no response regarding the presentation issues and typos. Errors are not fixed in the paper.\n\nGiven these reasons, I maintain my original rating."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3893/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700708131241,
                "cdate": 1700708131241,
                "tmdate": 1700708131241,
                "mdate": 1700708131241,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]