[
    {
        "title": "Recent Link Classification on Temporal Graphs Using Profile Builder"
    },
    {
        "review": {
            "id": "HVRq8h9n2q",
            "forum": "bDcaz87WCZ",
            "replyto": "bDcaz87WCZ",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7988/Reviewer_HrQ1"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7988/Reviewer_HrQ1"
            ],
            "content": {
                "summary": {
                    "value": "In this paper, the authors introduced recent link classification (RLC), a new inference task on dynamic graphs in addition to temporal link prediction (TLP) and dynamic node classification (DNC), and formalized it as a benchmark downstream task. A new graph profiler method was then introduce to tackle RLC. Moreover, the authors also proposed new quality metrics (e.g., edge homophily and Matthews correlation coefficient). Experiments on a set of dynamic graph datasets preliminaries validated the quality of the proposed method w.r.t. the RLC task."
                },
                "soundness": {
                    "value": "1 poor"
                },
                "presentation": {
                    "value": "1 poor"
                },
                "contribution": {
                    "value": "1 poor"
                },
                "strengths": {
                    "value": "S1. The idea of treating recent link classification (RLC) as a new benchmark task of temporal graph learning seems interesting.\n  \nS2. The authors introduced new quality metrics (i.e., edge homophily and Matthews correlation coefficient).\n\nS3. The authors provided the source code of their experiments."
                },
                "weaknesses": {
                    "value": "**W1. The motivations of some statements and designs are unclear.**\n\nIn Section 1, why the fact that 'FLP is sensitive to non-architectural hyperparameters' can begs a question regarding DNC, i.e., 'in analogy to the dynamic node classification task, is there a temporal link classification task we can define?' From my perspective, the relationships between FLP and RLC are also not fully discussed. At the very beginning of the paper, it is highly recommended to add a toy running example (e.g., a simple dynamic graph) to illustrate what are FLP, DNC, and RLC, as well as their inherent relationships.\n  \nIn the design of profile encoder, what are the motivations to introduce metapaths? As I known, metapaths are usually used in the graph representation learning of heterogeneous graphs, but it seems that the authors only consider (dynamic) homogeneous graphs in this study. Moreover, metapaths are also not illustrated in Fig. 1 (i.e., the model architecture).\n  \nThere are no intuitive motivations regarding the proposed metrics of edge homophily and Matthews correlation coefficient (e.g., why Matthews correlation coefficient can handle the label-imbalanced issue). As a results, it is unclear what are their advantages beyond conventional quality metrics.\n  \n***\n  \n**W2. The problem statements in Section 3 are unclear and even confusing. Some presentation and statements seem to be inconsistent.**\n  \nIn the 1st paragraph of Section 3, the availability of graph attributes (e.g., inputs of node and edge features) are not mentioned. However, as stated in the 2nd paragraph, edges attributes are treated as inputs of RLC. It is unclear that whether graph attributes (in terms of node attributes/features or edge attributes/features) are considered in this paper. If so, are they assumed to be static (for all time steps) or they are also dynamic?\n  \nAt the very beginning of Section 3, it is suggested to highlight which data model (i.e., discrete-time dynamic graph or continuous-time dynamic graph) that the authors adopted in this paper.\n  \nThe formal definitions of FLP and DNC are not given. For both FLP and DNC, there are transductive and inductive settings. The formal definitions regarding the transductive and inductive of RLC are not given. It is also unclear that the authors only consider the transductive setting or both transductive and inductive settings.\n\n'Profile' is a significant concept in the proposed method, e.g., profile encoder, node profile, etc. However, there seems no definition regarding this concept (e.g., what are profiles in real dynamic graphs and in terms of what).\n\nAccording to the statements in Section 3, each edge in a (dynamic) graphs should be associated with a time step. However, the graphs in Fig. 1 and Fig. 2 seem to be static. Furthermore, edge attributes are also not illustrated in Fig. 1 and Fig. 2.\n\n***\n\n**W3. Experiments are too simple. Some details regarding experiment settings are also unclear.**\n\nIn experiments, there are only two baseline methods (i.e., TGN and GraphMixer), which cannot fully validate the superiority of the proposed method. In addition to the two baselines, there are also some other dynamic graph representation learning methods (e.g., TGAT, DySAT, EvolveGCN, etc.) as mentioned in Section 2 that can be included in experiments. Experiment results of GraphMixer are not given in Table 3, Fig. 4, etc. In Table 1, the number of timesteps and the number of classed are not given for each dataset. The quality metric w.r.t. the results in Table 3 is not mentioned in the caption.  \n\n***\n\n**W4. The major contributions of this paper are unclear and not fully verified.**\n  \nAlthough the authors claimed that they proposed a new temporal graph learning task (i.e., RLC) and new quality metrics (i.e., edge homophily and MCR), their advantages beyond existing techniques (e.g., what are the advantages of treating RLC as a new temporal graph learning task beyond FLP and DNC) are not fully discussed in the paper and not fully validated in experiments, due to the unclear motivations and insufficient experiments.\n\n***\n\n**W5. The overall presentation is poor. In addition to the inconsistent presentation mentioned before, there are also some grammatical errors and typos that need careful revisions.**\n\n1) 'analyze the temporal graph learning architectures divindign categorizing the methods literature into two groups'\n\n2) 'edges$\\mathcal{E}$'\n\n3) 'we construct derived graphs that'\n\n4) 'connect a vertex acting that acts as a source to another that acts as a course through a shared destination vertex'\n\n5) 'on abuse-like like datasets'"
                },
                "questions": {
                    "value": "See W1, W2, and W4."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "1: strong reject"
                },
                "confidence": {
                    "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7988/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698388734239,
            "cdate": 1698388734239,
            "tmdate": 1699636984216,
            "mdate": 1699636984216,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "G7jFglgoKF",
                "forum": "bDcaz87WCZ",
                "replyto": "HVRq8h9n2q",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7988/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7988/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Proposed plan for revision"
                    },
                    "comment": {
                        "value": "Thank you for your thorough review, and your specific feedback. We are developing a plan to address the weaknesses that you have identified, and we would like to confirm with you that this plan would address your concerns.\n\n- W1: We will add a simple illustrative example indicating the differences between FLP, RLC, and DNC.\n- W1: The graphs that are currently considered are all bipartite and heterogeneous with interactions typically being between a user → item. This is not required for the RLC task in general, but is the structure of our dataset under consideration. In such a setting, we would argue that the metapath construction is a relatively natural fit.\n- W1: Metric uncertainty - We will add an illustrative example that highlights situations where MCC can correctly handle label imbalance but more traditional metrics cannot. In addition, we will leverage the edge homophily definition to explain aspects of our results, in analogy to the discussion of node homophily for node classification.\n- W2: We will rework the problem statement to address the lack of clarity. Specifically, we will make clear that we are working in a continuous time setting, the source of our edge features, and the transductive nature of the problem.\n- W2: We will clarify the definition of a profile in this setting, rather than depending on the colloquial definition.\n- W2: The graphs in the figures are illustrative but they are dynamic based on the content of the containers. We will make this more clear in the text and figure captions\n- W3: We will add two additional datasets, one based on video game reviews and one on NFT sales, and baselines from GraphMixer and TGAT. The NFT sales dataset is considerably larger than the ones in the current work.\n- W4: We will rework the text to highlight the importance of our new task and more clearly explain how it differs from FLP and DNC; and we will use that to further motivate our discussion about the value of this new task. We hope that by addressing the metrics as we have planned in W1, and clearly explaining the value of RLC, we can address W4.\n- W5: We thank the reviewer for pointing out typos and other places where the work lacks clarity. We will address those, and carefully edit the paper to catch others.\n\nWe aim to have this work completed before the end of the review process, so that we can address any additional concerns that you may have. Please do let us know if this plan of action is insufficient to address your points.\n\nBest Regards,\n\nThe Authors"
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7988/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1699674557434,
                "cdate": 1699674557434,
                "tmdate": 1699674557434,
                "mdate": 1699674557434,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "6EBr4DwB91",
                "forum": "bDcaz87WCZ",
                "replyto": "HVRq8h9n2q",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7988/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7988/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Follow up & revision"
                    },
                    "comment": {
                        "value": "We again thank the reviewer for their thorough review and specific feedback. We have just uploaded a new draft of the paper that has addressed the points that have been raised. Specifically we have:\n- W1: We have added such a figure as figure 1.\n- W1: We have added an illustrative example of a situation where MCC and APS give conflicting results, and provided an explicit citation to a paper that provides a clear argument for MCC over AUC.\n- W2: We have updated the problem definition provided in Section 3 in the light of your questions. \n- W3: We have added two additional datasets and two additional baselines in Table 3.\n- W4: We have made the difference between RLC, FLP, and DNC much more clear.\n- W5: We have given the paper a thorough edit, and we will perform one more pass of editing on Monday to catch any last typos.\n\nWe welcome any further questions. Please don’t hesitate to share them so that we can address them as quickly as possible.\n\nBest Regards,\nThe Authors"
                    }
                },
                "number": 11,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7988/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700275188493,
                "cdate": 1700275188493,
                "tmdate": 1700275188493,
                "mdate": 1700275188493,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "w1nek40KLj",
            "forum": "bDcaz87WCZ",
            "replyto": "bDcaz87WCZ",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7988/Reviewer_V529"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7988/Reviewer_V529"
            ],
            "content": {
                "summary": {
                    "value": "This paper works on edge classification (Recent Link Classification) on dynamic graphs. It uses a metric, Matthews Correlation Coefficient for imbalanced datasets and benchmarks TGN (Rossi et al.,2020) on message aggregation schema, readout layer, and time encoding strategy. It then proposes Graph Profiler, which has better model performance than TGN."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. Edge classification is an important topic.\n2. Introduced critical design principles look helpful for algorithm design.\n3. Experiments show Graph Profiler performs better than TGN."
                },
                "weaknesses": {
                    "value": "1. The reason why Graph Profiler performs better than TGN is unclear. The technical advancement of Graph Profiler is unclear.\n2. These critical design principles are different for different datasets, which makes it morel like hyper-parameter tuning for specific datasets.\n3. Extensive evaluation (e.g. larger datasets, other models) are needed for validating these critical design principles."
                },
                "questions": {
                    "value": "1. The motivation of the paper is unclear. If the authors want to highlight the proposed method, it might be better to explain how the design of the Graph Profiler algorithm incorporates these critical design principles.\n2. What is the key takeaway for these critical design principles?\n3. Do these critical design principles also fit other settings like node classification and future link prediction?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission7988/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission7988/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission7988/Reviewer_V529"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7988/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698888700570,
            "cdate": 1698888700570,
            "tmdate": 1699636984111,
            "mdate": 1699636984111,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "xJz4sZO4I6",
                "forum": "bDcaz87WCZ",
                "replyto": "w1nek40KLj",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7988/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7988/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Proposed plan for revision"
                    },
                    "comment": {
                        "value": "Thank you for your thorough review, and your specific feedback. We are developing a plan to address the weaknesses that you have identified, and we would like to confirm with you that this plan would address your concerns.\n- Our Graph Profiler method is novel in so far as, to our knowledge, the concept of building time-dependent profiles for entities based on based on the features and labels of their previous interactions  is not something we are aware of. In contrast, TGN learns a graph wide memory. We will update the text to make this point clear. Also, we believe that we have additional contributions, including the introduction of a new research task, an associated figure of merit, and baseline results. We will rework the text to further emphasize these contributions.\n- On the topic of extensive evaluations being required, we will add two additional datasets, one based on video game reviews and one on NFT sales, and baselines from GraphMixer and TGAT. The NFT sales dataset is considerably larger than the ones in the current work.\n- On the topic of critical design principles, we will rework the text to emphasize that these principles comprise the design space for a family of models.\n- We will include our investigations of the identified design space for the FLP in an appendix and make reference to it in the main text. \n\nWe aim to have this work completed before the end of the review process, so that we can address any additional concerns that you may have. Please do let us know if this plan of action is insufficient to address your points.\n\nBest Regards,\n\nThe Authors"
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7988/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1699674348463,
                "cdate": 1699674348463,
                "tmdate": 1699674348463,
                "mdate": 1699674348463,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "x1wQiQ9qzE",
                "forum": "bDcaz87WCZ",
                "replyto": "w1nek40KLj",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7988/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7988/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Follow up & revision"
                    },
                    "comment": {
                        "value": "We again thank the reviewer for their thorough review and specific feedback. We have just uploaded a new draft of the paper that has addressed the points that have been raised. Specifically we have:\n- We have cleaned up the text and notation, taking the time to be more clear about many of our definitions.\n- We have clarified the importance of the TGN modifications for motivating our design choices for our Graph Profiler model. This clarification can be found in the first paragraph of section 5.2. In summary, we explored modifications to TGN that borrowed specifics from other SOTA models, such as the fixed time encoder, to understand the importance of these model-features for our RLC task. Our development of Graph Profiler was informed by the important components of our modified TGN.\n- We have performed a related analysis to the above that explores the difference between RLC and FLP for a our modified TGN, and report this comparison in Appendix G.\n- We have included time dependent measures of our edge homophily in Appendix A. We hope that this provides a clearer perspective on the way that our datasets evolve with time.\n- We have added two additional datasets and two additional baselines in Table 3.\n- We have given the paper a thorough edit, and we will perform one more pass of editing on Monday to catch any last typos.\n\nWe welcome any further questions. Please don’t hesitate to share them so that we can address them as quickly as possible.\n\nBest Regards,\nThe Authors"
                    }
                },
                "number": 10,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7988/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700275091066,
                "cdate": 1700275091066,
                "tmdate": 1700275091066,
                "mdate": 1700275091066,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "o1doVrLlPG",
            "forum": "bDcaz87WCZ",
            "replyto": "bDcaz87WCZ",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7988/Reviewer_Sc4M"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7988/Reviewer_Sc4M"
            ],
            "content": {
                "summary": {
                    "value": "This paper formulates the problem of dynamic edge classification and proposes a method for this task and a specific metric for evaluating the performance of this task. Specifically, the proposed metric can handle the case of class imbalance, and the proposed model includes a novel message aggregation schema."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. The problem of dynamic edge classification is important. \n\n2. The problem formulation is coherent and well-reasoned.\n\n3. The experiments conducted are thorough, with the authors exploring a wide range of variants."
                },
                "weaknesses": {
                    "value": "1. The model design is rather conventional and lacks novelty. It adheres to the traditional message-passing framework and introduces event and time-related elements as a simple extension.\n\n2. While the proposed Matthews Correlation Coefficient is effective for assessing classification tasks, it may not fully account for the specific attributes of the problem, particularly in the context of temporal interaction classification. It remains unclear how well it aligns with the temporal and graph-based nature of the problem.\n\n3. It is recommended that the authors provide equations for all modules in the paper to offer a comprehensive understanding of the model. This would be especially beneficial in elucidating model details."
                },
                "questions": {
                    "value": "1. Is there any novelty in the method design, such as in a specific module or the whole framework?\n\n2. Is there any specific design of the metric for temporal interaction classification?\n\n3. What is the time encoder like?\n\nPlease elaborate on the above issues to ensure that I don't miss any contributions in the paper."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "details_of_ethics_concerns": {
                    "value": "No ethical issues were found."
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7988/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699177382807,
            "cdate": 1699177382807,
            "tmdate": 1699636983996,
            "mdate": 1699636983996,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "HYnfJbO8Ue",
                "forum": "bDcaz87WCZ",
                "replyto": "o1doVrLlPG",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7988/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7988/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Proposed plan for revision"
                    },
                    "comment": {
                        "value": "Thank you for your thorough review, and your specific feedback. We are developing a plan to address the weaknesses that you have identified, and we would like to confirm with you that this plan would address your concerns.\n- Our Graph Profiler method is novel in so far as, to our knowledge, the concept of building time-dependent profiles for entities based on based on the features and labels of their previous interactions  is not something we are aware of. Also, we believe that we have additional contributions, including the introduction of a new research task, an associated figure of merit, and baseline results. We will rework the text to further emphasize these contributions.\n- We will address the typos through a thorough editing process.\n- We will add an illustrative example of a situation where MCC and AUC give conflicting results and provide a clear argument for MCC. \n- We will add more information about the time-encoder, and more generally we thank the reviewer for pointing this areas where the methods discussion is unclear, and we will work to improve that. \n- We will add 2 additional datasets and additional benchmark results to make the analysis a bit more involved.\n\nAdditionally, we would appreciate if you could expand a little further on your question: “Is there any specific design of the metric for temporal interaction classification?” We are planning to answer it by expanding the MCC definition to explain that it applies in multi-class and imbalanced settings, but we are uncertain if this is a satisfactory answer for your question\n\nWe aim to have this work completed before the end of the review process, so that we can address any additional concerns that you may have. Please do let us know if this plan of action is insufficient to address your points.\n\nBest Regards,\n\nThe Authors"
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7988/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1699674149534,
                "cdate": 1699674149534,
                "tmdate": 1699674149534,
                "mdate": 1699674149534,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "DBC6FjFTEK",
                "forum": "bDcaz87WCZ",
                "replyto": "o1doVrLlPG",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7988/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7988/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Follow up & revision"
                    },
                    "comment": {
                        "value": "We again thank the reviewer for their thorough review and specific feedback. We have just uploaded a new draft of the paper that has addressed the points that have been raised. Specifically we have:\n- We have cleaned up the text and notation, taking the time to be more clear about many of our definitions.\n- We have added an illustrative example of a situation where MCC and APS give conflicting results, and provided an explicit citation to a paper that provides a clear argument for MCC over AUC.\n- We have added more information about the time encoder.\n- We have included time dependent measures of our edge homophily in Appendix A. We hope that this provides a clearer perspective on the way that our datasets evolve with time.\n- We have added two additional datasets and two additional baselines in Table 3.\n- We have given the paper a thorough edit, and we will perform one more pass of editing on Monday to catch any last typos.\n\nWe welcome any further questions. Please don’t hesitate to share them so that we can address them as quickly as possible.\n\nBest Regards,\nThe Authors"
                    }
                },
                "number": 9,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7988/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700275062379,
                "cdate": 1700275062379,
                "tmdate": 1700275062379,
                "mdate": 1700275062379,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "8Ly2vxxCXI",
            "forum": "bDcaz87WCZ",
            "replyto": "bDcaz87WCZ",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7988/Reviewer_aigg"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7988/Reviewer_aigg"
            ],
            "content": {
                "summary": {
                    "value": "The paper proposes a new task, called Recent Link prediction, which calls for classifying a graph link that has already occurred. This comes in the context of various industrial applications such as predicting whether a transaction (user node interacting (via an edge) with a credit card node) is fraudulent. The authors formulate the learning task, propose an architecture, an evaluation metric and conduct several experiments."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "Pros\n* For the most part the paper is well written and provides intuition on the new setting proposed by the authors\n\n* The proposal is backed by several experiments\n\n* The idea is interesting, the contrast with current methods is discussed and the need for the new task is well justified."
                },
                "weaknesses": {
                    "value": "Cons \n* The technical details on the graph profiler are hard to follow, some notation is missing or assumed. At the same time the authors explain more basic concepts such as edge homophily using more verbage. \n\n* The evaluation (since it is a novel task) is a bit weak. However, the analysis can be supplemented with more creative ways of analyzing the performance even if comparison to other algorithms is not possible."
                },
                "questions": {
                    "value": "* Given the datasets/tasks you are describing, it appears that these graphs are knowledge graphs (consisting of entities and relations connecting them). If my understanding is correct, how does this new task relate to the dynamic knowledge graph link prediction? \n\n* The edge homophily paragraph is dense with notation, which makes the formula hard to digest even though the idea is simple. Please include a sentence (in English) to supplement the formula when defining edge homophily, e.g. \"the fraction of edges that connect nodes of the same\nclass\". \n\n*  Are there other metrics beyond edge homophily that are useful here? Since you don't take the time dimension in the edge homophily, does any other metric make sense for the evaluation of the time component? \n\n* Please define the matrices you use (and their dimensions), they are sometimes only understood from the context, e.g. in the Profiler Encoder section on p.4 \n\n* How did you derive the formulat for d_1, bottom of p. 4? \n\n* Some typos need to be fixed: e.g. \n\n     * p.2 \"...temporal graph learning architectures divinding categorizing...\"\n     * p.4 \"...In our specific instance... acting that acts...\"\n \n* What is the significance of the TGN modifications in Table 2? They don't seem to be directly related to the proposed method."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7988/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699419665377,
            "cdate": 1699419665377,
            "tmdate": 1699636983879,
            "mdate": 1699636983879,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "1VL3dCPBlS",
                "forum": "bDcaz87WCZ",
                "replyto": "8Ly2vxxCXI",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7988/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7988/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Proposed plan for revision"
                    },
                    "comment": {
                        "value": "Thank you for your thorough review, and your specific feedback. We are developing a plan to address the weaknesses that you have identified, and we would like to confirm with you that this plan would address your concerns.\n- We thank the reviewer for pointing this areas where the methods discussion is unclear, and we will work to improve that. We will do so specifically by expanding upon details of our model, dimensions of matrices, and other model details; as well as the way in which we’ve constructed the dataset.\n- We will expand our definition of edge homophily to be easier to understand.\n- We will add 2 additional datasets and additional benchmark results to make the analysis a bit more involved.\n- Knowledge Graph Link Prediction (KGLP) is a related problem but is different for multiple reasons. The first is that in RLC, the prediction is performed conditioned on the existence of the link. The second is that KGLP implies an ontological structure to the relationships which can naturally be leveraged.\n- As for the question of additional metrics, we will add plots of the edge-homophily over time and a metric that we are referring to as balanced edge homophily.\n- We will address the typos through a thorough editing process.\n- We will review the rest of the paper to ensure that formulas like that for $d_1$ are motivated and clear.\n\nWe aim to have this work completed before the end of the review process, so that we can address any additional concerns that you may have. Please do let us know if this plan of action is insufficient to address your points.\n\nBest Regards,\n\nThe Authors"
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7988/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1699674057222,
                "cdate": 1699674057222,
                "tmdate": 1699674057222,
                "mdate": 1699674057222,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "zFZjFjPBTH",
                "forum": "bDcaz87WCZ",
                "replyto": "8Ly2vxxCXI",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7988/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7988/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Follow up & revision"
                    },
                    "comment": {
                        "value": "We again thank the reviewer for their thorough review and specific feedback. We have just uploaded a new draft of the paper that has addressed the points that have been raised. Specifically we have:\n- We have cleaned up the text and notation, taking the time to be more clear about many of our definitions.\n- We have clarified the definition of edge homophily by adding a paragraph that discusses its intuitive definition.\n- We have included time dependent measures of our edge homophily in Appendix A. We hope that this provides a clearer perspective on the way that our datasets evolve with time.\n- We have added two additional datasets and two additional baselines in Table 3.\n- We have given the paper a thorough edit, and we will perform one more pass of editing on Monday to catch any last typos.\n- We have clarified the importance of the TGN modifications for motivating our design choices for our Graph Profiler model. This clarification can be found in the first paragraph of section 5.2.\n- We thank the reviewer for directing us to the link between RLC and Dynamic KG link prediction These tasks are quite related, but our current formulation of RLC has the additional complexity of delayed label observations. We have formulated this task in this way to match common industrial tasks such as fraud or toxicity detection.\n\nWe welcome any further questions. Please don’t hesitate to share them so that we can address them as quickly as possible.\n\nBest Regards,\nThe Authors"
                    }
                },
                "number": 8,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7988/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700275013204,
                "cdate": 1700275013204,
                "tmdate": 1700275013204,
                "mdate": 1700275013204,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "BFBfgPG2nq",
            "forum": "bDcaz87WCZ",
            "replyto": "bDcaz87WCZ",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7988/Reviewer_cW29"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7988/Reviewer_cW29"
            ],
            "content": {
                "summary": {
                    "value": "The paper introduces the \"Recent Link Classification\" task within the field of \"Temporal Graph Learning,\" focusing on categorizing existing links based on source and destination entities. The authors evaluate baseline methods for future link prediction and temporal graph learning in recent link classification, employing the Mathews Correlation Coefficient as the evaluation metric. Their proposed Graph Profiler architecture consists of five components: profile encoder, message encoder, destination encoder, and a readout layer for information aggregation. The study delves into various strategies for the profile encoder, time encoder, and readout layer, demonstrating performance enhancements over baseline methods."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. The proposed recent link classification task is practical and holds applicability for addressing real-world industrial problems.\n2. The paper conducts a comprehensive investigation into the combination of different approaches from temporal graph learning literature."
                },
                "weaknesses": {
                    "value": "1. The modeling decisions, such as the choice between learnable or fixed time encoding, appear ad-hoc and contingent on specific datasets. It would be beneficial to elucidate insights or provide general guidance for determining an optimal combination on new datasets. For instance, what factors contribute to the observed performance variation, and is there a rationale for the less effective performance of learnable time-encoding on the Wikipedia dataset?\n2. Given that the src-dst-msg-t configuration doesn't generally yield the best results, I am wondering about the necessity of introducing seemingly redundant components like the destination encoder. Additionally, the observed performance degradation in cases where time encoding is added to src-dst raises questions. Is there any explanation for that?\n3. The presented task bears similarities to entity relationship classification in NLP. It would be interesting to discuss the similarities and differences between these two tasks.\n4. The proposed method mainly combines several existing methods together, which makes the technical contribution of method design not very high.\n\n\nMinor comment:\n1. The paper contains several typos, and certain sentences are challenging to comprehend.\n2. The captions in the graph are too small to read."
                },
                "questions": {
                    "value": "Please refer to the weaknesses."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 5,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7988/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699608932713,
            "cdate": 1699608932713,
            "tmdate": 1699636983771,
            "mdate": 1699636983771,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "mVhtATmvR5",
                "forum": "bDcaz87WCZ",
                "replyto": "BFBfgPG2nq",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7988/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7988/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Proposed plan for revision"
                    },
                    "comment": {
                        "value": "Thank you for your thorough review, and your specific feedback. We are developing a plan to address the weaknesses that you have identified, and we would like to confirm with you that this plan would address your concerns.\n- We will work to understand the structure of the datasets under investigation and how their structure impacts the time encoding.\n- To tease out the importance of the destination encoder, we will perform an ablation study and report those results. In addition to the destination encoder ablation study, we will perform other ablation studies and results in the main text of the paper.\n- We will explore the link between RLC and dynamic KG relationship classification. We thank the reviewer for pointing this connection out as the authors are unfamiliar with this literature.\n- Our Graph Profiler method is novel in so far as, to our knowledge, the concept of building time-dependent profiles for entities based on the features and labels of their previous interactions is not something we are aware of. Also, we believe that we have additional contributions, including the introduction of a new research task, an associated figure of merit, and baseline results. We will rework the text to further emphasize these contributions.\n- To address the figure captions, we will remake the figures such that they are easier to read.\n- We will address the typos through a thorough editing process.\n- We will add 2 additional datasets and additional benchmark results.\n\nWe aim to have this work completed before the end of the review process, so that we can address any additional concerns that you may have. Please do let us know if this plan of action is insufficient to address your points.\n\nBest Regards,\n\nThe Authors"
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7988/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1699673814753,
                "cdate": 1699673814753,
                "tmdate": 1699673912905,
                "mdate": 1699673912905,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "6NkcdqRFFd",
                "forum": "bDcaz87WCZ",
                "replyto": "BFBfgPG2nq",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7988/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7988/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Follow up & revision"
                    },
                    "comment": {
                        "value": "We again thank the reviewer for their thorough review and specific feedback. We have just uploaded a new draft of the paper that has addressed the points that have been raised. Specifically we have:\n- Performed an ablation study to understand the role of destination embeddings, which can be found in Appendix C. We observe that in 5/6 datasets, the destination embeddings help, and we present an explanation for why this would be true.\n- We have explored the structure of the datasets and unfortunately have no explanation for the importance of the time encodings in the TGN framework. We do want to make clear, however, that the Graph Profiler model only ever uses learnable time encodings.\n- We have added two additional datasets and two additional baselines in Table 3.\n- We have given the paper a thorough edit, and we will perform one more pass of editing on Monday to catch any last typos.\n- We thank the reviewer for directing us to the link between RLC and Dynamic KG relationship classification. These tasks are quite related, but our current formulation of RLC has the additional complexity of delayed label observations. We have formulated this task in this way to match common industrial tasks such as fraud or toxicity detection.\n\nWe welcome any further questions. Please don’t hesitate to share them so that we can address them as quickly as possible.\n\nBest Regards,\nThe Authors"
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7988/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700274964679,
                "cdate": 1700274964679,
                "tmdate": 1700274964679,
                "mdate": 1700274964679,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]