[
    {
        "title": "Structural Fairness-aware Active Learning for Graph Neural Networks"
    },
    {
        "review": {
            "id": "Pvl7ZXW0qi",
            "forum": "bvjcMvMn7B",
            "replyto": "bvjcMvMn7B",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission8658/Reviewer_RKZS"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission8658/Reviewer_RKZS"
            ],
            "content": {
                "summary": {
                    "value": "The study focuses on enhancing the performance of GNNs for semi-supervised node classification, even when high-quality labeled samples are scarce. Traditional active learning methods may not work optimally in graph data, given their unique structures and the bias introduced by the positioning of labeled nodes. To address this, the researchers introduce a unified optimization framework called SCARCE, which can be combined with node features. Their experiments confirm that this method not only enhances GNN performance but also helps mitigate structural bias and improve fairness in the results."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. Comparison with many baselines in this paper is very good."
                },
                "weaknesses": {
                    "value": "1. The paper is not easy to follow. I suggest the existing work on fairness in GNN should be discussed. Otherwise, it is very hard to estimate the significance of this work. \n\n2. My major concern is that the fairness definition in this paper is not very clear. We usually use demographic party (DP) or equal odds (EO) to measure fairness. However, this paper only uses the Standard Deviation (SD) and the Coefficient of Variation. Why do the authors consider them instead of DP and EO?\n\n3. Figure 6 and Figure 7 are also not very clear to me. The authors discussed that 'SCARCE, which combines both SIS and LPS variance, SCARCE can not only elevate overall performance but also attain commendable fairness'. However, it is very hard to get this result from these two figures. I suggest the authors provide more details for examination.\n\n4. This paper should focus on fairness instead of classification accuracy. However, Tables 1 and 2 provide more details about the classification accuracy. There should be a trade-off between accuracy and fairness. Only showing accuracy does not make any sense. In addition, how to balance the trade-off between accuracy and fairness in this paper. I do not find any implementation details related to this."
                },
                "questions": {
                    "value": "See Weakness."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission8658/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission8658/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission8658/Reviewer_RKZS"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission8658/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698070537142,
            "cdate": 1698070537142,
            "tmdate": 1700493384363,
            "mdate": 1700493384363,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "U4yfXNfxwI",
                "forum": "bvjcMvMn7B",
                "replyto": "Pvl7ZXW0qi",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8658/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8658/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer RKZS - Part 1"
                    },
                    "comment": {
                        "value": "Dear Reviewer RKZS,\n\nWe appreciate your constructive feedback. We are pleased to provide detailed responses to address your concerns.\n\n> **Q1**: I suggest the existing work on fairness in GNN should be discussed. Otherwise, it is very hard to estimate the significance of this work.\n\n**R1**: Thank you for your suggestions. It is important to clarify that the type of fairness our paper addresses differs significantly from the commonly studied attribute bias, which pertains to model performance disparity across different sensitive attribute groups, such as gender and race.\n\nOur work concentrates on structural fairness, specifically tackling the issue of \"Label Position Bias\" in GNNs.\nThis bias emerges due to the varying performance of a GNN model for nodes based on their \"structural distance\" to labeled nodes in the graph. Research [1] uses the Label Proximal Score (LPS) to quantify this proximity, with a higher LPS indicating a closer \"distance\" to labeled nodes and typically correlating with better model performance. They found the low variance of the LPS score, which means all the nodes have a similar \"distance\" to the labeled node, can mitigate the label position bias and improve the performance fairness of GNNs. Thus, we use the LPS variance to measure structural fairness. One natural way of reducing the LPS variance is to strategically select the labeled nodes based on their position in the graph. \n\nThe goal of active learning is to strategically select some nodes to label that can maximize the model's performance. \nTherefore, both active learning and mitigating the label position bias are fundamentally linked to the labeling of nodes in a graph. Our preliminary studies illustrate that structure fairness (Low LPS variance) is also related to the overall performance of GNNs, which is the central focus of active learning. Therefore, in this work, we use the LPS variance as one metric for active learning to select nodes to label. The proposed method not only improves performance but also addresses the fairness issue.\n\nAs for the existing works on fairness in GNNs, most of them focus on attribute fairness, which is not related to the selection of labeled nodes. Therefore, they are not related to labeling, which is the target of active learning. The pioneering work [1] identifies label position bias and proposes solving it by learning an unbiased graph structure. Our contribution differs as we approach the issue from a labeling perspective, offering an alternative solution to the problem.\n\nAdditionally, our method has the advantage of performing well even when node features are noisy or missing, as shown in the experiments in Appendix Section B.3 of our revised paper. For your convenience, we also present partial results here:\n\n1. Noise feature setting: we add different levels of gaussion noise to the node features.\n\n|GCN|||Cora|||||CiteSeer|||\n|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|\n|Noise|0.1|0.3|0.5|0.7|0.9|0.1|0.3|0.5|0.7|0.9|\n|Random|64.52±4.50|51.76±4.19|44.76±4.12|40.54±4.12|38.65±3.33|49.16±8.22|36.36±5.71|29.53±4.38|27.05±2.07|26.34±1.85|\n|Degree|61.58±0.44|54.84±0.66|51.25±0.60|49.82±0.62|47.37±0.79|44.37±0.88|37.27±0.47|34.28±0.56|34.53±0.46|34.12±0.56|\n|Pagerank|60.77±1.16|43.22±2.59|34.96±2.23|32.86±0.94|32.76±1.27|49.34±2.77|33.40±2.49|27.99±1.22|25.41±1.95|25.08±1.74|\n|FeatProp|77.51±0.61|45.93±2.18|38.50±1.63|32.94±0.48|26.86±1.45|52.30±2.47|33.16±1.62|27.59±1.84|26.10±1.25|24.88±0.98|\n|GraphPart|79.22±0.48|62.17±1.24|51.80±0.85|45.01±1.05|40.83±1.56|52.37±1.13|44.63±1.05|38.91±0.66|35.59±0.92|34.42±1.51|\n|SCARCE|75.13±0.81|67.23±0.70|59.42±0.47|55.90±0.63|53.45±0.96|59.50±2.53|50.35±0.56|41.61±0.83|37.23±0.63|35.23±1.11|\n\n2. Missing feature setting: we use the one-hot ID as node features.\n|GCN||Cora|||CiteSeer||\n|:---:|:---:|:---:|:---:|:---:|:---:|:---:|\n|Budget|5C|10C|20C|5C|10C|20C|\n|Random|44.76±5.83|56.47±2.30|64.03±1.74|28.41±2.69|34.78±3.06|40.58±2.61|\n|Degree|44.19±7.98|51.69±2.82|63.26±1.95|27.33±1.97|31.74±2.79|40.99±2.02|\n|Pagerank|39.19±3.55|47.95±3.94|63.93±3.85|24.03±1.96|32.83±2.21|40.35±2.02|\n|FeatProp|47.75±3.16|58.84±3.22|65.66±1.38|29.79±2.32|34.79±2.00|41.89±2.71|\n|GraphPart|55.37±4.06|57.40±4.24|67.60±2.61|38.27±2.08|37.40±2.56|43.61±3.15|\n|SCARCE|61.43±2.31|68.64±1.94|69.59±1.22|37.89±1.94|43.51±1.44|48.20±1.15|\n\nFrom the above results, we can find that the feature-based active learning method, such as FeatProp, can't perform well when the noise level is high or all the features are missed. However, our proposed SCARCE can only leverage the graph structure and perform well on both scenarios.\n\n[1] Towards Label Position Bias in Graph Neural Networks, NeurIPS'23"
                    }
                },
                "number": 9,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8658/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700290780069,
                "cdate": 1700290780069,
                "tmdate": 1700291161252,
                "mdate": 1700291161252,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "9xThjfnQmj",
                "forum": "bvjcMvMn7B",
                "replyto": "Pvl7ZXW0qi",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8658/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8658/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer RKZS - Part 2"
                    },
                    "comment": {
                        "value": "> **Q2**: My major concern is that the fairness definition in this paper is not very clear. We usually use demographic party (DP) or equal odds (EO) to measure fairness. However, this paper only uses the Standard Deviation (SD) and the Coefficient of Variation. Why do the authors consider them instead of DP and EO?\n\n**R2**: The performance fairness issue that we focused on in this paper is caused by the label position bias. We would like to first provide the definitions:\n\n**Label Position Bias & Structural Fairness**: In this paper, we use the notion of  \"Label Position Bias\", a critical aspect of performance bias in GNNs. This bias arises when the performance of a GNN model varies for nodes based on their proximity to labeled nodes in the graph.[1] Formally, in a graph G, with the set of labeled nodes $V_L$, and unlabeled nodes $V_U$, a GNN model trained on $V_L$ may exhibit varying performance for two nodes $i, j \\in V_U $ based on their \"structural distance\" to $V_L$. A key metric we use to measure this distance is the Label Proximal Score $LPS_{i} = \\sum_{j \\in V_L} P_{ij}$, where P is the personalized PageRank matrix. The LPS can well quantify the proximity of unlabeled nodes to labeled nodes and a higher LPS score typically correlates with better model performance for that node [1]. [1] also found the low variance of the LPS score, which indicates all the nodes have a similar \"distance\" to the labeled nodes, can mitigate the label position bias and improve the performance fairness of GNNs. As a result, we use the variance of the LPS score of each node as the measure of structural fairness.\n\n**Measuring Performance Fairness**: To quantify performance fairness, we categorize nodes into different sensitive groups based on their LPS scores. For each group, we calculate the average accuracy of the GNNs and use metrics such as Standard Deviation to measure the performance disparity across these groups.\n\nIn fact, when considering multiple sensitive groups, the concepts of DP and SD are the same.  If there are only two sensitive groups $i$ and $j$ with accuracy $a_i$ and $a_j$, the $DP = |a_i - a_j|$. However, if there are multiple sensitive groups, $DP = \\sum_i |a_i - \\bar{a}|$, where $\\bar{a}$ is the average accuracy. Therefore, we use the Standard Deviation $SD = \\sqrt{\\sum_i (a_i - \\bar{a})^2}$ to measure the fairness.\nIn our paper, we use the Label Proximity Score to split the nodes into multiple sensitive groups. This realization aligns with your suggestion, and we will update our terminology about SD to reflect this more accurately in our revised paper. Additionally, we use the Coefficient of Variation (CV) because it normalizes the standard deviation by the mean, $CV = SD / \\bar{a}$. This normalization is particularly useful for comparing the relative disparity in performance across models with different overall accuracy levels, allowing us to assess fairness in a way that accounts for differences in model performance.\n\n> **Q3**: Figure 6 and Figure 7 are also not very clear to me. The authors discussed that `SCARCE, which combines both SIS and LPS variance, SCARCE can not only elevate overall performance but also attain commendable fairness'. However, it is very hard to get this result from these two figures. I suggest the authors provide more details for examination.\n\n**R3**:  Thank you for your feedback on Figures 6 and 7, which might be uneasy to read. The proposed SCARCE combines two metrics, i.e., the LPS variance and SIS, to strategically select nodes for annotation. Figures 6 and 7 showcase the impact of these metrics on the Cora and CiteSeer datasets, respectively. For each figure, the left subfigure represents the accuracy, and the right subfigure represents the fairness (Standard Deviation) of using different metrics. From Figure 6 and 7, we can find:\n* For accuracy, the proposed SCARCE, which combines both LPS variance and SIS, consistently achieves better accuracy compared to using either metric alone.\n* For fairness, using the LPS variance alone tends to cause a low SD (better fairness). This finding is consistent with our motivation for leveraging the LPS variance to address the fairness issue.  The SIS alone may lead to a higher SD. However, when combining these two metrics in SCARCE, we observe that the model maintains commendable fairness (lower SD)."
                    }
                },
                "number": 10,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8658/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700291131130,
                "cdate": 1700291131130,
                "tmdate": 1700291131130,
                "mdate": 1700291131130,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "p1ftOGqTc9",
                "forum": "bvjcMvMn7B",
                "replyto": "Pvl7ZXW0qi",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8658/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8658/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer RKZS - Part 3"
                    },
                    "comment": {
                        "value": "> **Q4**: This paper should focus on fairness instead of classification accuracy. However, Tables 1 and 2 provide more details about the classification accuracy. There should be a trade-off between accuracy and fairness. Only showing accuracy does not make any sense. In addition, how to balance the trade-off between accuracy and fairness in this paper. I do not find any implementation details related to this.\n\n**R4**: We would like to clarify that the main focus of this paper is the active learning for the graph neural networks, which aims to maximize the model's performance within a labeling budget. We propose a unified framework that effectively combines different metrics in active learning. As discussed in **R1**, both active learning and mitigating label position bias are fundamentally related to the labeling of nodes in a graph. Besides, structure fairness (low LPS variance) is also related to the overall performance of GNNs, as demonstrated in the preliminary study. Therefore, we leverage structural fairness as one metric in active learning to maximize GNNs' performance. \nMeanwhile, we found this metric can also improve performance fairness, as shown in Figures 4 & 5 in our paper. Therefore, it is not a trade-off between accuracy and fairness. As demonstrated in Figures 6 & 7, incorporating the LPS variance can improve the model's overall performance and performance fairness. As a result, the proposed method bridges the gap between active learning and mitigating the label position bias in GNNs, proposing that addressing fairness can be synergistic with achieving high model performance.\n\n\nWe hope that we have addressed the concerns in your comments, and please kindly let us know if there is any further concern, and we are happy to clarify."
                    }
                },
                "number": 11,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8658/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700291312467,
                "cdate": 1700291312467,
                "tmdate": 1700291312467,
                "mdate": 1700291312467,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "ggnd1PYMaS",
                "forum": "bvjcMvMn7B",
                "replyto": "Pvl7ZXW0qi",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8658/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8658/Authors"
                ],
                "content": {
                    "title": {
                        "value": "A Gentle Remind to Reviewer RKZS"
                    },
                    "comment": {
                        "value": "Dear Reviewer RKZS,\n\nWe would like to express our sincere gratitude to you for reviewing our paper and providing valuable feedback. Could we kindly know if the responses have addressed your concerns? If there are any further questions, we are happy to clarify. Thank you.\n\nBest,\n\nAll authors"
                    }
                },
                "number": 16,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8658/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700492225943,
                "cdate": 1700492225943,
                "tmdate": 1700492225943,
                "mdate": 1700492225943,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "vQlXo4AOqx",
                "forum": "bvjcMvMn7B",
                "replyto": "ggnd1PYMaS",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8658/Reviewer_RKZS"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8658/Reviewer_RKZS"
                ],
                "content": {
                    "title": {
                        "value": "Response"
                    },
                    "comment": {
                        "value": "Dear Authors,\n\nThank you for your response. While I appreciate your elaboration on the contributions and objectives of the paper, I believe the emphasis on fairness may not be entirely appropriate in this paper. It appears that active learning is the primary focus, yet the definitions and applications of fairness within the paper lack clarity.\n\nMost importantly,  it's worth noting that this concern is not unique to me. I checked other reviewer's comments. Reviewer UJDy also has the same concern. \n\nGiven this, my recommendation would be to revise the paper with a reduced emphasis on fairness, possibly even removing the term from the title. This is merely a suggestion, and I understand it's ultimately at your discretion. \n\nAfter reviewing your response, which addressed some of my questions, I am inclined to adjust my evaluation. I will raise my score from 3 to 5.\n\nThanks.\n\nReviewer  RKZS."
                    }
                },
                "number": 17,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8658/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700493366685,
                "cdate": 1700493366685,
                "tmdate": 1700493366685,
                "mdate": 1700493366685,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "GaFhBTnTLY",
            "forum": "bvjcMvMn7B",
            "replyto": "bvjcMvMn7B",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission8658/Reviewer_tqC2"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission8658/Reviewer_tqC2"
            ],
            "content": {
                "summary": {
                    "value": "To leverage graph structure and mitigate structural bias in active learning, the authors present a unified optimization framework."
                },
                "soundness": {
                    "value": "1 poor"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "1 poor"
                },
                "strengths": {
                    "value": "Originality: The investigation of structure fairness using active learning is something new.\n\nQuality: The technical quality is below average. Many details are missing. For example, label position bias is a new term that was recently proposed, and the authors should elaborate more on it with a more intuitive explanation instead of just some formula. Also, at the beginning of Sec. 3.1, $t$ is a binary vector, and thus it should be $t \\in \\\\{0,1\\\\}^n$. The relaxation in the paper does not make sense to the reviewer.\n\nClarity: In general, it is ok. The reviewer understands how the proposed method works but sometimes fails to see why.\n\nSignificance: The fairness and active learning problems for graphs are important."
                },
                "weaknesses": {
                    "value": "1. The paper tries to solve the structure fairness problem using active learning. However, the connection between these two is weak, and the reviewer does not find any strong motivations to do so. The authors claim that \"in active learning, strategically choosing labeling nodes, represented by t, can potentially reduce the LPS variance, promoting fairness in GNNs\" in the second para. of Sec. 2.2, but the reviewer does not find any theoretical guarantees to motivate this finding. \n\n2. The goal of active learning is different from mitigating the bias in graphs and the ultimate goal of AL is to use as few as labeled nodes to achieve the best prediction performance. Therefore, the motivation of this work is totally unclear. \n\n3. The paper does not provide any theoretical proof to support the findings or the motivations. The relaxation used in the unified framework is also misleading."
                },
                "questions": {
                    "value": "1. Why can we use the relaxation of the binary vector t to its convex hull?\n2. How does the proposed method solve the fairness issue from the theoretical aspect? \n3. What is the formal definition of the structure bias in graphs, and how can we quantify it?\n4. Why do we use active learning to solve the fairness issue in graphs? What if we do not have access to the oracle?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission8658/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission8658/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission8658/Reviewer_tqC2"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission8658/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698749160575,
            "cdate": 1698749160575,
            "tmdate": 1700713349947,
            "mdate": 1700713349947,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "FAz2LVYUPz",
                "forum": "bvjcMvMn7B",
                "replyto": "GaFhBTnTLY",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8658/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8658/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer tqC2 - Part 1"
                    },
                    "comment": {
                        "value": "Dear Reviewer tqC2,\n\nWe appreciate your constructive feedback. We are pleased to provide detailed responses to address your concerns.\n\n> **Q1**: The paper tries to solve the structure fairness problem using active learning. However, the connection between these two is weak, and the reviewer does not find any strong motivations to do so.\n\n**R1**: Thank you for your feedback. We would like to clarify that the main focus of this paper is the active learning for graph neural networks, which aims to maximize the model performance within a labeling budget. There are two main reasons why we connect the structure fairness problem with active learning. **First**, the structure fairness discussed in our paper is based on the labeling. We explore \"Label Position Bias\" in GNNs, a critical performance fairness issue arising from varying performance based on nodes' \"structural distance\" to labeled nodes. The distance can be measured by the Label Proximity Score (LPS). Research [1] indicates that nodes closer to labeled nodes (higher LPS) typically perform better. They found the low variance of the LPS score, which means all the nodes have a similar \"distance\" to the labeled node, can mitigate the label position bias and improve the performance fairness of GNNs. Thus, we use the LPS variance to measure structural fairness. One natural way of reducing the LPS variance is to strategically select the labeled nodes based on their position in the graph.  Meanwhile, the goal of active learning is to select proper nodes for annotation that can maximize the model performance. Thus, **both problems are related to the labeling. Second**, from our preliminary studies, we found that structural fairness (low LPS Variance) can improve the overall model performance. As a result, we use the LPS variance as one metric to help active learning. Meanwhile, as the structural fairness (low LPS Variance) can improve the performance fairness, we find that the proposed method can improve both the model performance and the performance fairness of GNNs.\n\n[1] Towards Label Position Bias in Graph Neural Networks, NeurIPS'23\n\n> **Q2**: What is the formal definition of the structure bias in graphs, and how can we quantify it?\n\n**R2**: **Label Position Bias & Structural Fairness**:  Label Position Bias arises when the performance of a GNN model varies for nodes based on their proximity to labeled nodes in the graph.[1] Formally, in a graph G, with the set of labeled nodes $V_L$, and unlabeled nodes $V_U$, a GNN model trained on $V_L$ may exhibit varying performance for two nodes $i, j \\in V_U $ based on their \"structural distance\" to $V_L$. A key metric we use to measure this distance is the Label Proximal Score $LPS_{i} = \\sum_{j \\in V_L} P_{ij}$, where P is the personalized PageRank matrix. The LPS can well quantify the proximity of unlabeled nodes to labeled nodes and a higher LPS score typically correlates with better model performance for that node [1].  We use the variance of the LPS score of each node as the measure of structural fairness.\n\n**Measuring Performance Fairness**: To quantify performance fairness, we categorize nodes into different sensitive groups based on their LPS scores. For each group, we calculate the average accuracy of the GNNs and use metrics such as Standard Deviation to measure the performance disparity across these groups.\n\n> **Q3**: The goal of active learning is different from mitigating the bias in graphs and the ultimate goal of AL is to use as few as labeled nodes to achieve the best prediction performance. Therefore, the motivation of this work is totally unclear.\n\n**R3**: The label position bias studied in this paper is different from the traditional attribute bias issue. It is unique for graphs and is related to the labeled nodes' position in the graphs. A natural solution to mitigate the label position bias is to select the nodes, that have proper positions in the graph, to label. Meanwhile, as you mentioned, the ultimate goal of AL is to select the proper nodes to label to achieve the best prediction performance. As a result, both active learning and mitigating the bias are fundamentally related to the labeling of nodes in a graph.\n\nIn the preliminary studies, we found that structure fairness (Low LPS variance), which can reflect the label position bias, is also related to the overall performance of GNNs. Therefore, we leverage the LPS variance as one metric in the active learning to improve the overall model performance. This bridges the gap between active learning and mitigating the label position bias in GNNs, proposing that addressing fairness can be synergistic with achieving high model performance."
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8658/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700288968327,
                "cdate": 1700288968327,
                "tmdate": 1700288968327,
                "mdate": 1700288968327,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "rv4LPArxEc",
                "forum": "bvjcMvMn7B",
                "replyto": "GaFhBTnTLY",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8658/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8658/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer tqC2 - Part 2"
                    },
                    "comment": {
                        "value": "> **Q4**: The paper does not provide any theoretical proof to support the findings or the motivations.\n\n**R4**: We appreciate the concern regarding the lack of theoretical proof in our paper. Our research, focusing on the effectiveness of our approach in the context of active learning for GNNs, is primarily grounded in empirical evaluations. This decision is partly informed by the nature of active learning itself, which, as suggested by the No Free Lunch Theorem, does not subscribe to a one-size-fits-all strategy. Active learning metrics often vary significantly based on the specific datasets and contexts they are applied to. As a result, most active learning approaches use some heuristic metrics to select samples [2][3].\n\nTo illustrate this, let's consider the example of the FeatProp method, which is based on the assumption of linearity in GNNs. This method presupposes that the original features can represent the final node representations in GNNs. However, this assumption often falls short due to the inherent non-linearity of neural networks. As such, in scenarios where the original features are compromised – for instance, in the presence of noise or feature missing – the FeatProp method's performance can be significantly impacted, as shown in the experiments in Appendix Section B.3 of our revised paper.  For your convenience, we also present partial results here:\n1. Noise feature setting: we add different levels of gaussion noise to the original feature.\n|GCN|||Cora|||||CiteSeer|||\n|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|\n|Noise|0.1|0.3|0.5|0.7|0.9|0.1|0.3|0.5|0.7|0.9|\n|Random|64.52±4.50|51.76±4.19|44.76±4.12|40.54±4.12|38.65±3.33|49.16±8.22|36.36±5.71|29.53±4.38|27.05±2.07|26.34±1.85|\n|Degree|61.58±0.44|54.84±0.66|51.25±0.60|49.82±0.62|47.37±0.79|44.37±0.88|37.27±0.47|34.28±0.56|34.53±0.46|34.12±0.56|\n|Pagerank|60.77±1.16|43.22±2.59|34.96±2.23|32.86±0.94|32.76±1.27|49.34±2.77|33.40±2.49|27.99±1.22|25.41±1.95|25.08±1.74|\n|FeatProp|77.51±0.61|45.93±2.18|38.50±1.63|32.94±0.48|26.86±1.45|52.30±2.47|33.16±1.62|27.59±1.84|26.10±1.25|24.88±0.98|\n|GraphPart|79.22±0.48|62.17±1.24|51.80±0.85|45.01±1.05|40.83±1.56|52.37±1.13|44.63±1.05|38.91±0.66|35.59±0.92|34.42±1.51|\n|SCARCE|75.13±0.81|67.23±0.70|59.42±0.47|55.90±0.63|53.45±0.96|59.50±2.53|50.35±0.56|41.61±0.83|37.23±0.63|35.23±1.11|\n2. Missing feature setting: we use the one-hot ID as node features.\n |GCN||Cora|||CiteSeer||\n|:---:|:---:|:---:|:---:|:---:|:---:|:---:|\n|Budget|5C|10C|20C|5C|10C|20C|\n|Random|44.76±5.83|56.47±2.30|64.03±1.74|28.41±2.69|34.78±3.06|40.58±2.61|\n|Degree|44.19±7.98|51.69±2.82|63.26±1.95|27.33±1.97|31.74±2.79|40.99±2.02|\n|Pagerank|39.19±3.55|47.95±3.94|63.93±3.85|24.03±1.96|32.83±2.21|40.35±2.02|\n|FeatProp|47.75±3.16|58.84±3.22|65.66±1.38|29.79±2.32|34.79±2.00|41.89±2.71|\n|GraphPart|55.37±4.06|57.40±4.24|67.60±2.61|38.27±2.08|37.40±2.56|43.61±3.15|\n|SCARCE|61.43±2.31|68.64±1.94|69.59±1.22|37.89±1.94|43.51±1.44|48.20±1.15|\n\nWhile we acknowledge the importance of theoretical backing in scientific research, our current focus has been on demonstrating the practical efficacy and adaptability of our approach in diverse and realistic settings. Moving forward, we aim to complement our empirical findings with theoretical analysis to provide a more holistic understanding of our approach's mechanics and its broader applicability.\n\n[2] A Survey of Deep Active Learning, CSUR'21\n\n[3] A Comparative Survey of Deep Active Learning, Arxiv'22\n\n> **Q5**: The relaxation used in the unified framework is also misleading. Why can we use the relaxation of the binary vector t to its convex hull?\n\n**R5**:  The relaxation of binary vectors to their convex hull is a well-established technique in combinatorial optimization [4], particularly when dealing with complex optimization problems that are otherwise computationally intractable. This approach allows for the application of more efficient, continuous optimization methods. This method is usually used in gradient-based attacks [5][6]. For example, [5] leverages this relaxation to do the topology attack on graphs.\n\n[4] LP Relaxations for Combinatorial Relaxation\n\n[5] Topology attack and defense for graph neural networks: An optimization perspective, Arxiv'19\n\n[6] Probabilistic Categorical Adversarial Attack and Adversarial Training, ICML'23"
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8658/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700289659134,
                "cdate": 1700289659134,
                "tmdate": 1700289659134,
                "mdate": 1700289659134,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "rLoCnsl1Uc",
                "forum": "bvjcMvMn7B",
                "replyto": "GaFhBTnTLY",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8658/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8658/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer tqC2 - Part 3"
                    },
                    "comment": {
                        "value": "> **Q6**: How does the proposed method solve the fairness issue from the theoretical aspect?\n\n**R6**: In this work, we focus on the performance fairness issue caused by the labeling of nodes, which is different from the traditional fairness issue caused by some sensitive attributes, such as gender and race. To solve this performance fairness issue, we directly optimize the structure fairness (low LPS variance) by selecting the nodes for annotation (active learning). And we empirically demonstrate that the proposed method can mitigate the performance fairness issue, as demonstrated in Figures 4 and 5 of our paper. Besides, the LPS score of node $y$ is related to the influence score from labeled node $x$, defined as the absolute values of entries of Jacobian matrix $\\left[\\frac{\\partial h_x^{(k)}}{\\partial h_y^{(0)}}\\right]$ [7], where $h_x^{(k)}$ is the representation of node $x$ in a $k$-th layer GNN. [1] found that a lower LPS variance suggests a more uniform influence of all labeled nodes to each unlabeled node across the graph, hinting at greater fairness.\n\n[7] Representation Learning on Graphs with Jumping Knowledge Networks, ICML'18\n\n> **Q7**: Why do we use active learning to solve the fairness issue in graphs? What if we do not have access to the oracle?\n\n**R7**: As mentioned in **R1** and **R3**, both active learning and structure fairness issues are related to the labeling of nodes in a graph. Thus, we leverage the principles of active learning - strategic node selection for labeling - to improve structure fairness and thus solve the performance fairness issue of GNNs.\n\nRegarding the concern about reliance on an oracle for annotations: in active learning, the oracle is typically a necessary component for providing labels for the selected samples. If we do not have access to the oracle, we might need some pre-trained model to do annotation. For example, we can use the Large Language Model as an annotator, like [8].\n\n[8] Exploring the Potential of Large Language Models (LLMs) in Learning on Graphs. Arxiv'23\n\nWe hope that we have addressed the concerns in your comments, and please kindly let us know if there is any further concern, and we are happy to clarify."
                    }
                },
                "number": 8,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8658/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700289941611,
                "cdate": 1700289941611,
                "tmdate": 1700289941611,
                "mdate": 1700289941611,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "X5T0NnzBsb",
                "forum": "bvjcMvMn7B",
                "replyto": "GaFhBTnTLY",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8658/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8658/Authors"
                ],
                "content": {
                    "title": {
                        "value": "A Gentle Remind to Reviewer tqC2"
                    },
                    "comment": {
                        "value": "Dear Reviewer tqC2,\n\nWe would like to express our sincere gratitude to you for reviewing our paper and providing valuable feedback. Could we kindly know if the responses have addressed your concerns? If there are any further questions, we are happy to clarify. Thank you.\n\nBest,\n\nAll authors"
                    }
                },
                "number": 15,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8658/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700492198233,
                "cdate": 1700492198233,
                "tmdate": 1700492198233,
                "mdate": 1700492198233,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "YS729BzS8V",
                "forum": "bvjcMvMn7B",
                "replyto": "X5T0NnzBsb",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8658/Reviewer_tqC2"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8658/Reviewer_tqC2"
                ],
                "content": {
                    "comment": {
                        "value": "Thanks for the detailed rebuttal. Most of my concerns have been addressed and I have my score raised."
                    }
                },
                "number": 22,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8658/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700713441589,
                "cdate": 1700713441589,
                "tmdate": 1700713441589,
                "mdate": 1700713441589,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "KoAVYAfDgA",
            "forum": "bvjcMvMn7B",
            "replyto": "bvjcMvMn7B",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission8658/Reviewer_UJDy"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission8658/Reviewer_UJDy"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes a unified optimization framework for active learning on graph neural networks (GNNs) that can flexibly incorporate different selection criteria such as structure inertia score (SIS) and label proximity score (LPS) variance. It is empirically demonstrated that SCARCE outperforms existing baselines on node classification tasks across multiple benchmark datasets. In particular, SCARCE achieves higher accuracy than methods like FeatProp and GraphPart while also enhancing fairness by reducing variance in LPS across nodes."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "(1) This paper is generally well-organized and easy-to-follow.\n\n(2) The proposed unified optimization framework is flexible and does not require extensive hyperparameter tuning, which is especially useful for active learning. In addition, the scalability seems promising as well.\n\n(3) The superiority on utility and fairness seems significant given the presented results in section 4.3 and 4.4."
                },
                "weaknesses": {
                    "value": "(1) There lacks a formal introduction of the notion for fairness at the beginning of this paper.\n\n(2) Despite the discussion on scalability, this paper does not perform any experiments on large-scale network datasets.\n\n(3) Only performing experiments on two GNN backbones undermines the superiority of the proposed framework. In addition, one advantage of this paper lies in the applicability on featureless networks, which is not tested in this paper either."
                },
                "questions": {
                    "value": "(1) I would suggest to add a formal introduction about the fairness notion studied in this paper in Section 2, and add a descriptive discussion in the Introduction accordingly.\n\n(2) If the proposed framework can be easily generalized onto large network data, will the performance superiority still be maintained?\n\n(3) If the proposed framework can be easily generalized onto featureless network data, will the performance superiority still be maintained? Note that in such cases, the feature input of GNNs can be generated following traditional ways.\n\n(4) Can the proposed framework achieve generally good performance across different state-of-the-art GNN backbones? It would be better to adopt more backbones for experiments."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "details_of_ethics_concerns": {
                    "value": "N/A"
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission8658/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission8658/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission8658/Reviewer_UJDy"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission8658/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698783869137,
            "cdate": 1698783869137,
            "tmdate": 1700712469658,
            "mdate": 1700712469658,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "XeDVUSO6cC",
                "forum": "bvjcMvMn7B",
                "replyto": "KoAVYAfDgA",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8658/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8658/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer UJDy - Part 1"
                    },
                    "comment": {
                        "value": "Dear Reviewer UJDy,\n\nThank you for your insightful suggestions. We are pleased to provide detailed responses to address your concerns.\n\n> **Q1 & W1**: There lacks a formal introduction of the notion for fairness at the beginning of this paper. (I would suggest to add a formal introduction about the fairness notion studied in this paper in Section 2, and add a descriptive discussion in the Introduction accordingly.)\n\n**R1**: In response to your valuable feedback, we have incorporated a comprehensive introduction of the structure fairness issue in both the Introduction and Section 2 of our revised paper.  For your convenience, we present the formal introduction to the fairness issue discussed in our paper here:\n\n**Label Position Bias & Structural Fairness**: In this paper, we use the notion of  \"Label Position Bias\", a critical aspect of performance bias in GNNs. This bias arises when the performance of a GNN model varies for nodes based on their proximity to labeled nodes in the graph.[1] Formally, in a graph G, with the set of labeled nodes $V_L$, and unlabeled nodes $V_U$, a GNN model trained on $V_L$ may exhibit varying performance for two nodes $i, j \\in V_U $ based on their \"structural distance\" to $V_L$. A key metric we use to measure this distance is the Label Proximal Score $LPS_{i} = \\sum_{j \\in V_L} P_{ij}$, where P is the personalized PageRank matrix. The LPS can well quantify the proximity of unlabeled nodes to labeled nodes and a higher LPS score typically correlates with better model performance for that node [1]. [1] also found the low variance of the LPS score, which indicates all the nodes have a similar \"distance\" to the labeled nodes, can mitigate the label position bias and improve the performance fairness of GNNs. As a result, we use the variance of the LPS score of each node as the measure of structural fairness.\n\n**Measuring Performance Fairness**: To quantify performance fairness, we categorize nodes into different sensitive groups based on their LPS scores. For each group, we calculate the average accuracy of the GNNs and use metrics such as Standard Deviation to measure the performance disparity across these groups.\n\n[1] Towards Label Position Bias in Graph Neural Networks, NeurIPS'23\n\n> **Q2 & W2**: Despite the discussion on scalability, this paper does not perform any experiments on large-scale network datasets.\n\n**R2**: To verify the scalability of the proposed method, in addition to the OGB Arxiv dataset used in our paper, we have conducted extensive experiments on the OGB Products dataset, which contains over 2.4 million nodes. We conduct experiments with the labeling budgets of 5C, 10C, and 20C, where C is the number of classes. The results of the OGB Products dataset with GCN and APPNP backbones are shown below:\n\n|Backbone||GCN|||APPNP||\n|---|---|---|---|---|---|---|\n|Budget|5C|10C|20C|5C|10C|20C|\n|Random|60.78±0.60|67.38±0.74|70.45±0.89|66.15±1.43|70.23±0.42|74.82±0.10|\n|Degree|37.13±0.46|45.82±0.38|50.19±0.99|49.98±0.85|55.43±0.74|60.81±0.97|\n|Pagerank|56.33±0.60|63.20±0.20|69.00±0.45|61.08±0.32|67.61±0.70|72.69±0.18|\n|FeatProp|63.34±2.58|67.48±0.97|71.65±0.57|68.64±0.65|69.80±1.20|71.8±0.61|\n|GraphPart|OOT|OOT|OOT|OOT|OOT|OOT|\n|SCARCE|62.25±0.37|70.27±0.22|74.43±0.22|66.66±0.09|72.63±0.20|76.57±0.14|\n\nPlease note the GraphPart method takes more than 24 hours, and we treat it as out of time (OOT).\n\nThe results from our experiments on the large-scale OGB Products dataset clearly demonstrate the efficacy of our proposed SCARCE method. Notably, SCARCE achieves high accuracy with significantly fewer labeled nodes compared to standard training splits. For instance, while the standard split typically uses around 200,000 nodes for training, SCARCE requires only 940 labeled nodes to attain accuracies of 74.43/(75.64) and 76.57/(76.62) for the GCN and APPNP models, respectively, where the value in the $(\\cdot)$ represent the accuracy of the standard split. This underscores SCARCE's effectiveness in active learning, particularly in large-scale graph neural network applications."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8658/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700285034742,
                "cdate": 1700285034742,
                "tmdate": 1700285034742,
                "mdate": 1700285034742,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "Uzkw16XniM",
                "forum": "bvjcMvMn7B",
                "replyto": "KoAVYAfDgA",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8658/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8658/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer UJDy - Part 2"
                    },
                    "comment": {
                        "value": "> **W3 & Q4**: Only performing experiments on two GNN backbones undermines the superiority of the proposed framework. \n\n**R3**: We appreciate your suggestions. We further add two representative GNNs: GAT[2], which leverages the attention mechanism, and GCNII[3], which is a deep GNN. For these two methods, we follow the hyperparameter settings in their original paper. Specifically, for GCNII, we adopt 64 layers. The results on the Cora and CiteSeer datasets with budgets of 5C, 10C and 20 C, are shown below:\n\n|GAT||Cora|||CiteSeer||\n|:---:|:---:|:---:|:---:|:---:|:---:|:---:|\n|Budget|5C|10C|20C|5C|10C|20C|\n|Random|65.66±3.70|74.06±4.19|80.00±2.24|51.36±7.53|61.85±2.34|64.82±2.15|\n|Uncertainty|55.31±5.78|62.02±6.56|74.72±3.69|44.41±6.35|49.95±5.64|60.49±4.00|\n|Density|64.10±4.28|70.72±3.73|78.12±2.97|49.44±7.58|60.10±3.73|64.17±2.02|\n|CoreSet|60.72±7.03|72.54±3.40|79.48±1.52|47.29±6.76|58.00±4.21|64.54±2.11|\n|Degree|62.34±2.20|73.44±1.39|78.31±0.98|42.18±1.89|44.41±1.29|49.38±2.20|\n|Pagerank|63.78±2.05|71.84±1.77|80.00±1.03|42.98±2.40|58.62±1.87|66.51±0.77|\n|AGE|66.45±4.71|73.93±3.89|80.14±1.55|49.53±5.40|58.97±5.94|65.18±2.26|\n|FeatProp|73.40±1.39|77.62±1.36|82.36±0.53|58.03±2.99|62.14±2.29|68.08±0.54|\n|GraphPart|76.91±1.41|78.29±0.88|80.94±1.52|58.24±2.41|65.10±1.32|66.41±1.33|\n|SCARCE-Structure|76.36±2.00|81.78±0.46|82.58±0.41|64.23±1.92|69.32±0.60|72.36±0.49|\n|SCARCE-Feature|80.56±0.77|83.01±0.63|85.04±0.26|60.91±3.10|70.47±0.61|72.60±0.38|\n|SCARCE-ALL|80.62±0.50|83.27±0.39|84.96±0.24|61.20±2.77|70.29±0.61|72.34±0.40|\n\n|GCNII||Cora|||CiteSeer||\n|:---:|:---:|:---:|:---:|:---:|:---:|:---:|\n||5C|10C|20C|5C|10C|20C|\n|Random|69.76±6.47|78.29±3.99|83.24±1.08|55.25±7.68|65.59±1.60|68.25±1.28|\n|Uncertainty|68.78±5.64|77.15±3.36|82.33±1.30|53.59±8.70|62.91±5.47|67.97±1.69|\n|Density|72.31±3.10|78.85±1.61|83.22±1.08|55.49±7.04|65.41±2.80|68.07±1.51|\n|CoreSet|66.07±3.34|76.11±3.37|80.43±1.97|54.22±6.17|61.45±3.05|67.41±1.02|\n|Degree|68.02±1.92|77.92±0.45|82.85±0.41|58.99±1.61|60.62±1.95|67.41±0.50|\n|Pagerank|69.82±2.74|76.64±1.27|83.52±0.51|53.41±2.70|62.61±1.00|69.53±0.66|\n|AGE|71.31±3.89|78.81±2.14|83.29±1.23|56.65±4.73|64.46±2.58|67.59±2.60|\n|FeatProp|74.63±2.59|83.85±0.58|84.49±0.60|44.99±2.25|52.97±2.08|63.01±0.93|\n|GraphPart|80.45±1.07|82.47±0.46|83.4±0.42|47.89±2.25|58.99±1.34|65.99±1.08|\n|SCARCE-Structure|79.96±1.10|83.43±0.54|83.98±0.48|64.55±0.72|69.99±0.74|72.05±0.35|\n|SCARCE-Feature|82.05±1.32|83.25±0.65|85.96±0.53|67.63±1.98|70.98±0.37|72.25±0.74|\n|SCARCE-ALL|82.61±1.01|83.15±0.47|85.94±0.51|66.37±4.07|70.91±0.42|72.89±0.44|\n\nFrom the above results, we can observe that the proposed SCARCE can also work well with both GAT and GCNII backbones. This result demostrate the proposed SCARCE can achieve generally good performance across different state-of-the-art GNN backbones.\n\n[2] Graph attention networks. ICLR'18\n\n[3] Simple and deep graph convolutional networks. ICML'20\n\n> **Q3**: In addition, one advantage of this paper lies in the applicability on featureless networks, which is not tested in this paper either.\n\n**R4**: Thanks for your suggestion. To verify the effectiveness of the proposed method on low-quality feature cases, we conducted additional experiments in two distinct settings, i.e., Noise feature and Missing feature setting.\n\n1. **Noise Feature Setting**: We introduced varying levels of standard Gaussian noise to the original features. Specifically,  we modified the features as $X = X + k*\\epsilon$, where $\\epsilon \\sim \\mathcal{N}(0,1)$, and k takes values from the $[0.1, 0.3, 0.5, 0.7, 0.9]$. This experiment was conducted on the Cora and CiteSeer datasets with budget settings of 5C and 10C, where C represents the number of classes in the dataset. The results are shown in Appendix Section B.3 in our revised paper. For your convenience, we present the results of 5C budgets with GCN and APPNP backbones in Part 3."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8658/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700285869479,
                "cdate": 1700285869479,
                "tmdate": 1700285869479,
                "mdate": 1700285869479,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "lho4AbNY1f",
                "forum": "bvjcMvMn7B",
                "replyto": "KoAVYAfDgA",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8658/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8658/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer UJDy - Part 3"
                    },
                    "comment": {
                        "value": "**R4 Continued**: The results of the noise feature setting are shown below:\n\n|GCN|||Cora|||||CiteSeer|||\n|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|\n|Noise|0.1|0.3|0.5|0.7|0.9|0.1|0.3|0.5|0.7|0.9|\n|Random|64.52±4.50|51.76±4.19|44.76±4.12|40.54±4.12|38.65±3.33|49.16±8.22|36.36±5.71|29.53±4.38|27.05±2.07|26.34±1.85|\n|Degree|61.58±0.44|54.84±0.66|51.25±0.60|49.82±0.62|47.37±0.79|44.37±0.88|37.27±0.47|34.28±0.56|34.53±0.46|34.12±0.56|\n|Pagerank|60.77±1.16|43.22±2.59|34.96±2.23|32.86±0.94|32.76±1.27|49.34±2.77|33.40±2.49|27.99±1.22|25.41±1.95|25.08±1.74|\n|FeatProp|77.51±0.61|45.93±2.18|38.50±1.63|32.94±0.48|26.86±1.45|52.30±2.47|33.16±1.62|27.59±1.84|26.10±1.25|24.88±0.98|\n|GraphPart|79.22±0.48|62.17±1.24|51.80±0.85|45.01±1.05|40.83±1.56|52.37±1.13|44.63±1.05|38.91±0.66|35.59±0.92|34.42±1.51|\n|SCARCE|75.13±0.81|67.23±0.70|59.42±0.47|55.90±0.63|53.45±0.96|59.50±2.53|50.35±0.56|41.61±0.83|37.23±0.63|35.23±1.11|\n\n|APPNP|||Cora|||||CiteSeer|||\n|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|\n|Noise|0.1|0.3|0.5|0.7|0.9|0.1|0.3|0.5|0.7|0.9|\n|Random|69.52±5.14|60.06±4.43|55.21±4.19|53.16±3.60|51.51±4.42|50.91±7.05|39.35±4.37|35.08±5.96|32.97±3.49|31.77±4.15|\n|Degree|67.59±0.92|61.86±0.55|58.98±0.67|56.29±0.82|55.81±0.88|50.83±1.58|41.98±1.10|39.77±0.62|36.92±0.38|36.84±0.51|\n|Pagerank|70.87±1.70|54.90±2.85|50.41±1.87|44.75±1.93|43.62±2.49|52.08±2.55|41.20±2.01|34.63±2.43|30.68±2.27|31.78±1.99|\n|FeatProp|80.17±0.77|48.23±1.72|44.64±1.36|35.49±0.77|35.76±0.86|54.49±1.66|36.12±1.34|27.69±1.57|25.43±0.81|24.31±1.53|\n|GraphPart|80.68±0.41|68.76±1.80|66.11±1.05|59.14±2.04|54.07±2.22|60.38±1.40|45.39±1.36|40.97±1.14|39.19±1.78|38.79±1.11|\n|SCARCE|79.39±0.67|75.89±0.66|72.46±0.20|70.10±1.21|69.19±0.78|62.58±1.24|54.76±0.82|48.60±0.63|45.67±0.55|44.28±0.60|\n\nFrom the above results, we can have the following observations:\n* With the level of noise increase in the features, the performance of the feature-based methods drops a lot. For example, the FeatProp performs even worse than random selection. \n* The proposed SCARCE, which only leverages the graph structure in active learning, can outperform baselines by a large margin.\n\n2. **Missing Feature Setting**: To further test the resilience of SCARCE under challenging feature conditions, we conducted experiments in a setting where all features are missing. In this scenario, we replaced the original node features with one-hot ID features. We conduct experiments on both Cora and CiteSeer datasets with labeling budgets of 5C, 10C, and 20C using both GCN and APPNP models. The results are shown below:\n\n|GCN||Cora|||CiteSeer||\n|:---:|:---:|:---:|:---:|:---:|:---:|:---:|\n|Budget|5C|10C|20C|5C|10C|20C|\n|Random|44.76±5.83|56.47±2.30|64.03±1.74|28.41±2.69|34.78±3.06|40.58±2.61|\n|Degree|44.19±7.98|51.69±2.82|63.26±1.95|27.33±1.97|31.74±2.79|40.99±2.02|\n|Pagerank|39.19±3.55|47.95±3.94|63.93±3.85|24.03±1.96|32.83±2.21|40.35±2.02|\n|FeatProp|47.75±3.16|58.84±3.22|65.66±1.38|29.79±2.32|34.79±2.00|41.89±2.71|\n|GraphPart|55.37±4.06|57.40±4.24|67.60±2.61|38.27±2.08|37.40±2.56|43.61±3.15|\n|SCARCE|61.43±2.31|68.64±1.94|69.59±1.22|37.89±1.94|43.51±1.44|48.20±1.15|\n\n|APPNP||Cora|||CiteSeer||\n|:---:|:---:|:---:|:---:|:---:|:---:|:---:|\n|Budget|5C|10C|20C|5C|10C|20C|\n|Random|62.27±3.86|68.71±3.22|75.52±1.65|38.24±3.21|46.10±2.85|49.98±1.52|\n|Degree|64.48±2.97|65.29±1.63|73.21±1.17|38.92±4.79|46.93±1.60|49.10±2.16|\n|Pagerank|61.79±1.61|68.89±1.11|74.15±0.58|31.94±1.20|42.58±1.39|50.70±1.05|\n|FeatProp|35.22±0.99|47.42±3.34|72.47±0.42|31.89±0.46|31.98±0.57|29.01±0.56|\n|GraphPart|66.40±0.60|71.98±0.59|74.15±1.38|46.10±0.62|49.93±0.40|51.34±0.78|\n|SCARCE|72.39±1.54|76.33±0.99|76.77±0.71|48.06±3.66|52.20±2.02|56.21±1.92|\n\nFrom the above results, we can have similar findings: While the feature-based methods, such as FeatProp, perform poorly under the missing feature setting, our proposed SCARCE can achieve good performance.\n\nIn summary, the proposed method SCARCE can perform as expected when the feature quality is low or missing, but the feature-based active learning methods may perform poorly.\n\nWe hope that we have addressed the concerns in your comments, and please kindly let us know if there is any further concern, and we are happy to clarify."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8658/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700285951281,
                "cdate": 1700285951281,
                "tmdate": 1700285951281,
                "mdate": 1700285951281,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "3BgpDbaHUy",
                "forum": "bvjcMvMn7B",
                "replyto": "KoAVYAfDgA",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8658/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8658/Authors"
                ],
                "content": {
                    "title": {
                        "value": "A Gentle Remind to Reviewer UJDy"
                    },
                    "comment": {
                        "value": "Dear Reviewer UJDy,\n\nWe would like to express our sincere gratitude to you for reviewing our paper and providing valuable feedback. Could we kindly know if the responses have addressed your concerns? If there are any further questions, we are happy to clarify. Thank you.\n\nBest,\n\nAll authors"
                    }
                },
                "number": 14,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8658/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700492157429,
                "cdate": 1700492157429,
                "tmdate": 1700492157429,
                "mdate": 1700492157429,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "F1Knpg9SXL",
                "forum": "bvjcMvMn7B",
                "replyto": "KoAVYAfDgA",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8658/Reviewer_UJDy"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8658/Reviewer_UJDy"
                ],
                "content": {
                    "title": {
                        "value": "Thanks for the rebuttal"
                    },
                    "comment": {
                        "value": "Thanks for the detailed rebuttal. Most of my concerns have been addressed and I have my score raised."
                    }
                },
                "number": 21,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8658/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700712456464,
                "cdate": 1700712456464,
                "tmdate": 1700712456464,
                "mdate": 1700712456464,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "CrLZrEeWaA",
            "forum": "bvjcMvMn7B",
            "replyto": "bvjcMvMn7B",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission8658/Reviewer_BDeb"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission8658/Reviewer_BDeb"
            ],
            "content": {
                "summary": {
                    "value": "Existing active learning models for GNNs heavily rely on the quality of initial node features and ignore the impact of label position bias in the selection of representative nodes. To address these limitations, this paper proposes a novel framework called SCARCE."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "+ They identify the limitations in current active learning methods, specifically the oversight regarding feature quality and position bias.\n+ They propose a novel framework to tackle the aforementioned limitations.\n+ Extensive experiments validate the effectiveness of the proposed framework."
                },
                "weaknesses": {
                    "value": "- There are concerns regarding the fundamental motivation behind active learning. While the primary motivation for active learning lies in the difficulty of obtaining high-quality labels in real-world scenarios, the iterative addition of labels for learned target nodes during the optimization process raises doubts about the original motivation. This creates some contradiction as it suggests that labels for target nodes might be easy to obtain.\n- The improvement compared to baselines seems not statistically significant.\n- They argue that existing methods heavily rely on the quality of initial node features while the proposed framework can mitigate this problem. However, there lack of experimental support. The features of datasets seem typical, lacking any characteristics such as unavailability and noise. There is a need for a quantifiable evaluation to support this point."
                },
                "questions": {
                    "value": "Please refer to the weaknesses.\n- There are concerns regarding the fundamental motivation behind active learning. While the primary motivation for active learning lies in the difficulty of obtaining high-quality labels in real-world scenarios, the iterative addition of labels for learned target nodes during the optimization process raises doubts about the original motivation. This creates some contradiction as it suggests that labels for target nodes might be easy to obtain.\n- The improvement compared to baselines seems not statistically significant.\n- They argue that existing methods heavily rely on the quality of initial node features while the proposed framework can mitigate this problem. However, there lack of experimental support. The features of datasets seem typical, lacking any characteristics such as unavailability and noise. There is a need for a quantifiable evaluation to support this point."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "details_of_ethics_concerns": {
                    "value": "No"
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission8658/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699287960402,
            "cdate": 1699287960402,
            "tmdate": 1699637084542,
            "mdate": 1699637084542,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "51rZ5KFJiE",
                "forum": "bvjcMvMn7B",
                "replyto": "CrLZrEeWaA",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8658/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8658/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to reviewer BDeb - Part 1"
                    },
                    "comment": {
                        "value": "Dear Reviewer BDeb,\n\nWe appreciate your constructive feedback. We are pleased to provide detailed responses to address your concerns.\n\n> **Q1**: There are concerns regarding the fundamental motivation behind active learning. While the primary motivation for active learning lies in the difficulty of obtaining high-quality labels in real-world scenarios, the iterative addition of labels for learned target nodes during the optimization process raises doubts about the original motivation. This creates some contradiction as it suggests that labels for target nodes might be easy to obtain.\n\n**R1**:  Thank you for pointing out this concern. We would like to clarify that the fundamental motivation behind active learning is that we want to maximize the model's performance within a limited labeling budget. Due to the difficulty of obtaining high-quality labels, we usually assume the samples are labeled by human experts (often called “oracle”), which can be expensive and time-consuming. Therefore, we usually set a labeling budget to constrain the number of samples that can be labeled by human experts.\n\nIn active learning, there are primarily two settings: iterative [1][2] and one-step [3][4]. In the iterative setting, as you mentioned, we ask human experts to label a small number of samples and then train a model based on these samples in each iteration. Afterward, we use the learned model to select some new samples (for example, samples with low confidence based on the model) and ask human experts to label them. This process is repeated until the limited budget is reached. Conversely, in the one-step active learning setting, which is the focus of our work, all the labels are obtained at once within the set budget. This approach avoids the resource-intensive process of training the model multiple times. However, for both settings, the effects of human experts are the same as the number of labeled samples is the budget. Therefore, it does not imply that obtaining labels is easy.\n\n[1] An analysis of active learning strategies for sequence labeling tasks.\n\n[2] Active learning for graph embedding.\n\n[3] Active learning for graph neural networks via node feature propagation. \n\n[4] Partition-based active learning for graph neural networks.\n\n> **Q2**: The improvement compared to baselines seems not statistically significant.\n\n**R2**: We have conducted the t-test between our proposed SCARCE and the best baseline model across each dataset and budget setting. The p-value less than 0.05 usually indicates that the improvement is statistically significant. In our paper, we have marked results that are statistically significant with a red asterisk (*) in Tables 1 and 2 for clear reference.  For your convenience, we also present partial results of the GCN model here:\n\n| DataSet |  | Cora |  |  | CiteSeer |  |  | Computer |  |  | Arxiv |  |\n|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|\n| Budget | 5C | 10C | 20C | 5C | 10C | 20C | 5C | 10C | 20C | 5C | 10C | 20C |\n| P-Value | 2.9E-06 | 0.4 | 1.1E-04 | 8.0E-10 | 9.7E-19 | 4.4E-20 | 3.0E-06 | 0.01 | 4.7E-05 | 1.2E-06 | 1.5E-10 | 2.3E-21 |\n\nFrom the results, the majority of our improvements over baseline models are indeed statistically significant.\n\n> **Q3**: They argue that existing methods heavily rely on the quality of initial node features while the proposed framework can mitigate this problem. However, there lack of experimental support. The features of datasets seem typical, lacking any characteristics such as unavailability and noise. There is a need for a quantifiable evaluation to support this point.\n\n**R3**: Thank you for this great suggestion. Following your suggestion, we conducted additional experiments in two distinct settings to demonstrate the superiority of the proposed SCARCE.\n\n1. **Noise Feature Setting**: We introduced varying levels of standard Gaussian noise to the original features. Specifically, we modified the features as $X = X + k*\\epsilon$, where $\\epsilon \\sim \\mathcal{N}(0,1)$, and k takes values from the $[0.1, 0.3, 0.5, 0.7, 0.9]$. This experiment was conducted on the Cora and CiteSeer datasets with budget settings of 5C and 10C, where C represents the number of classes in the dataset. The results are shown in Appendix B.3 of our revised paper. For your convenience, we present the partial results of 5C budgets with GCN and APPNP backbones in Part 2."
                    }
                },
                "number": 1,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8658/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700282843328,
                "cdate": 1700282843328,
                "tmdate": 1700283258102,
                "mdate": 1700283258102,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "COPRDLNiGh",
                "forum": "bvjcMvMn7B",
                "replyto": "CrLZrEeWaA",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8658/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8658/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to reviewer BDeb - Part 2"
                    },
                    "comment": {
                        "value": "**R3 Continued**: The results of the noise feature setting are shown below:\n\n|GCN|||Cora|||||CiteSeer|||\n|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|\n|Noise|0.1|0.3|0.5|0.7|0.9|0.1|0.3|0.5|0.7|0.9|\n|Random|64.52±4.50|51.76±4.19|44.76±4.12|40.54±4.12|38.65±3.33|49.16±8.22|36.36±5.71|29.53±4.38|27.05±2.07|26.34±1.85|\n|Degree|61.58±0.44|54.84±0.66|51.25±0.60|49.82±0.62|47.37±0.79|44.37±0.88|37.27±0.47|34.28±0.56|34.53±0.46|34.12±0.56|\n|Pagerank|60.77±1.16|43.22±2.59|34.96±2.23|32.86±0.94|32.76±1.27|49.34±2.77|33.40±2.49|27.99±1.22|25.41±1.95|25.08±1.74|\n|FeatProp|77.51±0.61|45.93±2.18|38.50±1.63|32.94±0.48|26.86±1.45|52.30±2.47|33.16±1.62|27.59±1.84|26.10±1.25|24.88±0.98|\n|GraphPart|79.22±0.48|62.17±1.24|51.80±0.85|45.01±1.05|40.83±1.56|52.37±1.13|44.63±1.05|38.91±0.66|35.59±0.92|34.42±1.51|\n|SCARCE|75.13±0.81|67.23±0.70|59.42±0.47|55.90±0.63|53.45±0.96|59.50±2.53|50.35±0.56|41.61±0.83|37.23±0.63|35.23±1.11|\n\n|APPNP|||Cora|||||CiteSeer|||\n|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|:---:|\n|Noise|0.1|0.3|0.5|0.7|0.9|0.1|0.3|0.5|0.7|0.9|\n|Random|69.52±5.14|60.06±4.43|55.21±4.19|53.16±3.60|51.51±4.42|50.91±7.05|39.35±4.37|35.08±5.96|32.97±3.49|31.77±4.15|\n|Degree|67.59±0.92|61.86±0.55|58.98±0.67|56.29±0.82|55.81±0.88|50.83±1.58|41.98±1.10|39.77±0.62|36.92±0.38|36.84±0.51|\n|Pagerank|70.87±1.70|54.90±2.85|50.41±1.87|44.75±1.93|43.62±2.49|52.08±2.55|41.20±2.01|34.63±2.43|30.68±2.27|31.78±1.99|\n|FeatProp|80.17±0.77|48.23±1.72|44.64±1.36|35.49±0.77|35.76±0.86|54.49±1.66|36.12±1.34|27.69±1.57|25.43±0.81|24.31±1.53|\n|GraphPart|80.68±0.41|68.76±1.80|66.11±1.05|59.14±2.04|54.07±2.22|60.38±1.40|45.39±1.36|40.97±1.14|39.19±1.78|38.79±1.11|\n|SCARCE|79.39±0.67|75.89±0.66|72.46±0.20|70.10±1.21|69.19±0.78|62.58±1.24|54.76±0.82|48.60±0.63|45.67±0.55|44.28±0.60|\n\nFrom the above results, we can have the following observations:\n* With the level of noise increase in the features, the performance of the feature-based methods drops a lot. For example, the FeatProp performs even worse than random selection. \n* The proposed SCARCE, which only leverages the graph structure in active learning, can outperform baselines by a large margin.\n\n2. **Missing Feature Setting**: To further test the resilience of SCARCE under challenging feature conditions, we conducted experiments in a setting where all features are missing. In this scenario, we replaced the original node features with one-hot ID features. We conduct experiments on both Cora and CiteSeer datasets with labeling budgets of 5C, 10C, and 20C using both GCN and APPNP models. The results are shown below:\n\n|GCN||Cora|||CiteSeer||\n|:---:|:---:|:---:|:---:|:---:|:---:|:---:|\n|Budget|5C|10C|20C|5C|10C|20C|\n|Random|44.76±5.83|56.47±2.30|64.03±1.74|28.41±2.69|34.78±3.06|40.58±2.61|\n|Degree|44.19±7.98|51.69±2.82|63.26±1.95|27.33±1.97|31.74±2.79|40.99±2.02|\n|Pagerank|39.19±3.55|47.95±3.94|63.93±3.85|24.03±1.96|32.83±2.21|40.35±2.02|\n|FeatProp|47.75±3.16|58.84±3.22|65.66±1.38|29.79±2.32|34.79±2.00|41.89±2.71|\n|GraphPart|55.37±4.06|57.40±4.24|67.60±2.61|38.27±2.08|37.40±2.56|43.61±3.15|\n|SCARCE|61.43±2.31|68.64±1.94|69.59±1.22|37.89±1.94|43.51±1.44|48.20±1.15|\n\n|APPNP||Cora|||CiteSeer||\n|:---:|:---:|:---:|:---:|:---:|:---:|:---:|\n|Budget|5C|10C|20C|5C|10C|20C|\n|Random|62.27±3.86|68.71±3.22|75.52±1.65|38.24±3.21|46.10±2.85|49.98±1.52|\n|Degree|64.48±2.97|65.29±1.63|73.21±1.17|38.92±4.79|46.93±1.60|49.10±2.16|\n|Pagerank|61.79±1.61|68.89±1.11|74.15±0.58|31.94±1.20|42.58±1.39|50.70±1.05|\n|FeatProp|35.22±0.99|47.42±3.34|72.47±0.42|31.89±0.46|31.98±0.57|29.01±0.56|\n|GraphPart|66.40±0.60|71.98±0.59|74.15±1.38|46.10±0.62|49.93±0.40|51.34±0.78|\n|SCARCE|72.39±1.54|76.33±0.99|76.77±0.71|48.06±3.66|52.20±2.02|56.21±1.92|\n\nFrom the above results, we can have similar findings: While the feature-based methods, such as FeatProp, perform poorly under the missing feature setting, our proposed SCARCE can achieve good performance.\n\nIn summary, the proposed method SCARCE can perform as expected when the feature quality is low or missing, but the feature-based active learning methods may perform poorly.\n\nWe hope that we have addressed the concerns in your comments, and please kindly let us know if there is any further concern, and we are happy to clarify."
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8658/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700283226954,
                "cdate": 1700283226954,
                "tmdate": 1700283226954,
                "mdate": 1700283226954,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "N7j9HpIik0",
                "forum": "bvjcMvMn7B",
                "replyto": "CrLZrEeWaA",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8658/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8658/Authors"
                ],
                "content": {
                    "title": {
                        "value": "A Gentle Remind to Reviewer BDeb"
                    },
                    "comment": {
                        "value": "Dear Reviewer BDeb,\n\nWe would like to express our sincere gratitude to you for reviewing our paper and providing valuable feedback. Could we kindly know if the responses have addressed your concerns? If there are any further questions, we are happy to clarify. Thank you.\n\nBest,\n\nAll authors"
                    }
                },
                "number": 13,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8658/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700492110709,
                "cdate": 1700492110709,
                "tmdate": 1700492110709,
                "mdate": 1700492110709,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]