[
    {
        "title": "DAG-Based Column Generation for Adversarial Team Games"
    },
    {
        "review": {
            "id": "NQPm9Y8AGS",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6658/Reviewer_toQL"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6658/Reviewer_toQL"
            ],
            "forum": "C371MUzjBl",
            "replyto": "C371MUzjBl",
            "content": {
                "summary": {
                    "value": "The authors propose a column generation/double oracle-based framework for adversarial team games, in which the meta-Nash equilibrium is computed by allowing any (joint) action proposed by any of the strategies in the support through the TB-DAG framework, and the best responses are computed through an integer program. Via extensive experiments, the authors demonstrate that their method is more scalable than past techniques."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "The techniques proposed by the paper are at least somewhat novel. The authors do a reasonable job of positioning the paper within prior work, addressing what aspects of their proposed techniques are new and performing ablation tests in the experiments. The experiments show that the method scales better than past methods, which is important for practical applications of TMECor."
                },
                "weaknesses": {
                    "value": "As mentioned by the authors, the basic idea of using the sequence form to speed up column generation/double oracle for extensive-form games was proposed by Bosansky et al (2014). I do appreciate the authors' frank discussion of this comparison (Appendix A), but I think this should be reflected in the framing of the paper (e.g., perhaps Bosansky et al.'s method should be introduced in the body, and then the proposed DCG method should be framed as the natural analogue of that method for adversarial team games). I think the current framing of DCG makes it seem like it is more complex of a method than it really is. Phrased another way, in some sense I think Appendix A is the most important part of this paper from a conceptual standpoint, and it should be as much as possible moved into the body/discussed earlier, maybe even in the introduction. (if space is needed, for example, I'd suggest moving some of the ablation experiments, or the discussion of the BRO to the appendix; these matters are in my opinion less important than correct positioning of the work within past literature).\n\nFor the BRO, there should be some discussion of the total size of the representation (number of nonzeros in constraint matrix), as a function of e.g. the number of sequences, number of players, game size, etc. It seems to me that this size can be exponential in |H| in the worst case (when the number of players is large), which is somewhat troubling especially compared to past BROs which, as you say in Appendix A, do not have this problem. (For example, consider a polymatrix game with $N$ players and $A$ actions per player converted in the natural manner to extensive form---such a game would have $|H| = O((NA)^2)$ but every tuple of sequences will be relevant, so the  BRO will have representation size something like $A^N$).\n\nOn a more minor note, I would also like to see experiments on team-vs-team games, in which both teams would have to apply this column-generation method. In that setting, my guess would be the advantage over the baseline DAG algorithm will be less, because of the added inefficiency of having to perform CG for both sides---but I would still expect the method to perform very well."
                },
                "questions": {
                    "value": "1. (from above) How does the proposed technique (or, the natural generalization thereof) perform in the setting of team-vs-team games?\n1. Why does DCG_pure perform differently from DCG_linrelax^pure? Wouldn't an integer program solver first attempt to solve the linear relaxation anyway? (so they should do the same thing?)"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6658/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1697132665594,
            "cdate": 1697132665594,
            "tmdate": 1699636761595,
            "mdate": 1699636761595,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "FmEOJBX3B1",
                "forum": "C371MUzjBl",
                "replyto": "NQPm9Y8AGS",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6658/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6658/Authors"
                ],
                "content": {
                    "title": {
                        "value": "To Reviewer toQL (1/2)"
                    },
                    "comment": {
                        "value": "Thank you very much for your helpful comments. We have uploaded a new version of the paper to address your comments. \n\n**Comment**: About moving the related work in Appendix A to the main body of the paper.\\\n**A**: Thanks for giving us this interesting idea. We once put all related work in the main body of the paper, but the space is not enough. So, we summarized the related work in Section 3 and presented details in Appendix A. Specifically, at the beginning of Section 3, we present:\n\nSolving Problem (1) is challenging because the team’s coordinated strategy space is exponential in the size of the game tree. With the procedure shown in Figure 1(c), CG can mitigate this challenge but still converges slowly in large games due to such a large strategy space. It has been shown that the TB-DAG-based algorithms are more efficient than CG in games with a small TB-DAG (Zhang et al., 2022b;c). However, solving Problem (1) through the TB-DAG is impractical in large games because the size of the TB-DAG is still exponential in the size of the game tree (Zhang et al., 2022c). To speed up, one straightforward idea is applying CG with the procedure shown in Figure 1(c) to the TB-DAG, which also is the direct application of the sequence-form double oracle (Bosansky et al., 2014) to the TB-DAG. That is, we compute a TMECor with a limited size of the TB-DAG, and then expand the DAG by computing a best response over the whole TB-DAG form strategy space, i.e., solving the problem: max_{\\boldsymbol{x}} u_T (\\boldsymbol{x}, \\boldsymbol{y}_o). However, it is inefficient to compute a best response over the whole exponential-sized TB-DAG. As shown in experiments, this exponential size will make CG with the DAG-based BRO very inefficient. More details on related work are shown in Appendix A.\n\n**Comment**: About presenting the viewpoint of applying the sequence-form double oracle Bosansky et al. (2014) algorithm to ATGs.\\\n**A**: Thanks again for your interesting idea. We once considered presenting the viewpoint of applying the sequence-form double oracle Bosansky et al. (2014) algorithm to ATGs. However, compared to the current viewpoint of applying CG to the TB-DAG, both viewpoints give us the same procedure and do not need the key features of the sequence-form double oracle algorithm in Bosansky et al. (2014), but using CG is the tradition in the mainstream literature on ATGs (Celli & Gatti, 2018; Farina et al., 2018; Zhang et al., 2021; Farina et al., 2021; Zhang et al., 2022b). Therefore, we chose the current viewpoint of applying CG to the TB-DAG:\nRecall that the sequence-form double oracle algorithm in Bosansky et al. (2014) is only for two-player extensive-form perfect-recall zero-sum games. However, as we mentioned, an ATG is an imperfect-recall game. Thus, the algorithm in Bosansky et al. (2014) cannot be directly applied to original ATGs. To apply the algorithm in Bosansky et al. (2014) for solving ATGs, we need to transform the original strategy representation of ATGs into the TB-DAG form. Then, we can compute a TMECor with a limited size of the TB-DAG for the restricted game and then expand the TB-DAG by computing a best response over the whole TB-DAG of the original game. Unfortunately, it is inefficient to compute a best response over the whole exponential-sized TB-DAG. Therefore, the sequence-form double oracle algorithm in Bosansky et al. (2014) that is directly applied to the TB-DAG is inefficient in large games. To improve the scalability, similar to Section 3, we can propose a novel sequence-form oracle algorithm framework that includes 1) computing a coordinated best response, 2) transforming this coordinated best response to the TB-DAG form, and then 3) adding this equivalent TB-DAG form strategy to the restricted game. This algorithm framework has an extra transformation step and needs a suitable BRO to reduce the cost of the transformation. We can see that the above algorithm procedure is the same as our current DCG. We chose to present our algorithm from the viewpoint of applying CG to the TB-DAG because:\n\n1.\tAs we mentioned, both viewpoints will result in the same algorithm.\n\n2.\tIn the mainstream literature on ATGs (Celli & Gatti, 2018; Farina et al., 2018; Zhang et al., 2021; Farina et al., 2021; Zhang et al., 2022b), CG was used to solve ATGs because the team’s strategy space is in normal form and is exponentially larger than the strategy space of the opponent (adversary). \n\n3.\tBecause the strategy space of the opponent (adversary) is exponentially smaller than the team’s strategy space, we only expand the strategy space of the team. Thus, we do not need the key features of the sequence-form double oracle algorithm (Bosansky et al., 2014) in the restricted game (i.e., incomplete strategy and unallowed actions), as we mentioned in Appendix A.1.\n\nWe added Appendix A.2 in the new version to discuss the viewpoint of applying the sequence-form double oracle Bosansky et al. (2014) algorithm to ATGs."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6658/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700279345936,
                "cdate": 1700279345936,
                "tmdate": 1700279345936,
                "mdate": 1700279345936,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "zyBy5cexzk",
                "forum": "C371MUzjBl",
                "replyto": "G2NJmyNERx",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6658/Reviewer_toQL"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6658/Reviewer_toQL"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for the reply, especially for clarifying the BRO. My overall opinion of the paper remains positive, and I will keep my score."
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6658/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700340033295,
                "cdate": 1700340033295,
                "tmdate": 1700340033295,
                "mdate": 1700340033295,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "6VrxKhatWA",
            "forum": "C371MUzjBl",
            "replyto": "C371MUzjBl",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6658/Reviewer_rs4T"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6658/Reviewer_rs4T"
            ],
            "content": {
                "summary": {
                    "value": "This paper adapts the TB-DAG representation of an adversarial team game for column generation techniques, outperforming state-of-the-art CG implementations in numerical experiments on large instances."
                },
                "soundness": {
                    "value": "4 excellent"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "I reviewed a previous version of this paper.\n\nThe paper's exposition has improved substantially from this previous iteration. Notation has been standardized to match what is used in existing literature, and the flow of the paper has been vastly improved. Additionally, a discussion has been added regarding the transformation cost of DCG based on using the BRO that has been proposed, which makes clear that the transformation cost is not overly expensive. \n\nThe paper provides a solid technical contribution in providing a novel CG framework for TMECor computation. Extensive experiments are provided to demonstrate the effectiveness of this framework and how it compares to SOTA approaches for TMECor computation. The authors sufficiently discuss the novelty of their approach in the main body of the paper as well as in Appendix A. It is clear that their approach outperforms existing approaches in certain settings, and thus is a valuable contribution."
                },
                "weaknesses": {
                    "value": "Prior weaknesses that I (and other reviewers) had mentioned in an earlier review have been adequately addressed. In the past, some reviewers have mentioned concerns about the novelty of the approach; I think this has also been sufficiently addressed (see discussion in Strengths)."
                },
                "questions": {
                    "value": "N/A"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission6658/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6658/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6658/Reviewer_rs4T"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6658/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698778508172,
            "cdate": 1698778508172,
            "tmdate": 1699636761479,
            "mdate": 1699636761479,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "6SvpdvYr9B",
                "forum": "C371MUzjBl",
                "replyto": "6VrxKhatWA",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6658/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6658/Authors"
                ],
                "content": {
                    "title": {
                        "value": "To Reviewer rs4T"
                    },
                    "comment": {
                        "value": "Thank you very much for your positive review."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6658/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700279124112,
                "cdate": 1700279124112,
                "tmdate": 1700279124112,
                "mdate": 1700279124112,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "99iNNiZwMj",
            "forum": "C371MUzjBl",
            "replyto": "C371MUzjBl",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6658/Reviewer_cmYu"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6658/Reviewer_cmYu"
            ],
            "content": {
                "summary": {
                    "value": "The paper proposes a novel algorithm for computing a TMEcor in adversarial team games. The main idea is that of combining the two algorithms currently used in the literature, Column Generation and DAG/belief-based representation. The proposed algorithm employs column generation for equilibrium computation on a reduced version of the game, while adopting the faster equilibrium computation enabled by the DAG. The role of the best response routine is to progressively expands the DAG representation.\n\nThe paper shows that this procedure does not worsen the theoretical bounds of the previous algorithms, and thoroughly evaluates different variants of the main algorithm on a large suite of games."
                },
                "soundness": {
                    "value": "4 excellent"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "* clear positioning of the paper wrt the literature\n* strong empirical results\n* Comprehensive evaluation set and analysis\n* I also appreciated the structure of the paper, where detailed and satisfactory discussions are moved to the appendix and the paper focuses on the main"
                },
                "weaknesses": {
                    "value": "* No clear winner between \\emph{pure} or \\emph{linrelax} versions of the algorithm\n* the proopsed algorithm somewhat lack originality, in the sense that is an incremental improvement that recombines ideas already available in the literature. This lowers the contribution provided by the paper, even if my opinion is that this paper is interesting nonetheless."
                },
                "questions": {
                    "value": "The paper was clear enough for me to understand the points\nI suggest the following corrections/clarifications to improve the minor problems I found in specific points of the paper:\n* in many occasions it is said that \"by exploiting the team’s correlation property.. the BRO\".. This property is not clear to me, and I thnk it should be better specified in the text\n* the BRO algorithm presented in Section 3.3 is not completely novel. A similar algorithm was provided in \"Subgame Solving in Adversarial Team Games\" by Zhang et al., with the similar purpose of providing a more sparse BR (in that case sparsity is useful for reaching fewer private states in the same public state). My suggestion is to add a short reference to such a similar method."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6658/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698854021035,
            "cdate": 1698854021035,
            "tmdate": 1699636761386,
            "mdate": 1699636761386,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "iyUOtqamOy",
                "forum": "C371MUzjBl",
                "replyto": "99iNNiZwMj",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6658/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6658/Authors"
                ],
                "content": {
                    "title": {
                        "value": "To Reviewer cmYu"
                    },
                    "comment": {
                        "value": "Thank you very much for your insightful comments. We have uploaded a new version of the paper to address your comments. \n\n**Comment**: No clear winner between \\emph{pure} or \\emph{linrelax} versions of the algorithm\\\n**A**: As we mentioned, the setting of \\emph{linrelax} is: at each iteration, it solves the linear relaxation of the BRO first to see if it can output the optimal solution added to the restricted game; if it cannot do that, it solves the original mixed-integer BRO and adds all feasible solutions for the BRO from the CPLEX solution pool to the original game.\n\nThat is, \\emph{linrelax} usually adds more strategies to the restricted game than \\emph{pure}. Consider the relaxed version DCG^linrelax_pure of DCG_pure. As we mentioned in Section 4, the relaxed version DCG^linrelax_pure of DCG_pure, in most games with relatively narrow game trees, outperforms DCG_pure because it could reduce the cost of calling the mixed-integer BRO. However, in games with relatively wide game trees, DCG_pure outperforms DCG^linrelax_pure because DCG^linrelax_pure transforms too many coordinated strategies into the TB-DAG form, which incurs a very high cost in games with relatively wide game trees.\n\n**Comment**: About originality.\\\n**A**: Our DCG does not just directly apply CG to the TB-DAG. Our work provides the first efficient TB-DAG CG algorithm, which includes a novel CG algorithm framework and solves many games that were previously unsolvable. Our DCG algorithm computes a pure coordinated best response (i.e., a coordinated strategy represented by a joint normal-form strategy of the team) in the original game tree first and then transforms it into the TB-DAG form. Our DCG has an extra transformation step, which does not exist in previous CG algorithms. Our DCG significantly overcomes the limitation of previous CG/double oracle algorithms for a TMECor with a novel CG algorithm framework and a suitable best response oracle. More details on related work are shown in Appendix A.\n\nWe provide a solid technical contribution in providing a novel CG framework for TMECor computation. For example, we show that the transformation cost is only polynomial in the size of the original game tree, which makes it clear that the transformation cost is not overly expensive. We also show that our algorithm converges exponentially faster than the state-of-the-art CG algorithms.\n\n**Q**: in many occasions it is said that \"by exploiting the team’s correlation property.. the BRO\".. This property is not clear to me, and I thnk it should be better specified in the text\\\n**A**: Thanks. We explicitly mentioned that the team’s correlation property is the probability flow defined in Eq.(2) in the new version.\n\n**Q**: the BRO algorithm presented in Section 3.3 is not completely novel. A similar algorithm was provided in \"Subgame Solving in Adversarial Team Games\" by Zhang et al., with the similar purpose of providing a more sparse BR (in that case sparsity is useful for reaching fewer private states in the same public state). My suggestion is to add a short reference to such a similar method.\\\n**A**: Their technique is different from ours. In Appendix A.4 of the new version, we discussed the technique in \"Subgame Solving in Adversarial Team Games\" by Zhang et al.:\n\nZhang et al. (2022a) provided a subgame technique to solve ATGs and proposed using CG for sparse solutions in the subgame solving algorithm. That is, they compute a best response starting from each reachable belief in each public state. To keep the number of these reachable beliefs small, they create sparse blueprints in the subgame solving algorithm by using a CG algorithm because “the support size of the blueprint generated by a CG algorithm, scales linearly with the number of iterations, which, under reasonable time constraints, rarely exceeds the hundreds” (Zhang et al., 2022a). Their sparse blueprint and our pure best response are both sparse solutions, but theirs is different from our suitable BRO:\n\n 1. The goals are different: Our goal is to reduce the cost of the transformation in our DCG, but their goal is to reduce the number of times that the BRO is called.\n\n 2. The sparsity concepts are different: Their sparse blueprint is about a small support size of the blueprint (a mixed strategy of the gadget game), but our pure best response is just about an action for each reachable state/belief.\n\n 3. The approaches are different: We propose a new suitable BRO, i.e., pure BRO, to improve our DCG, but they just directly use an existing CG algorithm for a sparse blueprint, i.e., they do not provide a new BRO algorithm."
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6658/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700278997666,
                "cdate": 1700278997666,
                "tmdate": 1700279065259,
                "mdate": 1700279065259,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "cbqDi0GbQx",
                "forum": "C371MUzjBl",
                "replyto": "iyUOtqamOy",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6658/Reviewer_cmYu"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6658/Reviewer_cmYu"
                ],
                "content": {
                    "comment": {
                        "value": "Thanks for your detailed reviews. Your answers satisfy my questions, and I appreciated that you integrated the appendices with some extra details. I confirm my score."
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6658/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700469079379,
                "cdate": 1700469079379,
                "tmdate": 1700469079379,
                "mdate": 1700469079379,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "8A8Gw9NrqY",
            "forum": "C371MUzjBl",
            "replyto": "C371MUzjBl",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6658/Reviewer_yi8B"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6658/Reviewer_yi8B"
            ],
            "content": {
                "summary": {
                    "value": "This paper studies the problem of computing an equilibrium in team games in extensive form in which the team members can coordinate their strategies ex ante, before the beginning go the game. The paper introduces a new column generation approach working with the team-belief directed acyclic graph representation recently introduced by Zhang et al. (2022). The proposed method is experimentally evaluated and compared with state-of-the-art baselines in standard benchmark of games."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "Providing better computational methods for computing equilibria in adversarial team games is of paramount importance in order to operationalize game-theoretic techniques in real-world settings beyond two-player zero-sum games.\n\nThe experimental evaluation provided in the paper is sufficiently broad."
                },
                "weaknesses": {
                    "value": "I believe that the algorithm proposed in the paper is rather incremental over previous state-of-the-art techniques, for the following reasons:\n1) The column generation algorithm doe not really add anything new compared to what done in classical column generation algorithms.\n2) The only addition made by the proposed algorithm is related to the implementation of the best response oracle, and I believe this is not enough to constitute a contribution warrant publication in a top-tier AI conference as ICLR."
                },
                "questions": {
                    "value": "None."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6658/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699442416393,
            "cdate": 1699442416393,
            "tmdate": 1699636761274,
            "mdate": 1699636761274,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "NXv0PWAmyP",
                "forum": "C371MUzjBl",
                "replyto": "8A8Gw9NrqY",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6658/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6658/Authors"
                ],
                "content": {
                    "title": {
                        "value": "To Reviewer yi8B"
                    },
                    "comment": {
                        "value": "Thank you very much for your valuable comments.\n\n**Comment**: About novelty and contribution:\n\n**A**: Our algorithm DCG does not just directly apply previous CG algorithms to the TB-DAG. Our work provides the first efficient TB-DAG CG algorithm, which includes a novel CG algorithm framework and solves many games that were previously unsolvable. Our DCG algorithm computes a pure coordinated best response (i.e., a coordinated strategy represented by a joint normal-form strategy of the team) in the original game tree first and then transforms it into the TB-DAG form. Our DCG has an extra transformation step, which does not exist in previous CG algorithms. Our DCG significantly overcomes the limitation of previous CG algorithms for a TMECor with a novel CG algorithm framework and a suitable best response oracle. More details on related work are shown in Appendix A.\n\nWe provide a solid technical contribution in providing a novel CG framework for TMECor computation. For example, we show that the transformation cost is only polynomial in the size of the original game tree, which makes it clear that the transformation cost is not overly expensive. We also show that our algorithm converges exponentially faster than the state-of-the-art CG algorithms, and experimental results show that our algorithm is at least two orders of magnitude faster than the state-of-the-art baselines and solves games that were previously unsolvable. \n\nThus, this paper creates a fundamental theory for applying the multiagent learning framework – Policy-Spaced Response Oracles (PSRO) (Lanctot et al., 2017) (a variant of CG) – to the TB-DAG for a TMECor."
                    }
                },
                "number": 1,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6658/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700278759454,
                "cdate": 1700278759454,
                "tmdate": 1700278759454,
                "mdate": 1700278759454,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]