[
    {
        "title": "FMM-Head: Enhancing Autoencoder-based ECG anomaly detection with prior knowledge"
    },
    {
        "review": {
            "id": "bpFK26jrKw",
            "forum": "DUsSJcq4Nz",
            "replyto": "DUsSJcq4Nz",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission1898/Reviewer_2MCh"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission1898/Reviewer_2MCh"
            ],
            "content": {
                "summary": {
                    "value": "Inspired by FMM, the authors devised an FMM-HEAD for ECG anomaly detection. To accomplish this, various strategies, such as warm-up regression and some formulas for variable range requirements, are incorporated. Through experimentation on three datasets, it is substantiated that the model not only outperforms its counterparts but also operates at a lower computational cost."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "- The paper's primary strength lies in its adept transformation of recent breakthroughs within the cutting-edge field of medical research into deep learning field/approach. This signifies a highly commendable approach to advancing AI research for healthcare.\n\n- The performance is good, and the computational complexity is reduced compared to prior research efforts."
                },
                "weaknesses": {
                    "value": "- The presentation requires improvement, as many crucial details are missing. In a specialized and interdisciplinary field like AI for healthcare, readers may not possess knowledge about concepts or information that has not been explicitly introduced.\n\n- The illustrations are quite haphazard and lack standardization. For instance, in the case of Figure 3 (see questions below). See Figure 2, the author even used variable names from the code, which makes reading this paper highly inconvenient.\n\n- I believe that the FFM-head may not always yield benefits across all types of heart diseases. Could the authors provide a theoretical analysis and summary about which kinds of heart diseases are best suited for this approach and which ones are not? Additionally, it would be valuable to investigate whether FMM exhibits particular advantages in scenarios where training data is limited, and whether the performance gains become insignificant when an ample training set is available.\n\n- There must be some DL models for anomaly detection that is not AE-based. It is important to compare with them and observe if we really need to use the FMM-head."
                },
                "questions": {
                    "value": "- You should remove those useless reference on some terms like \"machine learning (ML)\", \"ECG\", \"AE\"...\n\n- Parts of the citation formats are wrong. e.g., EncDecAD in the experiment section.\n\n- Figure 3 is unclear, especially the right part. There are so many arrows, but it is hard to know their meaning.\n\n- How to implement \"Circular-to-Linear\" is not given.\n\n- It is not clear how to do anomaly detection by AE. Though authors said \"AEs are state-of-the-art models for anomaly detection (Chalapathy & Chawla, 2019). AEs are trained on normal data so that abnormal samples during test phases can straightforwardly be recognized.\" But it is still not clear for readers how this works. You may give something concrete (e.g., by equation), especially similar operations are exerted on your model.\n\n- Given that FMM is a recently introduced methodology, I am uncertain about its widespread acceptance within the medical community and whether subsequent research has substantiated its efficacy. This uncertainty also extends to the potential value of the FMM-HEAD."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission1898/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission1898/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission1898/Reviewer_2MCh"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission1898/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1697500087648,
            "cdate": 1697500087648,
            "tmdate": 1699636120265,
            "mdate": 1699636120265,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "AatgvEt92L",
            "forum": "DUsSJcq4Nz",
            "replyto": "DUsSJcq4Nz",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission1898/Reviewer_kmWJ"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission1898/Reviewer_kmWJ"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes a novel neural network model called FMM-Head for solving the ECG abnormality detection problem. The FMM-Head model employs a novel decomposition architecture that replaces the decoding part of the self-encoder with a reconstructed head based on the a priori knowledge of the shape of the ECG. Compared with the traditional self-encoder model, the FMM-Head model performs well in ECG abnormality detection with an improvement of 0.311 in the area under the ROC curve (AUROC)."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. The motivation is clear.\n2. The model has interpretable extracted features and small model size for real-time ECG parameter extraction and abnormality detection. \n3. The paper provides a detailed analysis of the performance and interpretability aspects of the model."
                },
                "weaknesses": {
                    "value": "1. The core idea is trivial. More baselines are needed for example GAN-based methods and diffusion-based methods for ECG data. \n2. It is strange to use “anomaly detection” for ECG related task. \n3. More experimental validation can be performed to demonstrate the robustness and scalability of the model. \n4. More in-depth analysis should be conducted in this paper to explore the limitations and optimization space of the model."
                },
                "questions": {
                    "value": "Please see above"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission1898/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698566746004,
            "cdate": 1698566746004,
            "tmdate": 1699636120193,
            "mdate": 1699636120193,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "7muoP3GUVB",
            "forum": "DUsSJcq4Nz",
            "replyto": "DUsSJcq4Nz",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission1898/Reviewer_YaBZ"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission1898/Reviewer_YaBZ"
            ],
            "content": {
                "summary": {
                    "value": "The authors propose to replace the decoder part of the auto-encoder by FMM-Head, composition of 5 waves to mimic normal human ECG, for anomaly detection. The capability of anomaly detection was well tested."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "To replace the decoder part of the auto-encoder by FMM-Head is quite an interesting idea for domains like ECG where data are indirect observation of some physiological activity. The approach sounds, and well tested within the scope of abnormal detection."
                },
                "weaknesses": {
                    "value": "Abnormal detection is just an initial analysis of ECG data and there are many ML models that can classify normal and 5 different arrhythmias etc. Thus the scope of the paper is narrow for both ML for ECG as well as the general audience of ICLM. It would be better to discuss in a more specific venue."
                },
                "questions": {
                    "value": "The datasets used have multiple classes in abnormal ECG. Have you tested classification tasks for those diagnostic labels?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission1898/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698638164065,
            "cdate": 1698638164065,
            "tmdate": 1699636120088,
            "mdate": 1699636120088,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "o3JIFcjqKR",
            "forum": "DUsSJcq4Nz",
            "replyto": "DUsSJcq4Nz",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission1898/Reviewer_johH"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission1898/Reviewer_johH"
            ],
            "content": {
                "summary": {
                    "value": "The paper proposes a method for ECG anomaly detection. The method replaces the decoding part an AE with a reconstruction head called FMM-Head that uses prior knowledge of the ECG shape. Experiments are done on 2 datasets: PTB-XL and ECG5000. 5 baseline models are used for implementing the new decoder namely ECG-NET, EncDecAD, BertECG, CVAE, and a fully connected AE. The results show improvements over standard decoders."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "1 poor"
                },
                "strengths": {
                    "value": "The paper is situated in an important problem area. The method is simple and easy to understand."
                },
                "weaknesses": {
                    "value": "Following are the weaknesses of the paper:\n\n- The focus of the problem statement is too narrow. While the general area of anomaly detection is broad and important, the method only explores AE setups. It is not clear how relevant and important this is since AEs are not the only way of ECG anomaly detection. There are also no indications as to how generalizable this solution is.\n\n- The paper claims that existing models \"do not consider the specific patterns of ECG leads and are unexplainable black boxes\". I would like to challenge both notions. First, it is completely possible that the ECG patterns and PQRST waveforms are implicitly learned by existing methods. There is no evidence that they are \"not considered\". It would be hard to imagine how prior works produce valid results without learning the waveforms. Second, the \"black box\" argument is not well-founded. There are many studies that have analyzed and interpreted the performance of other methods.\n\n- The writing can be improved by removing very simple notions such as Pearson's correlation (page 5) and other well-known concepts.\n\n- There seems to be a gap in the logic of the paper. The paper states \"The parameters obtained after the activation function are used to reconstruct an ECG time-series Xˆ for anomaly detection. We leverage this weak a priori knowledge drawn from the FMM formulation to better reconstruct the input ECG signal.\" How is this considered 'a priori knowledge'? and why is it 'weak'? How is this different from using a standard decoder in terms of reconstruction based extracted features of one form or another?\n\n- The experiment setup requires substantial improvements as only 5 AE-based methods are used. Are these the only methods that can be used for ECG anomaly detection? what about non-AE methods?"
                },
                "questions": {
                    "value": "Please see my comments under weaknesses."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "1: strong reject"
                },
                "confidence": {
                    "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission1898/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698727605040,
            "cdate": 1698727605040,
            "tmdate": 1699636120004,
            "mdate": 1699636120004,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    }
]