[
    {
        "title": "Weight Selection for Model Initialization"
    },
    {
        "review": {
            "id": "3juOyKJ3qW",
            "forum": "dyrGMhicMw",
            "replyto": "dyrGMhicMw",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission762/Reviewer_FWr5"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission762/Reviewer_FWr5"
            ],
            "content": {
                "summary": {
                    "value": "The paper suggests that initializing the weight parameters of a smaller neural network from a pre-trained, larger model can significantly improve the smaller model's performance."
                },
                "soundness": {
                    "value": "1 poor"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "- This paper is easy to follow;\n- The proposed method can improve the performance."
                },
                "weaknesses": {
                    "value": "- The proposed method of selecting layers or weights for initialization is somewhat trivial. A more technical approach is encouraged to fully leverage the capabilities of larger models.\n\n- The study is limited in its scope by only employing ViT-T and ConvNeXt-F architectures. Inclusion of additional architectures such as Swin, PVT, and EfficientViT would enrich the evaluation.\n\n- There is an inconsistency in the reported accuracies for the same ImageNet-1k on the same model across different tables. For instance, ConvNeXt-F yields an accuracy of 76.1% in Table 1 but achieves around 82.0% in Table 2. Clarification is needed.\n\n- A comparative analysis involving ConvNeXt is crucial in the \"COMPATIBILITY WITH KNOWLEDGE DISTILLATION\" section, given its architectural differences with ViT.\n\n- The paper lacks sufficient motivation and theoretical grounding for the proposed selection strategy. More insights are needed to justify why, for example, the first N layers are selected, and how this methodology generalizes to other architectures.\n\n- For better comprehension, it would be beneficial to present the customized structures, such as ConvNeXt-F, in tabulated form.\n\n- The potential for leveraging the weights of larger models (which are more powerful) is high. However, Table 7 indicates that the proposed method struggles to effectively learn from these larger models.\n\n- Some grammar errors: \n\t- \"Glorot & Bengio (2010a) maintains \" -> \"Glorot & Bengio (2010a) maintain\";\n\t- \"Lin et al. (2020) transforms\" -> \"Lin et al. (2020) transform\";\n\t- etc."
                },
                "questions": {
                    "value": "Please see Section \"Weaknesses\"."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission762/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698653224907,
            "cdate": 1698653224907,
            "tmdate": 1699636003884,
            "mdate": 1699636003884,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "QlbRqViL8m",
                "forum": "dyrGMhicMw",
                "replyto": "3juOyKJ3qW",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission762/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission762/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Rebuttal by Authors"
                    },
                    "comment": {
                        "value": "We sincerely thank you for your constructive comments. We are encouraged that you find our paper easy to follow. We would like to address the comments and questions below:\n\n> W1: The proposed method of selecting layers or weights for initialization is somewhat trivial. A more technical approach is encouraged to fully leverage the capabilities of larger models.\n> W5: The paper lacks sufficient motivation and theoretical grounding for the proposed selection strategy.\n\nWeight selection is designed to be easily adopted by people who want to use pretrained models directly without incurring any additional computation costs. We find that uniform selection is a cost-free approach that contains desirable properties (maintaining consistency) in the parameter selection process, and performs better than pruning approaches (as shown in Section 5: comparisons with pruning).\n\n**Justification for uniform element selection**\n\nIn the context of transforming larger models into smaller models involving a change in embedding dimension, we identify **maintaining consistency (selecting the same indices for all weight matrices)** as the critical factor. Specifically, for all networks with residual connections, the layer can be represented mathematically as:\n\n$$ y = F(x) + x $$\n\nwhere $x, y \\in \\mathbb{R}^D$, and $D$ is the embedding dimension. This equation can also be expressed element-wise:\n\n$$ y_i = F(x)_i + x_i$$\n\nfor all i from 0 to $D - 1$.\n\nTraditional frameworks that reduce model sizes (pruning) do not alter D, and consequently, they do not directly modify this equation. Under our setting, which reduces D to a smaller value, selecting the same set of indices on the input neurons and along F(⋅) (maintaining consistency) will preserve the addition operations on the subset of the original residual connection operations.\n\nAs demonstrated in Table 3, random selection with consistency outperforms random selection without consistency by a significant margin (an accuracy improvement of 4%). Moreover, random selection with consistency exhibits comparable performance to uniform/consecutive selection. Therefore, we determine that **maintaining consistency is the factor that contributes most of the performance.** To simplify and standardize weight selection in practice, we adopt uniform element selection (which inherently preserves consistency) as the default method for weight selection.\n\n**Justification for layer selection**\n\nOur ablation on layer selection confirms the superiority of first-N layer selection as shown in Table 6. We present Table 6 below for reference. As illustrated in section 5, to examine the effect of layer selection, we create Vit-A, a variant of ViT with 6 layers, with other model configurations identical to ViT-T. We present weight selection results (from ViT-S to ViT-A, from ConvNeXt-T to ConvNeXt-F) with different layer selection methods.\n\n| Setting / Model                            | ViT-A | ConvNeXt-F |\n| ------------------------------------------ |:-----:|:----------:|\n| random init                                | 69.6  |    81.3    |\n| first-N layer selection                    | 77.6  |    84.4    |\n| maximally-spaced / uniform layer selection | 76.7  |    83.2    |\n\nTo rule out the effect of element selection, we present results of directly finetuning different subsets of 6 layers out of 12 layers of a pretrained ViT-T model. We present the results as follows:\n\n| layer selection            | CIFAR-100 test acc |\n| -------------------------- |:------------------:|\n| first-N                    |        81.6        |\n| mid-N                      |        68.3        |\n| last-N                     |        62.0        |\n| maximally-spaced / uniform |        76.3        |\n\nWe observe a clear trend favoring shallow layers, with first-N > middle-N > last-N. And uniform layer selection is slightly worse than first-N layer selection. Based on these empirical results from two experiments listed above, we find first-N layer selection a suitable method in weight selection. We have included this analysis for layer selection in Appendix B."
                    }
                },
                "number": 11,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission762/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700664518307,
                "cdate": 1700664518307,
                "tmdate": 1700667798694,
                "mdate": 1700667798694,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "qaNeQPihvB",
                "forum": "dyrGMhicMw",
                "replyto": "3juOyKJ3qW",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission762/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission762/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Rebuttal by Authors"
                    },
                    "comment": {
                        "value": "> W2: The study is limited in its scope by only employing ViT-T and ConvNeXt-F architectures. Inclusion of additional architectures such as Swin, PVT, and EfficientViT would enrich the evaluation.\n\nWe present results on weight selection on **ResNet [He2016], MLP-Mixer [Tolstikhin2021], Swin Transformer [Liu2021], and Pyramid Vision Transformer [Wang2021]**, evaluated on both CIFAR-10 and CIFAR-100, along with the respective model configuration for the student and the teacher.\n\n**Model Configuration**\n\n|        Architecture        |  student   | # of parameters |  teacher   | # of parameters |\n|:--------------------------:|:----------:|:---------------:|:----------:|:---------------:|\n|           ResNet           | ResNet-18  |      11.7M      | ResNet-34  |      21.8M      |\n|         Mlp-Mixer          | Mixer-T/32 |      5.4M       | Mixer-S/32 |      19.1M      |\n|      Swin-Transformer      |   Swin-F   |      7.53M      |   Swin-T   |      28.5M      |\n| Pyramid Vision transformer | PVT-v2-b0  |      3.7M       | PVT-v2-b1  |      14.0M      |\n\n\n**CIFAR-10**\n| Setting / Model  | ResNet    | Mlp-Mixer | Swin Transformer | PVT  |\n| ---------------- | --- |:---------:|:----------------:|:----:|\n| random init      |   96.4  |   90.8    |       94.9       | 96.3 |\n| weight selection |   97.1  |   95.1    |       96.5       | 97.4 |\n\n**CIFAR-100**\n| Setting / Model  | ResNet    | Mlp-Mixer | Swin Transformer | PVT  |\n| ---------------- | --- |:---------:|:----------------:|:----:|\n| random init      |   80.3  |   72.3    |       79.0       | 81.5 |\n| weight selection |   82.3  |   77.9    |       81.7       | 83.4 |\n\nOver various architectures and datasets, we find weight selection provides consistently better results than random initialization. Interestingly, for architectures with less inductive bias like MLP-mixer and ViT(included in the main results), a higher increase in performance is observed.\n\n[He2016] He, Kaiming, et al. \"Deep residual learning for image recognition.\" Proceedings of the IEEE conference on computer vision and pattern recognition. 2016.\n\n[Tolstikhin2021] Tolstikhin, Ilya O., et al. \"Mlp-mixer: An all-mlp architecture for vision.\" Advances in neural information processing systems 34 (2021): 24261-24272.\n\n[Liu2021] Liu, Ze, et al. \"Swin transformer: Hierarchical vision transformer using shifted windows.\" Proceedings of the IEEE/CVF international conference on computer vision. 2021.\n\n[Wang2021] Wang, Wenhai, et al. \"Pyramid vision transformer: A versatile backbone for dense prediction without convolutions.\" Proceedings of the IEEE/CVF international conference on computer vision. 2021.\n> W3: There is an inconsistency in the reported accuracies for the same ImageNet-1k on the same model across different tables. For instance, ConvNeXt-F yields an accuracy of 76.1% in Table 1 but achieves around 82.0% in Table 2. Clarification is needed.\n\nWe present CIFAR-100 test accuracy for this experiment. We have edited paper to clarify that.\n\n> W4: A comparative analysis involving ConvNeXt is crucial in the \"COMPATIBILITY WITH KNOWLEDGE DISTILLATION\" section, given its architectural differences with ViT.\n\n| ConvNeXt-F                 | CIFAR-100 test accuracy |\n| -------------------------- | :---------------------: |\n| baseline (random init)     |          81.4           |\n| weight selection           |          84.4           |\n| distill                    |          82.1           |\n| weight selection + distill |          85.0           |\n\nWe can see a similar trend on ConvNeXt as the results of ViT shown in Table 4. These results further confirm weight selection's usefulness as an independent technique and the compatibility between weight selection and knowledge distillation, on both ViTs and ConvNets."
                    }
                },
                "number": 12,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission762/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700664602225,
                "cdate": 1700664602225,
                "tmdate": 1700689800036,
                "mdate": 1700689800036,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "ZyuCQthQSD",
                "forum": "dyrGMhicMw",
                "replyto": "3juOyKJ3qW",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission762/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission762/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Rebuttal by Authors"
                    },
                    "comment": {
                        "value": "> W6: For better comprehension, it would be beneficial to present the customized structures, such as ConvNeXt-F, in tabulated form.\n\nThanks, we have included model configurations for ViT-T, ViT-S, ConvNeXt-F, and ConvNeXt-T in Table 1. For reference, we also provide the model configuration of ConvNeXt-F and ConvNeXt-T here.\n\nConvNeXt-T: depth: (3,3,9,3) embedding dimension: (96, 192, 384, 768)\nConvNeXt-F: depth: (2,2,6,2) embedding dimension: (48, 96, 192, 384)\n\n> W7: The potential for leveraging the weights of larger models (which are more powerful) is high. However, Table 7 indicates that the proposed method struggles to effectively learn from these larger models.\n\nWeight selection is designed to find the best set of parameters in a larger model to initialize a small model. For ViT-S, approximately 1/4 of its parameters are utilized as initialization ViT-T. Comparatively, ViT-L has only 1/60 of its parameters utilized. Therefore, initializing ViT-T from ViT-L would naturally incur a higher information loss, which is the primary reason why it has a worse performance than ViT-S. This phenomenon can also be explained by the concept of information density. The knowledge acquired from the pretraining dataset is embedded in 20M parameters in ViT-S, but yet 300M parameters in ViT-L. Thus a parameter subset of 5M from ViT-S would carry more knowledge than the subset of the same size from ViT-L.\n\nIn addition, weight selection can be **progressively applied to boost performance.** Directly initializing ViT-T from ViT-B reaches an accuracy of 77.6. However, if we initialize ViT-S from ViT-B, train ViT-S for 300 epochs, and then use the trained ViT-S to initialize ViT-T, ViT-T would reach a final accuracy of 80.4. With less information loss at each step, weight selection could help small models learn from larger models more effectively.\n\n\n| Setting                 | CIFAR-100 test acc |\n| ----------------------- |:------------------:|\n| random init             |        72.3        |\n| ViT-B -> ViT-T          |        77.6        |\n| ViT-B -> ViT-S -> ViT-T |        80.4        |\n\n\n> W8: Some grammar errors:\n\nThanks, we have updated the paper to correct the grammar.\n\nWe thank you again for your valuable feedback and we hope our response can address your questions. We have revised the paper accordingly and marked all changes in red. If you have any further questions or concerns, we are very happy to answer."
                    }
                },
                "number": 13,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission762/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700664653043,
                "cdate": 1700664653043,
                "tmdate": 1700664653043,
                "mdate": 1700664653043,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "pW7FResSyM",
            "forum": "dyrGMhicMw",
            "replyto": "dyrGMhicMw",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission762/Reviewer_HkYt"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission762/Reviewer_HkYt"
            ],
            "content": {
                "summary": {
                    "value": "The paper introduces 'weight selection', a simple but effective method that uses the weight of pre-trained large model to initialize the small model. The authors have conducted extensive experiments, showcasing the method's superiority compared to initializing models from scratch."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "1. The experiments are comprehensive, covering both vision transformers and CNNs. Additionally, they have delved into various aspects such as knowledge distillation, comparison with pruning methods, and linear probing, which offer valuable insights\n2. The paper is easy to read and follow."
                },
                "weaknesses": {
                    "value": "See questions."
                },
                "questions": {
                    "value": "1. Could the authors give further explanation on the difference between 'consecutive selection' and 'uniform selection' in section 3.2?\n2. For comparison with pruning, could the authors elaborate on how L1 pruning was implemented? I am asking the question since the embedding dimension is changed."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission762/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission762/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission762/Reviewer_HkYt"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission762/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698686664628,
            "cdate": 1698686664628,
            "tmdate": 1699636003813,
            "mdate": 1699636003813,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "5wNBWVnsX5",
                "forum": "dyrGMhicMw",
                "replyto": "pW7FResSyM",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission762/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission762/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Rebuttal by Authors"
                    },
                    "comment": {
                        "value": "We sincerely thank you for your constructive comments. We are encouraged that you find our paper presents comprehensive experiments and provides valuable insights from various aspects. We would like to address the comments and questions below:\n\n> Q1: Could the authors give further explanation on the difference between 'consecutive selection' and 'uniform selection' in section 3.2?\n\nTaking a 1-D vector [1, 2, 3, 4] as an example. If we would like to select a shorter vector of length 2 from this vector, consecutive selection means selecting consecutive indices like [1, 2], while uniform selection means selecting evenly spaced indices like [1, 3].\n\nFor architectures with grouped components, like multi-head self-attention layers in ViT and grouped convolutional layers in ResNeXt, consecutive selection would mean selecting some complete groups while discarding other groups, while uniform selection will select a portion of all existing groups. In the context of weight selection from ViT-S to ViT-T, consecutive selection would approximately select 3 heads out of 6 heads in the multi-head self-attention layers, while uniform selection would select half of elements of each head. For architectures without grouped components, consecutive selection has no difference from uniform selection. As presented in Table 3, consecutive selection is of similar performance with uniform selection.\n\n\n> Q2: For comparison with pruning, could the authors elaborate on how L1 pruning was implemented? I am asking the question since the embedding dimension is changed.\n\nWe perform L-1 pruning on the embedding dimension. Taking ViT-T as an example, we first perform L-1 pruning on the patch embedding layer on the embedding dimension. For the rest layers, it is followed by removing neurons on the input dimension corresponding to the pruned neurons of the previous layer, and then pruning the output dimension/channels based on $L_1$ norm. L-1 pruning would break the consistency on residual connections, and thus yield a worse result than uniform selection, consecutive selection, and random selection with consistency as presented in Table 3.\n\nWe thank you again for your valuable feedback and we hope our response can address your questions. We have revised the paper and marked all changes in red. If you have any further questions or concerns, we are very happy to answer."
                    }
                },
                "number": 10,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission762/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700664451151,
                "cdate": 1700664451151,
                "tmdate": 1700664451151,
                "mdate": 1700664451151,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "UqUDarmqEQ",
                "forum": "dyrGMhicMw",
                "replyto": "5wNBWVnsX5",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission762/Reviewer_HkYt"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission762/Reviewer_HkYt"
                ],
                "content": {
                    "title": {
                        "value": "Thank you for your reply"
                    },
                    "comment": {
                        "value": "After reading the additional experiments from the author and reviews from other reviewers, most of my concerns are addressed and I tend to keep my rating."
                    }
                },
                "number": 15,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission762/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700680831858,
                "cdate": 1700680831858,
                "tmdate": 1700680831858,
                "mdate": 1700680831858,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "Fm1r3HIyon",
            "forum": "dyrGMhicMw",
            "replyto": "dyrGMhicMw",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission762/Reviewer_rXy8"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission762/Reviewer_rXy8"
            ],
            "content": {
                "summary": {
                    "value": "This work introduces a method aimed at accelerating the convergence of training by transferring pre-trained knowledge from a different network. The approach involves extracting well-trained weights, which exhibit characteristics similar to high-pass filtering (HPF) or low-pass filtering (LPF), from a pretrained network and transplanting these weights onto a novel network, as opposed to starting with random initialization. This technique facilitates quicker training of the new architecture. The authors conduct comparisons between this method and random initialization, demonstrating its superior performance.\n\n\nHowever, I have some concerns as follows:\n\n1)\tFirstly, it's important to note that the comparisons made in this work may not be entirely adequate. From my understanding, this approach falls somewhere between traditional initialization and transfer learning. Given that the method involves adopting a set of pre-trained filters or weights, it can be argued that this work is closer in nature to transfer learning rather than a simple initialization process. Therefore, it might be more appropriate to compare it with transfer learning methods rather than just random initialization. If the proposed method can approach or match the convergence levels of ImageNet pre-training, it would further support its practicality and utility in various applications, reinforcing its value in the field of deep learning.\n\n2)\tComparing the proposed method directly to random initialization may not provide a fair assessment, given the distinct differences in the initialization processes. Unlike the proposed method, a network initialized randomly must construct its structural filters (HPF or LPF) from scratch, which typically requires some epochs and computational resources. In contrast, the proposed method can bypass this initial construction step and is expected to be faster.\n\n3)\tI strongly recommend reconsidering the categorization of this work from merely weight initialization to a more encompassing concept of knowledge transfer to a novel architecture. This work goes beyond traditional weight initialization methods by borrowing well-structured filters from a pre-trained network with a different architecture. This transfer of knowledge to a distinctly different architecture represents a significant departure from conventional weight initialization and indeed underscores the novelty of the approach. Categorizing it as a knowledge transfer method would better capture its unique contribution in the field.\n\n4)\tBuilding upon the suggested change in categorization to knowledge transfer, it raises an interesting question about the potential applicability of the proposed method to highly dissimilar architectures. For instance, exploring the feasibility of transferring knowledge from a pre-trained ResNet to a Vision Transformer (ViT) is a compelling idea like Model Evolution. Training ViT models often necessitates access to large-scale datasets, but they can offer superior performance in various tasks. If the proposed method could indeed facilitate the transfer of knowledge from a ResNet to a ViT, it would hold significant promise. This potential application could lead to advancements in leveraging the strengths of different architectures and addressing challenges related to dataset size, thus expanding the scope and impact of the proposed method.\n\nI appreciate your insights, and it's clear that you find the work promising. However, I think that the manuscript doesn’t well categorize the proposed method and the experiments are not adequately conducted. I believe this work can be much improved."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "See above"
                },
                "weaknesses": {
                    "value": "See above"
                },
                "questions": {
                    "value": "See above"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission762/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission762/Reviewer_rXy8",
                        "ICLR.cc/2024/Conference/Submission762/Senior_Area_Chairs"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission762/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698740913427,
            "cdate": 1698740913427,
            "tmdate": 1700727164421,
            "mdate": 1700727164421,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "xoN0CS04RG",
                "forum": "dyrGMhicMw",
                "replyto": "Fm1r3HIyon",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission762/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission762/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Rebuttal by Authors"
                    },
                    "comment": {
                        "value": "We sincerely thank you for your constructive comments. We are encouraged that you find our paper demonstrates unique insight. We would like to address the comments and questions below:\n\n> W1: Given that the method involves adopting a set of pre-trained filters or weights, it can be argued that this work is closer in nature to transfer learning rather than a simple initialization process. Therefore, it might be more appropriate to compare it with transfer learning methods rather than just random initialization.\n\nWeight selection comes into place when there are **no existing pretrained models** that fulfill specific hardware requirements (not small enough). If suitable pretrained models are available, their use is undoubtedly preferred. However, this is usually not the case: for instance, in the context of ViTs, the original ViT paper only provides ViT-B (80M) as its smallest model, as is the case with CLIP [Radford2021] or MAE [He2022] pretrained models. Similarly, in the context of language models, the smallest LlaMa model has 3 billion parameters, posing a challenge for most individual users. In our paper, we demonstrate the application of weight selection using ViT-T and ConvNeXt-F as examples, representing smaller models that were subsequently developed by the community following the initial proposal of the architecture. In practical settings, our method can be employed to construct smaller ViTs, ConvNets, LlaMas, and all other existing nerual network architectures.\n\nWe conduct an ablation study on comparing weight selection to transfer learning pipeline (pretraining + finetuning). The experiment involved training the model on ImageNet for a specified number of epochs, followed by 300 epochs of fine-tuning on CIFAR-100. Given the significant difference in the number of training images between ImageNet (1.3 million) and CIFAR-100 (50,000), one epoch of training on ImageNet is approximately equivalent to 25.6 epochs of training on CIFAR-100.\n\n\n| Pre-train epochs  |  0   |  10   |  20   |  40  |  60  |  80  | 300  |\n| ----------------- |:----:|:-----:|:-----:|:----:|:----:|:----:|:----:|\n| CIFAR100 test acc | 72.4 | 76.3 | 77.2 | 80.0 | 81.5 | 82.5 | 85.7 |\n\nAfter 60 epochs of pretraining on ImageNet, the CIFAR-100 accuracy of ViT-T reaches 81.4, matching the accuracy achieved through weight selection. Notably, the accuracy obtained after 300 epochs of pretraining is equivalent to that achieved through fine-tuning. This demonstrates that weight selection effectively bridges the significant gap in accuracy observed during pretraining without incurring additional computational costs. **To achieve a comparable level of accuracy to weight selection through pretraining / transfer learning, one would need approximately 6.12 times more training resources and the access to the large pretraining dataset**, which could be unavailable like JFT-300M. Under the circumstance of no existing pretrained models of the desired size available, weight selection is far more resource-saving than transfer learning, and avoids the need for a large-scale pretraining dataset. We have included this result in section 5.\n\n\n> W2: Comparing the proposed method directly to random initialization may not provide a fair assessment, given the distinct differences in the initialization processes. Unlike the proposed method, a network initialized randomly must construct its structural filters (HPF or LPF) from scratch, which typically requires some epochs and computational resources. In contrast, the proposed method can bypass this initial construction step and is expected to be faster.\n\nYes, we agree that the superiority of weight selection as initialization comes from the pretrained parameters/filters, and is thus expected to converge faster. In addition, if the initialization filters are obtained from a model trained on a larger dataset, weight selection will bring addtional benefit.\n\n| Model |  Teacher (weight selection)   | CIFAR-100 test acc |\n|:-----:|:-----------------------------:|:-----------------:|\n| ViT-T | ViT-S pretrained on ImageNet  |       81.4        |\n| ViT-T | ViT-S pretrained on CIFAR-100 |       77.6        |\n\nOur contribution mainly lies in practice. We identify the general need for smaller models, and propose weight selection as a cost-free add-on technique to develop smaller models with their existing larger versions available. We find weight selection extremely effective, capable of substituting the current common practice which uses random initialization when training smaller models.\n\n[Radford2021] Radford, Alec, et al. \"Learning transferable visual models from natural language supervision.\" International conference on machine learning. PMLR, 2021.\n\n[He2022] He, Kaiming, et al. \"Masked autoencoders are scalable vision learners.\" Proceedings of the IEEE/CVF conference on computer vision and pattern recognition. 2022."
                    }
                },
                "number": 8,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission762/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700664311891,
                "cdate": 1700664311891,
                "tmdate": 1700664311891,
                "mdate": 1700664311891,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "0iiZLbFRfo",
                "forum": "dyrGMhicMw",
                "replyto": "Fm1r3HIyon",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission762/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission762/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Rebuttal by Authors"
                    },
                    "comment": {
                        "value": "> W3: I strongly recommend reconsidering the categorization of this work from merely weight initialization to a more encompassing concept of knowledge transfer to a novel architecture. This work goes beyond traditional weight initialization methods by borrowing well-structured filters from a pre-trained network with a different architecture. This transfer of knowledge to a distinctly different architecture represents a significant departure from conventional weight initialization and indeed underscores the novelty of the approach. Categorizing it as a knowledge transfer method would better capture its unique contribution in the field.\n\nThank you for your suggestion. **We would like to consider framing our method in a knowledge transfer context.** We also want to emphasize that in practice, our method serves as a cost-free initialization technique. Our method's benefit indeed comes from the knowledge transfer from large models to small models via parameters. In light of this, we are considering changing our title to **\"initializing small models with larger ones\"**, which captures the knowledge transfer from large models to small models as wellas showing it serves as an initialization technique.\n\n> W4: Building upon the suggested change in categorization to knowledge transfer, it raises an interesting question about the potential applicability of the proposed method to highly dissimilar architectures. For instance, exploring the feasibility of transferring knowledge from a pre-trained ResNet to a Vision Transformer (ViT) is a compelling idea like Model Evolution. Training ViT models often necessitates access to large-scale datasets, but they can offer superior performance in various tasks. If the proposed method could indeed facilitate the transfer of knowledge from a ResNet to a ViT, it would hold significant promise. This potential application could lead to advancements in leveraging the strengths of different architectures and addressing challenges related to dataset size, thus expanding the scope and impact of the proposed method.\n\n**We have conducted experiments on transferring knowledge from ConvNeXt to ViT via weight selection and obtained positive results.** More specifcally, we use the **pretrained isotropic ConvNeXt-S (20M parameters) to initialize ViT-T (5M parameters)** using weight selection. As ConvNeXt has identical architectures with ViT other than the self-attention layers, we are able to directly create a mapping between components.\n\nWe initialize the patch embedding module, and all the fully connected layers of ViT-T with the corresponding component in the isotropic ConvNeXt-S. \n\n|               Setting               | CIFAR-100 test acc |\n|-----------------------------------|:-----------------------:|\n|             random init             |          72.3           |\n| cross-architecture weight selection |          74.8           |\n\nIn this experiment, we did not initialize the self-attention layers of ViT-T with isotropic ConvNeXt-S, since there is no explicit way to initialize the self attention layers with convolutional layers as their weights and operations are completely different. Even without initializing self-attention layers, we observe a substantial improvement in self-attention layers. We hope this initial experiment can shed a light on transferring knowledge from ConvNets to vision transformers. Initializing self-attention layers with convolutional layers would be a part of our future works extending beyond weight selection.\n\nWe thank you again for your valuable feedback and we hope our response can address your questions. We have revised the paper accordingly and marked all changes in red. If you have any further questions or concerns, we are very happy to answer."
                    }
                },
                "number": 9,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission762/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700664359307,
                "cdate": 1700664359307,
                "tmdate": 1700692940143,
                "mdate": 1700692940143,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "oAA4kr8y0J",
                "forum": "dyrGMhicMw",
                "replyto": "0iiZLbFRfo",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission762/Reviewer_rXy8"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission762/Reviewer_rXy8"
                ],
                "content": {
                    "comment": {
                        "value": "I appreciate the response.\n\nThe latest version of the paper shows many improvements compared to the previous one, and it addresses several of my concerns. In particular, I find the feasibility of transferring from ConvNeXt to ViT quite intriguing.\n\nGiven the thorough rebuttal provided and the authors' willingness to reconsider the categorization of their proposed method, I have decided to raise my score.\n\nNevertheless, I still recommend that the authors conduct a comparative analysis with existing transfer learning methods, learnable initialization techniques, and distillation works as mentioned in the other reviewers' comments. For learning-based initialization, I recommend the following papers:\n\n1) [Zhu 2021]. Gradinit: Learning to initialize neural networks for stable and efficient training. NeurIPS 2021\n2) [Dauphin 2019]. Metainit: Initializing learning by learning to initialize. NeurIPS, 32, 2019. 2019\n3) [Knyazev 2021]. A. Parameter prediction for unseen deep architectures. NeurIPS, 34:29433–29448, 2021.\n\nThis comparison would further strengthen the paper by positioning the proposed method within the broader context of current research in the field."
                    }
                },
                "number": 18,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission762/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700727144128,
                "cdate": 1700727144128,
                "tmdate": 1700727144128,
                "mdate": 1700727144128,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "RHAfQiwycU",
            "forum": "dyrGMhicMw",
            "replyto": "dyrGMhicMw",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission762/Reviewer_A6vA"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission762/Reviewer_A6vA"
            ],
            "content": {
                "summary": {
                    "value": "The paper introduces a novel approach to initialize smaller models given large pretrained models. The approach is simple, efficient and shows good results compared to random init and other numerous baselines and many image classification tasks."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "1. The problem of obtaining strong weights for small models given large pretrained models is important and solving it efficiently is challenging.\n\n2. The paper explores a very interesting idea of simple weight copying from the source to target network as an efficient and training-free way to initialize smaller model. \n\n3. The uniform selection approach is reasonable and takes into account multi-head structure and group convolution of source networks.\n\n4. The paper has many nicely outlined and run experiments that overall look interesting and convincing enough.\n\n5. The approach outperforms random init and works well on different vision tasks. \n\n6. The paper is well presented and enjoyable to read."
                },
                "weaknesses": {
                    "value": "1. The paper misses some important related works:\n- [Czyzewski2022] Breaking the Architecture Barrier: A Method for Efficient Knowledge Transfer Across Networks\n- [Chen2021] bert2BERT: Towards Reusable Pretrained Language Models\n- [Chen2015] Net2net: Accelerating learning via knowledge transfer\n\nSpecifically, [Czyzewski2022] introduced a very similar weight transfer technique that seems more general than in the submitted paper since it allows for the source and target architectures to be different. They copied the center slices from source weights, which could be an interesting ablation in this submission. [Chen2015] proposed a simple approach to replicate weights to initialize models. While [Chen2015,Chen2021] focus on initializing a larger model, the idea of copying the weights from the source network to a target one is very similar and should be discussed in detail. This makes the novelty of the paper limited.\n\n2. The paper also should report results of student models pretrained and transferred to smaller datasets. While this would not be a fair baseline to the proposed method since it requires expensive pretraining, it could give important clues about what is the best performance of the model on this task. In addition, some papers (e.g. [Knyazev2021]) reported that very little pretraining is required to achieve competitive transfer learning performance. Therefore, it's not clear if the proposed weight selection approach would be competitive if someone has resources to pretrain a small target net on some large data first (at least for a little bit).\n\n- [Knyazev2021] Parameter Prediction for Unseen Deep Architectures\n\n3. For structured pruning, there are many stronger methods than L1 pruning, e.g. [Kwon2022, Halabi2022] and the baselines therein. The results in Table 6 are quite close and L1 pruning is also very simple, therefore stronger pruning methods could potentially match the performance.\n\n- [Kwon2022] A Fast Post-Training Pruning Framework for Transformers\n- [Halabi2022] Data-Efficient Structured Pruning via Submodular Optimization\n\n4. Most of the experiments are performed on transferring weights from ViT-S to ViT-T which have the same number of layers (12). It would be more interesting to see results when the source model is also deeper (which is usually the case in practice). Related to that, the teacher size results show that ViT-S is the best teacher and a potential reason for that could be that the layer selection approach (first-N) is not the best (perhaps a uniform selection of layers similarly how it is done for weights could be better than first N?). In Table 7, it would be very interesting to see the respective results for distillation which usually works better if the source model is larger/stronger (see the DeiT paper).\n\nDespite all the weaknesses, I'm looking forward to the the authors' response and will be willing to update the rating."
                },
                "questions": {
                    "value": "1. In Net2net [Chen2015], for initialization the copied weights are rescaled to take into account the width difference (i.e. for wider/thinner networks one needs smaller/larger weight values according to standard weight initialization such as K.He or X.Glorot). Have the authors tried to rescale copied weight values?\n\n2. For \"distill + weight selection\" is the target model first initialized with weight selection and then the distillation is run or it's different?\n\n3. It seems that the results of baselines (random init and mimetic init) are different from previous papers like the mimetic init paper even though the setup looks the same. For example, in the mimetic init paper for CIFAR-10 ViT-T the accuracy is 87.39 for rand init and 91.38 for mimetic init, while in this submission it is 92.4 and 93.3 respectively. Can the authors elaborate on the reasons for that?\n\n4. In L1 pruning experiments, is the final number of selected weights the same as in the proposed weight selection? It's a little bit surprising to see that L1 underperforms uniform weight selection implying that the latter is actually a stronger pruning method. Can the authors elaborate on that?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission762/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission762/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission762/Reviewer_A6vA"
                    ]
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission762/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698957895096,
            "cdate": 1698957895096,
            "tmdate": 1700771318689,
            "mdate": 1700771318689,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "qbLSsveGH8",
                "forum": "dyrGMhicMw",
                "replyto": "RHAfQiwycU",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission762/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission762/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Rebuttal by Authors"
                    },
                    "comment": {
                        "value": "We sincerely thank you for your constructive comments. We are encouraged that you find our paper presents meaningful key ideas, provides abundant experimental results, applies interesting and reasonable selection methods, and is well-organized and nice to read. We would like to address the comments and questions below:\n\n> w1: This paper misses some important related works. Specifically, [Czyzewski2022] introduced a very similar weight transfer technique that seems more general than in the submitted paper since it allows for the source and target architectures to be different. They copied the center slices from source weights, which could be an interesting ablation in this submission. [Chen2015] proposed a simple approach to replicate weights to initialize models. While [Chen2015,Chen2021] focus on initializing a larger model, the idea of copying the weights from the source network to a target one is very similar and should be discussed in detail. This makes the novelty of the paper limited.\n\nThanks for pointing out these related works. We have added the discussion to discuss these works to *Utilizing pretrained models* paragraph of the related work section.\n\nWeight selection, allows for the transfer of weights from larger models to smaller models applicable to **all kinds of architectures**, as long as the large model and small model belong to the same model family, while [Czyzewski2022] introduces parameter transfer across different convolutional neural networks. The center slices selection in this work is ablated as consecutive selection presented in Table 3.\n\nOur method aims to resolve the scenario where **a smaller version of an existing model** is needed whereas [Czyzewski2022]'s purpose is to transfer parameters to a **new convolutional architecture**. In practice, there is a relatively lower demand for developing entirely new models. We anticipate weight selection to be a practical and useful technique for developing smaller models of existing architectures.\n\nOur work differs from [chen2015] and [chen2021] in multiple aspects: targets, motivations for transferring knowledge, and the approach.\n- Our work focuses on efficiently developing **smaller models**, while these two works aim to accelerate training for **larger models**.\n- Weight selection draws knowledge from both larger models and their pretraining datasets, enabling smaller models to both converge faster and **achieve better performance**. In contrast, [chen2015] and [chen2021] primarily focus on **training efficiency** (convergence speed).\n- The weight selection process involves **selecting** an appropriate subset of pretrained parameters, while [chen2015] and [chen2021] transform smaller weight matrices into larger matrices in a larger network.\n\n[Czyzewski2022] Czyzewski, Maciej A., Daniel Nowak, and Kamil Piechowiak. \"Breaking the Architecture Barrier: A Method for Efficient Knowledge Transfer Across Networks.\" arXiv preprint arXiv:2212.13970 (2022).\n\n[Chen2021] Chen, Cheng, et al. \"bert2bert: Towards reusable pretrained language models.\" arXiv preprint arXiv:2110.07143 (2021).\n\n[Chen2015] Chen, Tianqi, Ian Goodfellow, and Jonathon Shlens. \"Net2net: Accelerating learning via knowledge transfer.\" ICLR 2016."
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission762/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700663718438,
                "cdate": 1700663718438,
                "tmdate": 1700663718438,
                "mdate": 1700663718438,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "AivvNQHKuE",
                "forum": "dyrGMhicMw",
                "replyto": "RHAfQiwycU",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission762/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission762/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Rebuttal by Authors"
                    },
                    "comment": {
                        "value": "> w2: the paper also should report results of student models pretrained and transferred to smaller datasets. While this would not be a fair baseline to the proposed method since it requires expensive pretraining, it could give important clues about what is the best performance of the model on this task. In addition, some papers (e.g. [Knyazev2021]) reported that very little pretraining is required to achieve competitive transfer learning performance. Therefore, it's not clear if the proposed weight selection approach would be competitive if someone has resources to pretrain a small target net on some large data first (at least for a little bit).\n\nWeight selection comes into place when there are **no existing pretrained models** that fulfill specific hardware requirements (not small enough). If suitable pretrained models are available, their use is undoubtedly preferred. However, this is usually not the case: for instance, in the context of ViTs, the original ViT paper only provides ViT-B (80M) as its smallest model, as is the case with CLIP [Radford2021] or MAE [He2022] pretrained models. Similarly, in the context of language models, the smallest LlaMa model has 3 billion parameters, posing a challenge for most individual users. In our paper, we demonstrate the application of weight selection using ViT-T and ConvNeXt-F as examples, representing smaller models that were subsequently developed by the community following the initial proposal of the architecture. In practical settings, our method can be employed to construct smaller ViTs, ConvNets, LlaMas, and all other existing nerual network architectures.\n\nTo investigate your mentioned problem of comparing with \"has some resource for pretraining\", we conduct an ablation study focused on this factor. The experiment involved training the model on ImageNet for a specified number of epochs, followed by 300 epochs of fine-tuning on CIFAR-100. Given the significant difference in the number of training images between ImageNet (1.3 million) and CIFAR-100 (50,000), one epoch of training on ImageNet is approximately equivalent to 25.6 epochs of training on CIFAR-100.\n\n\n| Pretraining epochs  |  0   |  10   |  20   |  40  |  60  |  80  | 300  |\n| ----------------- |:----:|:-----:|:-----:|:----:|:----:|:----:|:----:|\n| CIFAR100 test acc | 72.4 | 76.26 | 77.17 | 80.0 | 81.5 | 82.5 | 85.7 |\n\nAfter 60 epochs of pretraining on ImageNet, the CIFAR-100 accuracy of ViT-T reaches 81.4, matching the accuracy achieved through weight selection. Notably, the accuracy obtained after 300 epochs of pretraining is equivalent to that achieved through fine-tuning. This demonstrates that weight selection effectively bridges the significant gap in accuracy observed during pretraining without incurring additional computational costs. **To achieve a comparable level of accuracy to weight selection through pretraining / transfer learning, one would need approximately 6.12 times more training resources and access to the large pretraining dataset**, which could be unavailable like JFT-300M. Under the circumstance of no existing pretrained models of the desired size, weight selection is far more resource-saving than transfer learning, and avoids the need for a large-scale pretraining dataset. We have included this result in section 5.\n\n[Radford2021] Radford, Alec, et al. \"Learning transferable visual models from natural language supervision.\" International conference on machine learning. PMLR, 2021.\n\n[He2022] He, Kaiming, et al. \"Masked autoencoders are scalable vision learners.\" Proceedings of the IEEE/CVF conference on computer vision and pattern recognition. 2022."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission762/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700663796581,
                "cdate": 1700663796581,
                "tmdate": 1700663796581,
                "mdate": 1700663796581,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "RBuF8kZOeY",
                "forum": "dyrGMhicMw",
                "replyto": "RHAfQiwycU",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission762/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission762/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Rebuttal by Authors"
                    },
                    "comment": {
                        "value": "> w3: For structured pruning, there are many stronger methods than L1 pruning, e.g. [Kwon2022, Halabi2022] and the baselines therein. The results in Table 6 are quite close and L1 pruning is also very simple, therefore stronger pruning methods could potentially match the performance.\n\nTo the best of our knowledge, there is no existing pruning framework that can transform a ViT-S model into a ViT-T model. **Existing pruning methods operate within a block**. [Halabi2022] attempt to preserve layerwise output after pruning using submodular optimization. [Kwon2022] calculate the optimal mask in order to discard heads and filters within each layer. No existing pruning approaches modify the embedding dimension, as this is considered a destructive operation that would significantly degrade model performance.\n\nIn the context of transforming larger models into smaller models involving a change in embedding dimension, we identify **maintaining consistency** (selecting the same indices for all weight matrices) as the critical factor. Specifically, for all networks with residual connections, the layer can be represented mathematically as:\n\n$$ y = F(x) + x $$\n\nwhere $x, y \\in \\mathbb{R}^D$, and $D$ is the embedding dimension. This equation can also be expressed element-wise:\n\n$$ y_i = F(x)_i + x_i$$\n\nfor all i from 0 to $D - 1$.\n\nTraditional pruning frameworks do not alter D, and consequently, they do not directly modify this set of equations. Under our setting, which reduces D to a smaller value, selecting the same set of indices on the input neurons and along F(⋅) (maintaining consistency) will preserve the addition operations on the subset of the original residual connection operations.\n\n**Empirical results show that maintaining consistency is the most important factor.** As demonstrated in Table 2, random selection with consistency outperforms random selection without consistency by a significant margin (an accuracy improvement of 4%). Moreover, random selection with consistency exhibits comparable performance to uniform/consecutive selection. Therefore, we determine that maintaining consistency is the factor that contributes most to the performance. To simplify and standardize weight selection in practice, we adopt uniform element selection (which inherently preserves consistency) as the default method for weight selection.\n\n[Kwon2022] Kwon, Woosuk, et al. \"A fast post-training pruning framework for transformers.\" Advances in Neural Information Processing Systems 35 (2022): 24101-24116.\n\n[Halabi2022] El Halabi, Marwa, Suraj Srinivas, and Simon Lacoste-Julien. \"Data-efficient structured pruning via submodular optimization.\" Advances in Neural Information Processing Systems 35 (2022): 36613-36626."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission762/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700663974434,
                "cdate": 1700663974434,
                "tmdate": 1700663974434,
                "mdate": 1700663974434,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "RFETyy4i38",
                "forum": "dyrGMhicMw",
                "replyto": "RHAfQiwycU",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission762/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission762/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Rebuttal by Authors"
                    },
                    "comment": {
                        "value": "> w4-(1): Most of the experiments are performed on transferring weights from ViT-S to ViT-T which have the same number of layers (12). It would be more interesting to see results when the source model is also deeper (which is usually the case in practice).\n\n**ConvNeXt-F in main results include layer selection process**. Our main results in Table 2 show considerable improvement on both ViT-T and ConvNeXt-F, initialized from ViT-S and ConvNeXt-T respectively. Note that ConvNeXt-F is of depth [2, 2, 6, 2] for its four stages, and its weight selection teacher ConvNeXt-T is of depth [3, 3, 9, 3] for its four stages, which would involve layer selection process.\n\nOur ablation on layer selection further confirms the superiority of first-N layer selection as shown in Table 5. We present Table 5 below for reference. As illustrated in section 5, to examine the effect of layer selection, we create Vit-A, a variant of ViT with 6 layers, with other model configurations identical to ViT-T. We present weight selection results (from ViT-S to ViT-A, from ConvNeXt-T to ConvNeXt-F) with different layer selection approaches.\n\n| Setting / Model                            | ViT-A | ConvNeXt-F |\n| ------------------------------------------ |:-----:|:----------:|\n| random init                                | 69.6  |    81.3    |\n| first-N layer selection                    | 77.6  |    84.4    |\n| maximally-spaced / uniform layer selection | 76.7  |    83.2    |\n\n**Finetuning results show first-N layer selection is preferred.** To rule out the effect of element selection, we conduct experiments to evaluate results of directly finetuning different subsets of 6 layers out of 12 layers of a pretrained ViT-T model. We present the results as follows:\n\n| layer selection            | CIFAR-100 test acc |\n| -------------------------- |:------------------:|\n| first-N                    |        81.6        |\n| mid-N                      |        68.3        |\n| last-N                     |        62.0        |\n| maximally-spaced / uniform |        76.3        |\n\nWe observe a clear trend favoring shallow layers, with first-N > middle-N > last-N. And maximally spaced/uniform layer selection is slightly worse than first-N layer selection. Based on this empirical result, we find first-N layer selection a suitable method in weight selection. We have included this result in Appendix B.\n\n\n> w4-(2): Related to that, the teacher size results show that ViT-S is the best teacher and a potential reason for that could be that the layer selection approach (first-N) is not the best (perhaps a uniform selection of layers similarly how it is done for weights could be better than first N?).\n\nViT-S and ViT-B both comprise 12 layers, while ViT-L has 24 layers. Since there is no layer selection operation because there are the same numbers of layers in ViT-T, ViT-S, and ViT-B, the result that ViT-S is a better teacher than ViT-B supports our conclusion that the smaller teacher is better. We attribute ViT-S's superior performance as a teacher to its similarity in size to its student, which has minimal information loss during weight selection.\n\nHowever, when examining the effects of layer selection methods on initializing ViT-T with ViT-L, we observe distinct outcomes for different layer selection approaches.\n\n| layer selection| CIFAR-100 test acc  |\n| ------- | ---- |\n| first-N  | 76.9 |\n| mid-N  | 75.9  |\n| last-N  |  77.1 |\n|   maximally-spaced / uniform     |  77.5   |\n\nWe anticipate that **the best approach for layer selection might be related to the ratio between teacher and student**. We have added discussions for this phenomenon in appendix B. Our main approach would still adopt first-N layer selection as the default method, for the reason that in the case of a smaller teacher (which is favored in weight selection), first-N layer selection consistently outperforms its alternatives as shown in the answer to your previous question."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission762/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700664040532,
                "cdate": 1700664040532,
                "tmdate": 1700690968362,
                "mdate": 1700690968362,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "VIePpYBphX",
                "forum": "dyrGMhicMw",
                "replyto": "RHAfQiwycU",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission762/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission762/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Rebuttal by Authors"
                    },
                    "comment": {
                        "value": "> w4-3: In Table 7, it would be very interesting to see the respective results for distillation which usually works better if the source model is larger/stronger (see the DeiT paper).\n\nWe present results for feature-based knowledge distillation on CIFAR-100 for ViT-S, ViT-B, and ViT-L.\n\n| Setting/model    | ViT-S | ViT-B | ViT-L |\n| --- | ----- | ----- | ----- |\n|  distill  |   78.4    |   76.3    |   76.8    |\n|  weight selection   |   81.4    |    77.6   |   76.9    |\n|   distill + weight selection  |   83.9    |    78.7   |    78.4   |\n\nUnlike logit-based non-transfer learning setting in DeiT, feature-based knowledge distillation has a similar preference on a smaller teacher with closer size to student. For example in [Ren2023], the best result for ViT-T is obtained by  distilling from ViT-S. Smaller teacher is favored by both weight selection and distillation. These results also show that weight selection's compatibility with knowledge distillation is consistent across teachers of different sizes.\n\n[Ren2023] Ren, Sucheng, et al. \"TinyMIM: An empirical study of distilling MIM pre-trained models.\" Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition. 2023.\n\n> Q1: In Net2net [Chen2015], for initialization the copied weights are rescaled to take into account the width difference (i.e. for wider/thinner networks one needs smaller/larger weight values according to standard weight initialization such as K.He or X.Glorot). Have the authors tried to rescale copied weight values?\n\nYes, we have tried to rescale the copied weights based on kaiming initialization [He2015]. Specifically, if the desired student matrix size is of input dimension $s_{in}$, and teacher matrix is of input size $t_{in}$, we scale the result of weight selection by $\\sqrt{t_{in}} / \\sqrt{s_{in}}$. We report results of initializing ViT-T with different teachers with or without scaling.\n\n| Setting/teacher model                     | ViT-S | ViT-B | ViT-L |\n| --------------------------------- | ----- | ----- | ----- |\n| weight selection (no scaling)        | 81.4  | 77.6  | 76.9  |\n| weight selection (with scaling) | 81.8  | 75.8  | 76.9  |\n\nWe find that this approach does not provide stable improvement, possibly due to the existence of normalization layers.\n\n[He2015] He, Kaiming, et al. \"Delving deep into rectifiers: Surpassing human-level performance on imagenet classification.\" Proceedings of the IEEE international conference on computer vision. 2015.\n\n> Q2: For \"distill + weight selection\" is the target model first initialized with weight selection and then the distillation is run or it's different?\n\nYes, your current understanding is correct. Other than the initialization of the student, the distillation trial is identical to the teacher. We have edited section 4.3 to clarify this.\n\n> Q3: It seems that the results of baselines (random init and mimetic init) are different from previous papers like the mimetic init paper even though the setup looks the same. For example, in the mimetic init paper for CIFAR-10 ViT-T the accuracy is 87.39 for rand init and 91.38 for mimetic init, while in this submission it is 92.4 and 93.3 respectively. Can the authors elaborate on the reasons for that?\n\n**Mimetic initialization has less gain under stronger training recipe.** [Asher2023] used 100 epochs for training, input size as 32, and RandAug and Cutout as data augmentation. Our training recipe is stronger: we use 300 epochs for training, 224x224 input size, and RandAug, Mixup, and Cutmix for data augmentation.  This conclusion is supported by [Asher2023]: *on ImageNet, using ResNet pipeline gives 4.1% improvement, while using DeiT pipeline (a stronger training recipe) gives 0.5% improvement.*\n\n[Asher2023] Trockman, Asher, and J. Zico Kolter. \"Mimetic Initialization of Self-Attention Layers.\""
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission762/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700664115696,
                "cdate": 1700664115696,
                "tmdate": 1700689663674,
                "mdate": 1700689663674,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "esj03cGxCW",
                "forum": "dyrGMhicMw",
                "replyto": "RHAfQiwycU",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission762/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission762/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Rebuttal by Authors"
                    },
                    "comment": {
                        "value": "> Q4: In L1 pruning experiments, is the final number of selected weights the same as in the proposed weight selection? It's a little bit surprising to see that L1 underperforms uniform weight selection implying that the latter is actually a stronger pruning method. Can the authors elaborate on that?\n\nIn all existing pruning frameworks applicable to architectures with **residual connections**, they **do not prune the embedding dimension**, since that would incur a drastic performance degrade. Under the setting that embedding dimension needs to be pruned, we find consistency the most important factor, where the same indices should be pruned along the embedding dimension. Following L1 pruning approach would inevitably lose consistency, which is the primary reason causing the performance to drop. Empirical results in Table 3 show the importance of consistency.\n\nWe thank you again for your valuable feedback and we hope our response can address your questions. We have revised the paper accordingly and marked all changes in red. If you have any further questions or concerns, we are very happy to answer."
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission762/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700664152546,
                "cdate": 1700664152546,
                "tmdate": 1700664152546,
                "mdate": 1700664152546,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "FtKJWzLyEK",
                "forum": "dyrGMhicMw",
                "replyto": "qbLSsveGH8",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission762/Reviewer_A6vA"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission762/Reviewer_A6vA"
                ],
                "content": {
                    "comment": {
                        "value": "I would like to thank the authors for an extensive response that addressed many of my concerns.\n\nOne of the main concerns for me remains related work, specifically [Czyzewski2022]. Even though their method was only tested on convnets, it seems to be a general method that could be in principle applied to different architectures including scenarios of ViT-S -> ViT-T. Moreover, while \"there is a relatively lower demand for developing entirely new models\" is true, having such an ability might still be advantageous. So given small method differences compared to [Czyzewski2022], the novelty of this submission is limited. Nevertheless, this submission is still complementary to [Czyzewski2022] with extensive experiments and analysis showing interesting results and making useful contribution. Moreover, [Czyzewski2022] does not appear to be a published peer-reviewed paper so that some overlap might be fine.\n\nThe authors response is long and requires more time to read it carefully, so I will consider revising the final rating once I read it in detail."
                    }
                },
                "number": 16,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission762/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700688891213,
                "cdate": 1700688891213,
                "tmdate": 1700688891213,
                "mdate": 1700688891213,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]