[
    {
        "title": "A-Loc: Efficient Alternating Iterative Methods for Locating the $k$ Largest/Smallest Elements in a Factorized Tensor"
    },
    {
        "review": {
            "id": "RYQQrn7buE",
            "forum": "e0bdvNsgcF",
            "replyto": "e0bdvNsgcF",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4425/Reviewer_R5w8"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4425/Reviewer_R5w8"
            ],
            "content": {
                "summary": {
                    "value": "The paper takes several well-known ideas, in particular maximization/minimization over a continuous $x$ in a discrete problem, and what the paper calls block-search strategy (a.k.a. top-k). These approaches are used to simultaneously find the minimum or maximum of a CP-tensor. Several theorems in the paper do not fully shed light on the accuracy of the method, the evaluation of which remains more empirical. Numerical experiments are set on random low-dimensional CP-tensors, CP-factorization of two well-known model fucntions, and CP-factorization of several small real-world datasets."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "1 poor"
                },
                "strengths": {
                    "value": "- The paper is generally well structured and written\n- In some cases good results are obtained when searching for CP-tensors minimum"
                },
                "weaknesses": {
                    "value": "- The paper takes known algorithms, and only connects them together in the special case of the problem of finding the extremum of CP-tensors.\n \n- Comparisons in numerical examples are given with only two (and in the case of finding the minimum, only one) other method, which is clearly insufficient.\n   * The coloring in the tables when both the presented method and its competitor are the best is given only for the presented method. It would be fair to color all cases when a particular method was the best. For example, in Table 2, color all cases of minimum for both functions, since they are equal for the presented method and for MInCPD. \n\n- Table 1, which compares methods for random vectors, is not entirely honest. Indeed, the _star sampling_ method can only find maximum (modulo) elements of CP-tensor. But once one is found, let its values be $m$, we can do a transformation $m \\mathcal E - \\mathcal A$ (very similar to the one described on page 2 in section 2 of the paper), which increases the CP-rank by only 1. Then the problem of finding the minimum in the initial tensor $\\mathcal A$ reduces to finding the maximum in this tensor. Unfortunately, I haven't found open source code for the _star sampling_ method, but I suspect it would work (with this trick) just as well as the presented method. And in the problem of maximum finding the _star sampling_ algorithm, as the authors honestly write, already wins, so the the contribution made by this new approach may be considered negligible in this case.\n\n- As for finding optima of the Rastrigin and Schwefel model functions, this and many other functions were used to test a similar algorithm optima_tt, which is cited in this paper as Chertkov et al. (2022). If we take the _optima_tt_ code, which is open source, and apply it to TT-tensors that exactly describe the two functions (with exact TT-ranks of 2 each) with the same parameters (n=4096, d=10), we get the following results for the minimum and for the maximum (I took the hyperparameter $k=5$):\nRastrigin: min: 0.0014192582... max: 403.5327475...\nSchwefel min: 0.000725485....  max: 8379.65727....\nThus, for these two functions the combination of using CP-compression and the newly presented method is meaningless.\n\n- No code is provided so that experiments can be repeated\n\n- The Theorems in the paper are rather trivial, one of them is not proved at all (see below). Thus, there is no serious analysis of convergence. To be fair, it should be noted that there is no such analysis for many other similar methods.\n\n- in the proof of Theorem 1, in the last equation in (A.1) it is not clear what \"$x^{(n)}=1$\" means. If it is a constant vector, how can we search for $\\max$ w.r.t. it?\nIf it $\\||x^{(n)}\\||_2=1$ then (A.1) is not just equivalent (as the proof of the theorem states), but coincides with problem (2.3). \nBut Theorem 1 asserts more than that. It asserts that for continuous values of $x^{(n)}$, i.e., $x^{(n)}\\in\\mathbb R^{I_n}$, the solution of the maximization problem (2.3) coincides with the maximum of CP-Tensor element, i.e., with the case where each vector $x^{(n)}$ are binary and represents (different) rows of the unit matrix. In this form, Theorem 1 has never been proved in the this paper.\n\n- times in the Table 4 with experiments with \"real-world\" data are not relevant, because it will be much faster, for example, for COVID dataset expand it the full tensor, and then search the maximum. Moreover, the compression time of these real-world datasets into CP format is not taken into account.\n    * link the mnist dataset is not valid -- login and password requires to access it.\n\n- at the beginning (page 3) the paper says that the algorithm parameter-free. But then it turns out that the final Algorithm has an adjustable parameter $b$.\n\nMinor:\n\nSuggestion:  put brackets around formula references (use \"\\eqref\" instead of \"\\ref\")."
                },
                "questions": {
                    "value": "- Have you tried experiments on model functions other than Rastrigin and Schwefel?\n- Have you tried scaling the method to significantly higher dimensions ($N=100,1000$), which overcome the curse of dimensionality?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "1: strong reject"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission4425/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4425/Reviewer_R5w8",
                        "ICLR.cc/2024/Conference/Submission4425/Senior_Area_Chairs"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4425/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698691634311,
            "cdate": 1698691634311,
            "tmdate": 1700440966196,
            "mdate": 1700440966196,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "s89062RpWj",
                "forum": "e0bdvNsgcF",
                "replyto": "RYQQrn7buE",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4425/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4425/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Reply to Reviewer R5w8"
                    },
                    "comment": {
                        "value": "- One of the contributions of this work is to transform the problem of finding the largest element of a factorized tensor into a continuous optimization problem, i.e., Theorem 1, which makes it possible to design algorithms for finding the largest element of a factorized tensor from a continuous optimization perspective. More importantly, our proposed continuous optimization model is applicable to other formats such as Tucker and tensor-train. For example, if the tensor is given in Tucker format, i.e., $\\mathcal{A}=\\mathcal{G}\\times_{1}U^{(1)}\\times_{2}U^{(2)}\\cdots\\times_{N}U^{(N)}$, then the corresponding optimization problem can be written as \n$$\\max\\limits_{x^{(1)},x^{(2)},\\cdots,x^{(N)}}\\mathcal{G}\\times_{1}(x^{(1)T}(U^{(1)}\\odot x^{(1)}))\\times_2(x^{(2)T}(U^{(2)}\\odot x^{(2)}))\\cdots\\times_{N}(x^{(N)T}(U^{(N)}\\odot x^{(N)})),\\ \\text{subject to}\\ ||x^{(n)}||_2=1\\ \\text{for all}\\ n=1,2,\\cdots,N.$$\n- We have listed and compared the algorithms in the existing works. If there are any omissions, please point them out.\n- In the star sampling method, the top-k elements are obtained from the samples directly, but it may have too few effective samples that only include the largest element. Therefore, for a fair comparison, we use the same way to find the top-k elements in our experiments. Although the star sampling method is more accurate for random tensors, it requires many samples and is less efficient. Additionally, experiments in Sec. 5.2 and 5.3 show that the star sampling method is not always accurate.\n- The CP formats of Rastrigin and Schwefel can be directly obtained by Eq. (5.1), and their CP-ranks are both $d+1$. Since CP and TT formats can be converted to each other, they can also be expressed in TT format. As mentioned before, our proposed algorithms are also applicable to the tensor given in TT format due to the generality of the proposed continuous optimization model.\n- The key to Theorem 1 is that we observe the tensor corresponding to the solution is rank one, thus the problem (2.2) can be further rewritten as (2.3).\n- The goal of experiments in Sec. 5.3 is to verify the feasibility of our proposed algorithms, thus we use the data that can be stored in a laptop. However, for the higher-order tensor in practical applications, it can not be explicitly stored, and our proposed algorithms still work due to the fact that the time and memory cost of each iteration of them are $\\mathcal{O}(RI_n)$, which is linear with the order $N$."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4425/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1699686594679,
                "cdate": 1699686594679,
                "tmdate": 1699686594679,
                "mdate": 1699686594679,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "NHev74ry6h",
                "forum": "e0bdvNsgcF",
                "replyto": "RYQQrn7buE",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4425/Reviewer_R5w8"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4425/Reviewer_R5w8"
                ],
                "content": {
                    "comment": {
                        "value": "I thank the authors for their rather detailed answers. I will answer point by point (each of my black bullet points corresponds to the authors' bullet points)\n\n\n*\n\t- No, the problem of finding the extremal element for tensors in CPD using continuous elements is proposed in the paper Nicholas D Sidiropoulos, Paris Karakasis, and Aritra Konar. _Finding the smallest or largest element of a tensor from its low-rank factors._ arXiv preprint arXiv:2210.11413, you cited in your work.\nCompare formula (1) from this paper, where the positive values of $p$ coincide with the squares of $x$ from (2.3) of the formula of your paper.\nWithout considering the notation, the formulas are equivalent.\n\n * Moreover, you did not prove your theorem, because a) it is not clear (you did not answer my question in the review) what $x^{(n)}=1$ means b) you did not consider the case when a tensor has two or more extremal elements. Compare it with the proof of a similar theorem from the paper Sidiropoulos _et. al._ , it is already complete there. In Appendix you just proved the equivalence of (A.1) and (2.3), and both of these formulas contain continuous variables, so there is no reduction to the initial discrete task.\n\n - The method from the Sidiropoulos _et. al._  paper extends naturally to Tucker: $\\max_\\limits{ [p_n\\geq0, \\hbox{ }\\textbf{1}^T p_n=1]_{n=1}^N   } \\mathcal G \\times_1 (p_1^T U^{(1)})\\times_2 (p_2^T U^{(2)})\\cdots\\times_N (p_N^T U^{(N)})$ so you're not the first here either.\n - To summarize, you haven't invented a new method, you've assembled yours as a kit from parts of existing ones.\n\n\n* The main omission is the lack of real-world problems.  If you are talking about in principle low-rank data, as in the functions example, then you need to compare to other low-rank formats, such as TT decomposition as in the paper you cited by Andrei Chertkov, _et. al._ (arXiv:2209.14808), where maximum TT decomposition is used to find the extremum in discretized Rastrigin, Schwefel and other 8 more complex functions.  But most importantly, if one presents a maximum search method in CPD format, then it is author's job to find real examples where the new method would show superiority. I.e. it is important not just to show how the method works on extremely artificial examples, but to show its superiority in a problem where using CPD (and __not__ Tucker, TT and others) would be justified. Otherwise, it is much easier for one to use other decompositions for which similar methods of extremum search have already been developed.\n\n* Since the method presented in the paper is a combination of several heuristics, it is not very fair to compare it with one \"pure\" method. As an addition to Table 1 it would be interesting to see a comparison with a rather natural additional heuristic to Star sampling that converts the minimum of a CD tensor into a maximum. Moreover, a very similar transformation is given in this paper.\n\n* _Any_ tensor can be converted to _any_ format with _any_ given accuracy, the question is in ranks. For this particular case, discretization of Rastrigin and Schwefel functions, the ranks of exact TT-decomposion is 2, which is smaller, then $(d+1)$. If you know an efficient method to directly convert a CPD decomposition with ranks $(d+1)$ to a TT decomposition with rank 2 without loss of accuracy, please let me know. But it is not so important, what is important is that in the case of these functions, the TT-decomposition has $<4nd$ parameters, while the CPD has $(d+1)nd$ , which for the setup in your paper $d=10$, $n=4096$ gives $163840$ and $450560$ respectively. Thus, using CPD for this case of these functions is both inefficient and uneconomical, and, as I showed in the main review, gives worse accuracy than the existing algorithm for finding extrema in TT-tensors. Thus, the practical significance and novelty are not substantiated by these examples.\n\n* As I wrote above, this particular result was already in the Sidiropoulos _el. al._ paper.\n\n* All tensor decompositions (CPD, Tucker, TT, HT, etc.) are designed to break the curse of dimensionality. My concern was about the practical relevance of the work. Compressing a fairly small array into a CPD (which already takes a certain amount of time and loses accuracy) and then looking for an extremum in that decomposition is of no practical significance. Especially since there was not even a comparison in terms of speed (since you place the running time in the table) with direct search for minimum or maximum using numpy.min and numpy.max. If your paper would be focused on theoretical calculations, or would contain a fundamentally new algorithm, then it would be possible to pay less attention to the practical section. But your algorithm is just a set of already known tricks that is aimed at practical use, and in such a setting real-world problems are needed, not quite simple and extremely artificial synthetic ones.\n\n\nFinally, I keep my negative rating and increase confidence in it."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4425/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700440936588,
                "cdate": 1700440936588,
                "tmdate": 1700524996419,
                "mdate": 1700524996419,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "mQLjarDcsf",
            "forum": "e0bdvNsgcF",
            "replyto": "e0bdvNsgcF",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4425/Reviewer_TDnR"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4425/Reviewer_TDnR"
            ],
            "content": {
                "summary": {
                    "value": "This paper presents a algorithm for locating the largest and smallest elements in a tensor with low-rank format. The algorithm combines an alternating iterative method and a maximum block increasing approach, along with a newly-designed block-search strategy. The proposed algorithm achieves improvements in accuracy and efficiency compared to existing methods, as demonstrated through numerical experiments. It also discusses the use of the algorithm in various low-rank representations and highlights its advantage of obtaining both the largest/smallest elements and their location simultaneously."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "*1. Quality:*  The paper presents an algorithm that significantly improves upon existing methods by achieving remarkable advances in both accuracy and efficiency. The comparisons with existing methods underscore the superior performance of the proposed approach in terms of both accuracy and computational efficiency. Moreover, the paper discusses the algorithm's applicability to various low-rank representations, including CP, Tucker, and TT formats.\n\n*2. Clarity:*  The authors employ precise mathematical notations consistently, facilitating the understanding of the proposed algorithm, theoretical analysis, and numerical experiments."
                },
                "weaknesses": {
                    "value": "1. *Limited Novelty:* The paper draws inspiration from prior work and utilizes established techniques. It doesn't clearly differentiate how the proposed algorithms significantly advance beyond existing methods, both conceptually and theoretically. A more thorough exploration of the novelty would strengthen the paper's contribution.\n\n2. *Limited Impact:* The paper's contribution is niche, addressing a specific task related to low-rank tensors. It lacks the potential to significantly impact or disrupt the broader machine learning community. A broader discussion of potential applications or extensions could enhance its relevance.\n\n3. *Lack of Code Availability:* The absence of publicly available code for replicating the proposed algorithm limits reproducibility and practical usability for the research community. Providing code would improve transparency and facilitate further research.\n\n4. *Inadequate Discussion of Limitations:* The paper does not thoroughly discuss potential limitations or challenges associated with applying the proposed algorithm in practical scenarios. A comprehensive examination of limitations is essential for practical decision-making."
                },
                "questions": {
                    "value": "*Question 1:* Can the authors provide a more detailed explanation of how your proposed algorithms significantly differ from existing methods in both conceptual and theoretical aspects? Are there specific aspects of your approach that are novel and distinct from prior work that you draw inspiration from?\n\n*Question 2:* Could the authors elaborate on potential applications or extensions of your method beyond the specific task of low-rank tensors? How might it contribute to broader machine learning challenges? What are the limitations of your method in terms of scalability or adaptability to different problem domains?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission4425/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4425/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4425/Reviewer_TDnR"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4425/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698743890841,
            "cdate": 1698743890841,
            "tmdate": 1699636416916,
            "mdate": 1699636416916,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "L0kP4jiiEq",
            "forum": "e0bdvNsgcF",
            "replyto": "e0bdvNsgcF",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4425/Reviewer_nzvV"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4425/Reviewer_nzvV"
            ],
            "content": {
                "summary": {
                    "value": "The paper presents an approach for computing the largest elements of a factorized tensor by means of alternating optimization."
                },
                "soundness": {
                    "value": "1 poor"
                },
                "presentation": {
                    "value": "1 poor"
                },
                "contribution": {
                    "value": "1 poor"
                },
                "strengths": {
                    "value": "+ The results regarding convergence of the method would make the approach valuable for a reasonably formulated problem."
                },
                "weaknesses": {
                    "value": "- The paper seems to obfuscate at least two major technical oversights:\n    - The symmetric tensor eigenvalue formulation of the problem is used, by different factor matrices are optimized by alternating optimization. In the symmetric tensor eigenvalue problem, each component of the rank-1 factorization is typically set to be the same. Symmetry is mentioned in the problem definition in Section II, but never thereafter.\n    - The proof of theorem 1 does not appear complete or correct to me. Convergence is considered based only the objective function, which is convergent for any method that has a nondecreasing and bounded objective. Hence, the contrast to convergence of standard alternating least squares does not make sense. See, Uschmajew, A. (2012). Local convergence of the alternating least squares algorithm for canonical tensor approximation. SIAM Journal on Matrix Analysis and Applications, 33(2), 639-652.\n\nI believe the paper should not be published due to technical errors that are obfuscated by the writing."
                },
                "questions": {
                    "value": "None"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "1: strong reject"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission4425/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4425/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4425/Reviewer_nzvV"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4425/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698768361768,
            "cdate": 1698768361768,
            "tmdate": 1699636416797,
            "mdate": 1699636416797,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "Mmy6nbwFpb",
                "forum": "e0bdvNsgcF",
                "replyto": "L0kP4jiiEq",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4425/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4425/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Reply to Reviewer nzvV"
                    },
                    "comment": {
                        "value": "- We think it necessary to state that we consider the problem of finding the largest/smallest elements of a factorized tensor in this work, which can be equivalently transformed into a symmetric eigenvalue problem, where the symmetric matrix $A\\in\\mathbb{R}^{n_1n_2\\cdots n_d\\times n_1 n_2\\cdots n_d}$ is a diagonal matrix consisting of the entries of the tensor $\\mathcal{A}$. Based on this, we further combine the rank-one structure of the eigenvector to propose a continuous optimization model and use an alternating iterative method to solve it.\n\n- The goal of Theorem 1 is to show the equivalence of finding the largest element of $\\mathcal{A}$ and the proposed continuous optimization problem, which can be easily proved due to the rank-one structure of the eigenvector. Our convergence analysis involves two parts. The first one is global convergence, i.e., Theorem 2, which shows that Algorithm 1 converges to a stationary point, which matches the theory established in B. Chen, et al., SIAM Journal on Optimization, 22(1):87–107, 2012. The second one is local convergence, which requires a very careful analysis of the property of the objective function at the stationary point, just like A. Uschmajew analyzes the convergence of alternating least squares algorithm for canonical tensor approximation."
                    }
                },
                "number": 1,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4425/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1699670333318,
                "cdate": 1699670333318,
                "tmdate": 1699670333318,
                "mdate": 1699670333318,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "khrwrJ8ICe",
                "forum": "e0bdvNsgcF",
                "replyto": "28B3nsp9wY",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4425/Reviewer_nzvV"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4425/Reviewer_nzvV"
                ],
                "content": {
                    "comment": {
                        "value": "Theorem 1 is a trivial application of tensor algebra / CP format.\n\nThe proof of Theorem 2 assumes a sequence of points exist that approaches the minimum, then argues in terms that the objective value decreases monotonically and hence will converge. This is true for any alternating optimization approach in the sense that any monotonic sequence has a limit.\n\nThe proof of Theorem 3, refers to \"Ref 3\", though references are not numbered. But the above issues with theorem 2 to me are already critical."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4425/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700599231426,
                "cdate": 1700599231426,
                "tmdate": 1700599231426,
                "mdate": 1700599231426,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "2CMOMnWq7X",
            "forum": "e0bdvNsgcF",
            "replyto": "e0bdvNsgcF",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4425/Reviewer_neUt"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4425/Reviewer_neUt"
            ],
            "content": {
                "summary": {
                    "value": "In this paper, the authors develop algorithms aimed at identifying the largest and smallest elements in a factorized tensor. They propose an alternating iterative algorithm, which is enhanced with a maximum block increasing approach and a novel block-search strategy. The validation of their method is provided through both theoretical analysis and experimental evaluations."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "This paper presents a novel approach to a problem arising from tensor analysis - locating the largest/smallest elements in a tensor in the low-rank format. The strengths of the paper can be highlighted as follows:\n\n1. The authors propose a continuous optimization model that is different from the existing methods. This model could be applied to various low-rank representations such as CP, Tucker, and TT formats.\n\n2. The proposed method demonstrates significant improvements in both accuracy and efficiency over existing works in numerical experiments. This suggests that the method may be practically useful in real-world applications."
                },
                "weaknesses": {
                    "value": "While the paper presents a novel approach to locating the largest/smallest elements in a tensor in a low-rank format, some weaknesses mainly related to the theoretical results can be identified:\n\n1. Theorem 1 formulates an equivalent optimization problem for finding the largest element in a tensor, which is a crucial step in the authors' method. However, the paper does not provide an in-depth analysis of this equivalent problem. For example, it would be beneficial to understand the number of minimizers that this problem may have. Such analysis could provide insights into the complexity and potential pitfalls of the optimization problem, and could be critical for the algorithm's performance.\n\n2. Theorem 2 shows that the proposed algorithm's subsequence converges to a stationary point of the optimization problem. However, it's unclear whether the entire sequence converges, and more importantly, whether it converges to the optimal solution. The absence of these guarantees may limit the algorithm's reliability and effectiveness in practice.\n\n3. While Theorem 3 establishes a linear convergence rate to the optimal solution, it does so under the assumption that the initial point is sufficiently close to the optimal solution. Regrettably, the paper falls short in providing a discussion on how to obtain such an initial point. Furthermore, the paper does not explore the potential existence of multiple optimal solutions, a factor that could significantly affect the algorithm's convergence behavior."
                },
                "questions": {
                    "value": "Please answer the questions in Weakness part."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4425/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699274396248,
            "cdate": 1699274396248,
            "tmdate": 1699636416727,
            "mdate": 1699636416727,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "28B3nsp9wY",
                "forum": "e0bdvNsgcF",
                "replyto": "2CMOMnWq7X",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4425/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4425/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Reply to Reviewer neUt"
                    },
                    "comment": {
                        "value": "- Theorem 1 is one of the main contributions of this work, which makes it possible to design algorithms for finding the largest element of a factorized tensor from a continuous optimization perspective. Analysis of the number of minimizers is equivalent to the analysis of the convergence speed, which is very challenging for the alternating iterative algorithm in the field of optimization. Even for the alternating iterative algorithm for linear problems, i.e., Gauss-Seidel, the estimation of its convergence rate is also very difficult.\n\n- Since the corresponding objective function sequence is monotonic, if there is a subsequence converges to a stationary point of the optimization problem, the objective function sequence converges to the value corresponding to the stationary point. Theorem 2 is a global convergence theory, we cannot guarantee that the alternating iterative method converges to the global optimum, which matches the theory established in B. Chen, et al., SIAM Journal on Optimization, 22(1):87–107, 2012. If the initial point is sufficiently close to the optimal solution, then the stationary point that the alternating iterative method converges to is the optimal point, see Theorem 3."
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4425/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1699672792659,
                "cdate": 1699672792659,
                "tmdate": 1699672792659,
                "mdate": 1699672792659,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "pW3rwQzrNd",
                "forum": "e0bdvNsgcF",
                "replyto": "khrwrJ8ICe",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4425/Reviewer_neUt"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4425/Reviewer_neUt"
                ],
                "content": {
                    "comment": {
                        "value": "I concur with the comments made by Reviewer nzvV. The theoretical results presented in the paper require significant improvement."
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4425/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700637803862,
                "cdate": 1700637803862,
                "tmdate": 1700637803862,
                "mdate": 1700637803862,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]