[
    {
        "title": "Learning from Aggregate responses: Instance Level versus Bag Level Loss Functions"
    },
    {
        "review": {
            "id": "29aC1vNKhm",
            "forum": "E60SIDItyT",
            "replyto": "E60SIDItyT",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4708/Reviewer_2uPt"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4708/Reviewer_2uPt"
            ],
            "content": {
                "summary": {
                    "value": "The paper studies the relationship between instance-loss and bag-loss in the setting of aggregate label. In practice, the latter would provide stronger privacy protection in the model training process. The authors showed that instance loss can be viewed as having an extra regularization term similar to the within-cluster square loss from k-means. Based on this, a interpolative loss is proposed between these two as well as the bias-variance tradeoff on this factor."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "- The paper is clearly written and provides a very intuitive view on the connection between the bag-loss and individual-loss.\n- The authors derived theoretical results on the SNR which has practical implications on selecting optimal bag size."
                },
                "weaknesses": {
                    "value": "- The authors did not include the proof of the theorems, which I think is essential given the paper is largely centered around Theorem 2.5. In particular, (please let me know if I'm wrong), equation (8) simplifies to $2\\alpha_{\\ast}-1$ when k=1 which is not always 0 based on the fixed point assumption.\n- There is a little incoherence between the assumption and application. The authors focused on very practical applications with DP and aggregate learning, but it's rare in those cases for the proportional regime to hold which appears to be essential to the analysis. More commonly we see d = o(n), and I also assume k could not be fixed as d grows to satisfy k-anon."
                },
                "questions": {
                    "value": "As aforementioned, I would like the authors to provide the derivation of the theoretical results in the supplementary, and address the generalizability of the results if one or few assumptions do not hold in the paper."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission4708/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4708/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4708/Reviewer_2uPt"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4708/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698660815578,
            "cdate": 1698660815578,
            "tmdate": 1700468395529,
            "mdate": 1700468395529,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "u8pmzE2eB0",
                "forum": "E60SIDItyT",
                "replyto": "29aC1vNKhm",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4708/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4708/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for taking the time to read and review our paper!\n## Response to weaknesses:\n>The authors did not include the proof of the theorems, which I think is essential given the paper is largely centered around Theorem 2.5.\n\nWe would like to clarify that we did provide detailed proofs for all the theorems in the **supplementary material**. Specifically, the proof of Theorem 2.5 can be found in Appendix B. Due to space constraints for the main manuscript, the proofs are deferred to the supplementary. It is already available to the reviewers.\n>In particular, (please let me know if I'm wrong), equation (8) simplifies to $2\\alpha_*-1$ when $k=1$ which is not always 0 based on the fixed point assumption.\n\nNote that equation (8) is under the assumption $k>1$ and $\\rho>0$. (So you cannot set $k=1$ in it and get a valid result). We have been specific about this: The first bullet reads: **“Bias: For $k>1$ and $\\rho> 0$ ….”**. And then we add a sentence stating that under $k=1$ or $\\rho=0$, the bias is zero. In other words, these two statements are the complement of each other and you should not expect to get the second as a special case of (8). \n\n>The authors focused on very practical applications with DP and aggregate learning, but it's rare in those cases for the proportional regime to hold which appears to be essential to the analysis. More commonly we see d = o(n), and I also assume k could not be fixed as d grows to satisfy k-anon.\n\nThe case of $d = o(n)$ is the classical setting in statistics, while nowadays with the ability of collecting rich granular information on individuals, we are well into the proportional regime. For the practical applications discussed in the paper, there is often abundant information about users, many of which are categorical and would add even more dimension once converted into numerical features. Indeed there is a very active and broad area, called high-dimensional statistics, developed in the past three decades to discuss scenarios where $d$ exceeds sample size $n$.  We refer to (Donoho 2000) for a discussion of the relevance of the high-dimensional regime.\n\n\nRegarding the comment on $k$, we would like to recall that the setting of the paper is motivated by applications where the responses/labels contain private information, but the features vectors are not private. That’s why the aggregation is only done on the responses. That said, k-anonymity does not have anything to do with features dimension ($d$). It simply means that for each user, its aggregate response is shared with at least $k-1$ other users (since the bags are of size $k$).\nIf you have further questions or if additional clarification is needed, please let us know and we will be happy to address.\n\n*Donoho (2000), High-Dimensional Data Analysis: The Curses and Blessings of Dimensionality\n\n## Response to Question:\nPlease see our response to weaknesses. The proofs are already given in the supplementary which is available to the reviewers. In particular, the proof of Theorem 2.5 can be found in Appendix B."
                    }
                },
                "number": 1,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4708/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700279233925,
                "cdate": 1700279233925,
                "tmdate": 1700279233925,
                "mdate": 1700279233925,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "phTEtg138E",
                "forum": "E60SIDItyT",
                "replyto": "u8pmzE2eB0",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4708/Reviewer_2uPt"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4708/Reviewer_2uPt"
                ],
                "content": {
                    "comment": {
                        "value": "Thanks the authors' response as I missed the supplementary material initially. I'm willing to change my rating to 6: marginally above the acceptance threshold."
                    }
                },
                "number": 8,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4708/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700468381606,
                "cdate": 1700468381606,
                "tmdate": 1700468381606,
                "mdate": 1700468381606,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "aEiPbinRoL",
            "forum": "E60SIDItyT",
            "replyto": "E60SIDItyT",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4708/Reviewer_D7UY"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4708/Reviewer_D7UY"
            ],
            "content": {
                "summary": {
                    "value": "This paper studied the problem of learning from average response.\nThe author compared two loss functions (error of average output, average as instance label) theoretically and analyzed the bias and variance for linear models.\nThen, the author proposed a method for differential privacy based on the theoretical result."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "- This paper is well-written and easy to follow. The mathematical notation is clear.\n- The author did a good job discussing real-world examples and related works.\n- The analyses are sound and reasonable.\n- The private aggregate learning method is a solid contribution."
                },
                "weaknesses": {
                    "value": "- Most analyses are restricted to linear models. Thus, the range of applications may be limited. Even for tabular data, gradient boosting machines may perform better than linear models. There's a gap between theory and practice: for the Boston housing dataset, the author used an MLP instead.\n- The experiment is limited to one dataset. The labels generated in this way may not be a good proxy of real-world aggregate label problems.\n- A minor issue: the title \"learning from aggregate responses\" may be imprecise since here, the author only considered the average. There are other types of aggregate information, such as max, median, and rank."
                },
                "questions": {
                    "value": "- Why non-overlapping?\n- \"The bag-level loss does not have a unique minimizer\": is this proven?\n- Why should we reduce the variance? It seems that the regularization could lead to an over-smoothed solution."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4708/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698722526578,
            "cdate": 1698722526578,
            "tmdate": 1699636452588,
            "mdate": 1699636452588,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "XDiAYe6KgB",
                "forum": "E60SIDItyT",
                "replyto": "aEiPbinRoL",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4708/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4708/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for taking the time to read our paper and for your thoughtful comments.\n\n# Response to Weaknesses:\n>Most analyses are restricted to linear models. Thus, the range of applications may be limited. Even for tabular data, gradient boosting machines may perform better than linear models. There's a gap between theory and practice: for the Boston housing dataset, the author used an MLP instead.\n\nWhile it's true that our theoretical analyses primarily focus on linear models, by providing a precise theory for this case we develop non-trivial insights,  which as we see in the experiment carry over to more complex nonlinear setups. \n\n\nIn particular, we acknowledge that real-world data often exhibits complex patterns that may be better captured by non-linear models such as gradient boosting machines or multi-layer perceptrons (MLPs). To bridge the gap between theory and practice, we conducted experiments on the Boston housing dataset using an MLP, deviating from the linear models typically analyzed in the theoretical context.\n\n\nInterestingly, our experimental results with the MLP align with the predictions of our theoretical framework. Specifically, our theory suggests that the choice between bag-level and instance-level loss depends on the signal-to-noise ratio (SNR), and our experiment on the Boston housing dataset validates this insight. When the SNR is high (indicating smaller bags with higher SNR), bag-level loss outperforms; conversely, when the SNR is low, instance-level loss is more effective. In the intermediate phase, our results reveal a sweet spot, confirming the practical relevance of our theoretical findings.\n\n>The experiment is limited to one dataset. The labels generated in this way may not be a good proxy of real-world aggregate label problems.\n\nIn the setup discussed in the paper, the aggregate labels are generated by averaging the individual labels of all examples within a bag. It's worth noting that this method of label aggregation through averaging is a well-established and widely used practice. This technique finds application in various domains, from traditional group testing methodologies to contemporary privacy-preserving frameworks, such as the Private Aggregation API of Chrome Privacy Sandbox and the SKAdNetwork API from Apple.\n\nIf there's a specific concern or aspect of label generation that we may not have adequately addressed in our work, we would greatly appreciate additional details or clarification. It's possible that there might be a misunderstanding, and we are keen to ensure that we address your question comprehensively.\n\n>A minor issue: the title \"learning from aggregate responses\" may be imprecise since here, the author only considered the average. There are other types of aggregate information, such as max, median, and rank.\n\nWhile we acknowledge that there are various ways to aggregate information, such as using max, median, or rank, in the literature the aggregation often refers to the average or a weighted average. This method of label aggregation through averaging is a widely adopted practice, evident in traditional group testing methodologies, as well as in contemporary privacy-preserving frameworks like the Private Aggregation API of Chrome Privacy Sandbox and the SKAdNetwork API from Apple.\n\n# Response to Questions\n>Why non-overlapping?\n\nThe significance of employing non-overlapping bags is beyond considerations for our analysis; it is also crucial for maintaining privacy protection. Allowing overlapping bags, where a data example can be included in multiple bags, introduces the risk of inferring individual labels. To illustrate this potential privacy breach, consider an extreme scenario where there are more bags than the number of data examples. In such cases, an adversary could exploit the overlap to infer individual labels by solving a linear equation. Therefore, the choice of non-overlapping bags is not only for our analytical considerations but is also a deliberate measure to safeguard against potential privacy vulnerabilities. We appreciate your attention to this aspect of our methodology.\n\n>\"The bag-level loss does not have a unique minimizer\": is this proven?\n\nTo illustrate this point, let's consider a simple example. Suppose we have a bag consisting of two examples and the aggregate response for this bag is 0.5. In this case, we can select any one of the two examples and predict its response y, and the other as 1-y. As a result, the bag-level loss on this bag becomes zero, achieving the minimum. Therefore, it does not admit a unique minimizer. \nWe hope this example clarifies the observation that the bag-level loss does not admit a unique minimizer in general."
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4708/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700282099804,
                "cdate": 1700282099804,
                "tmdate": 1700282099804,
                "mdate": 1700282099804,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "FnS1yyFCwz",
            "forum": "E60SIDItyT",
            "replyto": "E60SIDItyT",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4708/Reviewer_wg1T"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4708/Reviewer_wg1T"
            ],
            "content": {
                "summary": {
                    "value": "This paper studies learning from aggregated responses with loss functions from both an instance level and a bag level with motivation from keeping individual privacy. It investigated the tradeoff between risk and privacy by inserting a multiplicative parameter for the regularization term $\\rho$ such that the instance-level loss and bag-level loss are well balanced. It also investigated different parameters such as signal-to-noise ratio, bag size, and overparameterization, and their effects on the convergence of the bias and variance of the model, and derived the optimal choice of parameter $\\rho$ with evidence from numerical experiments."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "The paper investigates the trade-off between bias and variance by taking into account various factors that might influence the model performance, which is considered thorough."
                },
                "weaknesses": {
                    "value": "The presentation can be improved. For example, some high-level ideas on the tradeoff could be included earlier in the paper (in more detail) instead of introducing them in the latter parts of the paper which makes it hard to grasp the contribution at the beginning. More explanation on Theorem 2.5 should be discussed. For example, the intuition of the actual meaning of the fixed point or the solution of the equation systems; what quantities the bias and the variance are converging to."
                },
                "questions": {
                    "value": "Can you explain a bit more on the fixed point and the solution of the equation systems in Theorem 2.5?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "details_of_ethics_concerns": {
                    "value": "No concerns."
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission4708/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4708/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4708/Reviewer_wg1T"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4708/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698853662954,
            "cdate": 1698853662954,
            "tmdate": 1700670087753,
            "mdate": 1700670087753,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "iZqq5GolDg",
                "forum": "E60SIDItyT",
                "replyto": "FnS1yyFCwz",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4708/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4708/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for taking the time to read our paper and for your thoughtful comments.\n\n# Response to Weaknesses\n>The presentation can be improved. For example, some high-level ideas on the tradeoff could be included earlier in the paper (in more detail) instead of introducing them in the latter parts of the paper which makes it hard to grasp the contribution at the beginning. \n\nFollowing your comment, we plan to add this explanation early on in the paper to better describe the contributions. “Note that bag-level and instance-level are approaches for training models using aggregated responses and once the bag configurations are given to the learner, she can try either loss to train her model. The high-level intuition we establish in this paper (through rigorous quantitative statements) is that using bag-level loss results in models with lower bias but higher variance compared to models that are trained by minimizing the instance-level loss. So in cases where there is a lot of heterogeneity in the responses, instance-level would work better. In contrast, for use cases with more homogenous responses, the bag-level would be better because lowering the bias becomes more effective (the variance is low).”\n\n>More explanation on Theorem 2.5 should be discussed. For example, the intuition of the actual meaning of the fixed point or the solution of the equation systems; what quantities the bias and the variance are converging to.\n\nNote that $u$ is a dummy variable and the first equation is a quadratic equation in $u$, which has one positive solution. Once it is solved in $u$, it can be plugged into the second equation which is linear in $v$, to solve for $v$. \nAs we see from the result $v$ is the variable that shows up in variance formula (equation 9). We could have just written $v$ explicitly by solving for $u$ and $v$ in closed form, but thought that writing it this way would be cleaner.\n\n# Response to Question:\n>Can you explain a bit more on the fixed point and the solution of the equation systems in Theorem 2.5?\n\nPlease see our response to the weaknesses as w answer this question there. If you have any other question or any further clarification is needed we are more than happy to respond."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4708/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700281749089,
                "cdate": 1700281749089,
                "tmdate": 1700281749089,
                "mdate": 1700281749089,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "rTUe4cHur7",
                "forum": "E60SIDItyT",
                "replyto": "FnS1yyFCwz",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4708/Reviewer_wg1T"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4708/Reviewer_wg1T"
                ],
                "content": {
                    "title": {
                        "value": "Official comment by Reviewer wg1T"
                    },
                    "comment": {
                        "value": "Thank you very much for addressing the concerns. It would be nice to incorporate the discussion in the revision. I would like to raise the score to 6."
                    }
                },
                "number": 13,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4708/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700670059886,
                "cdate": 1700670059886,
                "tmdate": 1700670169855,
                "mdate": 1700670169855,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "GQtFxAHgma",
            "forum": "E60SIDItyT",
            "replyto": "E60SIDItyT",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4708/Reviewer_LbHA"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4708/Reviewer_LbHA"
            ],
            "content": {
                "summary": {
                    "value": "This paper investigates the challenge of learning with restricted access to labels. Specifically, the authors explore two categories: Instance Level and Bag Level Losses. The proposed algorithm begins by partitioning data points into k non-overlapping bags, each containing m examples. Subsequently, the authors introduce two sets of loss functions: bag-level (as seen in Eq. 1) and instance-level (as seen in Eq. 2).\n\nThe primary contributions of this paper are as follows:\n\n1- Demonstrating that for a wide range of loss functions, a regularized bag-level loss can effectively serve as a surrogate for instance-level losses.\n\n2- In the context of well-specified linear regression, providing a precise characterization of the tradeoff between bias and variance.\n\n3- Introducing a label-DP variant of their algorithm tailored to bag-level losses."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "I think the paper is well-written and the theoretical results are presented with lots of intuitions. I think the main strength of the paper is the exact characterization of the bias and variance tradeoff. This characterization let them compare two family of losses."
                },
                "weaknesses": {
                    "value": "I think the motivation behind the definition of instance-level and bag-level losses is not clear. Another weakness is that the authors do not compare their results with the prior results on label DP. In this paper the authors use bag-level loss and then consider the noisy labels. Is that the best approach?"
                },
                "questions": {
                    "value": "1- What are the use-cases of instance-level loss and bag-level loss? To me, instance-level seems more intuitive and I want to know about the scenarios in which it is preferable to use bag-level loss.\n\n2- What is the significance of non-overlapping bags? Is it because of the analysis?\n\n3- For DP variants, the authors propose first forming the bag-level loss and then applying Laplace mechanism to the aggregated labels. Is that the best approach? What is the comparison of this method with the prior work on label-DP?\n\n4- Randomness in placing the samples in bags may help in privacy amplification."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4708/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699283600412,
            "cdate": 1699283600412,
            "tmdate": 1699636452438,
            "mdate": 1699636452438,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "Eku2I2WKxK",
                "forum": "E60SIDItyT",
                "replyto": "GQtFxAHgma",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4708/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4708/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for taking the time to read our paper and for your thoughtful comments.\n\n# Response to Weaknesses\n>I think the motivation behind the definition of instance-level and bag-level losses is not clear. \n\nIndeed having a clear understanding of these concepts is essential for comprehending our work. Note that in our setup, the learner has access to individual features vectors $x_i$, while is only given access to the aggregate responses. The instance-level and bag-level losses are two approaches often used in this area to assess the loss of a model. In the instance-level you treat the average response in a bag as a proxy for the *ungiven* individual responses in that bag and measure the loss between your model predictions $f(x_i)$ and the average response. Therefore, for each instance $x_i$ you still have a term in the loss function. In the bag-level loss, for each bag you measure how well your *average predictions* align with the given *average responses*. So for each bag you get a term in the loss function, but not for each instance.   \nWe hope that this explanation has been helpful. Please let us know if you have any further questions.\n\n>Another weakness is that the authors do not compare their results with the prior results on label DP. In this paper the authors use bag-level loss and then consider the noisy labels. Is that the best approach?\n\nTo clarify, we do compare our results with the label DP procedure. Note that the pure label DP procedure corresponds to the choice of $k=1$, which results in clusters of size one and essentially no aggregation. In particular, in Figure 2, we discuss that if $\\rho$ is small (recall that $\\rho=0$ corresponds to the bag-level loss), then $k=1$ is optimal, which means that pure label DP yields better model risk under a fixed privacy budget than aggregation + DP. On the other hand, for large values of $\\rho$ (recall that $\\rho=1$ corresponds to the instance-level loss), larger $k$ is better, so adding noise to the aggregated responses is better than just label DP. Hence, in summary, in our experiments, we compare with pure label DP ($k=1$) and also different choices of $\\rho$ (which cover both the bag-level and instance-level loss as well as any combination of them).\n\n# Response to Questions\n>1- What are the use-cases of instance-level loss and bag-level loss? To me, instance-level seems more intuitive and I want to know about the scenarios in which it is preferable to use bag-level loss.\n\nNote that bag-level and instance-level are approaches for training models using aggregated responses and once the bag configurations are given to the learner, she can try either loss to train her model. In our response to the weaknesses (above), we provided further intuition about the definition of these losses. The high-level intuition we establish in this paper (through rigorous quantitative statements) is that using bag-level loss results in models with lower bias but higher variance compared to models that are trained by minimizing the instance-level loss. So in cases where there is a lot of heterogeneity in the responses, instance-level would work better. In contrast, for use cases with more homogenous responses, the bag-level would be better because lowering the bias becomes more effective (the variance is low). For the case of linear regression, we explicitly characterize regimes where one approach is better than the other (see Lemma 3.2). In Figure 3, we also plot the risk (derived from our precise theoretical characterization). Note that the leftmost point ($\\rho=0$) corresponds to the bag-level loss and the rightmost point ($\\rho =1$) corresponds to the instance-level loss. As we see depending on the values of signal-to-noise ratio (SNR), cluster size (k) and overparameterization ($\\psi$), one approach can outweigh the other.\n\n>2- What is the significance of non-overlapping bags? Is it because of the analysis?\n\nThe significance of employing non-overlapping bags is beyond considerations for our analysis; it is also crucial for maintaining privacy protection. Allowing overlapping bags, where a data example can be included in multiple bags, introduces the risk of inferring individual labels. To illustrate this potential privacy breach, consider an extreme scenario where there are more bags than the number of data examples. In such cases, an adversary could exploit the overlap to infer individual labels by solving a linear equation. Therefore, the choice of non-overlapping bags is not only for our analytical considerations but is also a deliberate measure to safeguard against potential privacy vulnerabilities. We appreciate your attention to this aspect of our methodology."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4708/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700281260875,
                "cdate": 1700281260875,
                "tmdate": 1700281260875,
                "mdate": 1700281260875,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "xap5lVLqEZ",
                "forum": "E60SIDItyT",
                "replyto": "MX7oZoCckv",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4708/Reviewer_LbHA"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4708/Reviewer_LbHA"
                ],
                "content": {
                    "comment": {
                        "value": "Thanks. I think the paper is interesting and I would like to keep my score unchanged."
                    }
                },
                "number": 11,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4708/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700667287604,
                "cdate": 1700667287604,
                "tmdate": 1700667287604,
                "mdate": 1700667287604,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "0olFxvOqoK",
            "forum": "E60SIDItyT",
            "replyto": "E60SIDItyT",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4708/Reviewer_Z7mk"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4708/Reviewer_Z7mk"
            ],
            "content": {
                "summary": {
                    "value": "This paper addresses the problem of learning a model from a dataset partitioned into non-overlapping 'bags' of equal size, given the average value of the response variable in each bag. The difference with respect to usual regression analysis is that the individual responses are not provided, and so we cannot calculate the usual loss function. This calls for the definition of a modified loss function that depends only on the aggregate response in each bag.\n\nThe present paper analyses two such modified loss functions : L_bag, which measures the distance between the aggregate responses and the aggregates of model predictions ; and L_ins, which measures the distance between the aggregate responses and the individual model predictions.\n\nWhile L_bag gives rise to an unbiased estimator, the estimator corresponding to L_ins has a lower variance, at the cost of introducing a bias. The author(s) interpret the difference L_ins - L_bag as a sort of regularization term.\n\nThe paper also studies a loss function L_int, depending on a parameter rho, that interpolates linearly between L_bag and L_ins. (This corresponds to tuning the strength of the regularization.) The choice of rho involves a trade-off between the bias and variance of the resulting estimator, and one can make this choice in order to minimize the 'prediction risk' of the estimator.\n\nThe paper illustrates the above ideas in the case of linear models, with a quadratic loss function. In a rather specific asymptotic regime, with the training data drawn from standard normal distributions and then assigned uniformly at random to the bags, the paper computes several quantities of interest, such as the bias and variance of the estimator corresponding to L_int (and, by specialization, of that corresponding to L_bag and L_int). The results support the qualitative conclusions mentioned above.\n\nThe paper also contains certain numerical experiments, verifying the theoretical results in the asymptotic regime mentioned above, and exploring in the case of the Boston Housing dataset the optimal value of rho as a function of bag size.\n\nFinally, the paper also shows that truncating and adding a Laplace noise to the original aggregate responses makes the dataset epsilon-label Differentially Private. The resulting estimator is also Differentially Private, and the paper studies the optimal bag size (in the aforementioned asymptotic regime) as a function of the optimal regularization parameter rho."
                },
                "soundness": {
                    "value": "4 excellent"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "A. Clarity\n     1. The content is well organized. The introduction succinctly motivates the problems and summarizes the results.\n     2. The intuitions are made explicit and are transparently described. This made the review process painless.\n     3. The main text is clutter free and the proofs of all the technical claims are included in the supplementary material. The submission, is as a result, largely self contained and has no technical gaps.\n     4. The literature review is thorough and the authors have gone the extra mile organizing the ideas and summarizing the current state of a rapidly evolving niche in ML research.\n\nB. Significance, Quality\n     1. The subject is topical since Privacy preserving ML is a burning issue and an active area of current research.\n     2. The results shed new light on the interplay between instance-level and bag-level loss. It is interesting to see that the interpolate improves generalization in a real world dataset. \n     3. The qualitative conclusions derived in the asymptotic regime are clarifying and may be useful in more \"hairy\" real world datasets.\n\nC. Originality\n     1. Mixed loss function: The idea of interpolating between the loss functions is interesting and the idea that this could result in better generalization for aggregates-based learning appears to be novel.\n     2. The authors go beyond showing empirical results and derive closed form expressions and provide compelling interpretations for them."
                },
                "weaknesses": {
                    "value": "1. This is a minor comment on terminology: regularizers in the ML context, to the best of this reviewer's knowledge, only depend on model parameters and not on the data (which includes the feature vectors). Shrinkage and variance-reduction are related but not identical, and regularization in ML refers to the former. If indeed this term is used more broadly it may be helpful to include a few clarifying sentences and/or references. \n\n2. The theoretical results are proved under the following\n      a. Random Bags\n      b. Equal Sized Bags\n      c. Non-Overlapping Bags\n\nThe introduction cites the Google(Privacy Sandbox) and Apple(SKAd) APIs as motivations for the problem but the assumptions (a),(b),(c) do not hold in this regimes. In fact, a critical feature of both (a) Google's Private Aggregation API and (b) Apple's SKAd Network is that the aggregation keys are configurable (eg. aggregate behavior of traffic from California, visiting sports content at a certain time of day) ie the bags are specified by the consumer of the API, not by random aggregations. This enables ML algorithms to effectively use these aggregates for prediction.\n\nThis is an essential part of the problem. For example, here is a quasi-technical [report published by Google](https://github.com/google/ads-privacy/blob/master/Combining%20the%20Event%20and%20Aggregate%20Summary%20Reports%20from%20the%20Privacy%20Sandbox%20Attribution%20Reporting%20API.pdf)\n\nIf there is indeed a connection/insight in the paper that this reviewer has missed, please respond to the question below."
                },
                "questions": {
                    "value": "1. Are there explicit connections/insights to be gleaned from the results in the paper and the Google/Apple approaches for aggregated-feedback?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission4708/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4708/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4708/Reviewer_Z7mk"
                    ]
                }
            },
            "number": 5,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4708/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699480335588,
            "cdate": 1699480335588,
            "tmdate": 1699636452351,
            "mdate": 1699636452351,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "vU01pZtgvb",
                "forum": "E60SIDItyT",
                "replyto": "0olFxvOqoK",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4708/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4708/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for taking the time to read our paper and for your thoughtful comments.\n\n# Response to Weaknesses:\n>1.This is a minor comment on terminology: regularizers in the ML context ....\n\nYes, we agree that regularization is often used to refer to techniques that only depend on model parameters. However, there is indeed a growing body of work on data-dependent regularization. Following your comments, we will add the following clarification to the paper:\n\"In addition to traditional regularization techniques that only depend on model parameters, there is also a growing body of work on data-dependent regularization. This type of regularization explicitly takes into account the training data during the regularization process, which can lead to improved generalization performance in certain settings.\"\nWe will also add references to the following papers, which provide examples of data-dependent regularization techniques:\n- Shivaswamy, P. K., & Jebara, T. (2010). Maximum Relative Margin and Data-Dependent Regularization. Journal of Machine Learning Research, 11(2).\n- Zhao, H., Tsai, Y. H. H., Salakhutdinov, R. R., & Gordon, G. J. (2019). Learning neural networks with adaptive regularization. Advances in Neural Information Processing Systems, 32.\n- Mou, W., Zhou, Y., Gao, J., & Wang, L. (2018, July). Dropout training, data-dependent regularization, and generalization bounds. In International conference on machine learning (pp. 3645-3653). PMLR.\nWe hope that these additions will clarify the distinction between traditional regularization and data-dependent regularization.\n\n>2.The theoretical results are proved under the following a. Random Bags b. Equal Sized Bags c. Non-Overlapping Bags. The introduction cites the Google(Privacy Sandbox) and Apple(SKAd) APIs as motivations for the problem but the assumptions (a),(b),(c) do not hold in this regimes ....\n\nThank you for your insightful comment. The Google Privacy Sandbox and Apple APIs are discussed in the introduction mainly to motivate the general problem of learning from aggregated data, why it is of interest in practice and the privacy protections benefits of it.  We acknowledge that the configurability of aggregation keys introduces a level of specificity that may not align perfectly with our assumption of random aggregations. However, we contend that even in scenarios where bags are specified based on certain criteria (e.g., location, content, time of day), there remains an element of randomness in the aggregation process, especially when multiple users meet the specified conditions. In this sense, our theoretical framework, while idealized, can still serve as a valuable baseline for practical considerations.\n\nFurthermore, note that constructing bags by aggregating records with specific attributes in general outperforms random bags (see Chen et al. (2023)). Therefore, our study of random bags provides a conservative estimate of performance in practical settings, acting as a benchmark for the worst-case scenario. Additionally, it's noteworthy that random bags are commonly employed in the literature on learning from aggregate labels, further emphasizing their relevance in theoretical analyses (e.g., Busa-Fekete et al. (2023), Yu et al. (2013), Quadrianto et al. (2008)).\n\n# Response to Questions\n>Are there explicit connections/insights to be gleaned from the results in the paper and the Google/Apple approaches for aggregated-feedback?\n\nOur paper aims to shed light on the trade-offs between instance-level and bag-level losses in aggregated feedback settings. While we understand that the specifics of the Google Privacy Sandbox and Apple SKAd APIs may not align directly with our theoretical framework, our findings suggest a broader principle — the potential regularization effect of instance-level loss leading to improved generalization performance. This principle may inform the design of algorithms for APIs with configurable aggregation keys, guiding the search for an optimal balance between instance-level and bag-level losses.\n\nIn conclusion, we value your input and recognize the need for future work that bridges the gap between theoretical models and real-world applications. Our ongoing research will focus on extending our theoretical framework to incorporate more realistic assumptions, specifically addressing the nuances of APIs like the Google Privacy Sandbox and Apple SKAd. We are committed to exploring how our theoretical insights can be practically applied in these settings and welcome further discussion on this important intersection of theory and application."
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4708/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700280674440,
                "cdate": 1700280674440,
                "tmdate": 1700280674440,
                "mdate": 1700280674440,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]