[
    {
        "title": "HeroLT: Benchmarking Heterogeneous Long-Tailed Learning"
    },
    {
        "review": {
            "id": "BLebYQ25YC",
            "forum": "eADuHv62J5",
            "replyto": "eADuHv62J5",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6031/Reviewer_Tkrb"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6031/Reviewer_Tkrb"
            ],
            "content": {
                "summary": {
                    "value": "The paper develops long-tailed learning benchmark named HEROLT, which integrates 15 state-of-the-art algorithms and 6 evaluation metrics on 16 real-world benchmark datasets across 5 tasks from 3 domains. They provide the systematic view from three pivotal angles and do extensive experiments."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. The paper is exceptionally well-written, with each part being introduced in a clear and concise manner, making it easy to understand.\n2. The paper demonstrates substantial effort, with convincing experimental results.\n3. The paper presents a refreshing classification approach, introduces new metrics, and provides reliable benchmarks."
                },
                "weaknesses": {
                    "value": "1. Although a new metric is designed and experimental analysis is conducted, the originality of this work is minimal. It mostly summarizes existing methods with few new designs or practices. It would be more valuable if there were innovative ideas and contributions.\n2. The selection of datasets seems extensive, but it is essentially a combination of different domains, without a clear purpose. The data is heterogeneous, while the methods are specialized for different problems. After the integration, specific domain methods are still used for specific domain testing, without transferability or comparison. What is the purpose of this integration?\n3. At least in the field of image recognition, these methods cannot be considered as \"state-of-the-art methods\" as mentioned in the paper. They serve as baselines in recent papers. For example, [1] and [2] are methods with better performance.\n4. The finding that \"none of the algorithms statistically outperforms others across all tasks and domains, emphasizing the importance of algorithm selection in terms of scenarios\" is not surprising but rather intuitive. The subsequent analysis is based on specific dataset experiments, and it remains a mystery how to better guide the design process.\n\n[1] Long-Tailed Recognition via Weight Balancing. CVPR22\n\n[2] Distribution alignment: A unified framework for long-tail visual recognition. CVPR21"
                },
                "questions": {
                    "value": "1. What are the specific purposes and implications of Assumption 1 and Assumption 2 in the subsequent context? The use of insufficiently  proof by contradiction is questionable and unconvincing. For example, in the examples of Assumption 1, the feature distribution can be linearly separable. It is confusing to make assumptions about the data without considering the specific training process of the model. If the data possessed such favorable properties, the long-tail distribution problem would not be so challenging. Personally, I believe the difficulties lie in the model's inability to effectively distinguish and generalize features.\n\n2. See others in weakness."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission6031/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6031/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6031/Reviewer_Tkrb"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6031/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1697604454637,
            "cdate": 1697604454637,
            "tmdate": 1699636648626,
            "mdate": 1699636648626,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "pYgINWawIB",
                "forum": "eADuHv62J5",
                "replyto": "BLebYQ25YC",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6031/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6031/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Part 1/2"
                    },
                    "comment": {
                        "value": ">**Q1:** It would be more valuable if there were innovative ideas and contributions.\n\n**A1:** Thank you for your suggestion.\n\nAs a benchmark paper, we would like to emphasize that one of our main contributions is the development of a **comprehensive toolbox for heterogeneous long-tailed learning:** \n\n- It facilitates benchmarking heterogeneous long-tailed learning, where the data are of different **types** and thus may have different **pre-processing**. \n\n- Our toolbox integrates the datasets and enables **uniform evaluation** using a standardized function. \n\n- We actively engaged in adapting the **SOTA** long-tailed learning algorithms for multiple tasks (e.g., image classification, instance segmentation). \n\nIn addition, we give a **guideline** for dataset and model selection by long-tailed metrics:\n\n- We analyze the potential performance of extreme classification methods, methods for imbalance, long-tail learning, or ordinary machine learning methods when the datasets exhibiting varying degrees of long-tail characteristics.\n\n- Our experimental analysis shows that this guideline can partially explain the experimental results.\n\n&nbsp;\n>**Q2:** The data is heterogeneous, while the methods are specialized for different problems. What is the purpose of this integration?\n\n**A2:** Thank you for pointing this out. We would like to emphasize the following points:\n\n- **Figure 1 illustrates that there is a gap in leveraging multi-model data for building a long-tailed learning algorithm.** However, limited work pays attention to heterogeneous long-tailed learning. Our work establishes a foundational platform for the exploration of this novel area, giving a systematic view of the common challenges, and encouraging the solutions for diverse real-world tasks.\n\n- Our study incorporated specific methods to address the challenges of heterogeneous long-tailed learning. For instance, **datasets like Cora-Full and Email encompass tabular feature information and relational structural information.** Methods such as GraphSMOTE, ImGAGN, TailGNN, and LTE4G effectively exploit both tabular and relational information, and we provide a comparison of these methods. Furthermore, **datasets such as AMAZONCat-13K, Amazon-Clothing, and Amazon-Electronics, sourced from Amazon, span multiple data modalities (sequential, relational, and tabular) while sharing product IDs.** Consequently, concating representations learned from listed algorithms with identical IDs may be a solution to heterogeneous long-tailed learning. However, there exists a research gap in multi-model long-tailed learning algorithms. We propose the first heterogeneous long-tailed benchmark, paving the path for future investigations in this area.\n\n- **We propose a toolbox to facilitate heterogeneous long-tailed learning**, where the data are of different types and thus may have different pre-processing. This integration facilitates standardized evaluation through a uniform evaluation function to furnish the research community with a resource for comparing methods in heterogeneous long-tailed learning.\n\n&nbsp;\n>**Q3:** At least in the field of image recognition, these methods cannot be considered as \"state-of-the-art methods\" as mentioned in the paper. \n\n>**A3:** Thanks for your valuable suggestion! \n\n- For **multi-label text classification and node classification tasks**, we used state-of-the-art models such as XR-Transformer (2021), XR-Linear (2022), ImGAGN (2021), TailGNN (2021), LTE4G (2022).\n\n- We have added the discussion of the two papers for **image classification and instance segmentation tasks** in Appendix B.2, and are conducting experiments to compare some state-of-the-art methods. The experimental results we have obtained so far are as follows, and we will provide the complete experimental results in our new version.\n\n| Dataset  | Method | Acc|  | | Precision  |  |  | Recal |  |  |MAP  |  |  | Time (s) |\n|-------|--------|:--------:|--------|--------|:--------:|----|---------|:---------:|-------|----|:-------:|--------|--------|:--------:|\n|  |  | 100 | 50 | 10 | 100 |  50 |  10 |  100 |  50 |  10 |  100 |  50 |  10 |  |\n| CIFAR-10-LT  | PaCo   | 85.9 | 88.3 | 91.7 | 86.0 | 88.3 | 91.7 | 85.9 | 88.3 | 91.7 | 75.5 | 79.4 | 85.1 | 4.6 |\n| CIFAR-100-LT | PaCo  | 51.2 | 55.4 | 66.0 | 51.2 | 55.9 | 66.2 | 51.2 | 55.4 | 66.0 | 34.9 | 34.2 | 46.0 | 2.5 |\n\n| Dataset    | Method | Acc |  |   |  | Precision | Recall | MAP  | Time (s) |\n|------------|--------|:------:|--------|------|---------|:----------:|:-------:|:------:|:-------:|\n|  |  | Many | Medium | Few  | Overall |  | (bAcc) |  |  |\n| ImageNetLT | PaCo   | 67.8 | 56.5   | 37.8 | 58.3    | 58.3      | 58.3   | 37.5 | 58.9    |"
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6031/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700495904057,
                "cdate": 1700495904057,
                "tmdate": 1700540201259,
                "mdate": 1700540201259,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "rlRnD1cUG9",
                "forum": "eADuHv62J5",
                "replyto": "BLebYQ25YC",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6031/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6031/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Part 2/2"
                    },
                    "comment": {
                        "value": ">**Q4:** The subsequent analysis is based on specific dataset experiments, and it remains a mystery how to better guide the design process.\n\n**A4:** Thank you for your valuable feedback. We would like to emphasize the following points:\n\n- In Section 3.4, we conducted an analysis of the building components of each algorithm, such as mixup, meta-learning, and decoupled training. The decoupled learning-based methods OLTR and BALMS exhibited promising experimental results, suggesting their potential efficacy in the context of long-tailed learning.\n\n- However, no single technique consistently outperforms others across all tasks and datasets. **This is the reason we refrain from structuring our taxonomy based on specific components or modules used for benchmarking, like in prior literature.**\n\n- Our benchmark consists of three novel angles (the characterization of data long-tailedness, the data complexity of various domains, and the heterogeneity of emerging tasks) to enrich the understanding of heterogeneous long-tailed data, thereby inspiring future algorithmic research to **fill the gap of multi-model, multi-task long-tail learning algorithms.**\n\n&nbsp;\n>**Q5:** What are the specific purposes and implications of Assumption 1 and Assumption 2 in the subsequent context? \n\n**A5:** Sorry if our prior assumptions cause any misunderstandings. We have updated the content of the assumptions. In general, we made these two assumptions to **satisfy the distinguishability of head categories, tail categories, and noise** `[1]`. Therefore, we illustrate the outcomes of obeying/violating these two assumptions **on the embedding space after great feature engineering and training (https://anonymous.4open.science/r/HeroLT-9746/figs/assumption.pdf).**\n\n|    | $A2$. Compactness Assumption | $\\neg{A2}.$ Violation of Compactness Assumption |\n|---|---|---|\n| **$A1$. Smoothness Assumption** | The long-tailed problem is distinguishable, as in Fig. (b) |  Cannot determine whether it is noise data or data from tail class, as in Fig. (d) |\n| **$\\neg{A1}$. Violation of Smoothness Assumption** | Cannot depict the decision region of the head, as in Fig. (c) | Cannot distinguish head, tail, and noise, as in Fig. (e) |\n\n`[1]` He, Jingrui. Rare category analysis. Carnegie Mellon University, 2010."
                    }
                },
                "number": 8,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6031/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700496113090,
                "cdate": 1700496113090,
                "tmdate": 1700497088540,
                "mdate": 1700497088540,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "pODxJr7zCI",
                "forum": "eADuHv62J5",
                "replyto": "rlRnD1cUG9",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6031/Reviewer_Tkrb"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6031/Reviewer_Tkrb"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for your response, and I agree that this paper has made a contribution to the community.\n\nHowever, my main concern remains that the motivation is not convincing. The rigid merging of multiple fields without further exploration has limited significance. Additionally, the subsequent experimental conclusions are relatively limited as well. These are not deficiencies that a simple benchmark design can compensate for.\n\nI believe that other reviewers also hold similar views to some extent. Therefore, in my opinion, this paper requires further refinement and improvement. I will keep my current score."
                    }
                },
                "number": 13,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6031/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700617366343,
                "cdate": 1700617366343,
                "tmdate": 1700617366343,
                "mdate": 1700617366343,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "WQiQw9dmSX",
            "forum": "eADuHv62J5",
            "replyto": "eADuHv62J5",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6031/Reviewer_wsvH"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6031/Reviewer_wsvH"
            ],
            "content": {
                "summary": {
                    "value": "This paper provides a systematic view of long-tailed learning with regard to three pivotal angles: (A1) the characterization of data long-tailedness, (A2) the data complexity of various domains, and (A3) the heterogeneity of emerging tasks. It integrates 15 state-of-the-art algorithms and 6 evaluation metrics on 16 real-world benchmark datasets across 5 tasks from 3 domains and proposes an open-source toolbox HEROLT for the long-tailed tasks."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. The paper involves a significant amount of work, and its structure is relatively clear.\n2. This paper introduces Pareto-LT Ratio as a new metric for better measuring datasets and gives guidelines for the use of this metric.\n3.  It provides a fair and accessible performance evaluation of 15 state-of-the-art methods on multiple benchmark datasets that are contributing to the community"
                },
                "weaknesses": {
                    "value": "1. Despite the considerable effort invested in this work, I think that, apart from introducing the Pareto-LT Ratio, the paper falls short of provoking deeper contemplation on the long-tail problem for the readers. Instead, it primarily serves as a means of testing existing methods as baselines across various tasks.\n2. I have reservations about the two assumptions mentioned in Section 2.1. Modern deep models' feature space distributions depend on the outcomes of the model learning process, and as a result, these two assumptions may not hold in some cases. \n3. I find that the categorization of long-tail tasks in Angle 3 may not be entirely reasonable. For instance, should classification include both multi-label text classification and image classification? And is it appropriate to group single-image and video classification as image classification? Additionally, some other tasks like long-tail semantic segmentation have not been included. Furthermore, certain methods listed in Table 3 may be applicable to multiple tasks; for example, the concept of decoupling could be applied to both classification and detection (segmentation).\n4. The citations of methods in the experiments are needed. Meanwhile, some recent methods such as Paco and FCC in the image classification have not been discussed.\n\n[1] Cui, Jiequan, et al. \"Parametric contrastive learning.\" Proceedings of the IEEE/CVF international conference on computer vision. 2021.\n[2] Li, Jian, et al. \"FCC: Feature Clusters Compression for Long-Tailed Visual Recognition.\" Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition. 2023."
                },
                "questions": {
                    "value": "1. What's the meaning of \"support region\" in the Assumption 1 in Section 2.1?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission6031/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6031/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6031/Reviewer_wsvH"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6031/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698378826805,
            "cdate": 1698378826805,
            "tmdate": 1699636648490,
            "mdate": 1699636648490,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "r29fCAcqIQ",
                "forum": "eADuHv62J5",
                "replyto": "WQiQw9dmSX",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6031/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6031/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Part 1/2"
                    },
                    "comment": {
                        "value": ">**Q1:** It primarily serves as a means of testing existing methods as baselines across various tasks.\n\n**A1:** We would like to emphasize that one of our main contributions is the development of **a comprehensive toolbox for heterogeneous long-tailed learning:** \n\n- It facilitates benchmarking heterogeneous long-tailed learning, where the data are of different **types** and thus may have different **pre-processing**. \n- Our toolbox integrates the datasets and enables **uniform evaluation** using a standardized function. \n- We actively engaged in adapting the **SOTA** long-tailed learning algorithms for multiple tasks (e.g., image classification, instance segmentation). \n\nIn addition, we give a **guideline** for dataset and model selection by long-tailed metrics:\n\n- We analyze the potential performance of extreme classification methods, methods for imbalance, long-tail learning, or ordinary machine learning methods when the datasets exhibiting varying degrees of long-tail characteristics.\n- Our experimental analysis shows that this guideline can partially explain the experimental results.\n\n&nbsp;\n>**Q2:** Modern deep models' feature space distributions depend on the outcomes of the model learning process, and as a result, these two assumptions may not hold in some cases.\n\n**A2:** Sorry if our prior assumptions cause any misunderstandings. We have updated the content of the assumptions. In general, we made these two assumptions to **satisfy the distinguishability of head categories, tail categories, and noise** `[1]`. Therefore, we illustrate the outcomes of obeying/violating these two assumptions **on the embedding space after great feature engineering and training (https://anonymous.4open.science/r/HeroLT-9746/figs/assumption.pdf).**\n\n|    | $A2$. Compactness Assumption | $\\neg{A2}.$ Violation of Compactness Assumption |\n|---|---|---|\n| **$A1$. Smoothness Assumption** | The long-tailed problem is distinguishable, as in Fig. (b) |  Cannot determine whether it is noise data or data from tail class, as in Fig. (d) |\n| **$\\neg{A1}$. Violation of Smoothness Assumption** | Cannot depict the decision region of the head, as in Fig. (c) | Cannot distinguish head, tail, and noise, as in Fig. (e) |\n\n`[1]` He, Jingrui. Rare category analysis. Carnegie Mellon University, 2010.\n\n&nbsp;\n>**Q3:** I find that the categorization of long-tail tasks in Angle 3 may not be entirely reasonable. \n\n**A3:** Thank you for pointing this out.\n\n- In our original paper, the 'Classification' task referred specifically to the task of categorizing tabular data, which we have replaced with **'Tabular Classification'** to avoid confusion.\n\n- In Angle 3, we primarily enumerated five common tasks. However, there exist additional long-tailed tasks, such as sentence-level few-shot relation classification, video classification, entity alignment, and others. **We positioned the discussion of these tasks after their most similar common task**, out of concern for the length and brevity of the paper. In addition, we have added references and introductions to semantic segmentation tasks.\n\n- Yes, some methods can be applied to multiple tasks. For example, we give experimental results for BALMS on the image classification and instance segmentation tasks. While the decoupling approach exhibits promise in addressing segmentation challenges, we do not present such results due to the unavailability of the corresponding model or implementation details in the official code."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6031/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700495006454,
                "cdate": 1700495006454,
                "tmdate": 1700497072234,
                "mdate": 1700497072234,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "5nz9vP2GPV",
                "forum": "eADuHv62J5",
                "replyto": "WQiQw9dmSX",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6031/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6031/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Part 2/2"
                    },
                    "comment": {
                        "value": ">**Q4:** Some recent methods such as Paco and FCC in the image classification have not been discussed.\n\n**A4:** Thanks for your valuable suggestion! We have added the discussion of **FCC, PaCo and its following work GPaCo** `[1]` for image classification and instance segmentation tasks in Appendix B.2. In addition, we have added several baselines for image classification and instance segmentation tasks. The experimental results we have obtained so far are as follows, and we will provide the complete experimental results in our new version.\n\n| Dataset  | Method | Acc|  | | Precision  |  |  | Recal |  |  |MAP  |  |  | Time (s) |\n|-------|--------|:--------:|--------|--------|:--------:|----|---------|:---------:|-------|----|:-------:|--------|--------|:--------:|\n|  |  | 100 | 50 | 10 | 100 |  50 |  10 |  100 |  50 |  10 |  100 |  50 |  10 |  |\n| CIFAR-10-LT  | PaCo   | 85.9 | 88.3 | 91.7 | 86.0 | 88.3 | 91.7 | 85.9 | 88.3 | 91.7 | 75.5 | 79.4 | 85.1 | 4.6 |\n| CIFAR-100-LT | PaCo  | 51.2 | 55.4 | 66.0 | 51.2 | 55.9 | 66.2 | 51.2 | 55.4 | 66.0 | 34.9 | 34.2 | 46.0 | 2.5 |\n\n| Dataset    | Method | Acc |  |   |  | Precision | Recall | MAP  | Time (s) |\n|------------|--------|:------:|--------|------|---------|:----------:|:-------:|:------:|:-------:|\n|  |  | Many | Medium | Few  | Overall |  | (bAcc) |  |  |\n| ImageNetLT | PaCo   | 67.8 | 56.5   | 37.8 | 58.3    | 58.3      | 58.3   | 37.5 | 58.9    |\n\n`[1]` Cui, Jiequan, et al. \"Generalized parametric contrastive learning.\" IEEE Transactions on Pattern Analysis and Machine Intelligence (2023).\n\n&nbsp;\n>**Q5:** What's the meaning of \"support region\" in the Assumption 1 in Section 2.1?\n\n**A5:** Sorry for the confusion. We would like to refer to the decision region `[1]`, a conventional notion in classification problems, where the input data points correspond to a unique output class. For categories $c$, the decision region is defined as\n$S_c=\\{x_i : f(x_i)=c, i=1,\\ldots,n \\}$\n\n`[1]` Gibson, Gavin J., and Colin FN Cowan. \"On the decision regions of multilayer perceptrons.\" Proceedings of the IEEE, 1990."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6031/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700495086059,
                "cdate": 1700495086059,
                "tmdate": 1700540185934,
                "mdate": 1700540185934,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "QjcCwEpNL7",
            "forum": "eADuHv62J5",
            "replyto": "eADuHv62J5",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6031/Reviewer_BsKP"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6031/Reviewer_BsKP"
            ],
            "content": {
                "summary": {
                    "value": "The paper builds a comprehensive benchmark for the long-tail problem, containing multiple datasets and algorithms."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. The long tail problem is a practical and valuable research topic.\n2. Benchmark contains different data types and tasks."
                },
                "weaknesses": {
                    "value": "1. Most of the datasets and tasks seem to have been well constructed and the paper seems to merely concatenate them together without much additional integration.\n2. The methods discussed in the paper appear to be somewhat dated. For instance, the image classification data that is prominently featured in Table 2 is based on methodologies that were largely developed before 2020. Considering that it is already near the end of 2023, this renders the insights provided by the paper less credible.\n3. Referring to section C.1 of the paper, there is a misalignment in the model architectures and the number of epochs used when comparing different methods, which calls into question the article's claim of a 'fair evaluation'.\n4. According to the four-point analysis in the upper half of the third page, the Pareto-LT Ratio still requires integration with the Gini coefficient and IF to describe the dataset. The former primarily represents the number of categories, while the latter two indicate data imbalance. So why not directly use the number of categories as a descriptor? Additionally, I do not find comprehensive experimental and theoretical evidences to support this four-point analysis."
                },
                "questions": {
                    "value": "See above."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission6031/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6031/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6031/Reviewer_BsKP"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6031/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698722925529,
            "cdate": 1698722925529,
            "tmdate": 1699636648358,
            "mdate": 1699636648358,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "jkjKKUrD5Q",
                "forum": "eADuHv62J5",
                "replyto": "QjcCwEpNL7",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6031/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6031/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Part 1/1"
                    },
                    "comment": {
                        "value": "> **Q1:** Most of the datasets and tasks seem to have been well constructed and the paper seems to merely concatenate them together without much additional integration.\n\n**A1:** We would like to emphasize that one of our main contributions is the development of a **comprehensive toolbox for heterogeneous long-tailed learning**: \n\n- It facilitates benchmarking heterogeneous long-tailed learning, where the data are of different **types** and thus may have different **pre-processing**. \n\n- Our toolbox integrates the datasets and enables **uniform evaluation** using a standardized function. \n\n- We actively engaged in adapting the **SOTA** long-tailed learning algorithms for multiple tasks (e.g., image classification, instance segmentation). \n\n- In addition, we give a **guideline** for dataset and model selection by long-tailed metrics by analyzing the potential performance of extreme classification methods, methods for imbalance, long-tail learning, or ordinary machine learning methods when the datasets exhibiting varying degrees of long-tail characteristics.\n\n&nbsp;\n>**Q2:** The methods discussed in the paper appear to be somewhat dated. \n\n**A2:** Thanks for your valuable suggestion! \n\n- For **multi-label text classification and node classification tasks**, we used state-of-the-art models such as XR-Transformer (2021), XR-Linear (2022), ImGAGN (2021), TailGNN (2021), LTE4G (2022).\n\n- We have added the discussion of several recent papers `[1-4]` for **image classification and instance segmentation tasks** in Appendix B.2, and are conducting experiments to compare some of these state-of-the-art methods. The experimental results we have obtained so far are as follows, and we will provide the complete experimental results in our new version.\n\n| Dataset  | Method | Acc|  | | Precision  |  |  | Recal |  |  |MAP  |  |  | Time (s) |\n|-------|--------|:--------:|--------|--------|:--------:|----|---------|:---------:|-------|----|:-------:|--------|--------|:--------:|\n|  |  | 100 | 50 | 10 | 100 |  50 |  10 |  100 |  50 |  10 |  100 |  50 |  10 |  |\n| CIFAR-10-LT  | PaCo   | 85.9 | 88.3 | 91.7 | 86.0 | 88.3 | 91.7 | 85.9 | 88.3 | 91.7 | 75.5 | 79.4 | 85.1 | 4.6 |\n| CIFAR-100-LT | PaCo  | 51.2 | 55.4 | 66.0 | 51.2 | 55.9 | 66.2 | 51.2 | 55.4 | 66.0 | 34.9 | 34.2 | 46.0 | 2.5 |\n\n| Dataset    | Method | Acc |  |   |  | Precision | Recall | MAP  | Time (s) |\n|------------|--------|:------:|--------|------|---------|:----------:|:-------:|:------:|:-------:|\n|  |  | Many | Medium | Few  | Overall |  | (bAcc) |  |  |\n| ImageNetLT | PaCo   | 67.8 | 56.5   | 37.8 | 58.3    | 58.3      | 58.3   | 37.5 | 58.9    |\n\n`[1]` Li, Jian, et al. \"FCC: Feature Clusters Compression for Long-Tailed Visual Recognition.\" CVPR, 2023.\n\n`[2]` Cui, Jiequan, et al. \"Generalized parametric contrastive learning.\" IEEE PAMI, 2023.\n\n`[3]` Alshammari, Shaden, et al. \"Long-tailed recognition via weight balancing.\" CVPR, 2022.\n\n`[4]` Zhang, Songyang, et al. \"Distribution alignment: A unified framework for long-tail visual recognition.\" CVPR 2021.\n\n&nbsp;\n>**Q3:** There is a misalignment in the model architectures and the number of epochs used when comparing different methods.\n\n**A3:** Thank you for pointing this out. In our experiments, we used the default model architecture and hyperparameters for all methods. \n\n- Various methods do employ divergent model structures (e.g., ResNet-32, ResNeXt-50, ResNet-152). However, changes to the model architecture may disrupt the efficacy of the original optimized hyperparameters. \n\n- Furthermore, the difference in model complexity necessitated a distinct number of epochs. This is because using the same number of epochs may result in scenarios where some models reach convergence while others remain inadequately trained. Thus, our benchmark follows the settings of the original papers.\n\n&nbsp;\n>**Q4:** The Pareto-LT Ratio still requires integration with the Gini coefficient and IF to describe the dataset.\n\n**A4:** Thank you for your comment!\n- **Pareto-LT Ratio itself serves as a metric tailored to measure long-tailedness.** Intuitively, the higher the skewness of the data distribution, the higher Pareto-LT Ratio may be; the more number of categories, the higher the value of Pareto-LT Ratio. On the other hand, IF and Gini coefficient are designed to measure imbalance, with the number of categories reflecting solely the size of categories. \n\n- Sample size, the number of categories, IF, Gini coefficient, and Pareto-LT Ratio can provide insights into model design. **Our study concurrently analyzes multiple metrics to enable a more comprehensive characterization of datasets and to inspire potential model design.** However, no metric can comprehensively and accurately depict all the characteristics of a dataset currently. Our analysis may indeed exhibit limitations in specific datasets."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6031/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700493472363,
                "cdate": 1700493472363,
                "tmdate": 1700540110289,
                "mdate": 1700540110289,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "6OEDfU1PCR",
                "forum": "eADuHv62J5",
                "replyto": "QjcCwEpNL7",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6031/Reviewer_BsKP"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6031/Reviewer_BsKP"
                ],
                "content": {
                    "comment": {
                        "value": "My concerns remain.\n\n1. The datasets utilized are well-established and commonly employed. Despite being amalgamated in the paper, there remains a disjointed nature between various tasks.\n\n2. As a benchmark paper, the lack of alignment in model architectures raises doubts about the reference value of the results.\n\n3. Upon receiving the email, I immediately checked the author's response and the updates to the paper. However, I could not find any discussion or comparison in the paper regarding the works the authors claimed to “have added” in their response."
                    }
                },
                "number": 9,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6031/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700497356174,
                "cdate": 1700497356174,
                "tmdate": 1700497356174,
                "mdate": 1700497356174,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "YzgwbbW2n3",
            "forum": "eADuHv62J5",
            "replyto": "eADuHv62J5",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6031/Reviewer_aihc"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6031/Reviewer_aihc"
            ],
            "content": {
                "summary": {
                    "value": "This paper systematically investigates the long-tailed problem in various scenarios. It proposes a heterogeneous view from the aspect of 1) long-tailedness or extreme categories; 2) data complexity of various domains; and 3) heterogeneous tasks. Different from the previous metric (Imbalanced factor, gini coefficient), it proposes a new metric (Pareto-LT) to help measure the extreme number of categories. By conducting empirical studies on various long-tailed benchmarks, the authors provide some insights that different methods may work for different tasks with different long-tailed properties."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "This paper is well-written, and I think it will contribute to the long-tailed learning community.\n\n1. As far as I know, this is the first work that systematically benchmarks long-tailed learning problems. Moreover, it categorizes long-tailed learning problems from different angles, including the data imbalance/extremes, data types/domains, and applied tasks. It almost covers recent important long-tailed learning challenges.\n2. This paper proposes a novel metric, the Pareto-LT Ratio, for measuring both the degree of imbalance and the extreme number of categories of long-tailed datasets.\n3. This paper conducts empirical studies on multiple datasets and compares popular methods. It provides valuable insights regarding which types of methods may work on a certain type of task.\n4. The authors open-source a toolbox for evaluating long-tailed datasets."
                },
                "weaknesses": {
                    "value": "1. The problem definition in Sec. 2.1 is under an ideal situation. The authors present two assumptions, i.e., the Smoothness Assumption and the Compactness Assumption, which indicate that all data points are annotated and clustered well. However, in real-world scenarios, this might not be easily achieved. A category may contain multiple subcategories, which may obey Assumption 1. Also, the data might contain feature or label noise, making it hard to extract distinctive representations, thereby obeying Assumption 2. The authors should either consider these real-world problems, otherwise declare that they just define long-tailed learning under an ideal situation.\n2. The definition of long-tailed learning (Problem 1) seems trivial. It is similar to the definition of supervised learning, except that you emphasize the importance of both head and tail categories. It is better to illustrate the long-tailed property, i.e., $\\mathbb{P}(\\mathcal{Y})$ obeys a long-tailed distribution, or $\\mathcal{Y}$ has an extreme cardinality.\n3. The imbalance factor (IF) and Gini coefficient seem to perform a similar effect. The authors mainly consider them equally when compared with the Pareto-LT Ratio. Since the IF metric is more widely used, it seems that the Gini coefficient is less important. I suggest the authors discuss more about the difference between IF and Gini coefficient."
                },
                "questions": {
                    "value": "1. In Fig. 2(a), what is the meaning of the Pareto curve?\n2. Why do you choose 20% as a threshold for the Pareto-LT Ratio metric?\n3. I find the performance of OLTR on CIFAR-10-LT and CIFAR-100-LT too well. It almost surpasses all long-tailed learning methods using ResNet-32 (https://paperswithcode.com/task/long-tail-learning). However, I failed to find the reproduced results of OLTR on CIFAR-LT in previous works. I wonder if there are some mistakes in this paper."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission6031/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6031/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6031/Reviewer_aihc"
                    ]
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6031/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698766366432,
            "cdate": 1698766366432,
            "tmdate": 1700582975349,
            "mdate": 1700582975349,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "1ixHCJ75iG",
                "forum": "eADuHv62J5",
                "replyto": "YzgwbbW2n3",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6031/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6031/Authors"
                ],
                "content": {
                    "comment": {
                        "value": ">**Q1:** The authors present two assumptions, i.e., the Smoothness Assumption and the Compactness Assumption. However, in real-world scenarios, this might not be easily achieved.\n\n**A1:** Thank you for your constructive comments. \n\n**Firstly,** we would like to confirm if you are referring to 'A category may contain multiple subcategories, which may *violate* Assumption 1.' If this is the case, we would like to clarify that **our paper does not consider hierarchical categories.** Note that the majority of the long-tailed learning research does not explicitly consider subcategory categorization nor provide systematic evaluation `[1-7]`. As a benchmark paper integrating state-of-the-art methods across multiple domains, we follow the common problem setting.\n\n**Secondly,** **Assumption 2 does not assume a zero-noise scenario.** In real scenarios, data exhibits feature noise and label noise, thus we give Assumption 2 to ensure that the tail categories are distinguishable from the rest of the categories and background noise following `[8]`. \n\n**Finally,** we have updated the content of the assumptions to avoid confusion and will add it to our later version. In general, **we made these two assumptions to satisfy the distinguishability of head categories, tail categories, and noise**. Therefore, we illustrate the outcomes of obeying/violating these two assumptions on the embedding space after great feature engineering and training (**https://anonymous.4open.science/r/HeroLT-9746/figs/assumption.pdf**).\n\n|    | $A2$. Compactness Assumption | $\\neg{A2}.$ Violation of Compactness Assumption |\n|---|---|---|\n| **$A1$. Smoothness Assumption** | The long-tailed problem is distinguishable, as in Fig. (b) |  Cannot determine whether it is noise data or data from tail class, as in Fig. (d) |\n| **$\\neg{A1}$. Violation of Smoothness Assumption** | Cannot depict the decision region of the head, as in Fig. (c) | Cannot distinguish head, tail, and noise, as in Fig. (e) |\n\n`[1]` Zhang, Jiong, et al. \"Fast multi-resolution transformer fine-tuning for extreme multi-label text classification.\" NeurIPS, 2021.\n\n`[2]` Zhong, Zhisheng, et al. \"Improving calibration for long-tailed recognition.\" CVPR, 2021.\n\n`[3]` Zhou, Boyan, et al. \"Bbn: Bilateral-branch network with cumulative learning for long-tailed visual recognition.\" CVPR, 2020.\n\n`[4]` Kang, Bingyi, et al. \"Decoupling representation and classifier for long-tailed recognition.\" ICLR, 2020.\n\n`[5]` Zhao, Tianxiang, Xiang Zhang, and Suhang Wang. \"Graphsmote: Imbalanced node classification on graphs with graph neural networks.\" WSDM, 2021.\n\n`[6]` Qu, Liang, et al. \"Imgagn: Imbalanced network embedding via generative adversarial graph networks.\" KDD, 2021.\n\n`[7]` Yun, Sukwon, et al. \"Lte4g: long-tail experts for graph neural networks.\" CIKM, 2022.\n\n`[8]` He, Jingrui. Rare category analysis. Carnegie Mellon University, 2010.\n\n&nbsp;\n>**Q2:** The definition of long-tailed learning (Problem 1) seems trivial. It is better to illustrate the long-tailed property.\n\n**A2:** Thanks for your suggestion! We would like to clarify that long-tailed data exhibits a highly skewed data distribution and an extensive number of categories, and we give some examples with long-tailed distributions in Appendix A.\n\nFor the sake of clarity, we have modified the Long-Tailed Learning problem as follows. \n\n**Given:** a training set $\\mathcal{D}$ of $n$ samples from $C$ distinct categories and the label set $\\mathcal{Y}$. **The data follows long-tailed distribution, i.e., the frequency of the categories can be approximated as $\\lim_{y\\rightarrow \\ \\infty}\\ e^{ty}\\ P(Y>y)=\\infty$, for all $t>0$, where $Y$ is a random variable.**\n\n**Find:** a function $f: \\mathcal{X} \\rightarrow \\mathcal{Y}$ that gives accurate label predictions on both head and tail categories.\n\n&nbsp;\n>**Q3:** I suggest the authors discuss more about the difference between IF and Gini coefficient.\n\n**A3:** Thanks for pointing this out. We will add more discussion in Appendix B.1:\n\n**Imbalance Factor: $n_1/n_C$.**\n\n**Gini Coefficient: $\\sum_{i=1}^{C}\\sum_{j=1}^{C}|n_i-n_j| / 2nC$.**\n\nBoth IF and Gini coefficient try to quantify data imbalance, while IF measures the size of the most majority to the size of the most minority categories, and Gini coefficient considers the difference between the sizes of any two categories, less affected by extreme samples or absolute data size.\n\n&nbsp;\n>**Q4:** In Fig. 2(a), what is the meaning of the Pareto curve?\n\n**A4:** Thank you for pointing this out! The curve is **the probability density function of the Pareto distribution** which is a skewed distribution with a long tail, i.e., much of the data is in the tails `[1]`.\n\n`[1]` Arnold, Barry C. \"Pareto distribution.\" Wiley StatsRef: Statistics Reference Online (2014): 1-10."
                    },
                    "title": {
                        "value": "Part 1/2"
                    }
                },
                "number": 1,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6031/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700420573275,
                "cdate": 1700420573275,
                "tmdate": 1700497054009,
                "mdate": 1700497054009,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "F7nPDJbsMJ",
                "forum": "eADuHv62J5",
                "replyto": "YzgwbbW2n3",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6031/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6031/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Part 2/2"
                    },
                    "comment": {
                        "value": "> **Q5:** Why do you choose 20% as a threshold for the Pareto-LT Ratio metric?\n\n**A5:** We choose $p$=20% by default according to **Pareto principle (the 80-20 rule)** `[1]`, i.e., the top 20% categories contain 80% of samples. \n\nMeanwhile, two long-tailed datasets are comparable if using the same $p$ value. However, if the user has a unique definition of head categories in a particular domain, a different value of $p$ can be used.\n\n`[1]` Dunford, Rosie, Quanrong Su, and Ekraj Tamang. \"The pareto principle.\" (2014).\n\n&nbsp;\n> **Q6:** I failed to find the reproduced results of OLTR on CIFAR-LT in previous works. \n\n**A5:** Thank you for checking.\n- OLTR was not originally implemented on the CIFAR dataset and was only implemented on the ImageNet and Places datasets. We changed the dataset object defined in the official code, **used the default settings for Places to conduct the two-stage training based on ResNet-152**, and then reported the test results.\n\n- The great performance of OLTR on the CIFAR datasets may be related to the model structure. Our past experimental results show that **the ResNet-152-based OLTR method outperforms the ResNet-10-based OLTR in accuracy.**\n\n|              | IF:        | 100  | 50   | 10   |\n|--------------|-----------|------|------|------|\n| CIFAR-10-LT  | ResNet-10  | 50.7 | 64.2 | 83.0 |\n|              | ResNet-152 | 88.7 | 90.8 | 93.3 |\n| CIFAR-100-LT | ResNet-10  | 56.5 | 63.7 | 77.2 |\n|              | ResNet-152 | 67.6 | 72.0 | 77.2 |"
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6031/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700421573548,
                "cdate": 1700421573548,
                "tmdate": 1700421929838,
                "mdate": 1700421929838,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "LLHn1LmcJu",
                "forum": "eADuHv62J5",
                "replyto": "F7nPDJbsMJ",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6031/Reviewer_aihc"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6031/Reviewer_aihc"
                ],
                "content": {
                    "comment": {
                        "value": "For Q1, what I mean is that a category may contain multiple sub-populations, but annotated as the same category. In the embedding space, their features may be distributed across multiple clusters (as illustrated in Figure 2(b) in the main paper). I think this situation is common in the real scenarios.\n\nFor Q6, your results are reproduced with ResNet-10 and ResNet-152. However, in Appendix C.1, you use ResNet-32 for Decoupling, TDE, and MiSLAS on CIFAR. Therefore I am concerned with the fairness in the comparison.\n\nAnd your answers to Q2-Q5 have addressed my concerns. Thanks for your response."
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6031/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700495744931,
                "cdate": 1700495744931,
                "tmdate": 1700495744931,
                "mdate": 1700495744931,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "FLfs3sluJU",
                "forum": "eADuHv62J5",
                "replyto": "YzgwbbW2n3",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6031/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6031/Authors"
                ],
                "content": {
                    "comment": {
                        "value": ">**Q1:** For Q1, what I mean is that a category may contain multiple sub-populations, but annotated as the same category. In the embedding space, their features may be distributed across multiple clusters (as illustrated in Figure 2(b) in the main paper). I think this situation is common in the real scenarios.\n\n**A1:** Yes, a category may potentially contain multiple sub-populations. But it does not contradict our Assumption 1.\n\n- Firstly, **we would like to clarify the notion of smoothness is defined based on the well-trained embedding space instead of the input feature space.** For the head categories with rich data and labels,  with sufficient training, the examples should be well-clustered together with a smooth decision region in the learned embedding space.\n\n- Secondly, **We consider smoothness to be a continuous quantitative measure**, different degrees of smoothness can impair the performance of long-tail learning to varying degrees, but do not necessarily lead to a complete failure of the algorithm. When the degree of smoothness is low, as shown on the left (https://anonymous.4open.science/r/HeroLT-9746/figs/example.pdf), the decision region of the head category may be difficult to depict smoothly and the tail category may be difficult to classify, especially tail category has fewer samples. When relatively smooth, as shown on the right, the tail category may be easier to recognize.\n\n&nbsp;\n>**Q2:** For Q6, your results are reproduced with ResNet-10 and ResNet-152. However, in Appendix C.1, you use ResNet-32 for Decoupling, TDE, and MiSLAS on CIFAR. Therefore I am concerned with the fairness in the comparison.\n\n**A2:** We understand your concern. \n\n- We tried to adopt the same backbone for all methods in the image classification task. However, given the existence of additional hyperparameters to these methods, only adjusting the model backbone may compromise model performance. Consequently, in our reported outcomes, we used the default settings.\n\n- In our future investigations, we will search for the optimal hyperparameters for the small number of methods that do not use the same backbone and report the results."
                    }
                },
                "number": 10,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6031/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700533658879,
                "cdate": 1700533658879,
                "tmdate": 1700534747681,
                "mdate": 1700534747681,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "DsHrMl1pOB",
                "forum": "eADuHv62J5",
                "replyto": "FLfs3sluJU",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6031/Reviewer_aihc"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6031/Reviewer_aihc"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for your feedback.\n\nFirst, your assumptions are based on \"well-trained embedding space\". Although it is acceptable in the paper, it will compromise its practicality.\n\nSecond, it is unreasonable to use different backbones on the same dataset. This will lead to unfair comparisons and raise concerns about your conclusions.\n\nTherefore, I have to decline my score, considering the unconvincing results. Nevertheless, I believe that your work has a certain contribution, and I encourage the authors to improve your paper in the future."
                    }
                },
                "number": 12,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6031/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700582938843,
                "cdate": 1700582938843,
                "tmdate": 1700582938843,
                "mdate": 1700582938843,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]