[
    {
        "title": "Junk DNA Hypothesis: A Task-Centric Angle of LLM Pre-trained Weights through Sparsity"
    },
    {
        "review": {
            "id": "HLM3HrV7rz",
            "forum": "EmUVpfrXWN",
            "replyto": "EmUVpfrXWN",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6083/Reviewer_Q2er"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6083/Reviewer_Q2er"
            ],
            "content": {
                "summary": {
                    "value": "This paper raises a very interesting argument, that the weights within deep neural networks exhibit a similarity to the redundancy observed in human genes in that they both contain seemingly non-functional elements that play a critical role in their respective systems. This similarity is due to the fact that low-magnitude weights in pre-trained LLMs may appear \"useless\" for simple tasks and suitable for pruning, but they actually encode crucial knowledge necessary for solving more difficult downstream tasks."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "The main strength of this paper, compared to previous pruning works, is its task-centric viewpoint towards pre-trained weights. While it does not propose any new pruning way, the paper adopts a novel approach to isolate and quantify the significance of low-magnitude weights in pre-trained large language models (LLMs) by examining their correlation with the complexity of the downstream task for which the pre-trained LLM will be employed. This approach provides a more comprehensive understanding of the role of small-magnitude weights in LLMs and their impact on performance, particularly for complex tasks.\n\nOne of the main highlights of this paper is the authors' proposal of a method to quantitative define NLP downstream task difficulty. While this is in general highly ambiguous, the authors proposed (1) Varying the Adequacy of Target Domain Data; (2) Majority v.s. Minority in Multi-Lingual Translation, which essential extends the first setting to multi-domain learning; (3) QA with v.s. without available external Information, and (4) for different task types, as the disparity in performance between humans and models, normalized by human performance. The definition will be broadly useful for understanding LLM (both full and compressed) performance in fine granularity."
                },
                "weaknesses": {
                    "value": "-\tThe fourth “cross-task difficulty” definition is flawed.  The authors assumed the larger the positive normalized performance gap between humans and models, the more difficult the task is for the model. However, if both human and LLM perform very poor (but “comparably poor”) on one task, it could mean this task is very difficult, yet in your setting the “relative” gap might not be significant. Besides, as the authors also pointed out, different tasks might have different metrics so directly normalizing and comparing across tasks can be problematic too.\n-\tIt was known before difficult tasks are more fragile for pre-trained model pruning, such as in Sparsity-May-Cry (ICLR 2023). This paper essentially delves deeper on top of this exsiting observation."
                },
                "questions": {
                    "value": "No particular question. The paper is very well written, and I enjoyed reading it. Great clarity and solidity, particularly in the way the authors organized their experiment."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6083/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698632204283,
            "cdate": 1698632204283,
            "tmdate": 1699636655854,
            "mdate": 1699636655854,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "hZlHTg9W5P",
                "forum": "EmUVpfrXWN",
                "replyto": "HLM3HrV7rz",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6083/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6083/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer Q2er"
                    },
                    "comment": {
                        "value": "We sincerely thank you for your support and positive score. We are glad that you have found our definitions will be broadly useful for understanding LLMs. We now provide a detailed response to address the weaknesses that you have highlighted.\n\n**Question 1:** *The fourth “cross-task difficulty” definition is flawed. The authors assumed the larger the positive normalized performance gap between humans and models, the more difficult the task is for the model. However, if both human and LLM perform very poor (but “comparably poor”) on one task, it could mean this task is very difficult, yet in your setting the “relative” gap might not be significant. Besides, as the authors also pointed out, different tasks might have different metrics so directly normalizing and comparing across tasks can be problematic too.*\n\n- We appreciate your insightful critique of the “cross-task difficulty”. Your observation rightly points out a potential limitation in our methodology. Specifically, in cases where both humans and LLMs exhibit poor performance, the relative gap might not accurately reflect the true difficulty of the task. Nevertheless, the task pairs used in our paper were carefully selected by us, such that our assessment of task difficulty aligns well with intuitions derived from previous studies [1,2,3]. These studies suggest that COLA is more challenging than SST-2, STS-B is more difficult than QQP, and CSQA is more challenging than WinoGrande, respectively. Therefore, despite the limitation of our “cross-task difficulty” definition, we believe that our main conclusion remains valid within this context. We will highlight the current scope and limitations of the definition in the manuscript. We hope our work can inspire and encourage more efforts to accurately measure the cross-task difficulty.\n\n\n**Question 2:** *It was known before difficult tasks are more fragile for pre-trained model pruning, such as in Sparsity-May-Cry (ICLR 2023). This paper essentially delves deeper on top of this existing observation.*\n\n- While our study is indeed inspired by Sparsity-May-Cry (SMC), as rightly pointed by the reviewer, we delve deeper to study the role of small-magnitude weights in LLMs in addition to identifying the importance of the knowledge they encapsulate for downstream task performance. Specifically, compared with SMC, the unique contributions of the current draft can be summarized as follows:\n  1. Provided task criticality definitions: SMC estimates task difficulty mainly based on their ad-hoc results, while we provide more concrete measures (two large categories with four small categories) to identify task difficulty. Especially, the within task category is able to disentangle task difficulty from task type, providing a more convincing evaluation.\n  2. Exploring the effect of data volume on pruning.\n  3. Wider range of task choices: Small-scale: RoBERTa on various tasks from GLUE; Large-scale: billion-level models i.e., Vicuna-7B on Open-book and Close-book QA.\n  4. Exploring More sparsity patterns: we explored structured N:M sparsity.\n  5. Understand the importance of knowledge of small magnitude weights in the context of LLM fine-tuning.\n\n[1] Moshe Wasserblat. Best practices for text classification with distillation (part 2/4) – challenging use cases. https://www.linkedin.com/pulse/best-practices-text-classification-distillation-part-24-wasserblat/, 2021.\n\n[2] Bowon Ko and Ho-Jin Choi. Twice fine-tuning deep neural networks for paraphrase identification. Electronics Letters, 56(9):444–447, 2020.\n\n[3] Liu, Shiwei, Tianlong Chen, Zhenyu Zhang, Xuxi Chen, Tianjin Huang, Ajay Jaiswal, and Zhangyang Wang. \"Sparsity May Cry: Let Us Fail (Current) Sparse Neural Networks Together!.\" arXiv preprint arXiv:2303.02141 (2023)."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6083/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700567922075,
                "cdate": 1700567922075,
                "tmdate": 1700569462773,
                "mdate": 1700569462773,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "AwsoUOdbE0",
            "forum": "EmUVpfrXWN",
            "replyto": "EmUVpfrXWN",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6083/Reviewer_52Ea"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6083/Reviewer_52Ea"
            ],
            "content": {
                "summary": {
                    "value": "The paper focuses on the importance of the small weights in LLMs. They show that these are indispensable, particularly for harder tasks. The authors embrace a narrative to present similarities between the importance of these (previously thought to be \"junk\") weights and the junk DNA hypothesis in biology, which hypothesizes the unimportance of huge parts of DNA in humans for certain cellular processes and was proved to be wrong."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "- The paper is well-written.\n- The task-centric approach to the effects of small weights in LLMs is a good contribution to the AI community. \n- The results of the paper are convincing."
                },
                "weaknesses": {
                    "value": "- Most findings are not that surprising to me, for example, the finding that the small weights in LLMs can be important, or not, and that depends on the task. Nevertheless, this needs to be proved and this paper does it well.\n- The paper could be improved if the error margins of the results were evaluated or included in the figures. If this might cause a huge additional computational burden (does it?), at least some statistical analysis of the significance of the results would help."
                },
                "questions": {
                    "value": "- How do you explain the ups and downs in the figures? Specifically, for example in Fig.6a, the sparse-transfer 3:8 has better result than 4:8 in QNLI, and in Fig. 6b., sparse to dense transfer in CSQA 30% is higher than 20%, etc. Might such ups-and-downs indicate the variance of the results are high, and therefore the results are statistically insignificant?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6083/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698839983141,
            "cdate": 1698839983141,
            "tmdate": 1699636655747,
            "mdate": 1699636655747,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "dARpgR75ii",
                "forum": "EmUVpfrXWN",
                "replyto": "AwsoUOdbE0",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6083/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6083/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer 52Ea （1/2）"
                    },
                    "comment": {
                        "value": "We sincerely thank the reviewer for the positive review. We are glad that you have found our paper to be impactful with important and convincing results! We now provide a detailed response to address the weaknesses that you have highlighted.\n\n\n**Question 1:** *Most findings are not that surprising to me, for example, the finding that the small weights in LLMs can be important, or not, and that depends on the task. Nevertheless, this needs to be proved and this paper does it well.*\n\n- We are grateful that you think our paper does well on verifying the Junk DNA hypothesis. While the importance of small-magnitude weights depending on task difficulty may not be very surprising, no previous work has comprehensively studied this point, likely due to the daunting challenges of quantifying task difficulty. While our paper does not introduce any new pruning method, we propose a novel way to quantify task difficulty including both within task and across task. Based on our approach, we provide a comprehensive understanding of the role of small-magnitude weights in LLMs, inspiring the exploration of directions such as task-complexity-dependent dynamic inference and network self-slimmable properties. As rightly highlighted by the **Reviewer Q2er**, quoting his/her comment:\n  \n  > \"One of the main highlights of this paper is the authors' proposal of a method to quantitatively define NLP downstream task difficulty. While this is in general highly ambiguous, the authors proposed (1) Varying the Adequacy of Target Domain Data; (2) Majority v.s. Minority in Multi-Lingual Translation, which essentially extends the first setting to multi-domain learning; (3) QA with v.s. without available external Information, and (4) for different task types, as the disparity in performance between humans and models, normalized by human performance. The definition will be broadly useful for understanding LLM (both full and compressed) performance in fine granularity.\"\n\n\n**Question 2:** *The paper could be improved by evaluating or including error margins in the results. If doing so is computationally burdensome, incorporating some statistical analysis to determine the significance of the results would be beneficial.*\n\n- Thank you for your valuable suggestion. We would like to clarify that the results presented in our submission are averages derived from three different random seeds. We chose not to include the error margin in the plot because the values represented are not original; they are after normalization based on the mean value of the dense transfer.\n\n  Based on your concerns, we take RoBERTa-Large on QNLI task as an example and conducted **20 runs** instead of our previous 3 runs. We report our mean and standard deviation as follows:\n\n  |                          | Dense Transfer   | 7:8           | 6:8           | 5:8           | 4:8           | 3:8           | 2:8           | 1:8          |\n  |--------------------------|------------------|---------------|---------------|---------------|---------------|---------------|---------------|--------------|\n  | Sparse to Dense Transfer | 0.91 ± 0.11      | 0.91 ± 0.11   | 0.85 ± 0.17   | 0.91 ± 0.11   | 0.87 ± 0.14   | 0.54 ± 0.1    | 0.51 ± 0.021  | 0.5 ± 0.0053 |\n  | Sparse Transfer          | 0.91 ± 0.11      | 0.91 ± 0.11   | 0.91 ± 0.11   | 0.91 ± 0.11   | 0.85 ± 0.17   | 0.86 ± 0.11   | 0.8 ± 0.094   | 0.62 ± 0.035 |\n  | Dense Transfer with Freezing | 0.91 ± 0.11 | 0.89 ± 0.15   | 0.95 ± 0.0021 | 0.94 ± 0.019  | 0.92 ± 0.11   | 0.92 ± 0.11   | 0.92 ± 0.11   | 0.91 ± 0.11  |\n\n  To illustrate the performance drop by pruning from dense transfer, we normalized the average results against dense transfer, as shown in the following table:\n\n  |                          | Dense Transfer | 7:8  | 6:8  | 5:8  | 4:8  | 3:8  | 2:8  | 1:8  |\n  |--------------------------|----------------|------|------|------|------|------|------|------|\n  | Sparse to Dense Transfer | 1.00           | 1.00 | 0.93 | 1.00 | 0.96 | 0.59 | 0.56 | 0.55 |\n  | Sparse Transfer          | 1.00           | 1.00 | 1.00 | 1.00 | 0.93 | 0.95 | 0.88 | 0.68 |\n  | Dense Transfer with Freezing | 1.00      | 0.98 | 1.04 | 1.03 | 1.01 | 1.01 | 1.01 | 1.00 |\n\n  We observed a repeating pattern that is consistent with Figure 6 in our original submission. Specifically, the methods Dense Transfer and Dense Transfer with Freezing significantly outperform the other two methods. Notably, removing small-magnitude weights from pre-trained models leads to a marked decrease in performance."
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6083/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700568303356,
                "cdate": 1700568303356,
                "tmdate": 1700568303356,
                "mdate": 1700568303356,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "FL4hS62YGH",
                "forum": "EmUVpfrXWN",
                "replyto": "AwsoUOdbE0",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6083/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6083/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer 52Ea （2/2）"
                    },
                    "comment": {
                        "value": "**Questions 3:** *Explain the fluctuations in the figures.*\n\n- This could be attributed to two factors. First, pruning may introduce noise since performance doesn't always show a consistent, monotonic decrease with increased weight pruning, similar results are observed in [1,2].  Secondly, results averaged from limited random seeds might intensify this noise. Interestingly, a similar pattern of fluctuation persists in N:M QNLI sparse transfer even after 20 random seeds are run, specifically sparse transfer 3:8 still outperforms 4:8 in QNLI as shown in the above table. \n\n[1] Jaiswal A, Liu S, Chen T, et al. The Emergence of Essential Sparsity in Large Pre-trained Models: The Weights that Matter. NeurIPS 2023.\n\n[2] Liu S, Chen T, Zhang Z, et al. Sparsity May Cry: Let Us Fail (Current) Sparse Neural Networks Together!. ICLR 2023."
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6083/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700568377492,
                "cdate": 1700568377492,
                "tmdate": 1700569377996,
                "mdate": 1700569377996,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "4UThY7X0zr",
            "forum": "EmUVpfrXWN",
            "replyto": "EmUVpfrXWN",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6083/Reviewer_ahA2"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6083/Reviewer_ahA2"
            ],
            "content": {
                "summary": {
                    "value": "This paper investigates the significance of low-magnitude weights in pre-trained language models and how they affect performance in downstream tasks. The authors suggest a task-centric method to prune pre-trained language models. They illustrate that the small-magnitude weights hold crucial downstream knowledge essential for addressing more difficult tasks, challenging the conventional wisdom regarding the relevance of \"Junk DNA\" in the human genome and its similarity to the redundancy observed in deep neural networks."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "This article introduces three novel discoveries that set it apart from prior techniques for pruning Large Language Models (LLMs) such as essential sparsity, WANDA, and SparseGPT:\n\n1. The paper adopts a task-centric viewpoint when considering pre-trained weights, offering a more holistic comprehension of the function of small-magnitude weights in LLMs and their influence on performance, particularly in complex tasks. This viewpoint is innovative and challenges conventional wisdom.\n\n2. The paper mainly employs magnitude-based pruning to identify and measure the subtle importance of low-magnitude weights. While this approach has been used in previous research, the paper introduces a more nuanced and task-specific application of this technique.\n\n3. The paper challenges the established beliefs regarding the role of \"Junk DNA\" in the human genome and its similarity to the redundancy observed in deep neural networks. By expanding the Junk DNA Hypothesis to encompass other criteria for weight importance, the paper offers a more comprehensive insight into the significance of low-magnitude weights in LLMs and their impact on performance."
                },
                "weaknesses": {
                    "value": "1. This paper does not provide another LLM pruning method. As stated above it is mainly considered as a strength (with its simplicity and great clarity). However, it remains uncertain how the magnitude-based pruning approach would yield practical application value because (1) this vanilla pruning technique leads to a rapid decline in performance, and (2) unstructured sparsity is impractical for GPU implementation.\n\n2. Furthermore, the majority of experiments indicate that pruning performance, even for moderately challenging tasks, begins to drop at medium sparsity (around 30-50%). This raises doubts about the potential for any acceleration in LLM inference speed resulting from such pruning techniques."
                },
                "questions": {
                    "value": "Have the authors examined their study topic for quantization?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission6083/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6083/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6083/Reviewer_ahA2"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6083/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698847201720,
            "cdate": 1698847201720,
            "tmdate": 1699636655650,
            "mdate": 1699636655650,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "gLg3SYrr6Q",
                "forum": "EmUVpfrXWN",
                "replyto": "4UThY7X0zr",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6083/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6083/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer ahA2"
                    },
                    "comment": {
                        "value": "We thank you for your overall positive comments. We are really grateful that you recognize three novel discoveries of our paper. We have carefully read the review and would like to address them point-by-point as below.\n\n\n**Question 1:** *This paper does not provide another LLM pruning method. As stated above it is mainly considered as a strength (with its simplicity and great clarity). However, it remains uncertain how the magnitude-based pruning approach would yield practical application value because (1) this vanilla pruning technique leads to a rapid decline in performance, and (2) unstructured sparsity is impractical for GPU implementation.*\n\n-  We thank the reviewer for identifying the major strength of our work. As already highlighted by the reviewer, our intent was not to demonstrate a new pruning method, but to present a detailed analysis of the importance of the low magnitude weights from a task-centric angle. For that, we view magnitude pruning as a *quantitative and easily controllable tool* for investigating and understanding the role of small-magnitude weights within pre-trained LLMs. Additionally, we consider magnitude pruning to be a widely used post-training pruning technique since it does not necessarily require more sophisticated proxies such as gradient or Hessian. Also, as the models grow bigger, even fine-tuning for few epochs may not be feasible for a downstream user to evaluate such proxies. We believe magnitude-based proxy has value due to its ease of adaptation without any additional fine-tuning or proxy storage cost.\n-  Please note, we have demonstrated the Junk DNA hypothesis both for unstructured and N:M sparsity. It may often be argued that having inference speed up for unstructured sparsity is difficult without proper hardware or compiler support. However, N:M sparsity can yield inference speed up ([Accelerating Inference with Sparsity Using Ampere and TensorRT](https://developer.nvidia.com/blog/accelerating-inference-with-sparsity-using-ampere-and-tensorrt/)).\n\n\n\n**Question 2:** *Furthermore, the majority of experiments indicate that pruning performance, even for moderately challenging tasks, begins to drop at medium sparsity (around 30-50%). This raises doubts about the potential for any acceleration in LLM inference speed resulting from such pruning techniques.*\n\n- Regarding the reviewer's concern on the potential of pruning for LLMs, we want to highlight that our goal is not to demonstrate a pruning method that can yield speedup. Rather, we take the first step to analyze the impact of pruning from a task-centric point of view. More importantly, we take the first step to answer a rather overlooked question: *whether the low-magnitude weights are truly inconsequential artifacts for large-scale models?* \n- Nevertheless, apart from the detailed analysis on the importance of low-magnitude weights, we believe our discoveries should inspire exploration into potential avenues, such as task-complexity-dependent dynamic inference and network self-slimmable properties. Specifically, we can dynamically assign a different amount of weights according to specific prior knowledge of task difficulty, and then we can implement more precise and hardware-friendly methods to dynamically prune models, thereby facilitating efficient inference.\n\n\n**Question 3:** *Have the authors examined their study topic for quantization?*\n\n- We appreciate the reviewer's suggestion. As you suggested, we explored the Junk DNA Hypothesis in the field of quantization. We use GPTQ [1] to quantize the weights and generate the results with different target quantizations Bit-width. Specifically, we examined with Setting 3: With vs. Without Available External Information. We use Vicuna-7B as the base model and report the results in the following table, the values before the slash (\"/\") represent Exact Match Ratios, while the values after the slash are Normalized Against Pre-Quantization Performance.\n\n  | Configuration      | Closed Book (hard task)  | Open Book (easy task)  |\n  |--------------------|----------------------------|---------------------------|\n  | Before Quantization| 63.7 / 1.0                 | 76.1 / 1.0                |\n  | 8-bit              | 62.8 / 0.98                | 75.55 / 0.99              |\n  | 4-bit              | 54.35 / 0.85               | 72.2 / 0.95               |\n  | 2-bit              | 13.5 / 0.21                | 18.65 / 0.25              |\n\n\n    Our findings demonstrate a notable trend: as the bit-width decreases, there is a more rapid decline in performance after quantization for hard tasks. This trend also indicates the connection between the Junk DNA hypothesis and quantization.\n\n    [1] Frantar E, Ashkboos S, Hoefler T, et al. Gptq: Accurate post-training quantization for generative pre-trained transformers[J]. arXiv preprint arXiv:2210.17323, 2022."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6083/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700567328574,
                "cdate": 1700567328574,
                "tmdate": 1700589589811,
                "mdate": 1700589589811,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]