[
    {
        "title": "Differentially Pivate Per-Instance Additive Noise Mechanism: A Game Theoretic Approach"
    },
    {
        "review": {
            "id": "6cWhlWUXbq",
            "forum": "ESt7ECoWpn",
            "replyto": "ESt7ECoWpn",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission2502/Reviewer_HRkt"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission2502/Reviewer_HRkt"
            ],
            "content": {
                "summary": {
                    "value": "This paper presents a novel perspective to solve the pDP problem by a game-theoretical modeling. In particular, they introduce a per-instance noise variance optimization (NVO) game, which is designed to find suitable non-identical per-instance additive Laplace noises within a dataset. The authors use two algorithms to derive strategies for achieving the NE: 1) best response dynamics (BRD).1) best response dynamics (BRD), and 2) an approximate enumeration (AE) using a genetic algorithm. The paper demonstrates the efficacy of the NVO game on various statistical metrics and shows that it can achieve better statistical utility while maintaining the same level of DP as the conventional Laplace mechanism."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "1. The problem of pDP is well motivated, considering that conventional DP often introduces substantial noise into the dataset, which can significantly diminish its statistical utility. The introduction of a game-theoretical modeling approach is indeed a novel and well-suited method for tackling this challenge, with the aim of optimizing per-instance noise.\n\n2. The paper is commendably presented and effectively communicates its core contributions. It adeptly addresses fundamental questions within this domain, namely, 1) how to ensure the preservation of statistical utility, and 2) whether this alternative modeling approach maintains a sufficiently high level of privacy protection."
                },
                "weaknesses": {
                    "value": "1. The experiments conducted in this study were carried out with a relatively low level of privacy protection, specifically $\\epsilon = \\{1,2,4,8\\}$. It is worth noting that, in practical scenarios, an even lower value of $\\epsilon$ (i.e., $\\epsilon<1$) is often preferred. I would greatly appreciate it if the authors could either provide further justification for their choice of $\\epsilon$ or consider conducting additional experiments with smaller values of $\\epsilon$ to address this concern comprehensively.\n\n2. I am genuinely curious about the computational cost associated with this approach. The datasets used in the experiments consisted of roughly one thousand samples, and the variance set was defined as relatively small. For the best response dynamics (BRD) approach, it would be valuable if the authors could present the computational time required. Regarding the approximate enumeration (AE) approach, I have some reservations about its privacy protection level, as Theorem 4.1 can only guarantee privacy protection for a Nash Equilibrium (NE) point. However, there is a possibility that AE may fail to obtain any NE point, which raises questions about the robustness of privacy protection in this context."
                },
                "questions": {
                    "value": "See weakness."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission2502/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission2502/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission2502/Reviewer_HRkt"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission2502/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698494267038,
            "cdate": 1698494267038,
            "tmdate": 1699636186715,
            "mdate": 1699636186715,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "f0tT4W3jWD",
                "forum": "ESt7ECoWpn",
                "replyto": "6cWhlWUXbq",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2502/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2502/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer HRkt"
                    },
                    "comment": {
                        "value": "Thank you for your constructive feedback on additional numerical results and computational cost analysis. To cope with the comments, we added new experiments with smaller values of $\\epsilon$. Also, as the reviewer suggested, we added computational cost analysis. We hope that the changes we made in the revised manuscript are satisfactory.\n\n---\n\n**1. Additional experiments with smaller $\\epsilon$.**\n\n> Comment: The experiments conducted in this study were carried out with a relatively low level of privacy protection, specifically $\\epsilon$ =1, 2, 4, 8. It is worth noting that, in practical scenarios, an even lower value of $\\epsilon$ (i.e., $\\epsilon$<1) is often preferred. I would greatly appreciate it if the authors could either provide further justification for their choice of e or consider conducting additional experiments with smaller values of e to address this concern comprehensively.\n\nAnswer: We sincerely appreciate this suggestion. The authors kindly note that $\\epsilon>1$ is widely used for practical DP use cases. For example, [Apple](https://www.apple.com/privacy/docs/Differential_Privacy_Overview.pdf) is known to use $\\epsilon$-DP with epsilon values ranging between 2 and 8.\n\nHowever, some previous papers have provided results for $\\epsilon<1$ in extreme cases. Therefore, we conducted additional experiments for the cases where $\\epsilon=0.1$ and $\\epsilon=0.3$.\n\n- For additional experiments, please refer to Figures 6, 7, 8, 9, and 10. Based on the newly added results, we found that the proposed NVO game still better preserves utility while guaranteeing $\\epsilon$-pDP. In these cases, the Laplace mechanism provides a uniform distribution, with almost zero utility. We added the results in Appendices D and E, because of the page limit.\n\n---\n\n**2. Computational cost analysis**\n> Comment: I am genuinely curious about the computational cost associated with this approach. The datasets used in the experiments consisted of roughly one thousand samples, and the variance set was defined as relatively small. For the best response dynamics (BRD) approach, it would be valuable if the authors could present the computational time required. Regarding the approximate enumeration (AE) approach, I have some reservations about its privacy protection level, as Theorem 4.1 can only guarantee privacy protection for a Nash Equilibrium (NE) point. However, there is a possibility that AE may fail to obtain any NE point, which raises questions about the robustness of privacy protection in this context.\n\nAnswer: Thank you for providing new suggestions. The reviewer raised questions about computational complexity of BRD approach and robustness of privacy preserving in AE approach. The bellows are one-by-one responses to the suggestions.\n\n**Computational complexity of BRD approach**: First of all, we kindly remind you that the wall-clock time of the BRD algorithm is available in Tables 1, 3, 4, and 5 for various datasets, including a newly added large dataset (credit profile dataset). Moreover, for computational complexity analysis, we first bring a fact from proof of Theorem 4.1 that in each round of the game, at least one player has a change of incrementally guaranteeing the pDP of a data instance. Thus, for privacy preserving, the maximum number of required steps is $|\\mathcal{D}|$. Since the computational complexity of the payoff computation in each step of a round is $O(|\\mathcal{D}|)$, the worst computational complexity of the BRD algorithm is $O(|\\mathcal{D}|^2)$. \n\nFor extremely large datasets, the required computation time becomes a limitation of our work. In such scenarios, it might be necessary to consider methods such as grouping data points with identical query output values to reduce computation by adding the same noises. \nYet, additional future work is required to develop a better solution.\n\nTo comply with the comment, we have revised the manuscript.\n- Added statements in **Limitation** paragraph in Section 7.\n- Add a paragraph **Convergence of BRD toward NE** in Section 5.1 \n\n**Failure of AE to obtain NE point**:\nWith ample time, the AE algorithm has the capability to reach a level of performance comparable to that of the exact enumeration algorithm, achieving an NE point. We extended our experiments for an extended duration to ensure convergence. However, there's no theoretical assurance of attaining an NE point within a polynomial time frame. In our revised manuscript, we relocated the detailed explanations of the AE algorithm to Appendix B. It's worth noting that we included this algorithm to assess the effectiveness of a non-greedy approach within our proposed NVO game when provided with ample computational resources.\n\nWe strongly agree that we should address the exact solution that satisfies pDP. Thus, we additionally added more discussions of convergence in the BRD algorithm.\n\n- To reflect the comment, we moved the AE algorithm part into Appendix B on page 14, since AE is no longer our main focus."
                    }
                },
                "number": 8,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2502/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700533438014,
                "cdate": 1700533438014,
                "tmdate": 1700533438014,
                "mdate": 1700533438014,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "4rfFJY0jIJ",
                "forum": "ESt7ECoWpn",
                "replyto": "f0tT4W3jWD",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2502/Reviewer_HRkt"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2502/Reviewer_HRkt"
                ],
                "content": {
                    "comment": {
                        "value": "The answers address the reviewer's concerns and the reviewer would like to keep the positive scores for this work."
                    }
                },
                "number": 9,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2502/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700643018220,
                "cdate": 1700643018220,
                "tmdate": 1700643018220,
                "mdate": 1700643018220,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "QzVKwKlFnC",
            "forum": "ESt7ECoWpn",
            "replyto": "ESt7ECoWpn",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission2502/Reviewer_UXaT"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission2502/Reviewer_UXaT"
            ],
            "content": {
                "summary": {
                    "value": "This paper investigates the problem of computing good noise variances for a Laplace mechanism used to implement per-instance pure DP.  There is a well-known trade-off between the amount of noise and the level of privacy achieved, and so generally, the goal is to minimize the amount of noise required to achieve a certain privacy level. In the regular pure DP case in full generality, the amount of noise to be added is easily computed, but the per-instance definition leads to significant complications. \n\nThe authors frame this as a game and implement a best-response dynamics to compute a good noise variance. Results are compared in simulations to some baselines"
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "* The algorithm seems correct and intuitive\n* The performance does seem to be good when compared to baselines\n* The approximate enumeration baseline is as interesting as the main result"
                },
                "weaknesses": {
                    "value": "This paper certainly has its redeeming qualities, but the negatives cannot be ignored. I found this paper very difficult to read due to the poor writing and errors.\n\nI think the game theoretic framing is not meaningful. Perhaps it was included as a way to justify the optimization procedure. I would prefer if it was removed because I believe it does not add anything to the paper, but makes things more confusing.\n\nMy interpretation of what you are doing is setting two objective functions for both the utility and privacy, then you are optimizing their sum in a greedy way. With this understanding, I think this work falls below the standard for this venue. \n\nThere are some errors, even in very important mathematical statements, for example, as written, the LHS of (1) is always 0 since $z \\in \\mathcal{Z}$. I had to read the original reference to understand what pDP was. Please address this."
                },
                "questions": {
                    "value": "1.  Why did you decide to use a game-theoretic presentation? \n\n2. What does (1) mean, as the current statement seem meaningless?\n\n3.  What does it mean to take a union of vectors as in Algorithm 1?\n\n4. What is $\\mathbf{b}_j$ in the inner for loop of Algorithm 1?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission2502/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission2502/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission2502/Reviewer_UXaT"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission2502/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698703235019,
            "cdate": 1698703235019,
            "tmdate": 1699636186645,
            "mdate": 1699636186645,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "V65oAP9P7x",
                "forum": "ESt7ECoWpn",
                "replyto": "QzVKwKlFnC",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2502/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2502/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer UXaT (Part 1)"
                    },
                    "comment": {
                        "value": "Thank you for your valuable feedback on our manuscript. In light of your comments, we have added an explanation about our choice to use game-theoretic interpretations. While there are various approaches to introduce our work, such as optimization theory, we opted for the method we believed would be most accessible and familiar to our audience. We acknowledge that our initial explanation, particularly regarding Figure 1, had certain shortcomings. \nAlso, we change the vector-form data representation $\\mathbf{d}_i$ into a scalar representation $d_i$ for simplicity. Accordingly, we have revised the manuscript for improved clarity and a more effective presentation of our approach. We earnestly hope that these modifications will meet the reviewer's expectations and enhance the overall quality of our manuscript. In addition, we revised the fatal errors you pointed out.\n\n---\n\n**1. Use of game theory**\n> Comment: Why did you decide to use a game-theoretic presentation?\n\nWe are sincerely sorry for the complicated interpretation. \nWe use game-theoretic presentation because we think it is familiar to the audience.\nAs a result, the proposed algorithm is a greedy algorithm for updating each data instance’s additive noise.\nHere, we kindly note that we mainly contributed by showing the NE point of the NVO game guarantees the $\\epsilon$-pDP for all data instances, where the greedy algorithm cannot guarantee $\\epsilon$-pDP if Equation 9 does not hold.\n\nAlso, we note that the proposed work has the following challenges in optimization perspective.\n\nWe can represent the target optimization as a constraint problem.\n\n$$\\min U(\\mathcal{D}, \\mathcal{M}(\\mathcal{D})) ~~~ \\textnormal{s.t.} \\left|\\ln\\frac{\\Pr[\\mathcal{M}(\\mathcal{D}) \\in S]}{\\Pr[\\mathcal{M}\\textcolor{blue}{(\\mathcal{D} \\setminus \\{\\mathbf{d}\\})} \\in S]}\\right| \\leq \\epsilon, \\forall \\mathbf{d} \\in \\mathcal{D}, \\forall S\\in\\mathnormal{Range}(\\mathcal{M})$$\n\n- Initially, the continuous nature of the domain $S$ poses a unique challenge, differing from that in $\\epsilon$-DP. In this context, it's necessary to confirm the $\\epsilon$-pDP condition for each instance and each point within $S$, an endeavor impractical to accomplish in polynomial time. To address this issue, we have employed data categorization in our approach.\n- Furthermore, the variable $\\mathbf{b}_i$ exhibits both continuity and a complex interdependence. While gradient descent is a common technique for finding local optima in standard optimization problems, our situation is complicated by the constraint being a non-differentiable function, which makes typical projection methods ineffective. As a solution, we have opted to moderate the variance of $b$, thereby simplifying the problem.\n\nRegrettably, despite the desire to pivot the problem definition from game theory to optimization theory, substantial portions had already been developed centered on game theory. Fully acknowledging the difficulty in comprehending game theory-centric explanations, we extensively revised Section 4 of the paper, although every change cannot be highlighted. We made substantial modifications to enhance the clarity of explanations. We earnestly hope that these revisions bring greater satisfaction to your understanding.\n\nWe sincerely apologize for confusion, and we hope these revisions significantly enhance the paper's comprehensibility.\n\n---\n\n**2. Correction of Equation 1**\n> Comment: What does (1) mean, as the current statement seems meaningless?\n\nWe deeply apologize for an oversight in a crucial definition that permeates the entire paper. We sincerely appreciate your interest in our work.\nWe have rectified a fatal error in Definition 3.1 as follows.\n\nDefinition 3.1 ($\\epsilon$-pDP)\nA randomized mechanism, denoted by $\\mathcal{M}$, has a range $\\mathcal{R}(\\mathcal{M})$. For a fixed dataset $\\mathcal{Z}$ and a fixed data instance $z\\in\\mathcal{Z}$, the mechanism $\\mathcal{M}$ meets $\\epsilon$-pDP, if the following condition holds:\n\n$$\n\\bigg|\\ln\\frac{\\Pr[\\mathcal{M}(\\mathcal{Z}) \\in S]}{\\Pr[\\textcolor{blue}{\\mathcal{M}(\\mathcal{Z} \\setminus \\{z\\})} \\in S]}\\bigg| \\leq \\epsilon, ~ \\forall S \\subseteq \\textnormal{Range}(\\mathcal{M}).\n$$\n\n\nWe have uniformly rectified other sections to maintain consistency. \n\n**Remark:** The variance in mathematical notations compared to Wang (2019) lies in Definition 3.1. Consequently, it deals with the difference in probability of query outputs based on the presence or absence of a single data point, thus remaining equivalent meaning."
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2502/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700532620431,
                "cdate": 1700532620431,
                "tmdate": 1700532620431,
                "mdate": 1700532620431,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "EEqvkw89Av",
                "forum": "ESt7ECoWpn",
                "replyto": "QzVKwKlFnC",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2502/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2502/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer UXaT (Part 2)"
                    },
                    "comment": {
                        "value": "**3. Correction of Algorithm 1**\n> Comment: What does it mean to take a union of vectors as in Algorithm 1?\n> Comment: What is bj in the inner for loop of Algorithm 1?\n\nWe sincerely appreciate your corrections. The authors agree that the notation is really confusing. We deeply apologize for this typo in the explanation of the main algorithm. We corrected it to make the notations clearer.\n\n**Union of vectors in Algorithm 1**: \nThank you for this question. We have a mistake in this notation, we forgot to exploit the set notation. We replace $\\mathcal{D}=\\bigcup_{i=1}^{|\\mathcal{D}|}d_{i}$ by $\\mathcal{D}=\\set{d_{i}|i=1,...,m}$ \n\nand $\\mathcal{V} =\\bigcup_{i=1}^{|\\mathcal{V}|}{v_{i}}$ into $\\mathcal{V}=\\set{v_{i}|i=1,...,n}$.\n\n\n**$b_j$ in the inner for loop of Algorithm 1**: We apologize sincerely for the error in depicting $b$ (now $v$) as a vector when it should have been a scalar. To clarify, $b_j$ (now $v_j$) refers to the variance value corresponding to the $j$-th element in the variance set $\\mathcal{V} = \\set{v_{1}, v_{2}, …, v_{n}}$."
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2502/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700533247023,
                "cdate": 1700533247023,
                "tmdate": 1700533256795,
                "mdate": 1700533256795,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "tj65oXqp8I",
            "forum": "ESt7ECoWpn",
            "replyto": "ESt7ECoWpn",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission2502/Reviewer_xkkw"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission2502/Reviewer_xkkw"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes an algorithm for optimizing the additive noise variances for achieving per-instance differential privacy, and then demonstrates the algorithm's performance on real data sets."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "1 poor"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "* The game-theoretic formulation of noise distribution optimization for DP (and variants of DP) is a new idea, to the best of my knowledge.\n* There is an extensive set of experiments assessing the performance of the proposed algorithm and comparing with existing noise addition algorithms."
                },
                "weaknesses": {
                    "value": "* Lack of problem formulation. A central premise of the paper is that \"ensuring pDP for a particular data instance is inherently dependent on the noise distribution of other instances\". However the claim is not formulated in mathematical terms, making the paper difficult to follow for those readers who are not already convinced of this claim before reading the paper. The lack of problem formulation also makes it confusing why existing noise mechanisms (for example the per instance Gaussian mechanism in Wang (2019)) are not desirable.  \n\n* Ambiguous scope. The first 2.5 pages of the paper give an impression that the new noise addition mechanism, similar to the Laplace mechanism for DP, is suitable for general queries, but on page 3 it is then stated that \"we focus on the random sampling query\" and $q$ is defined to be the random sampling query. Later, in Remark 4.1 on page 4, the utility function uses $q$ to refer to generic queries. It is ambiguous whether the paper's results are applicable to queries other than the random sampling query.\n\n* Some minor issues: \n     * In \"Relation to ($\\epsilon, \\delta$)-DP\" under Section 2, the citation for Gaussian mechanism is incorrect: Dwork and Roth (2014) is an expository work; the Gaussian mechanism appeared in the literature much earlier. \n     * The definition of pDP is imprecise. Compared to the original definition in Wang (2019), Definition 3.1 in this paper does not explicitly fix the data set $\\mathcal Z$\n    * There is an incorrect statement above Definition 3.2: pDP holding for \"every $z$ within $\\mathcal Z$\" does not guarantee DP, if the data set $\\mathcal Z$ is fixed."
                },
                "questions": {
                    "value": "* Can you formulate the difficulty of optimizing noise distribution for pDP in mathematical terms? What target is being optimized? What is the relation of your work to, for example, the Gaussian mechanism in Wang (2019)?\n\n* Is your work, in the present form, limited to the random sampling query?\n\n* Is the algorithm in Section 5.2 trying to find an approximate instead of an exact solution? If so, does the pDP guarantee hold for the approximate solution? It appears that we only know from Theorem 4.1 that the exact solution satisfies pDP."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission2502/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698865261834,
            "cdate": 1698865261834,
            "tmdate": 1699636186580,
            "mdate": 1699636186580,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "DnBnXSjSRB",
                "forum": "ESt7ECoWpn",
                "replyto": "tj65oXqp8I",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2502/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2502/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer xkkw (Part 1)"
                    },
                    "comment": {
                        "value": "We greatly appreciate the constructive feedback on our manuscript. In response, we have first introduced an optimization problem and explored the challenges associated with solving it. Additionally, we've expanded our analysis to include the applicability of our approach to general statistical queries. Regarding the approximated enumeration (AE) method, we acknowledge that, unlike the Best Response Dynamics (BRD) algorithm, AE cannot mathematically guarantee an exact Nash Equilibrium (NE) within a finite time frame. To address this, we have shifted our focus in the main manuscript to emphasize the BRD algorithm over AE. The detailed discussion on AE has been moved to Appendix B. We sincerely hope that the reviewer will be satisfied with the changes we made in the revised manuscript.\n\n--- \n\n**1. Problem formulation should be addressed.**\n> Comment: Can you formulate the difficulty of optimizing noise distribution for pDP in mathematical terms? What target is being optimized? What is the relation of your work to, for example, the Gaussian mechanism in Wang (2019)?\n\nAnswer: Thank you for this suggestion. To comply with the comment, we first added the following optimization problem in the main paper.\n\n$$\\min U(\\mathcal{D}, \\mathcal{M}(\\mathcal{D})) ~~~ \\textnormal{s.t.} \\left|\\ln\\frac{\\Pr[\\mathcal{M}(\\mathcal{D}) \\in S]}{\\Pr[\\mathcal{M}(\\mathcal{D} \\setminus \\{d\\}) \\in S]}\\right| \\leq \\epsilon, \\forall d \\in \\mathcal{D}, \\forall S\\in\\mathrm{Range}(\\mathcal{M})$$\n\nwhere the objective function minimized represents the distributional difference between $q(\\mathcal{D})$ and $q(\\mathcal{M}(\\mathcal{D}))$, with various metrics available. \n\nOur primary focus is on addressing the constraint of the problem, namely $\\epsilon$-pDP. Consider the term $\\left|\\ln\\frac{\\Pr[\\mathcal{M}(\\mathcal{D}) \\in S]}{\\Pr[\\mathcal{M}(\\mathcal{D} \\setminus \\{d\\}) \\in S]}\\right|$.\n\n- First, the domain of $S$ is continuous, which presents a challenge distinct from that in $\\epsilon$-DP. Here, we must verify the $\\epsilon$-pDP condition for each instance and each point within $S$, a task that is not feasible within polynomial time. To overcome this, our method incorporates data categorization.\n- Second, the variance parameter $v$ is continuous and intricately interlinked. In typical optimization problems, gradient descent is utilized to identify a locally optimal solution. However, in our case, the constraint represents a non-differentiable function, rendering common projection methods unsuitable. Therefore, we relax the diversity of $v$ to simplify and solve the problem effectively.\n\nWe propose an NVO game, designed based on a relaxed version of our initial problem. Despite this relaxation, ensuring $\\epsilon$-pDP remains a significant challenge. In Theorem 4.1, we demonstrate that our proposed NVO game successfully achieves $\\epsilon$-pDP, provided that the condition (9) is met.\n\n**Relation to $\\epsilon$-pDP study :**\nWang's (2019) study drew attention to the varying levels of privacy protection in data instances when the same noise is added to each query output. However, it primarily focused on identifying and analyzing these issues, **without offering concrete solutions**. In contrast, our paper represents a pioneering effort in this field. We **formulate and address a problem that involves optimizing the addition of distinct noises to individual data instances**. This approach ensures a uniform level of pDP throughout the dataset while maintaining its statistical utility. We appreciate your feedback highlighting this critical aspect of our work. Accordingly, we have revised the paper to more prominently feature this significant contribution.\"\n\n- We have revised statements to reflect this discussion. (please refer to Section 1 on page 1, and Section 4.1 on page 4)"
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2502/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700531981627,
                "cdate": 1700531981627,
                "tmdate": 1700532304972,
                "mdate": 1700532304972,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "rvqs4m3LZx",
                "forum": "ESt7ECoWpn",
                "replyto": "tj65oXqp8I",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2502/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2502/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer xkkw (Part 2)"
                    },
                    "comment": {
                        "value": "**2. Extensibility to other queries.**\n> Comment: Is your work, in the present form, limited to the random sampling query?\n\nAnswer: **It is definitely possible. The random sampling query is a fundamental query that encompasses all possible statistical queries.** More specifically, the random sampling query can capture the statistical distribution of a dataset. Therefore, based on the post-processing theorem, our proposed NVO game can answer all statistical queries that rely on this distribution. \n\n**Example:** Let's consider the NBA player height dataset. Suppose the query asks for the proportion of players with a height of 203 cm or above. In this scenario, we can derive the response from the distribution of the modified dataset through random sampling queries. In the original height dataset, the proportion of players with a height of 203 cm or above is 49.16%. If one player who is 210 cm tall is removed from the dataset, the proportion changes to 49.08%, with the difference being only 0.08%. However, after applying our algorithm, the calculated proportions are 48.84% with the player and 48.80% without the player.\n\n- To comply with the comment, we have added Remark 3.1 on page 3, and a new discussion in Section 7 on page 9 (paragraph **Extensibility to other queries**).\n\n---\n\n**3. Guarantees of AE algorithms for the NE.**\n\n> Comment: Is the algorithm in Section 5.2 trying to find an approximate instead of an exact solution? If so, does the pDP guarantee hold for the approximate solution? It appears that we only know from Theorem 4.1 that the exact solution satisfies pDP.\n\n**AE Algorithm**: With **ample time**, the AE algorithm has the potential to match the performance of the exact enumeration algorithm and attain an NE point. Our experiments continued for an extended period to ensure convergence. Nevertheless, there is **no theoretical guarantee** that an **NE point is achievable within polynomial time**. In the updated version of our manuscript, we have relocated the specifics of **the AE algorithm to Appendix B**. It is important to mention that this algorithm was included to evaluate the performance of a non-greedy approach in our proposed NVO game when given ample computational time.\n\nWe strongly agree that we should address the exact solution that satisfies pDP. Thus, we additionally added more discussions of convergence in the BRD algorithm.\n\n- To reflect the comment, we moved the AE algorithm part into Appendix B on page 14 and added this discussion.\n\n---\n\n**4. Minor issues**\n> Comment: In \"Relation to (e, delta)-DP\" under Section 2, the citation for Gaussian mechanism is incorrect: Dwork and Roth (2014) is an expository work; the Gaussian mechanism appeared in the literature much earlier.\nAnswer: We have revised the sentence to comply with the comment. \n- Page 2: The pioneer of DP, Dwork & Roth (2014), defined (ϵ, δ)-DP, demonstrating that the Gaussian mechanism can achieve this definition.\n\n\n> Comment: The definition of pDP is imprecise. Compared to the original definition in Wang (2019), Definition 3.1 in this paper does not explicitly fix the data set Z.\n\nAnswer: Thank you for your careful comment. We added **fixed** dataset $\\mathcal{Z}$ in the Definition 3.1.\n\n- Please refer to Definition 3.1 to see the changes.\n\n> Comment: There is an incorrect statement above Definition 3.2: pDP holding for \"every $z$ within $\\mathcal{Z}$\" does not guarantee DP, if the data set $\\mathcal{Z}$ is fixed.\n\nAnswer: Thank you for this clarification again. To correct the statement, we have added a new condition “for all dataset $\\mathcal{Z}$”.\n- Please refer to statements below Equation 1 and Equation 9."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2502/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700532285467,
                "cdate": 1700532285467,
                "tmdate": 1700532285467,
                "mdate": 1700532285467,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "OpZPq40fAh",
            "forum": "ESt7ECoWpn",
            "replyto": "ESt7ECoWpn",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission2502/Reviewer_eCZ8"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission2502/Reviewer_eCZ8"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposed a game theoretical approach to achieve data dependent privacy guarantees. Specifically, based on the per-instance differential privacy (pDP) definition, a per-instance noise variance optimization (NVO) game is designed and the Nash equilibrium (NE) guarantees DP. An approximate enumeration (AE) algorithm or a best response dynamics (BRD) algorithm can be used to solve the Nash equilibrium."
                },
                "soundness": {
                    "value": "4 excellent"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "As far as I know, the game theoretical approach for per-instance DP is new. The proposed approach looks technically solid. The privacy utility trade-off of pDP is better than the baseline Laplace \\epsilon-DP."
                },
                "weaknesses": {
                    "value": "Unfortunately, I am not an expert on either game theory or per-instance DP, so I would rather use this opportunity to ask questions below. \n\nIn general, my questions are around intuition, experiments and baseline methods."
                },
                "questions": {
                    "value": "Could the authors provide more intuition of theorem 4.1: e.g., why does it hold intuitively; how realistic is condition (8)? \n\nCould the authors comment on the guarantees of AE and BRD Algorithms in Section 5 for the NE? Please provide necessary intuition, or properly cite references if it is well known. \n\nIn Section 6 Experiment, it would be nice to actually verify the per-instance \\epsilon is achieved using the game theoretical algorithms; the dataset does not seem to be large, and I would hope to see some discussion on the scalability of the approach. \n\nFinally, I am a little surprised that the only baseline is the worst-case \\epsilon-DP with Laplace noise. Are there no other pDP or data dependent DP methods to compare with?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission2502/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698990591008,
            "cdate": 1698990591008,
            "tmdate": 1699636186462,
            "mdate": 1699636186462,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "ysOVYs0TXH",
                "forum": "ESt7ECoWpn",
                "replyto": "OpZPq40fAh",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2502/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2502/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer eCZ8 (Part 1)"
                    },
                    "comment": {
                        "value": "We sincerely appreciate your constructive feedback on our manuscript. To follow the comments, we mainly revised the manuscript by newly adding 1) intuition of Theorem 4.1, 2) guarantee of convergence to NE, and 3) experimental results for a large dataset. Also, we re-checked existing studies and found that there has been no data-instance-wise pDP mechanism. The point-by-point responses are given below. We believe that the revised manuscript can be more insightful to future readers.\n\n\nThank you sincerely.\n\n---\n\n**1. Intuition of Theorem 4.1.**\n> Comment: Could the authors provide more intuition of theorem 4.1: e.g., why does it hold intuitively; how realistic is condition (8)?\n\nAnswer: To follow your suggestion, we bring Equation 9 (Eq. 8 in the original manuscript) here:\n\n$$\nb_{\\min}\\ge\\frac{1}{\\log(1+(|\\mathcal{D}|-1)(\\exp(\\epsilon)-1))}.\n$$\n\n**Intuition**: From the above equation, as the value of $|\\mathcal{D}|$ increases, we require smaller variance noise for guaranteeing $\\epsilon$-pDP. Intuitively, it is evident that the more data instances there are in the dataset, the less influence each individual data instance has. On the other hand, if $\\epsilon$ reaches zero, the query output with and without a data instance should be statistically the same. In other words, adding noise that tends toward infinite variance becomes necessary, resembling a uniform distribution of noise.\n\n- This discussion is added in Remark 4.2 on page 6.\n\n**Realistic variance values**: In Theorem 4.1, the value of $b_{\\min}$ is sufficiently realistic but also smaller than the noise added in the Laplace mechanism. For example, Apple is known to use $\\epsilon$-DP with epsilon values ranging between 2 and 8 [(link).](https://www.apple.com/privacy/docs/Differential_Privacy_Overview.pdf) \nIf the smallest $\\epsilon$ is given, i.e., $\\epsilon=2$, the Laplace mechanism has an additive noise with the variance parameter of $1/\\epsilon=0.5$, where the sensitivity is one. However, in Theorem 4.1, the proposed NVO game has a minimum value of variance parameter $b_{\\min}$ by 0.263 for a dataset of size of 1,000. \nWe kindly note that the variance is reduced as the dataset size increases, e.g., $b_{\\min}=0.208$ for a dataset size of 10,000.\n\n- This discussion is added in Appendix C.1 on page 15.\n\n---\n\n**2. Guarantees of AE and BRD algorithms for the NE.**\n> Comment: Could the authors comment on the guarantees of AE and BRD Algorithms in Section 5 for the NE? Please provide necessary intuition, or properly cite references if it is well known.\n\n**BRD Algorithm**: The authors have referenced [R1] in the revised manuscript, indicating that the BRD algorithm converges to an NE point for games falling into specific categories: potential games, weakly acyclic games, aggregative games, and quasi-acyclic games. Given that the NVO game is categorized as a potential game, the BRD algorithm effectively reaches an NE point for this game.\n\n**Intuition of BRD Algorithm toward NE**: The authors kindly inform that the intuition is in **BRD Algorithm in potential game** in Section 5. We bring the corresponding statements here. “Intuitively, as players opt for their best responses, either sequentially or simultaneously, the potential function's value rises, eventually peaking. The strategy at this peak is the game's NE.”\n- The intuition of the BRD algorithm’s convergence has been relocated to the paragraph **Convergence of BRD toward NE** on page 6.\n\n[R1] Boucher, Vincent, Selecting Equilibria Using Best-Response Dynamics (September 1, 2017). CRREP Working Paper Series 2017-09, Available at SSRN: https://ssrn.com/abstract=3175335 or http://dx.doi.org/10.2139/ssrn.3175335\n\n**AE Algorithm**:  Given ample time, the AE algorithm can perform equivalently to the enumeration algorithm, thereby reaching an NE point. We ran experiments for a sufficient duration until convergence was achieved. However, it has not been theoretically proven that an NE point can be obtained in polynomial time. In the revised manuscript, we relocate the details of AE into Appendix B. We kindly note that we add this algorithm to know the performance of a non-greedy algorithm in the proposed NVO game with sufficient computation time.\n\n- We relocated the section of the AE algorithm (Section 5.2) in Appendix B."
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2502/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700531633931,
                "cdate": 1700531633931,
                "tmdate": 1700531633931,
                "mdate": 1700531633931,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "q92820z3H2",
                "forum": "ESt7ECoWpn",
                "replyto": "OpZPq40fAh",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2502/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2502/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer eCZ8 (Part 2)"
                    },
                    "comment": {
                        "value": "**3. Verification of $\\epsilon$-pDP on a larger dataset for showing scalability**\n> Comment: In Section 6 Experiment, it would be nice to actually verify the per-instance ε is achieved using the game theoretical algorithms; the dataset does not seem to be large, and I would hope to see some discussion on the scalability of the approach.\n\nAnswer: Thank you for this suggestion. We kindly remind you that we have shown that the proposed NVO game can achieve $\\epsilon$-pDP for all datasets if condition (9) is satisfied. From the obtained condition, larger datasets require lower minimum variance to guarantee $\\epsilon$-pDP, as the significance of each data instance is getting smaller. \n\nOn the other hand, practically, we strongly agree with the reviewer that the experimental results lack the scalability of larger dataset. Thus, we added new experimental results in Appendix F. From the newly added experiments, we confirm that the proposed NVO game still works well and outperforms the baseline mechanisms.\n\n- We have added new experimental results in Appendix F on page 20. Please refer to newly added figures and table: Table 5, Figure 11, Figure 12, and Figure 13.\n\nNew Discussion for Limitation: In addition to presenting new results, we also discuss the limitations of our work when applied to large datasets. For extremely large datasets, our proposed method incurs high-order computational complexity for the $\\epsilon$-pDP guarantee, scaling as $O(|\\mathcal{D}|^2)$. To mitigate this, one approach could be to group data points with identical query outputs, allowing for computational reduction through the addition of uniform noise. \n\n- We have reflected this discussion in Section 7 on page 9 (**Limitation** paragraph), and Appendix F.2 on page 22.\n\n---\n\n**4. Additional baseline methods**\n> Comment: Finally, I am a little surprised that the only baseline is the worst-case ε-DP with Laplace noise. Are there no other pDP or data-dependent DP methods to compare with?\n\nAnswer: Thank you for this suggestion. Upon thorough review of existing studies, we confirm that while numerous algorithms exist for ensuring DP, none have yet introduced per-instance noise or pDP-inspired mechanisms. It is important to highlight that our proposed NVO game represents the first initiative to address per-instance noise mechanisms grounded in the pDP concept.\n\n- We have revised Section 1 on page 1 to highlight our contribution related to this comment."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2502/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700531663323,
                "cdate": 1700531663323,
                "tmdate": 1700531663323,
                "mdate": 1700531663323,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]