[
    {
        "title": "DynaEval: A Dynamic Interaction-based Evaluation Framework for Assessing LLMs in Real-world Scenarios"
    },
    {
        "review": {
            "id": "5GSR1Cv0ze",
            "forum": "f7PmO5boQ9",
            "replyto": "f7PmO5boQ9",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission5534/Reviewer_EKE2"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission5534/Reviewer_EKE2"
            ],
            "content": {
                "summary": {
                    "value": "The authors propose a novel framework for evaluating LLMs in goal-driven, multi-agent, and multi-turn settings called DynaEval. They motivate their approach by pointing out the gap between the existing benchmarks and how LLMs will be used in the wild, which is in interaction with other humans/agents/LMs in which they try to achieve a final goal (be it a common goal or a personal one).\n\nIn the first step, they propose what they believe to be the common ground of such real-world interaction processes to create a unified definition. They call this the Interaction process of DynaEval, which mainly consists of an interaction goal and an interaction rule. They then draw a relationship between this interaction process and extensive games with perfect information (not described in the paper). Furthermore, they then enforce the anonymity and perfect information rules from EGPI on the DynaEval interaction process in order to overcome the stability and fairness issues that they identified.\n\nNext, they explain the structure of the DynaEval process implementation, which consists of a referee, a message pool, and a synchronous interaction algorithm. The authors then explain the implementation of 4 games to evaluate the LLMs with.\n\nFinally, they do experiments with to compare 4 existing LLMs in the aforementioned games under the DynaEval process. The authors claim that GPT-4 is superior in 3 out of the 4 games and ChatGPT (I'm assuming that means GPT-3.5?) is superior in the remaining one."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "1 poor"
                },
                "strengths": {
                    "value": "- Attempting to go beyond the simple static framework of evaluation for LLMs, trying to bring the evaluation setting closer to reality of how these models will be used\n- I quite liked the idea of using games to evaluate LLMs, since even though the games can be quite complex, the evaluation criteria can be pretty simple and mechanistic"
                },
                "weaknesses": {
                    "value": "1. My first issue with the paper is clarity:\n\n    a. Even though EGPI seems to be a central concept in their paper, the authors do not even explain what it is. They simply brush over it by adding a citation. I wouldn't expect more than a small minority of the audience at ICLR to be familiar with this concept.\n\n    b. The DynaEval interaction process doesn't seem quite natural and it's not explained from where the \"interaction goal\" and \"interaction rule\", which are supposed to be defining characteristics of these processes, come from. If I had to guess, I would think that the \"definition\" came as a result of trying to match EGPI definition with the DynaEval process and not the other way around.\\\n\n    c. The equations (1) and (2) seem totally out of place in the paper. Honestly, I'm not sure what role they play in explaining any of the concepts. Are they just there to explain the concept of sampling, or are they there simply to provide a \"scare factor\"?\n\n2. Another point of contention is statistical significance:\n\n    a. Looking at Figure 3. Both Figures 3.a and 3.b show a set of highly overlapping distributions. The medians of the top contenders in 3.a are barely distinguishable even, however the conclusion that section 3.2 notes is that GPT-4 performs best is mode 1. It seems to me like the authors are making claims without regard to statistical significance of their results.\n    b. The same is true in Table 2: the difference between GPT-4 (8.77) and ChatGPT (8.74) seems negligible, but that is not reflected in the conclusions of the text\n\n\n3. I'm not sure of the utility of many parts of the proposal:\n\n    a. I'm not convinced that DynaEval framework itself brings anything to the table. I get the utility of using games as evaluation methods, which is a good idea depending on the implementation, but the framework itself doesn't quite bring anything to the table IMO.\n\n    b. The games seem odd, and it's not obvious what capability of the model they are trying to measure. For example, I'm not even sure it makes sense for the Code G&R and the Machine Translation games to actually be turn-based games. As I said, I do see why games can be useful, but the devil is in the details"
                },
                "questions": {
                    "value": "I ended up aggregating questions in the weaknesses section as it made more sense."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission5534/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698817313345,
            "cdate": 1698817313345,
            "tmdate": 1699636567724,
            "mdate": 1699636567724,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "DeBgTpCXt2",
                "forum": "f7PmO5boQ9",
                "replyto": "5GSR1Cv0ze",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5534/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5534/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Reply to Reviewer EKE2 (1-Part 1)"
                    },
                    "comment": {
                        "value": "We would like to thank you very much for the detailed feedback and valuable suggestions.\n\nThe “ChatGPT” in experiments means GPT-3.5-turbo. Sorry for the confusion. We will clarify this in the new version of our paper.\n\nW1.a. Even though EGPI seems to be a central concept in their paper, the authors do not even explain what it is. They simply brush over it by adding a citation.\n\nA1. a. Thank you for your question. We explained EGPI in our paper in p3 (after the citation), and introduced the formal definition of EGPI in Appendix A.2. Due to the page limitation, we did not place the definition and detailed explanation of EGPI in the main body of this paper.\n\nW1.b. The DynaEval interaction process doesn't seem quite natural and it's not explained from where the \"interaction goal\" and \"interaction rule\", which are supposed to be defining characteristics of these processes, come from.\n\nA1.b. As mentioned in the first paragraph of Section 2.2, it should be noticed that the definition of dynamic interaction is totally based on our observation of real-world dynamic interaction rather than matching with EGPI. The relationship between DynaEval and EGPI is an accidental discovery, and we find that EGPI can help us to standardize the evaluation of LLMs. Indeed, the “interaction goal” and “interaction rule” are common denominators of dynamic interactions and are sufficient to depict the former. For example, the review-rebuttal process of ICLR is a dynamic interaction scenario, which can be completely depicted by interaction goals (of reviewers and authors) and interaction rules. For reviewers, their interaction goal is to accept high-quality papers and reject low-quality papers and to help improve the quality of papers. For authors, their interaction goal is to explain to and discuss with reviewers to maximize the probability of publishing their paper at this conference and also improve the quality of their paper. The interaction rule of the review-rebuttal process is that reviewers first give their original reviews of submitted papers, and then reviewers and authors can freely discuss the paper during the rebuttal phase. \n\nW1.c. The equations (1) and (2) seem totally out of place in the paper. Honestly, I'm not sure what role they play in explaining any of the concepts. Are they just there to explain the concept of sampling, or are they there simply to provide a \"scare factor\"?\n\nA1.c. Thank you for your doubt. The equations (1) and (2) aim to model and alleviate the uncertainty of LLMs’ performance in dynamic interaction-based evaluation, which is significant in LLM evaluation. As shown in our experiments, the performance of LLMs is unstable and can fluctuate given different interaction environments. Unlike traditional supervised signal-based evaluations where the environment (context) is static, the environment of dynamic interaction-based evaluation is itself dynamic, thus magnifying the uncertainty of LLMs’ performance. Therefore, it is indispensable to formally model the performance of LLMs with “uncertainty” and to alleviate the effect of uncertainty on evaluation results. As a result, rather than modeling the performance of LLMs by deterministic values, we find that modeling by random variables is more suitable for this problem and utilize equations (1) and (2) to present how our method models and alleviates the uncertainty of LLMs’ performance in the evaluation process.\n\nW2.a. Both Figures 3.a and 3.b show a set of highly overlapping distributions. The medians of the top contenders in 3.a are barely distinguishable even, however the conclusion that section 3.2 notes is that GPT-4 performs best is mode 1. It seems to me like the authors are making claims without regard to statistical significance of their results. \n\nA2.a. Thank you for your constructive suggestion. Statistical significance can be used to test whether specific features of random variables (e.g., expectation) are different. In our paper, statistical significance is not used for two reasons. First, one indispensable assumption of most hypothesis testing methods (e.g., t-test and chi-square test) is that random variables should follow a family of distributions like normal distribution. Although this assumption is valid in many real-world scenarios (e.g., a person’s height), it is unconfirmed for the random variable of an LLM’s performance, and there is still a lack of research on the statistical property of LLMs’ performance. As a result, we cannot ensure whether the statistical significance itself is correct. Second, rather than to “rank the ability of different LLMs”, we aim to use DynaEval to “discover and depict the ability of different LLMs using evaluation”. Therefore, we presented the difference in LLMs’ performances in terms of average score and stability (the range of the box) in the text of Section 3.2. Following your constructive suggestion, we will discuss more about the performances of LLMs in the next version of our paper."
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5534/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1699848044803,
                "cdate": 1699848044803,
                "tmdate": 1699958194319,
                "mdate": 1699958194319,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "D5JPfduKeY",
                "forum": "f7PmO5boQ9",
                "replyto": "5GSR1Cv0ze",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5534/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5534/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Reply to Reviewer EKE2 (1-Part 2)"
                    },
                    "comment": {
                        "value": "W2.b. The same is true in Table 2: the difference between GPT-4 (8.77) and ChatGPT (8.74) seems negligible, but that is not reflected in the conclusions of the text.\n\nA2.b. Thank you for your constructive suggestion. As explained in A2.a, we will supplement more discussion about performance of LLMs in Code G&R (especially Table 2) in the next version of our paper.\n\nW3.a. I'm not convinced that DynaEval framework itself brings anything to the table.\n\nA3.a. Thank you for your doubt. As you mentioned, using games as evaluation methods depends on the implementation. One challenge in this process is that games can differ a lot in many aspects such as the number of participants, role design, game rule, etc., and are hard to standardize. As a result, many existing works about LLMs’ performance in games (e.g., [1], [2]) only focus on a specific game and cannot be extended to other games or scenarios. Indeed, one contribution of DynaEval is that it provides a standardized modeling method of all kinds of games using “interaction goals” and “interaction rules” and provides a general framework for running all these games and evaluating the ability of LLMs, as mentioned in A1.b. With this framework, researchers need not waste their time on designing a specific system for running a specific game, but focus more on the properties of the game itself such as what to evaluate (which can be reflected in the interaction goals and interaction rules).\n\nW3.b. The games seem odd, and it's not obvious what capability of the model they are trying to measure. For example, I'm not even sure it makes sense for the Code G&R and the Machine Translation games to actually be turn-based games. As I said, I do see why games can be useful, but the devil is in the details.\n\nA3.b. Thank you for your doubt. As mentioned above, DynaEval is a general framework for running all kinds of games and evaluating LLMs, and “what ability to measure” depends on **the design of games**, which is decided by users of DynaEval. Generally, we can categorize the abilities of LLMs into “fundamental” abilities and “domain-specific abilities”. Fundamental abilities are necessary for all kinds of dynamic interactions between LLMs, such as the ability to understand and reasoning. Domain-specific abilities are required by specific domains or tasks, such as the ability to generate logically correct and well-styled codes in code generation. The design of evaluation tasks can decide the domain-specific abilities to evaluate. For example, as introduced in Section 2.4, p6 in our paper, the Code G&R evaluates the code generation ability of programmer LLMs and the code review ability of reviewer LLMs. In real-world scenarios, users of DynaEval can design their own evaluation tasks to evaluate their required domain-specific abilities of LLMs.\n\n[1] Yuzhuang Xu, Shuo Wang, Peng Li, Fuwen Luo, Xiaolong Wang, Weidong Liu, & Yang Liu. (2023). Exploring Large Language Models for Communication Games: An Empirical Study on Werewolf.\n\n[2] Shenzhi Wang, Chang Liu, Zilong Zheng, Siyuan Qi, Shuo Chen, Qisen Yang, Andrew Zhao, Chaofei Wang, Shĳi Song, & Gao Huang. (2023). Avalon's Game of Thoughts: Battle Against Deception through Recursive Contemplation."
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5534/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1699848139735,
                "cdate": 1699848139735,
                "tmdate": 1699848139735,
                "mdate": 1699848139735,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "aAszr05OG4",
                "forum": "f7PmO5boQ9",
                "replyto": "D5JPfduKeY",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5534/Reviewer_EKE2"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5534/Reviewer_EKE2"
                ],
                "content": {
                    "title": {
                        "value": "Acknowledging Response - Not convinced"
                    },
                    "comment": {
                        "value": "I thank the authors for their response.\nUnfortunately, I am still not convinced by the responses to my questions. In general, I'll be hard-pressed to find the actual novelty an added value in many aspects of the paper.\n\n(W1.b) Agreed, I retract my comment about the interaction goals and rules not being natural. I'm having a hard time putting my thoughts about this into words and that's on my not the authors.\n\n(W1.c) I still find equations (1) and (2), as well as the surrounding text, to have very little added information.\n  -  Not being able to \"directly measure\" the ability of any models, not just LLMs is a given in the ML field in general. For example, the authors say \"... rather than modelling the performance of LLMs by deterministic values, we find that modelling by random variables is more suitable ...\". Yes, that's true, but it's also true of all ML models. Even in the classical classification setting, we assume (or hope rather) to have IID samples in the form of a test set. I acknowledge that due to the changing nature of the environment, the sources of randomness are increased, but that doesn't seem to be the point of this section.\n  - Modelling, usually involves definitions and aims to create usable conclusions, but here the conclusion seems to be \"Condition 2\" which, if looked at pessimistically, only says that when evaluating LLMs we need more than one samples (N > 1). That's just not good enough.\n\n(W1.a) Given the amount of space that I find (in my opinion) being wasted on the previously mentioned content, I'm surprised the authors couldn't spare a few lines or a paragraph to at least summarize the formal definition of EGPI and contrast it with possible other options that they didn't pick.\n\n(W2.a) The paper proposes an evaluation method, then presents some results. But when it comes to interpreting the results, with this response, the authors (in my opinion) are just throwing their hands up in the air and saying, sorry since these we are measuring random variables, we cannot compare them in any way.\n  - First, if that's true, you just admitted to the whole framework being useless. What good is an \"evaluation framework\" who's results cannot be interpreted? And why are you interpreting them if you just admitted that you cannot?! What good is a \"random ranking system\"?\n  - Second, I think the authors could at least make some attempt at rectifying the situation, by actually \"modelling\" the random variables (which equations (1) and (2) don't do correctly). For example, you could try to find the conditions which would result in each measurement/observation being IID. In that case, you could use the law of large numbers and claim that in aggregate your measurement follows a normal distribution for which a statistical significance test *can* be used.\n\n(W3.a and W3.b) I can see the paper having three main contributions: 1) The framework itself, 2) the choice/design of games, 3) the evaluation results performed comparing different models. However, I'm very doubtful of all three aspects of the paper (in the reverse order):\n  - Evaluations: already expressed doubts about statistical significance, to which I believe you replied by saying that the significance cannot be measured and hence the results are almost useless.\n  - Choice of games: I believe you said that this is up to the users of DynaEval, hence the games themselves are just stand-ins and of no real value\n  - Dismissing the framework itself is harder for me, but I'm still not convinced there is anything new or of significance here. I admit that some *works of genius* can seem so obvious after the fact that they can be dismissed unjustly, but I doubt that's what is happening here."
                    }
                },
                "number": 12,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5534/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700704739962,
                "cdate": 1700704739962,
                "tmdate": 1700704739962,
                "mdate": 1700704739962,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "DrEnZeXkP4",
            "forum": "f7PmO5boQ9",
            "replyto": "f7PmO5boQ9",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission5534/Reviewer_U79L"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission5534/Reviewer_U79L"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes DynaEval, an interaction-based evaluation framework for evaluating LLMs. DynaEval employs a referee and a message pool in the evaluation process. The authors claim that by this design, the evaluation ensures fairness and stabability. They also discuss the relation between the proposed evaluation procedure and the extensive-form games."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. This paper is very well written and easy to follow. The examples given in the paper help people to understand the procedures of DynaEval. \n2. The problem is well motivated. Indeed existing LLM evaluation frameworks rely on high-quality datasets or human judgement, therefore it is necessary to develop novel frameworks to evaluate their ability of interaction."
                },
                "weaknesses": {
                    "value": "Although this paper targets an interesting problem and the presentation is great, I find that the real contribution of this paper is limited or unclear.\n\nFirst, the proposed DynaEval framework lacks a specific evaluation goal since the \"ability of interaction\" is too big. DynaEval focuses on the interaction BETWEEN LLMs, whereas I think the \"ability of interaction\" of LLMs should focus more on the interaction BETWEEN LLMs and HUMAN USERs. In other words, we care more on whether an LLM could understand user intentions and help to execute tasks.Therefore, the ability of interaction should include the ability of understanding, questioning, reasoning or even tool using. I am not sure what specific ability can DynaEval evaluate. The authors may argue that DynaEval is a general framework to evaluate all of these abilities. But I think that is not the core challenge of evaluating LLMs. \n\nSecond, I did not find anything novel in DynaEval except the referee. The paper tries to standardize the interaction process and spends many words to emphasize the fairness and stability, and hence propose a synchronous interaction algorithm which ensures anonymity and multiple indenpendent runnings. However, I think most of them are common senses in many evaluation tasks. For example, if we are evaluating several recommendation models, it is very natural to use the same test set (fairness) and run multiple times (stability). Therefore, I did not find much novelty of DynaEval.\n\nThird, the paper tries to build a close relation between DynaEval and extensive-form games with perfect information (EGPI). But I did not see necessity of doing this.  The authors claim that game theory helps to overcome fainess and stability by introducing anonymity and synchronicity. But I think this is unconvincing. Because the concepts of anonymity and synchronicity are not exlusive to game theory. In fact, EGPI can describe a very broad range of interaction scenarios, therefore it is not surprising that the procedures of DynaEval belong to EGPI. But it should be interesting if DynaEval shares some characteristics of EGPI, such as the existence of equilibrium."
                },
                "questions": {
                    "value": "In the example of IDIOMS SOLITAIRE, which specific ability are you testing? From my point of view, winning LLM should have seen more idioms so that it can come up with an answer easily. But does this has anything to do with \"interaction\"?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission5534/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698917643433,
            "cdate": 1698917643433,
            "tmdate": 1699636567625,
            "mdate": 1699636567625,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "X5mrUGse9L",
                "forum": "f7PmO5boQ9",
                "replyto": "DrEnZeXkP4",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5534/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5534/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Reply to Reviewer U79L (1)"
                    },
                    "comment": {
                        "value": "We would like to thank you very much for the detailed feedback and valuable suggestions.\n\nW1. The proposed DynaEval framework lacks a specific evaluation goal since the \"ability of interaction\" is too big.\n\nA1. Thank you for the question. We agree with the opinion that LLM evaluation should focus on specific abilities. As for DynaEval, what should be noticed is that **the ability to evaluate depends on the design of the evaluation task, which is determined by the user of DynaEval**. On the other hand, DynaEval itself provides a platform/framework for users to design and implement their evaluation task that evaluates the task-specific abilities of LLMs in dynamic interaction scenarios. For example, in our experiment, the Code G&R evaluates the code generation ability of the programmer LLM and the code review ability of the reviewer LLM. The reviewer may doubt that this task cannot disentangle the understanding and reasoning ability of LLMs because they are also required by this task. However in real-world dynamic interaction scenarios, LLMs always need to use multiple abilities to solve users’ problems, and the understanding and reasoning ability is the basis of them because they need to optimize their solution based on their understanding and reasoning of user feedback. Therefore, as Code G&R and Machine Translation, users of DynaEval can design their own evaluation tasks to evaluate task-specific or domain-specific abilities of LLMs. In our paper, we also introduced in **Appendix A.4** how to design evaluation tasks based on users’ own requirements.\n\nW2. The paper tries to standardize the interaction process and spends many words to emphasize the fairness and stability, and hence propose a synchronous interaction algorithm which ensures anonymity and multiple independent runnings. However, I think most of them are common senses in many evaluation tasks.\n\nA2. Thank you for your question. Indeed, fairness and stability are only easy to achieve in traditional supervised signal-based evaluation or human-based evaluation because the response of each LLM is **independent of and isolated from others**. However, In the dynamic interaction between LLMs, things are much more complicated. LLMs might expose their real identity because of a lack of supervision, and the synchronicity is easy to be violated because the response time of different LLMs can vary a lot. Moreover, the synchronicity also depends on game rules. For example, in the public goods game, LLMs are required to respond simultaneously in each round. But in Code G&R, LLMs are required to respond one by one. In real-world scenarios, the game rule can be much more complex. As a result, to standardize the complex interaction process, we propose the **referee** to help guarantee the fragile but significant anonymity and rate LLMs’ performance, and we propose the **message pool** which uses the synchronous interaction algorithm to compulsively guarantee the synchronicity of the dynamic interaction process.\n\nW3. Third, the paper tries to build a close relation between DynaEval and extensive-form games with perfect information (EGPI). But I did not see necessity of doing this.\n\nA3. Thank you for your question. As mentioned in A2, the dynamic interaction process between LLMs is much more complicated than the traditional supervised signal-based or human-based evaluation process. As a result, we utilize the EGPI to standardize the interaction process in all kinds of tasks and scenarios and introduce the fairness and stability condition of DynaEval. As for shared properties of DynaEval and EGPI such as the existence of equilibrium (Do you mean Nash equilibrium?), since we have proved that DynaEval belongs to EGPI, it is theoretically easy and convenient to analyze the property of DynaEval in terms of game theory. As this paper mainly focuses on LLM evaluation in dynamic scenarios, such an analysis exceeds the range of research of this paper. We plan to analyze the theoretical properties of DynaEval in our next research.\n\nQ1. In the example of IDIOMS SOLITAIRE, which specific ability are you testing? From my point of view, winning LLM should have seen more idioms so that it can come up with an answer easily. But does this has anything to do with \"interaction\"?\n\nAQ1. As introduced in Section 2.4, p6 in our paper, we test the ability to retrieve and use the Chinese vocabulary of LLMs. Interaction is significant in this task, because LLMs’ responses are based on the context, and Chinese idioms are limited and it is easy for LLMs to acquire a host of idioms. If two participants have seen a similar amount of idioms, they need to use specific strategies to win the game, such as coming up with a Chinese idiom with the last character complex and rare, which makes it hard for the opponent LLM to come up with a valid Chinese idiom, even though it has seen a lot of Chinese idioms."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5534/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1699847923494,
                "cdate": 1699847923494,
                "tmdate": 1699847923494,
                "mdate": 1699847923494,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "41evnoTg9H",
            "forum": "f7PmO5boQ9",
            "replyto": "f7PmO5boQ9",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission5534/Reviewer_u39q"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission5534/Reviewer_u39q"
            ],
            "content": {
                "summary": {
                    "value": "The authors in this work propose an evaluation framework for LLMs by connecting the typically interactive use of LLMs to game theory. Leveraging this connection, the authors provide a general framework for evaluating the performance of LLMs as agents in dynamic real-world games. They construct several explicit scenarios from the framework and find relative performance that seems to be somewhat distinct from static evaluation results."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "The authors make an important point regarding a significant difference in the typical use case versus LLMs and the typical forms of evaluating LLM performance. They provide a simple and theoretically grounded approach to resolving this difference which they explain clearly and soundly. They demonstrate how to use this evaluation criteria with straightforward and well executed experiments. The experimental results seem to demonstrate that they capture a gap between static and dynamic use of LLMs though this result is not explicitly highlighted by the authors - see weaknesses."
                },
                "weaknesses": {
                    "value": "In this work there is a hypothesis that the authors test in their experiment design which they are not explicit about. The hypothesis is that these dynamic evaluation scenarios will uncover different comparative results between LLMs than static evaluation scenarios. It seems to be that they found comparatively different results in their experiments because to my knowledge, static evaluation methods find that ChatGPT underperforms GPT-4 on translation tasks while they find the reverse on their dynamic evaluation dataset. This claim is significant, and should be both highlighted and explained substantially in the text. There needs to be an explicit and clear comparison between the dynamic evaluation results and what static evaluation methods find with an accompanying explanation.\n\nIn fact, the authors emphasize an odd point instead of this comparison to the relative performance in static evaluation. They discuss the “improvement of performance” through the evaluation, even while highlighting their main results in the conclusion. While LLMs can improve performance on tasks through interaction, this observation seems completely beside the point of DynEval which is an evaluation procedure, so the absolute performance of the LLMs is not important."
                },
                "questions": {
                    "value": "Is the stability condition reasonable for LLMs? Couldn’t they not converge? Aren’t those sorts of guarantees made for substantially similar agents? Maybe I also don’t correctly understand what “converge” means in this context. Some greater clarity here would help.\n\nThe source code link does not work."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission5534/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission5534/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission5534/Reviewer_u39q"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission5534/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699183189337,
            "cdate": 1699183189337,
            "tmdate": 1700600935083,
            "mdate": 1700600935083,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "mjbeWwmPzG",
                "forum": "f7PmO5boQ9",
                "replyto": "41evnoTg9H",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5534/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5534/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Reply to Reviewer u39q (1)"
                    },
                    "comment": {
                        "value": "We would like to thank you very much for the detailed feedback and valuable suggestions.\n\nW1. There needs to be an explicit and clear comparison between the dynamic evaluation results and what static evaluation methods find with an accompanying explanation.\n\nA1. Thank you for your constructive suggestion. Indeed, we conducted the machine translation task on different language pairs. Due to the page limitation, we only put the EN-ZH in the body of the paper and put the rest in Appendix A.9, p20. According to our experiment, ChatGPT only outperforms GPT-4 in the EN-ZH setting of machine translation, while underperforming GPT-4 in the DE-EN and EN-FR setting. Similarly, in the Idioms Solitaire task (which is also relevant to Chinese), we also observed that ChatGPT outperforms GPT-4, as shown in Table 1 and Table 2. These results might demonstrate that ChatGPT can perform better than GPT-4 in Chinese-related tasks. We will discuss more about this discovery in the next version of our paper.\n\nW2. They discuss the “improvement of performance” through the evaluation, even while highlighting their main results in the conclusion. While LLMs can improve performance on tasks through interaction, this observation seems completely beside the point of DynaEval which is an evaluation procedure, so the absolute performance of the LLMs is not important.\n\nA2. We suppose that the “ability to improve performance through interaction” is a significant part of the performance of LLMs. As mentioned in the third paragraph of Section 1, in dynamic interaction scenarios, LLMs repeatedly get feedback and optimize their output to gradually meet users’ requirements. As a result, “how is the performance of an LLM after getting feedback” is significant in our evaluation. In addition, since the feedback highly affects the degree of improvement and is provided by another agent, “how an LLM can improve the performance of another LLM” is also significant in our evaluation.\n\nQ1. Is the stability condition reasonable for LLMs? Couldn’t they not converge? Aren’t those sorts of guarantees made for substantially similar agents?\n\nAQ1. The stability condition is reasonable and indispensable for LLMs. Due to the uncertainty in the text generation of LLM and the variety and complexity of interaction environments (e.g., different interaction contexts can lead to different input for an LLM), the uncertainty of interaction results widely exist in dynamic interaction scenarios and can highly affect the evaluation of LLMs. Therefore, we noticed that the performance of an LLM should be modeled as a random variable rather than a specific value. As a result, we utilize the stability condition of DynaEval to evaluate the expected performance of LLMs, as shown in Eq.(1) in our paper. With multiple running of an evaluation task, the performance of participant LLMs can converge in distribution. This condition is also reasonable for dissimilar agents. As shown in Eq.(2), when modeling the full distribution of an LLM’s performance, the interaction histories (and other LLMs’ abilities) are only viewed as the context and condition of the random variable of the LLM’s performance and can be eliminated using the law of total probability.\n\nQ2. The source code link does not work.\n\nAQ2: Sorry for the confusion. Our source code is available at  https://anonymous.4open.science/r/DynaEval-D334 . We will update the source code link to the new version of our paper."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5534/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1699847774495,
                "cdate": 1699847774495,
                "tmdate": 1699847774495,
                "mdate": 1699847774495,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "268RjJf2nk",
                "forum": "f7PmO5boQ9",
                "replyto": "41evnoTg9H",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5534/Reviewer_u39q"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5534/Reviewer_u39q"
                ],
                "content": {
                    "title": {
                        "value": "Reply to rebuttal"
                    },
                    "comment": {
                        "value": "Thank you for the responses. \n\nHowever, I have decreased my score with the rebuttal because there is definitely confusion about what this relative performance evaluation is compared to static evaluation. When you clarified this in the first rebuttal comment, you still are replied to total score between 2 LLMs only in the dynamic setting. I still am in support of this paper, but for it to be a meaningful benchmark, it needs to clearly find that comparing 2 LLMs (i.e. ChatGPT and GPT-4) yields different results in this test than the existing ones already defined in prior work.\n\nIt is critical that you very definitively point out \"on [this task (for example machine translation)], static evaluation methods yield [this relative performance] between 2 LLMs and our dynamic evaluation method uncovers [this relative performance]\". Please clearly write this for all tasks for which the relative performance is not the same as a comment (ultimately to be included in the paper) for me to fully support it in further discussion."
                    }
                },
                "number": 11,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5534/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700596510365,
                "cdate": 1700596510365,
                "tmdate": 1700600919277,
                "mdate": 1700600919277,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "rnJSbfo5BU",
            "forum": "f7PmO5boQ9",
            "replyto": "f7PmO5boQ9",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission5534/Reviewer_ZvMp"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission5534/Reviewer_ZvMp"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes a dynamic interaction-based evaluation framework for evaluating LLMs named DynaEval. Inspired by game theory, the authors highlight the interaction process of LLMs is theoretically aligned with extensive games with perfect information (EGPI). The interaction process of LLMs in DynaEval is categorized into four steps: selection, interaction, recording, and circulation. The authors propose a fairness condition as letting LLMs be **anonymous** and delivering the messages **synchronously**. The authors specify a stability condition as running multiple times of interactive LLMs independently. In practice, the authors introduce a referee and message pool to implement the fairness and stability condition."
                },
                "soundness": {
                    "value": "1 poor"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "1 poor"
                },
                "strengths": {
                    "value": "- The evaluation of LLMs with fairness and stability guarantee is a less studied yet very important research problem for the machine learning community. The topic of this paper is highly related to the ICLR conference.\n\n- The paper is well-written and easy to read.\n\n- The intuition of relating the interaction process of LLMs to the extensive games with perfect information (EGPI) is novel, though I feel the connection fails to result in a strong technical contribution."
                },
                "weaknesses": {
                    "value": "- Overall, I feel the technical contribution of this paper is limited because the method fails to come up with a practical and novel fairness condition or stability condition. The presented fairness condition and stability condition are both standard practice, with limited new insights. Anonymity, synchronicity, and independent runs are all typical practices during LLM evaluation. As the method is tackling dynamic interaction of LLMs, I do not see any specific part of the algorithm being customized to the specific property of dynamic interaction. Also, I feel the concepts of referee and message pool are not novel either.\n\n- Apart from the refee and message pool, another important concept that is less talked about in the paper is the **task rule**. The task rule itself has a lot to do with fairness and stability for the evaluation task. Regretfully, in the paper, very little details about it has been revealed.\n\n- The referee plays a very important role in the evaluation, responsible for the selection, recording, and circulation process.  The referee also takes charge of evaluating all LLMs' performance. However, for the fairness evaluation of LLMs, it is unclear whether it is possible to develop referees automatically in a supervised signal-based manner with less human-based guidance. \n\n- The discussion on the proposed evaluation method compared to existing ones is quite weak. It is unclear how the proposed one can tackle the dynamic nature of the LLMs interaction while the existing evaluation methods cannot."
                },
                "questions": {
                    "value": "Please refer to the WEAKNESSES part."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission5534/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699409216681,
            "cdate": 1699409216681,
            "tmdate": 1699636567402,
            "mdate": 1699636567402,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "hL2uD653DB",
                "forum": "f7PmO5boQ9",
                "replyto": "rnJSbfo5BU",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5534/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5534/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Reply to Reviewer ZvMp (1-Part 1)"
                    },
                    "comment": {
                        "value": "We would like to thank you very much for the detailed feedback and valuable suggestions.\n\nW1. The technical contribution of this paper is limited because the method fails to come up with a practical and novel fairness condition or stability condition. Also, the concepts of referee and message pool are not novel either.\n\nA1. Thank you for your doubt. The technical contribution of this paper is that: 1. We noticed and proved the relationship between the dynamic interaction process of LLMs in real-world scenarios and EGPI; 2. Based on EGPI, we proposed DynaEval which is a **general** framework for dynamic LLM evaluation that can cover most interaction processes in real-world scenarios, which is much more complex than traditional signal-based evaluation methods. Anonymity, synchronicity, and independent runs are fundamental yet indispensable in all dynamic interaction-based LLM evaluation. However, they are only easy to achieve in traditional supervised signal-based evaluation or human-based evaluation because **the response of each LLM is independent of and isolated from others**. In the dynamic interaction between LLMs, things are much more complicated. **LLMs might expose their real identity because of a lack of supervision, and the synchronicity is easy to be violated because the response time of different LLMs can vary a lot. Moreover, the synchronicity also depends on game rules.** For example, in the public goods game, LLMs are required to respond simultaneously in each round. But in Code G&R, LLMs are required to respond one by one. In real-world scenarios, the game rule can be much more complex. As a result, we propose the **referee** to help guarantee the fragile but significant anonymity and rate LLMs’ performance, and we propose the **message pool** which uses the synchronous interaction algorithm to compulsively guarantee the synchronicity of the dynamic interaction process.\n\nW2. The task rule itself has a lot to do with fairness and stability for the evaluation task, but very little details about it has been revealed.\n\nA2. Thank you for your question. As illustrated in Section 2.2 and Definition 1, the task rule of a dynamic interaction-based evaluation task consists of an **interaction goal** and an **interaction rule**. Such a design is simple yet sufficient for depicting all dynamic interaction-based tasks in real-world scenarios. \n\nAs for fairness and stability, they are disentangled from task rules, and achieved by the special mechanism of our proposed DynaEval (referee, message pool, etc.) that is irrelevant to specific task. This design is in alignment with real-world requirements. For example, in the review-rebuttal process of this paper, the review-rebuttal rule only regularizes the interaction goal and the interaction rule for reviewers and authors. For reviewers, the goal is to accept high-quality papers and reject low-quality papers while helping improve the quality of the latter. For authors, the goal is to make their paper accepted by the conference and improve its quality. The interaction rule is that reviewers first review the paper and give the comment. Then authors and reviewers can discuss the paper during the rebuttal phase. During this process, stability is ensured by assigning multiple reviewers to a paper, and fairness is ensured by the surveillance of the OpenReview platform. Indeed, even though the task rule does not regularize fairness and stability, they can still be satisfied by the special mechanism of DynaEval."
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5534/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1699847601545,
                "cdate": 1699847601545,
                "tmdate": 1699847814827,
                "mdate": 1699847814827,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "GZ0ftNVIy1",
                "forum": "f7PmO5boQ9",
                "replyto": "rnJSbfo5BU",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5534/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5534/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Reply to Reviewer ZvMp (1-Part 2)"
                    },
                    "comment": {
                        "value": "W3. For the fairness evaluation of LLMs, it is unclear whether it is possible to develop referees automatically in a supervised signal-based manner with less human-based guidance.\n\nA3. First, it is hard to develop referees automatically in a supervised signal-based manner in DynaEval because the interaction environment is complex, and the interaction rule and evaluation metric of different dynamic interaction-based evaluation tasks can vary a lot in real-world scenarios. As a result, it is inefficient to customize a supervised signal-based referee for each (countless) evaluation task. Moreover, during the interaction process, participant LLMs may generate abnormal outputs (such as outputs that violate the format) which affect the running of the evaluation process and should be distinguished by the referee. However, supervised signal-based referees cannot distinguish these abnormal outputs. Therefore, supervised signal-based referees are hard to develop in DynaEval.\n\nSecond, human-based guidance for referees does not affect the fairness of LLM evaluation. As illustrated in Condition 1 in our paper, all participant LLMs should be anonymous during the interaction process. This condition means that participants are not only anonymous to each other, but also anonymous to the referee. That is, the referee can only identify each participant by their assigned ID. As a result, the referee can only evaluate the performance of LLMs based on their interaction history, which is identity-irrelevant. As a result, the fairness of LLM evaluation can still be achieved when using referees with human-based guidance.\n\nW4. The discussion on the proposed evaluation method compared to existing ones is quite weak. It is unclear how the proposed one can tackle the dynamic nature of the LLMs interaction while the existing evaluation methods cannot.\n\nA4. As presented in **the third paragraph of Section 1**, we discussed the reason why existing evaluation methods cannot tackle the dynamic nature of the LLMs interaction. In the fourth paragraph, we further illustrated how the proposed DynaEval can solve this problem. For traditional supervised signal-based methods, their evaluation environments are static, and hard to capture the complexity of dynamic real-world situations. Moreover, although some evaluation methods support multiple-round conversations, they still fall short in providing a dynamic interaction environment and lack generality."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5534/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1699847666718,
                "cdate": 1699847666718,
                "tmdate": 1699847666718,
                "mdate": 1699847666718,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]