[
    {
        "title": "Prompt-based 3D Molecular Diffusion Models for  Structure-based Drug Design"
    },
    {
        "review": {
            "id": "pMXl1mdGkq",
            "forum": "FWsGuAFn3n",
            "replyto": "FWsGuAFn3n",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission1345/Reviewer_gTfj"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission1345/Reviewer_gTfj"
            ],
            "content": {
                "summary": {
                    "value": "The paper proposes a diffusion model for de novo structure-based ligand generation. Compared to the existing methods, current model has two additional mechanisms: self prompting and exemplar prompting that aim to make model generate molecules that interact with the target pocket with higher affinity. To enable exemplar prompting, authors train a separate scoring model to predict binding affinity. The performance seems to reach the state of the art."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "1 poor"
                },
                "strengths": {
                    "value": "The idea about additional prompts for the model using exemplary molecules seems promising, as such prompts suggest the model what can potentially work for a specific target. Figure 6 gives a very nice illustration of this idea. Besides, the model with prompting seems to work a bit better in terms of Vina scores, however, I would be interested in looking at the standard deviation of these scores."
                },
                "weaknesses": {
                    "value": "Even though prompting sounds like a nice idea in general, the overall contribution of the current paper seems to me rather limited. Besides, the scope of application is quite unclear. Below I elaborate on these two main concerns and discuss several smaller issues:\n\n1. First of all, for me the scenario in which this model can be applied is not clear. Is it correct that PromptDiff can be used only for pockets that already have known binders? What if I want to generate a molecule for the pocket which has never been targeted before?\n\n2. Why cannot existing scoring methods be used for selecting prompts from the database? What is the reason for creating a new model for predicting binding affinity given that: (a) the proposed model does not seem to suggest any novelty compared to what has been done before, (b) it does not really outperform GraphDTA.\n\n3. In my opinion, the part about exemplar prompting is not clearly explained. Do you consider experimental data? Do you dock molecules to the target? Besides, how exactly do you create a database? Where do you take examples from?\n\n4. Abstract and introduction suggest that you focus on optimizing different molecular properties through prompting while in reality you aim to improve only binding affinity. While you mention synthesizability in the abstract and intro, there is no focus on it in the paper at all. Besides, SA scores of PromptDiff samples are very mediocre. I would suggest to change the wording or to explain better how synthesizability can be addressed by your model and support it by experiments.\n\n5. Algorithm 1, line 1: I did not find the explanation of the sampling procedure of your method in Section 3."
                },
                "questions": {
                    "value": "1. How do train/test sets for PMINet and PromptDiff correspond?\n\n2. Are notations $\\mathcal{M}$ and $\\boldsymbol{M}=[\\boldsymbol{X}, \\boldsymbol{V}]$ interchangeable? What's the reason to use different ones?\n\n3. It seems strange for me that adding self-prompting results in degradation of the average Vina score in Table 3. Did you investigate this issue?\n\n4. \"_We randomly choose 128 ligands from training set for retrieval, and select the ligand of top-1 predicted binding affinity as prompt for each protein_\" – is it 128 random different ligands that you use for all your samples or is it 128 ligands bound to the same pocket? Could you please explain this procedure in more detail?\n\n5. How do you sample initial atom types?\n\n6. What is the difference between self-conditioning [1] and your self-prompting?\n\n**Additional suggestions:**\n\n1. Would be interesting to look at a couple of case studies where one or multiple active compounds are known. How does PromptDiff perform there? Do samples share some parts with these compounds? What are scores of those?\n\n2. Suggested scoring model can be used to score samples so that you get the ranked list of samples.\n\n[1] Chen, T., Zhang, R., & Hinton, G. (2022). Analog bits: Generating discrete data using diffusion models with self-conditioning"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission1345/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission1345/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission1345/Reviewer_gTfj"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission1345/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698321362463,
            "cdate": 1698321362463,
            "tmdate": 1699636061720,
            "mdate": 1699636061720,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "WVwOsod5Qu",
            "forum": "FWsGuAFn3n",
            "replyto": "FWsGuAFn3n",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission1345/Reviewer_78qn"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission1345/Reviewer_78qn"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes PROMPTDIFF, a prompt-based 3D molecular diffusion model for generating 3D ligand molecules that bind to specific protein targets. In particular, PROMPTDIFF leverages the target-aware prompt ligands to steer the 3D molecular diffusion models towards generating ligands that satisfy the designed criteria. PROMPTDIFF is compared with recent representative SBDD methods in terms of molecular structures, target binding affinity, and molecular properties."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. This work proposes two novel prompting mechanisms (i.e., self-prompting and exemplar prompting), and the effectiveness has been fully proved through experiments.\n2. The experimental results show that PROMPTDIFF can achieve state-of-the-art binding affinities towards the protein targets."
                },
                "weaknesses": {
                    "value": "1.  Inference efficiency: Given a target protein, this method needs to first retrieve target-aware ligand molecules from the database as prompts, and then use the ligand prompts to steer the diffusion model. Therefore, the method will inevitably inherit the efficiency issues of the diffusion model and be even less efficient.\n2. More Baselines: \n     - Zhang Z, Min Y, Zheng S, et al. Molecule generation for target protein binding with structural motifs, ICLR2023.\n     - Zhang Z, Liu Q. Learning Subpocket Prototypes for Generalizable Structure-based Drug Design, ICML2023. \n     - Zhang O, Zhang J, Jin J, et al. ResGen is a pocket-aware 3D molecular generation model based on parallel multiscale modeling, Nature Machine Intelligence, 2023: 1-11.\n3. Writings: The description of this method is unclear, and the use of symbols is very confusing, especially for the superscript and subscript.\n4. Others: The settings in Table 4 are not clear, please add n-k pair information."
                },
                "questions": {
                    "value": "1. Compared with current binding-affinity prediction methods, what’s the advantage of your PMINet? If it can not achieve state-of-the-art performance, why not use better methods to retrieve target-aware ligand molecules?\n2. What’s the relationship between ligand prompts and ground truth ligands? Why not directly use the ground truth ligand as prompt?\n3. Since the protein target is certain, why enhance its atom feature in PROMPTDIFF?\n4. In Table3, how to prompt without PMINet?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission1345/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission1345/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission1345/Reviewer_78qn"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission1345/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698688034796,
            "cdate": 1698688034796,
            "tmdate": 1699636061628,
            "mdate": 1699636061628,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "n2yX70HlRR",
            "forum": "FWsGuAFn3n",
            "replyto": "FWsGuAFn3n",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission1345/Reviewer_M3og"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission1345/Reviewer_M3og"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes a prompt-based 3D molecular diffusion model, called PomptDiff, that aims to advance structure-based drug design through target-aware generative molecule design.\nThe main idea is to train a geometric protein-molecule interaction network (PMINet) that is trained based on protein-ligand pairs with known binding affinity, which is then used to select \"target-aware\" molecules with high predicted binding affinity against the given target and use them as effective prompts to guide the generative diffusion process.\nThe paper shows that PromptDiff can effectively generate molecules with high binding affinities to protein targets and good molecular properties by incorporating the pre-trained PMINet and the use of effective exemplar prompting and self-prompting techniques."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "The paper introduces a \"target-aware\" molecular design approach based on the use of a small set of molecular prompts to guide the diffusion-based molecular generation process - which is well-motivated and reasonable.\nThe ideas are presented in a logical and clear fashion, making the underlying motivations clear and their actual implementation in PromptDiff relatively easy to understand.\nThe evaluation results show that PromptDiff is capable of generating stable molecular structures and generate ligan molecules that can tightly bind to protein targets thanks to its \"target-awareness\".\nFurthermore, a number of other properties - such as drug-likeness and diversity - of the generated molecules are enhanced compared to other diffusion-based methods with comparable synthetic accessibility."
                },
                "weaknesses": {
                    "value": "Overall, the paper is written well and the presented evaluation results make the proposed PromptDiff scheme look promising.\nThere are nevertheless several concerns/questions that need to be addressed.\nThese are summarized in what follows.\n\n1. It is reasonable to expect that the use of exemplars with high binding affinity as prompts may be more efficient than designing ligands from scratch and also may effectively steer the diffusion-based molecular generation process to make the generated molecules possess high binding affinity against the given protein target.\nHowever, one concern regarding such an approach is its impact on the diversity of the generated molecules.\nInterestingly, the authors show that PromptDiff is capable of enhancing/maintaining molecular diversity compared with other diffusion-based methods and many other non-diffusion schemes.\nBut it is not intuitive why that's the case, and it warrants further investigation and discussion about this aspect.\n\n2. An interesting question - also somewhat relevant to the \"diversity\" of the molecules generated by using exemplar prompting - is how the generated molecules would perform if the original database lacks molecules with high binding affinity.\nEven in such scenarios, would PromptDiff be capable of generating diverse molecules such that the generated molecules would include ligands with high binding affinity to the protein targets?\nWould the performance of PromptDiff still outperform other techniques that do not use such exemplar prompting?\n\n3. In the evaluation results, how were the \"reference molecules\" selected?\nPlease clarify, as this is not clearly described in the current manusscript.\nAlso at leat brief define (with proper citations) how QED, SA, Diversity metrics were evaluated, since there exist different schemes/tools for this purpose.\n\n4. Since PromptDiff mainly aims to generate molecules with enhanced binding affinity to the target proteins, is the fact that it also enhances some other properties compared to other approaches simply a (somewhat unexpected) by product of the proposed diffusion-based generation scheme?\nOr would one expect to similar outcomes for various other molecular optimization tasks/scenarios in general?\nPlease share relevant insights/intuition (if any).\n\n5. In the ablation study, the paper discusses the impact of applying promopting without the pre-trained PMINet.\nWhat conclusions can be drawn regarding the (relative) importance/efficacy of prompting using \"good exemplars\" vs. the use of the learned ligand-protein interactions captured in the interaction layer of PMINet (used in self-prompting)?\n\n6. It appears that results in Table 4 are somewhat limited to draw a reliable conclusion (especially so for k).\nThere is no discussion regarding the impact of T.\nFurthermore, the impact of these hyperparameters on the overall computational cost should be discussed.\n\n7. Considering that multi-objective optimization is commonly required for molecular design, it is important to discuss how the proposed scheme would extend to the case when multiple molecular properties need to be optimized simualtaneously."
                },
                "questions": {
                    "value": "Please see the questions and concerns summarized in the \"Weaknesses\" section."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "details_of_ethics_concerns": {
                    "value": "NA"
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission1345/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698893261996,
            "cdate": 1698893261996,
            "tmdate": 1699636061557,
            "mdate": 1699636061557,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "0Y2wd9qIkZ",
            "forum": "FWsGuAFn3n",
            "replyto": "FWsGuAFn3n",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission1345/Reviewer_DL9h"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission1345/Reviewer_DL9h"
            ],
            "content": {
                "summary": {
                    "value": "The proposed method presents PromptDiff, a prompt-based approach to generate 3D molecules via diffusion models. This method uses pre-trained binding affinity signals and exemplar prompting and self-prompting techniques to generate ligands. Empirical results show improvement of generating drugs with high binding affinity."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. The first one to adopt prompting techniques for 3D molecule drug designs. \n2. Introduce two novel prompting techniques.\n3. Empirically show some improvement in generating ligands with high-affinity scores."
                },
                "weaknesses": {
                    "value": "1. The method of this work lacks novelty. Prompting is a common technique in NLP, and diffusion models are one of the most popular models in image generation. The paper would benefit more if the author could explain the insights behind choosing prompting and diffusion models as the main method.  \n\n2. The pipeline has several steps, retrieving and prompting. How each step affects the molecules is not clear. For example, a model is easily affected by the selection of retrieved molecules, but the model is robust to selecting top-1 affinity molecules. This part of the argument is not inconsistent and needs empirical evidence."
                },
                "questions": {
                    "value": "Please see *weaknesses* section."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission1345/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699252827974,
            "cdate": 1699252827974,
            "tmdate": 1699636061477,
            "mdate": 1699636061477,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    }
]