[
    {
        "title": "Reduce, Reuse, and Recycle: Navigating Test-Time Adaptation with OOD-Contaminated Streams"
    },
    {
        "review": {
            "id": "4cCXtFTtel",
            "forum": "gTRtDFm8Di",
            "replyto": "gTRtDFm8Di",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4714/Reviewer_8qGX"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4714/Reviewer_8qGX"
            ],
            "content": {
                "summary": {
                    "value": "This paper aims to tackle test-time adaptation in an open-world setting where data from unseen classes (OOD data) and seen classes (InD data) are mixed up in the test data stream under the same distribution shift. Based on empirical observation, this paper claims that the existence of OOD data can benefit the adaptation of the pre-trained model on shifted InD data. A TTA algorithm is further proposed with OOD data filtering and recycling, similarity-based data mixup, and contrastive learning with class-wise prototypes. Experimental results on CIFAR-10-C and ImageNet-C are illustrated. No theory is provided."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. This paper considers test-time adaption in the open world, which is interesting and realistic.\n\n2. This paper tackles the OOD-contaminated distribution-shifted data streams by rigorously filtering out OOD data and then learning the shifted InD and OOD data with different training objectives.\n\n3. Experimental results on CIFAR-10-C and ImageNet-C show that the proposed algorithm outperforms the baselines under single and mixed corruption scenarios."
                },
                "weaknesses": {
                    "value": "1. The claim of \"benign OOD contamination\" is not strong enough:\n   - Experimental settings are lacking to show a fair comparison between test streams with and without OOD contamination.\n   - The total number of data samples is not mentioned in the comparison. If test streams with OOD data have more data than those without OOD data, there is not enough evidence to show that the improvements come from auxiliary signals provided by OOD data rather than the increase of shifted data samples.\n   - Only batch norm adaptation is discussed and analyzed.\n\n2. The discussion about benign and harmful OOD data is not sufficient. \n   - According to which measure can we distinguish benign OOD data and harmful OOD data?\n   - Does the advancement of R3 come from the removal of OOD data or the preservation of benign OOD data? The main experiment results show that R3 only outperforms the clean stream baseline under a few OOD-contaminated scenarios. Does it mean that benign OOD data is also removed during the filtering process?\n\n3. The reason for using cosine similarity is not clearly stated. Using cosine similarity alone as the filtering scheme is also recommended in the ablation study.\n\n4. Why perform the filtering process on mixed shifted InD data?\n\n5. Discussions regarding the effect of batch size and the ratio of InD to OOD data on the performance of R3 are also recommended.\n\n6. Although it outperforms baselines in the mixed corruption scenario, R3 still fails to improve the pre-trained model on CIFAR-10-C+SVHN/DTD/DTD+SVHN and ImageNet-C with OOD data."
                },
                "questions": {
                    "value": "Please [Weaknesses]"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "details_of_ethics_concerns": {
                    "value": "N/A"
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4714/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698655934623,
            "cdate": 1698655934623,
            "tmdate": 1699636453311,
            "mdate": 1699636453311,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "WDTwX1NHnF",
                "forum": "gTRtDFm8Di",
                "replyto": "4cCXtFTtel",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4714/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4714/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Author Response"
                    },
                    "comment": {
                        "value": "We would like to first thank Reviewer 8qGX for the thorough feedback. We hope our response below addresses the concerns and questions raised by the reviewer.\n\nW1. Claim of benign OOD contamination\n- In our work, we provide two pieces of evidence for benign OOD-contamination.  First, we reveal that in certain test streams, OOD data can improve the performance of TENT, which does not employ any filtering scheme. Second, we demonstrate that algorithms with similar OOD detection performance can exhibit wildly different InD adaptation performance, indicating that OOD data have different degrees of helpfulness.\n- By default, a test stream contains the same number of InD and OOD samples.\n- Because updating the learnable parameters during TTA will likely result in model collapse, it is commonly assumed that only batch norm adaptation is performed at test-time.\n\nW2. Discussion about harmful OOD data\n- Generally speaking, if OOD data help adaptation on shifted InD performance, we refer to it as benign OOD data, and vice versa. Therefore, while it is difficult to determine the harmfulness of OOD data without post-adaptation performance, we speculate that OOD data that exist close to InD data in the feature space of the pre-trained model will tend to be benign. This hypothesis is supported through analyses of t-sne plots and 2-Wasserstein distance measurements.\n\n- The performance improvement of R3, compared to other TTA baselines, can be attributed to 1) its increased distinguishability between benign vs. harmful OOD instances and 2) effective utilization of benign OOD instances. R3 only outperforms the clean stream because while benign OOD data exist, harmful OOD data are still quite dominant, and R3, as well as all of the existing baselines, are incapable of perfectly picking out shifted InD and benign OOD data for adaptation. Yet, the significant relative performance improvement of R3 from TTA baselines suggests that R3 does indeed extend the state-of-the-art in this particular TTA scenario.\n\nW3. The cosine similarity is used as an auxiliary metric for filtering OOD instances because we believe that those lie closer to the InD data in the feature space aid better in the domain transfer process.\n\nW4. Without access to explicit test labels, it is impossible to distinguish between the shifted InD and OOD data. Therefore, R3 is bound to be blind to this distinction, leaving it with no choice but to perform a filtering process on both types of data. \n\nW5. The results of ablation studies on the batch size and ratio of InD to OOD data are reported in Tables 4 and 5 of the main paper, respectively.\n\nW6. We were not exactly sure what the reviewer was referring to here by the “CIFAR-10-C+SVHN/DTD/DTD+SVHN and ImageNet-C with OOD data.” If the mentioned quantity refers to the “Clean Stream” accuracy in Tables 1, 2, 3, and 4, it was obtained by performing TENT on clean streams to provide the potential empirical upper bound not by performing inference with a pre-trained model."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4714/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700662661672,
                "cdate": 1700662661672,
                "tmdate": 1700662661672,
                "mdate": 1700662661672,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "sWkNS6CZEj",
                "forum": "gTRtDFm8Di",
                "replyto": "WDTwX1NHnF",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4714/Reviewer_8qGX"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4714/Reviewer_8qGX"
                ],
                "content": {
                    "title": {
                        "value": "Re: response"
                    },
                    "comment": {
                        "value": "Thanks for your response. However, the concerns about motivations and experimental settings are still unclear. Thus, I will keep my original score the same, but I would like to note that I will not fight for rejection, as it is borderline."
                    }
                },
                "number": 11,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4714/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700730856512,
                "cdate": 1700730856512,
                "tmdate": 1700730856512,
                "mdate": 1700730856512,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "6PkiqVOrkj",
            "forum": "gTRtDFm8Di",
            "replyto": "gTRtDFm8Di",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4714/Reviewer_szCP"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4714/Reviewer_szCP"
            ],
            "content": {
                "summary": {
                    "value": "This paper studies the problem of TTA with OOD-contaminated data streams. They empirically reveal that the existence of benign OOD data can improve the adaptation performance on shifted ID data. Then, they introduce a stage-wise approach, term R3, to aid in the domain transfer process. Experimental results show that R3 improves baseline methods on OOD-contaminated streams created with CIFAR-10-C and ImageNet-C."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "- The paper is well organized and with clear clarification.\n\n- Based on the experiment results, this paper provides some findings or analyses."
                },
                "weaknesses": {
                    "value": "- My main concern is the motivation. Using external OOD data during training has empirically proved to be effective in OOD detection/generalization [r1]. However, in this manuscript, the authors appear to replicate these observed phenomena without introducing novel insights or furnishing theoretical guarantees specific to test-time adaptation. This redundancy raises questions about the contribution and originality of the work, necessitating a more comprehensive justification to substantiate the research's value. Moreover, the term 'benign' in the manuscript is vaguely defined, leading to potential confusion about what constitutes 'harmful' or 'malignant' in this context. Clarification from the authors would enhance the paper's clarity.\n\n- The use of t-SNE visualization for validating assumptions on benign OOD data in the manuscript is notably heuristic and may not be entirely reliable. This situation gives the impression that the authors are attempting to validate one intuitive hypothesis using another intuitive tool, which significantly weakens the theoretical foundation of the paper.  \n\n- The proposed method simply concatenates three stages without offering additional insights, particularly concerning the so-called `benign OOD data'. The authors need to delve deeper and elucidate how these stages interact and contribute to handling benign OOD data. \n\n- The experimental results indicate that the proposed method only achieves marginal improvements, which raises further doubts about whether the motivation of the paper has been accurately conveyed and validated. The authors need to address this issue by providing a more thorough analysis of the results and discussing potential reasons for the limited improvement, ensuring that the paper's objectives and contributions are clearly and convincingly presented.\n\n[r1] Generalized Out-of-Distribution Detection: A Survey."
                },
                "questions": {
                    "value": "Please refer to the weaknesses."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission4714/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4714/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4714/Reviewer_szCP"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4714/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698830037982,
            "cdate": 1698830037982,
            "tmdate": 1699636453215,
            "mdate": 1699636453215,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "SEuJ8NV2Hk",
                "forum": "gTRtDFm8Di",
                "replyto": "6PkiqVOrkj",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4714/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4714/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Author Response"
                    },
                    "comment": {
                        "value": "We first thank Reviewer szCP for the constructive critique of our paper. With our additional discussion below, we sincerely hope that the reviewer will reconsider the research value of our work. \n\nThe term “benign OOD data” in the manuscript refers to OOD data that can improve the adaptation performance on the shifted InD data; any OOD data that does not meet this criterion are considered to be harmful or malignant.\n\nWe agree that OOD data have been demonstrated to improve the OOD detection or generalization performance, but this is the first work to study its effect on test-time adaptation. Because intuition that holds in one domain may not always extend to another, it would be a stretch to regard the observed phenomenon of benign OOD-contamination in TTA as simple regurgitation of previously-known facts. \n\nWe are deeply disheartened that the reviewer finds the insights from our empirical analyses lacking in research value. While our work may not offer the theoretical depth that the reviewer expects, we kindly ask Reviewer szCP to reconsider the value of our work based on the following grounds:\n\n1. As noted above, we would like to emphasize that this is the first time OOD-contaminated streams have been explored in test-time adaptation. We believe this is a realistic and important setting that significantly broadens the scope and versatility of TTA.\n2. We do make a meaningful attempt to explicate the reason behind the existence of benign OOD data through analyses of t-sne plots and 2-Wasserstein distance measurements.\n3. We develop a novel algorithm which is grounded on the empirical findings, as well as extending the state-of-the-art across a variety of test scenarios that span combinations of two shifted InD datasets and five OOD datasets. R3 employs conservative dual filtering to preserve benign data, and new R3 loss functions are designed to amplify the effect of OOD data during the adaptation process through mixup and contrastive learning. Moreover, R3 may only lead to marginal performance improvements in certain test scenarios, we would like to bring to the reviewer’s attention the consistent improvement observed across the board."
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4714/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700662913507,
                "cdate": 1700662913507,
                "tmdate": 1700662913507,
                "mdate": 1700662913507,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "UkkfNR8RFL",
            "forum": "gTRtDFm8Di",
            "replyto": "gTRtDFm8Di",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4714/Reviewer_hsXp"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4714/Reviewer_hsXp"
            ],
            "content": {
                "summary": {
                    "value": "This paper focuses on TTA with data streams contaminated with out-of-distribution (OOD) data. The authors analysis the reasons for of benign OOD-contamination. And they propose a R3 (Reduce, Reuse, and Recycle) TTA algorithm tailored to OOD-contaminated streams."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1.\tThe authors propose metrics of energy and similarity to identify harmful OOD instances.\n2.\tThe authors propose a sample mixup method to alleviate the noisy learning signal from test labels.\n3.\tThe proposed method achieves promising performance in the experimental results."
                },
                "weaknesses": {
                    "value": "1.\tI am confused about what is “shifted InD data”. In my understanding, “shifted + InD data” = OOD data. However, in the paper, they are different. And the concept “shifted InD data” is first introduced in the last line of page 1 with further definition. Could the authors give more clear explanation?\n2.\tIn Section 3.1, the concept “benign OOD-contamination” means the OOD data that is helpful for TTA?\n3.\tIn Section 4.1, for “Reduce” part, what are the differences from and advantages over EATA? Can we identify harmful OOD instances with entropy metric instead of energy one?\n4.\tIn “Preliminaries and Notations”, the authors mention that irrelevant OOD data do not share the label set with training data? How to deal with these differences in label sets?\n5.\tThe pipeline seems to be very complex and computationally costly. It may introduce significant latency while inferring models. Do the authors compare the latency of the proposed methods and SOTAs? Note that introducing too much computational cost will make TTA algorithms hard for practical applications."
                },
                "questions": {
                    "value": "Some key concepts are not described clearly in the current manuscript. And some motivation behind current technique solutions remains unclear. If the authors can address my concerns, I would raise my scoring."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4714/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698977518388,
            "cdate": 1698977518388,
            "tmdate": 1699636453132,
            "mdate": 1699636453132,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "lePPoqZtEO",
                "forum": "gTRtDFm8Di",
                "replyto": "UkkfNR8RFL",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4714/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4714/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Author Response"
                    },
                    "comment": {
                        "value": "We would like to thank Reviewer hsXP for the constructive comments. In the author response below, we provide answers to the questions raised by the reviewer. We sincerely hope that our answers will serve to clarify any confusion.\n\nW1. Distinction between Shifted InD and OOD data\nIn the proposed scenario, we assume that two types of out-of-distribution data exist in the test stream: those that share the label space with the in-distribution data but have undergone some type of corruption in the input space (shifted InD data) and those that exist in a completely different label space (OOD data). The objective of test-time adaptation is to adapt the pre-trained model on the shifted InD data, and thus, we consider the latter “OOD-contamination.” As the reviewer correctly notes, “shifted InD data” are commonly considered to be “OOD data,” and we apologize that our wording led to confusion.\n\nW2. Yes, the concept of “benign OOD-contamination” refers to OOD data that could assist in the domain transfer from InD to shifted InD data and consequently lead to the adaptation accuracy on the shifted InD data.\n\nW3. In the reduce part, we utilize both the energy score and the similarity measure to identify and discard OOD instances. In Table A4, we compare the InD adaptation and OOD detection performance of EATA vs. R3. While the two yield a similar detection performance, R3 noticeably outperforms EATA, demonstrating that the filtering schemes in EATA and R3 may appear similar on the surface, the latter is more effective for the proposed scenario.\n\nW4. Yes, the irrelevant OOD data do not share the label space with training data. Because we do not have access to the test labels, when performing adaptation, R3 remains blind to the distinction between the two and applies the filtering scheme to both relevant shifted InD and irrelevant OOD data.\n\nW5. While R3 does lead to latency increase compared to TENT, we would like to argue that such an increase in the computational cost does not completely undermine the practicality of our method, especially because this is the first time OOD-contamination has been studied in TTA. Furthermore, many of previous TTA methods have utilized techniques that can increase the computational cost, and optimizing the computational cost of TTA is a separate research topic on its own."
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4714/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700663079477,
                "cdate": 1700663079477,
                "tmdate": 1700663079477,
                "mdate": 1700663079477,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "P7FvbCL5Mj",
                "forum": "gTRtDFm8Di",
                "replyto": "UkkfNR8RFL",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4714/Reviewer_hsXp"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4714/Reviewer_hsXp"
                ],
                "content": {
                    "title": {
                        "value": "Responses to Authors"
                    },
                    "comment": {
                        "value": "Thank you for the authors' responses.\n\nUpon careful examination of the rebuttal and the revised manuscript, I have decided to maintain my initial scoring since I still have some concerns:\n\n- Although the authors have clarified the concept of \"shifted InD data,\" I was unable to identify the corresponding modification in the revised manuscript. Additionally, I recommend a rewrite of the introduction section to enhance the clarity of key concepts, as the current version is challenging to comprehend.\n\n- Regarding the distinctions from and advantages over EATA, I encourage the authors to delve into methodological discussions and analyses rather than merely emphasizing empirical results. A more in-depth exploration from a methodological perspective would enhance the overall understanding.\n\n- It appears that the concept of \"OOD-contamination\" is not original to this work, as EATA has previously highlighted the detrimental effects of high-entropy samples and the potential benefits of relatively low-entropy samples for TTA. I suggest revisiting the novelty claim and acknowledging the existing contributions in this area.\n\nI appreciate the authors' efforts in addressing these concerns and look forward to the continued refinement of the manuscript."
                    }
                },
                "number": 10,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4714/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700705681589,
                "cdate": 1700705681589,
                "tmdate": 1700705978946,
                "mdate": 1700705978946,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "upk8qlMKFK",
            "forum": "gTRtDFm8Di",
            "replyto": "gTRtDFm8Di",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4714/Reviewer_hKzM"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4714/Reviewer_hKzM"
            ],
            "content": {
                "summary": {
                    "value": "This paper studies an interesting test-time adaptation (TTA) problem, namely TTA with OOD-Contaminated Streams, in which the data stream faces not only sample distribution shifts but also the presence of novel classes. The authors find the existence of benign OOD contamination and conduct experiments to analyze the underlying reasons. Based on the analysis, the authors further propose a R3 (Reduce, Reuse and Recycle) method. Experiments demonstrate the promise of R3. Frankly speaking, I was one of the reviewers when this work was submitted to NeurIPS. For the ICLR version, most of my concerns have been addressed and I only have the following questions and suggestions."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "The studied problem of TTA with OOD-Contaminated data stream is practical and novel.\n\nAnalyses regarding benign OOD-contamination are interesting and contribute new insights.\n\nExperiments demonstrate the effectiveness of the proposed method."
                },
                "weaknesses": {
                    "value": "According to Figure 4, the performance gain is mainly attributed to the \"Filter\" component, whereas the performance gains from the other components (\"Cont\" and \"Unif\") are a bit marginal."
                },
                "questions": {
                    "value": "- Why is there a difference in accuracy between \"separate\" and \"mixed\" for \"Test (no adapt)\" in Tables 1-3? Please include corresponding implementation details in the main paper. Moreover, I highly suggest the authors mix all 15 corrupted datasets rather than sampling a part of the test samples from each corrupted dataset, as the former one is more challenging to demonstrate the effectiveness of the proposed R3 method.\n\n- Could the authors provide information on the number of OOD samples (with novel classes) that are filtered out by your method? This would help further validate the claim of \"Benign OOD contamination.\"\n\n- Will the proposed method still be effective under small batch sizes, e.g., 1, 2, 4? It would be better to provide these results even though it does not perform well enough.\n\n- It would enhance comprehension if clear definitions of \"shifted InD\" and \"OOD\" were provided in the introduction. Additionally, it may be more appropriate to utilize alternative terms to describe \"shifted InD\" and \"OOD,\" as \"OOD\" inherently encompasses \"shifted InD\" for the sake of general understanding.\n\n- Many references have been published. Pls carefully check this and cite the corresponding published version.\n\n- It would be better to clearly point out that in Tables 1-3 the clean stream accuracy is measured by Tent. Additionally, in Tables 1-3, the performance gain of Clean Stream (Tent) over “Test (no adapt)” is lower than other TTA papers. I guess this is because the authors use ResNet-50-BN from timm. Here I suggest the authors could also provide comparisons based on ResNet50BN from torchvision and include the results in the Appendix."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4714/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698991806868,
            "cdate": 1698991806868,
            "tmdate": 1699636453046,
            "mdate": 1699636453046,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "f9Xc5fNnAG",
                "forum": "gTRtDFm8Di",
                "replyto": "upk8qlMKFK",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4714/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4714/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Author Response"
                    },
                    "comment": {
                        "value": "We would like to thank hkzM for the honest and thoughtful review. In response to the reviewer's comments, we provide additional discussion below.\n\nW1. Additional ablation study to demonstrate the effectiveness of R3:\nIn Table A6 of the revised paper, we report the results of replacing the filtering scheme in EATA and SAR with the proposed “Filter component.” Even with the proposed filtering scheme, abbreviated as R.F., these approaches fall short of R3, indicating that the additional technical components in R3 are integral parts in the success of R3.\n\nQ1. Mixed Setting Implementation Detail\nAs noted in our NeurIPS response, the number of instances in the test set used for the mixed scenario was set to be the same as the number of instances in a single test of shifted InD data in the separate scenario. For instance, for CIFAR-10-c, each shifted test set contains 10,000 samples. To construct the mixed test set for CIFAR-10-c, we sampled 10,000 / 15 number of samples from each test set and shuffled them. Therefore, the test set used for the mixed scenario is different from that used for the separate scenario. \n\nWe will incorporate your suggestion to mix all 15 corrupted datasets and include the results in the final version of the paper. \n\nQ2. Number of OOD samples filtered out\nIn Table A4 of Appendix, we compare the OOD detection accuracy on a CIFAR-01-C+DTD stream. The total number of OOD samples in this stream are 5000, so the OOD detection accuracy of 53.38% indicates that 2669 samples are being identified as OOD.\n\nWhile the three compared approaches perform similarly from the perspective of OOD detection, they yield significantly different results on the InD classification task, further justifying that some OOD data are better preserved than discarded.\n\nQ3. Small batch size\nWe found that running our method with extremely small batch sizes is rather tricky and leads to complete model collapse mostly due to the filtering factor. Oftentimes, the filtering component would leave us with no sample to perform test-time adaptation with.\n\nQ4. Published references\nWe apologize again for not updating the publication statuses of cited references.\n\nQ5. Use of timm model\nWe are deeply sorry that this implementation detail was missing; we will include this detail in the final version."
                    }
                },
                "number": 8,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4714/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700664798741,
                "cdate": 1700664798741,
                "tmdate": 1700664798741,
                "mdate": 1700664798741,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]