[
    {
        "title": "Greedy Sequential Execution: Solving Homogeneous and Heterogeneous Cooperative Tasks with a Unified Framework"
    },
    {
        "review": {
            "id": "mC8FEcsu8T",
            "forum": "hB2hXtxIPH",
            "replyto": "hB2hXtxIPH",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7432/Reviewer_CxDZ"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7432/Reviewer_CxDZ"
            ],
            "content": {
                "summary": {
                    "value": "The authors incorporate sequential execution into a value-decomposition-based MARL algorithm, which can thus be applied to both homogeneous and heterogeneous tasks, while maintaining effective credit assignment. \nTwo approximations are involved: 1) using greedy marginal contribution as the assigned credit for each individual, and 2) using greedy actions (augmented by Monte Carlo samples) as the optimal actions taken by subsequent agents.\nThe experiments show the efficacy of this approach, demonstrating its ability to adapt to dynamically changing partners within homogeneous, heterogeneous, and mixing scenarios."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "- Originality. The proposed method addresses common problems in MARL algorithms, such as the relative overgeneralization and credit assignment, at the same time. This enhancement expands the scope of potential applications of value-decomposition-based MARL algorithms. \n- Clarity. The paper is basically clear and easy to follow."
                },
                "weaknesses": {
                    "value": "- The algorithm is tested exclusively on specially designed tasks. There are no additional experiments conducted on common benchmarks.\n- The ablation study section fails to provide an in-depth discussion of the functions of the key components in the algorithm. I would appreciate a more detailed description of the ablated algorithms and a clearer explanation of the results."
                },
                "questions": {
                    "value": "- To generate a joint action $u$, each agent must calculate its action $a$ sequentially, which prevents parallel processing. Therefore, with each agent requiring $t$ time to produce its action, a single environment step requires $n*t$ units of time for $n$ agents. Compared with baseline algorithms like QMIX, does GSE require more wall-clock time for training and evaluation? If so, could you provide a rough estimate of the additional time required?\n- During training, is the execution sequence of all agents fixed, or do you shuffle the sequence?\n- What does 'training with a larger scale of agents' mean in Section 6.3 & Figure 6?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7432/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698745742508,
            "cdate": 1698745742508,
            "tmdate": 1699636892589,
            "mdate": 1699636892589,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "eujPHzo9bU",
                "forum": "hB2hXtxIPH",
                "replyto": "mC8FEcsu8T",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7432/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7432/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for your thoughtful questions and feedback on our paper. Below, we provide detailed responses to each of your questions:\n\n1. The algorithm is tested exclusively on specially designed tasks. \n\n    a. Our work aims to address the challenge of learning both homogeneous and heterogeneous policies simultaneously in value decomposition methods. **Therefore, it is crucial to validate our approach in tasks that require both types of policies.** Unfortunately, existing environments such as SMAC, GRF, and overcooked do not meet this requirement, which necessitated the design of new scenarios. \n\n    b. Furthermore, the tasks encompass a variety of behaviors necessary for completion, and the effectiveness of a task is influenced not just by the environment, but also by the nature of the policy required for its completion. In the environments we have utilized, agents are required to concurrently learn both homogeneous and heterogeneous policies. This dual learning requirement substantially elevates the complexity of these tasks, making them challenging and rich in diversity. \n\n2. About a more detailed description of the ablated algorithms and a clearer explanation of the results. \n    \n    We provide the following clearer explanation of the results in our ablation study and modify the revision accordingly: \n    \n    a. **Ablation of Greedy Actions:** Our first ablation test involved evaluating our method without using greedy actions, meaning we relied on marginal contributions instead of greedy marginal contributions. The results indicated a significant performance degradation when greedy actions were not utilized. This finding aligns with our analysis in Section 4.2, where we discussed how using greedy actions helps overcome the relative over-generalization problem. \n\n    b. **Ablation of Marginal Contributions:** The second ablation focused on evaluating our method without marginal contributions. In this scenario, we did not use the critic as proposed in Section 4.1 and directly fitted the policy value function Q_s^i to Q_{tot}. The results demonstrated the challenges of using an implicit credit assignment method to learn the policy when the sequential execution policy does not satisfy the IGM principle, underscoring the importance of our proposed critic. \n\n    c. **Effect of Number of Sampling in MC Method:** We also investigated the impact of varying the number of sampling in the Monte Carlo (MC) method. The findings showed that a small number of samples could lead to suboptimal action selection, failing to identify the greedy value of actions. Conversely, a sufficiently large number of sampling (beyond 5) did not yield additional performance improvements, indicating an optimal range for the number of sampling. \n\n    d. **Performance with Increased Numbers of Agents:** Lastly, we tested our method in the Lift task with double and triple the number of agents. These results affirmed our method's robustness, demonstrating effective performance management even with a larger number of agents. \n    \n    We believe these clarifications provide a comprehensive understanding of the key components and functions in our algorithm, as well as the implications of each ablation test conducted. \n    \n3. About the additional time required for training and evaluation. \n    \n    It is true that the sequential execution in GSE necessitates more time per step, as each agent calculates its action sequentially. This additional execution time can be estimated as (n-1)*t for n agents, where t is the time taken by each agent to produce its action. However, it's important to note that **this sequential execution primarily impacts the execution phase and not the training phase**. During training, as the transitions are collected, the sequential nature of execution does not impede the parallel processing capabilities. Therefore, the additional time required during training is mitigated. We appreciate the suggestion to focus on minimizing additional execution time. We have included a discussion about this limitation in our work, underscoring its significance. Thank you for this valuable input. \n    \n4. During training, is the execution sequence of all agents fixed, or do you shuffle the sequence?\n    \n    We employ a fixed order for the execution sequence of agents, which is determined based on the agent IDs. \n    \n5. What does 'training with a larger scale of agents' mean in Section 6.3 & Figure 6? \n    \n    We tested our method in the Lift task with double and triple the number of agents. These results affirmed our method's robustness, demonstrating effective performance management even with a larger number of agents. \n    \n\nThank you once again for your constructive feedback. We believe that your insights have helped us to improve the clarity and quality of our paper."
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7432/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700326853578,
                "cdate": 1700326853578,
                "tmdate": 1700326853578,
                "mdate": 1700326853578,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "KYkvAZ3htQ",
                "forum": "hB2hXtxIPH",
                "replyto": "eujPHzo9bU",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7432/Reviewer_CxDZ"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7432/Reviewer_CxDZ"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for your reply. Your clarifications have furthered my understanding of your work. I appreciate your efforts in addressing my concerns during the review process."
                    }
                },
                "number": 10,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7432/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700553730572,
                "cdate": 1700553730572,
                "tmdate": 1700553730572,
                "mdate": 1700553730572,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "wEG0n7U2j1",
            "forum": "hB2hXtxIPH",
            "replyto": "hB2hXtxIPH",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7432/Reviewer_GHAQ"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7432/Reviewer_GHAQ"
            ],
            "content": {
                "summary": {
                    "value": "The paper proposes a way of handling cooperative tasks with multi-agents when the tasks are not all homogeneous.\nThe approach proposed uses sequential execution policies, proposing the Greedy Sequential Execution (GSE), which learns the optimal policy for both cases (homogeneous and heterogeneous tasks). The GSE is evaluated empirically in multiple domains. The GSE  uses a value decomposition method that works for both homogeneous and heterogeneous tasks, and enables the agents to learn utilities that take into account the interactions with other agents. They also propose a credit assignment method that computes the marginal contributions of each agent. The marginal contribution avoids over-generalization, since it represents the optimal value of an action instead of the average value. A couple of theorems are proved in an appendix (not attached to the paper). The experiments use homogeneous scenarios, heterogeneous scenarios, and mixed scenarios. \nMultiple appendices are mentioned but they are not attached to the paper and are not accessible."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "The paper is very well written and easy to follow. The work presented addresses a known problem (over-generalization) that takes place when combining homogeneous and heterogeneous tasks and expands the applicability of agent-based approaches to situations where some tasks are homogeneous and some are heterogeneous. Having to deal with a mix of the two types of tasks might not be too common, but when mixes of tasks are used, the approach proposed here, even if greedy, becomes quite useful."
                },
                "weaknesses": {
                    "value": "The paper is more appropriate for a journal than for a conference. The numerous appendices are not included in it for space reasons, but are important to understand the method more in depth.\nFigure 2 with the architecture is hard to read and not well explained."
                },
                "questions": {
                    "value": "1. The use of Monte Carlo method to estimate the optimal cooperative actions with previous agents to maximize the greedy marginal contribution is mentioned with no other details. How is the number of actions selected?\n2. In the Overcooked scenario, I understand why the size of the map affects the complexity, but there is no indication of how large the maps are. I believe the number of agents is fixed to two. Have you tried a larger number of agents?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7432/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698813825418,
            "cdate": 1698813825418,
            "tmdate": 1699636892472,
            "mdate": 1699636892472,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "dFJirmP7Gb",
                "forum": "hB2hXtxIPH",
                "replyto": "wEG0n7U2j1",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7432/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7432/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for your thoughtful questions and feedback on our paper. Below, we provide detailed responses to each of your questions:\n\n1. Figure 2 with the architecture is hard to read and not well explained.\n    \n    We have added a more detailed description to accompany Figure 2 in our manuscript. This includes:\n    \n- Upper (Blue): A depiction of the critic architecture that we elaborated on in Section 4.1.\n- Lower (Green): An illustration of the framework used for calculating the greedy marginal contribution. This is based on $Q_c^i$ and $V_c^i$, as well as the sequential execution policy $Q_s^i$.\n2. How is the number of actions of Monte Carlo method selected?\n    \n    The number of actions selected for this estimation process is treated as a hyperparameter in our method. In our ablation studies, we have evaluated the effect of different numbers of sampling on the final results. Specifically, we examined how the sample number M affects performance. The results demonstrate that a small value of M can be problematic as it may not select the greedy value of actions. However, a reasonably large value of M is sufficient as increasing M beyond 5 does not further improve performance. \n    \n2. About the size of the map in Overcooked and scenarios with a larger number of agents.\n    \n    To provide a clearer understanding of the environment's complexity, we have included more detailed information about the Overcooked scenario and schematic representations of the maps in the appendix. The sizes of the maps used in our experiments are 5x5 for easy and medium and 7x7 for hard. \n    \n    Regarding the exploration with a larger number of agents, we have conducted evaluations in the Lift task using double or triple agents. The results of these evaluations are presented in the fourth figure of Figure 6. These results demonstrate that our method effectively handles a larger number of agents, maintaining performance without significant degradation. \n    \n\nThank you once again for your constructive feedback. We believe that your insights have helped us to improve the clarity and quality of our paper."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7432/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700326408921,
                "cdate": 1700326408921,
                "tmdate": 1700326408921,
                "mdate": 1700326408921,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "DFoYmiREDx",
                "forum": "hB2hXtxIPH",
                "replyto": "dFJirmP7Gb",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7432/Reviewer_GHAQ"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7432/Reviewer_GHAQ"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for answering my questions/comments and for the improvements in the paper."
                    }
                },
                "number": 11,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7432/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700633160682,
                "cdate": 1700633160682,
                "tmdate": 1700633160682,
                "mdate": 1700633160682,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "N1ua7CJlpJ",
            "forum": "hB2hXtxIPH",
            "replyto": "hB2hXtxIPH",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7432/Reviewer_ia9o"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7432/Reviewer_ia9o"
            ],
            "content": {
                "summary": {
                    "value": "The paper presents a unified framework for learning policies for multiple agents where there are homogeneous and heterogeneous tasks, with the goal of addressing limitations of current methods that work with either homogeneous or heterogeneous tasks. Specifically, the paper proposes greedy sequential execution, with value decomposition including a utility that encodes also the interactions between agents and credit assignment calculated as marginal contribution of Shapley values. Simulation experiments considering different types of tasks are performed and results include comparison with other methods."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "- the paper addresses an open problem in MARL, where a general framework able to learn optimal policies for both homogeneous and heterogeneous tasks is still not fully present.\n\n- the paper presents a technically sound method, with the augmented utility, sampled considering the joint actions of other agents who might cooperate, and with the greedy marginal contribution \n\n- the paper includes a fairly comprehensive evaluation of the proposed method and compares with a good number of state-of-the-art approaches, with corresponding insights from the results, as well as ablation studies.\n\n- the paper has a structure that overall clearly show the gap, with specific examples, and motivates the proposed approach."
                },
                "weaknesses": {
                    "value": "- a trend that should be discussed more in detail is in Overcooked, where there is a large standard deviation for both Easy and Medium, with Easy having a decreasing return past 900 episodes. It seems that it didn't converge.\n\nA few minor presentation comments: \n- Section V already introduces comparison methods that are presented in Section VI. It is better instead to introduce the comparison methods in Section V so that the reader doesn't have to guess what methods are they.\n- it is worth including graphically the map for the overcooked environment.\n- the references, when the authors name are not used in the sentence should be all in parentheses, e.g., \" experiences Sunehag et al. (2017); Rashid et al. (2018).\" -> \"experiences (Sunehag et al., 2017); (Rashid et al., 2018).\"\n- please ensure to include the correct venue for papers, instead of just including the arxiv version, e.g., the MAVEN paper was published in NeurIPS 2019."
                },
                "questions": {
                    "value": "Please comment on the trends of overcooked as mentioned in the \"Weaknesses\" box."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission7432/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission7432/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission7432/Reviewer_ia9o"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7432/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698832147423,
            "cdate": 1698832147423,
            "tmdate": 1699636892371,
            "mdate": 1699636892371,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "pPFG1SlNBX",
                "forum": "hB2hXtxIPH",
                "replyto": "N1ua7CJlpJ",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7432/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7432/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for your thoughtful questions and feedback on our paper. Below, we provide detailed responses to each of your questions:\n\n1. Discuss more in detail in Overcooked. \n    \n    The performance in the Overcooked environment is impacted by a variety of factors. **Our settings of difficulty are calibrated based on the ease of discovering rewards.** In simpler scenarios, characterized by more interactive objects and smaller maps, agents have increased opportunities for interaction. **This design, while lowering the barrier for exploration, potentially escalates the difficulty of policy learning as agents progress.** For instance, in scenarios with multiple onions, agents may quickly learn the value of picking up an onion. However, as they develop, they might attempt to pick up different onions, leading to mis-cooperation. This issue is less likely in harder scenarios with fewer onions. These are the reasons that lead to some degree of fluctuation. **However, since the primary challenge of learning is relative overgeneralization and the difficulty in discovering successful instances, our setting is appropriate.** We have added a discussion about this phenomenon in our work. Thank you once again for this suggestion. \n    \n2. It is better instead to introduce the comparison methods in Section V.\n    \n    We have reorganized the content to introduce the comparison methods directly in Section V. We believe that this revised order will enhance the readability and coherence of our manuscript, making it easier for readers to follow the logic and rationale behind our comparative analysis. \n    \n3. It is worth including graphically the map for the overcooked environment.\n    \n    We have included images of the map in the appendix of our manuscript. \n    \n4. About citation. \n    \n    We have revised the citation format throughout our manuscript. We have also updated the manuscript to include the correct publication venues for referenced papers. We appreciate your guidance on these matters and believe these revisions enhance the accuracy and professionalism of our manuscript. \n    \n\nThank you once again for your constructive feedback. We believe that your insights have helped us to improve the clarity and quality of our paper."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7432/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700326302825,
                "cdate": 1700326302825,
                "tmdate": 1700326302825,
                "mdate": 1700326302825,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "fvRN95E5fO",
                "forum": "hB2hXtxIPH",
                "replyto": "pPFG1SlNBX",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7432/Reviewer_ia9o"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7432/Reviewer_ia9o"
                ],
                "content": {
                    "comment": {
                        "value": "Thanks for the response to this and others' reviews. Overall, the paper appears improved."
                    }
                },
                "number": 8,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7432/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700490054540,
                "cdate": 1700490054540,
                "tmdate": 1700490054540,
                "mdate": 1700490054540,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "97WHERlXOo",
            "forum": "hB2hXtxIPH",
            "replyto": "hB2hXtxIPH",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7432/Reviewer_CQwR"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7432/Reviewer_CQwR"
            ],
            "content": {
                "summary": {
                    "value": "The authors propose a general framework for solving both homogeneous and heterogeneous cooperative tasks, which they call Greedy Sequential Execution (GSE). The key idea behind GSE is to sequentially execute the actions of each agent, while taking into account the dependencies between agents measured by greedy marginal contribution."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. The analysis in Sec 3.1 is valuable for readers to gain a deeper understanding of the performance of different policies in homogeneous and heterogeneous scenarios."
                },
                "weaknesses": {
                    "value": "The authors claim that existing solutions have not been successful in **addressing both homogeneous and heterogeneous** scenarios simultaneously, and thus GSE is the first to propose for both scenarios, whose key idea is integrating **sequential execution** and **value decomposition** framework for better **credit assignment** and **cooperation**. However, [1] was published in 2022, which also proposed a general framework based on **sequential execution** for **cooperative games** with **both homogeneous and heterogeneous** agents, and leveraged **advantage value decomposition** for **credit assignment**. \n\nThere are too many overlaps in key ideas between these two works, while the main difference seems to be [1] implements these ideas with PPO and sequence model, i.e. transformer, and GSE implements these ideas in a QMIX-like pattern.\n\nHowever, I have not found any comparison, discussion, or citation to [1] in this paper, which should be compared thoroughly, or the contributions might be significantly weakened.\n\n[1] Wen, Muning, et al. \"Multi-agent reinforcement learning is a sequence modeling problem.\" Advances in Neural Information Processing Systems 35 (2022): 16509-16521."
                },
                "questions": {
                    "value": "I have no further question."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission7432/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission7432/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission7432/Reviewer_CQwR"
                    ]
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7432/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699287690576,
            "cdate": 1699287690576,
            "tmdate": 1700654586201,
            "mdate": 1700654586201,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "XeQHTS8hUD",
                "forum": "hB2hXtxIPH",
                "replyto": "97WHERlXOo",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7432/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7432/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Rebuttal by Authors (1/3)"
                    },
                    "comment": {
                        "value": "Thank you for your suggestion! In the following, we use **MAT** to refer to your suggested work [1]. According to your suggestion, we have now explicitly discussed the relationships between our solution and MAT in the related works of our revision. This discussion also involves HAPPO, which is the base of MAT. We now summarize the differences between our work and these methods for your reference. \n\nThe contributions of our method are as follows: \n\n1. Our proposed utility function adheres to the Individual-Global-Maximum (IGM) principle, with the policy depending solely on local observation. \n\n2. Our method analyzes and can overcome the problem of relative over-generalization. \n\n3. Our method achieves explicit credit assignment. \n\n4. The policy utilizes sequential execution to learn both homogeneous and heterogeneous policies. \n\nIn the table below, we compare the characteristics of our method with MAT, HAPPO, as well as our selected baselines in the paper (QMIX, CDS, MAVEN, Shapley). It is evident that compared to baseline methods, HAPPO and MAT have less relevance to our method, as they only use sequential execution to achieve monotonic improvement.\n\n| Method    | IGM principle | Policy relies on local observation | Learn both homogeneous and heterogeneous policies | Overcome relative over-generalization | Explicit credit assignment |\n|-----------|---------------|------------------------------------|---------------------------------------------------|--------------------------------------|---------------------------|\n| GSE       | Yes           | Yes                                | Yes                                               | Yes                                  | Yes                       |\n| QMIX      | Yes           | Yes                                | No                                                | No                                   | No                        |\n| CDS       | Yes           | Yes                                | Yes                                               | No                                   | No                        |\n| MAVEN     | Yes           | Yes                                | No                                                | Yes                                  | No                        |\n| Shapley   | No            | Yes                                | No                                                | Yes                                  | Yes                       |\n| MAT       | No            | No                                 | Yes                                               | No                                   | No                        |\n| HAPPO     | No            | No                                 | Yes                                               | No                                   | No                        |\n\nFirst, we will explore the distinctions in utility function structures between value decomposition and policy gradient (PG) methods, and the unique challenges each approach presents in multi-agent reinforcement learning. \n\n1. **Utility Functions Structure:** \n\n    a. **We adhere to IGM principle and only requires local observation, whereas MAT requires joint observations:** In our approach, we introduce a distinctive value decomposition framework implemented by a versatile utility function. This utility function is designed to accurately represent reward function while strictly adhering to the IGM principle. This adherence is crucial as it facilitates more effective credit assignment in multi-agent settings, a key aspect of our research's contribution to value decomposition methods. By adhering to the IGM principle, our utility and policy functions depend exclusively on **local observation** for decision-making. In contrast, MAT adopts policy gradient (PG) approaches, utilizing the transformer's encoder as its value function and the decoder as the policy structure, necessitating **joint observations** to generate actions."
                    }
                },
                "number": 1,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7432/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700325631155,
                "cdate": 1700325631155,
                "tmdate": 1700325631155,
                "mdate": 1700325631155,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "0lcrbwIYBw",
                "forum": "hB2hXtxIPH",
                "replyto": "97WHERlXOo",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7432/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7432/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Rebuttal by Authors (2/3)"
                    },
                    "comment": {
                        "value": "1. **Utility Functions Structure:**\n\n    b. **Unique challenges of different paradigms:** Regarding policy gradient (PG) methods, as we all know, value-based methods and PG methods represent different paradigms in MARL, each with its own features. Value decomposition approaches utilize the IGM principle to model the global maximizer of the joint state-action value function as the combination of individual agent value maximizers, providing a clear and scalable optimization strategy [2][3]. Yet, IGM may not always be applicable, such as in sequential execution scenarios. This limitation is precisely what we have addressed in our work. Conversely, PG methods typically extend single-agent actor-critic algorithms to multi-agent contexts, where the critic is trained on joint observations’ value function. While PG methods like MAPPO demonstrate empirical successes, they struggle with ensuring monotonic improvement, prompting methods like HAPPO, which specifically address this issue to enhance previous PG methods. This distinction in paradigms highlights the unique challenges and methodologies that our research brings to MARL. The table illustrates that our focus is on addressing issues pertinent to value decomposition methods, positioning our work in closer relation and comparison to other methods within this framework. \n\nNext, we will delve into the unique aspects of credit assignment in our method, focusing on how it addresses the issue of relative over-generalization and implements explicit credit assignment techniques. \n\n2. **Credit assignment:** \n\n    a. **Overcome the problem of relative over-generalization:** Our method introduces a novel approach to credit assignment through the concept of **greedy marginal contribution** to address potential issues of mis-cooperation, often referred to as **the relative over-generalization problem**. This problem typically arises when agents executing earlier in the sequence lack crucial information about the subsequent actions of their counterparts. Our method of greedy marginal contribution employs optimal cooperative actions to calculate marginal contributions in collaboration with preceding agents. This approach directly addresses and compensates for information asymmetry, leading to more effective and accurate credit assignment. In contrast, MAT adopts advantage value decomposition within the structure of a transformer. This design is aimed at executing updates both monotonically and in parallel, thereby enhancing the time efficiency compared to previous methods like HAPPO. However, it does not specifically address the relative over-generalization problem of the value decomposition methods, which is a central concern in our approach. By focusing on the optimal cooperative policy and addressing potential mis-cooperation, our method’s credit assignment differentiates itself significantly from the advantage value decomposition used in MAT. \n\n    b. **Explicit credit assignment:** Our method enables explicit credit assignment by utilizing the marginal contribution of Shapley values. It allows us to compute the credit value of an individual agent's action at a single timestep, which can be applied to reward distribution on recruitment [4] or for pricing [5]. In contrast, MAT cannot compute a credit value for a single observation and action pair, as the utility is based on joint observations. Therefore, our solution offers broader applicability in more realistic settings. \n\nNext, we will discuss the proposal and contributions of using sequential execution in different methods. \n\n3. **Propose of using sequential execution:**\n\n    a. **Different objectives:** Our work delves into why existing value decomposition methods fail to simultaneously represent both homogeneous and heterogeneous policies. Through this analysis, we introduce the concept of **greedy sequential execution** as a novel solution. The core contribution of our research lies not merely in proposing a new sequential execution method, but in innovatively applying this concept within the context of value-based methods by proposing an IGM utility function as well as the greedy sequential execution to solve the relative over-generalization problem. These problems have not been analyzed and solved before and are important for the value decomposition method to be implemented in real-world scenarios. In contrast, MAT does not directly address the challenge that **merely using sequential execution policies does not conform to the IGM principle and cannot solve the relative over-generalization problem**. This is because MAT leverages transformer structures to achieve on-policy and monotonic performance enhancement within the framework of PG methods, without specifically addressing the challenges we focus on. Therefore, MAT is not suitable to be compared as a baseline in our setting."
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7432/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700325997049,
                "cdate": 1700325997049,
                "tmdate": 1700326176039,
                "mdate": 1700326176039,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "G6OCgCJ1vv",
                "forum": "hB2hXtxIPH",
                "replyto": "97WHERlXOo",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7432/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7432/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Rebuttal by Authors (3/3)"
                    },
                    "comment": {
                        "value": "In summary, while both our method and MAT aim to improve the performance of cooperative multi-agent systems, they do so from different perspectives and using different techniques. We believe that our approach offers a novel and effective solution to the challenges of learning both homogeneous and heterogeneous policies simultaneously when using value decomposition methods in multi-agent systems. Its efficiency is further validated through comparisons with other value decomposition methods. \n\nThank you once again for your constructive feedback. We believe that your insights have helped us to improve the clarity and quality of our paper. \n\n[1] Wen, Muning, et al. \"Multi-agent reinforcement learning is a sequence modeling problem.\" Advances in Neural Information Processing Systems 35 (2022): 16509-16521. \n\n[2] Dou Z, Kuba J G, Yang Y. Understanding value decomposition algorithms in deep cooperative multi-agent reinforcement learning[J]. arXiv preprint arXiv:2202.04868, 2022. \n\n[3] Wang J, Ren Z, Liu T, et al. QPLEX: Duplex Dueling Multi-Agent Q-Learning[C]. International Conference on Learning Representations. 2020. \n\n[4] Shen S, Ji M, Wu Z, et al. An optimization approach for worker selection in crowdsourcing systems[J]. Computers & Industrial Engineering, 2022, 173: 108730. \n\n[5] Landinez-Lamadrid D C, Ramirez-Ríos D G, Neira Rodado D, et al. Shapley Value: its algorithms and application to supply chains[J]. INGE CUC, 2017, 13(1): 53-60."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7432/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700326084022,
                "cdate": 1700326084022,
                "tmdate": 1700326084022,
                "mdate": 1700326084022,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "UqaWN0XH7d",
                "forum": "hB2hXtxIPH",
                "replyto": "97WHERlXOo",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7432/Reviewer_CQwR"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7432/Reviewer_CQwR"
                ],
                "content": {
                    "title": {
                        "value": "Thanks so for authors' clarification and here are a few further suggestions."
                    },
                    "comment": {
                        "value": "Thank you for the clarification, which makes the contributions of this work more clear and specific, especially the 2.a & 2.b. \n\nJust a personal thought, the **Explicit credit assignment** with greedy marginal contribution is the most attractive contribution of this work in the field of value-decomposition methods for cooperative MARL. But the original writing spent too much in emphasizing **handling both homogeneous and heterogeneous** (actually, it is not a new topic currently), which instead led to obscuring the contribution of the explicit credit assignment as well as locating this work into an unnecessarily over-large scope. In other words, if this work mainly claims that \"we propose a new framework that addresses both homogeneous and heterogeneous scenarios well\", you have to compare it with other existing works that address both homogeneous and heterogeneous scenarios like the MAT to prove this work is non-trivial (since from the title of the article, the MAT can also be described similarly as \"SEQUENTIAL EXECUTION: SOLVING HOMOGENEOUS AND HETEROGENEOUS COOPERATIVE TASKS WITH A UNIFIED FRAMEWORK\"). Otherwise, if the main claim of this work is a novel value-decomposition method that is capable of both homogeneous and heterogeneous agents, the comparison is unnecessary but the scope of contribution in the original writing should be adjusted and explained a bit according to the rebuttal provided by authors (this rebuttal is more specific about the scope of this work then that in the original writing). \n\nIt is overall a writing issue instead of a technical issue, if authors can make sure to address my concerns in the later version, I am willing to update my score to positive.\n\nMinor issue:\nSimilar reason to the above discussion, the beginning sentences in the abstract \"Effectively handling both homogeneous and heterogeneous tasks is crucial for the practical application of cooperative agents. However, existing solutions have not been successful in addressing both types of tasks simultaneously.\" are misleading without a correct specification about the scope of this paper. (Is MAT an existing solution in addressing both homogeneous and heterogeneous tasks? Is it successful? If not, why?)"
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7432/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700478699201,
                "cdate": 1700478699201,
                "tmdate": 1700478717977,
                "mdate": 1700478717977,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "9o5kkSenuU",
                "forum": "hB2hXtxIPH",
                "replyto": "97WHERlXOo",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7432/Reviewer_CQwR"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7432/Reviewer_CQwR"
                ],
                "content": {
                    "title": {
                        "value": "Thanks for authors' effort"
                    },
                    "comment": {
                        "value": "Thanks for providing the revision, this revision is clearer about the scope of this paper and has addressed most of my concerns. I am delighted to increase my score."
                    }
                },
                "number": 13,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7432/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700654528955,
                "cdate": 1700654528955,
                "tmdate": 1700654554249,
                "mdate": 1700654554249,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]