[
    {
        "title": "Online Weight Approximation for Continual Learning"
    },
    {
        "review": {
            "id": "LI6hrs8thg",
            "forum": "HCCkCjClO0",
            "replyto": "HCCkCjClO0",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6374/Reviewer_Si3p"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6374/Reviewer_Si3p"
            ],
            "content": {
                "summary": {
                    "value": "This paper presents Online Weight Approximation (OWA) to address the forgetting in continual learning. Specifically, OWA tries to model the dynamics of the weights across the learned task sequence to mitigate the forgetting issue. Experiments on several datasets and baselines show the effectiveness of the proposed method."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "This paper proposes  Online Weight Approximation (OWA)  to mitigate forgetting in continual learning."
                },
                "weaknesses": {
                    "value": "* The paper writing needs to be further improved. In the abstract section, this section should clearly state what specific problem you are trying to address. For example, the authors state that they are trying to address catastrophic forgetting. The forgetting issue is extensively studied in existing works. The abstract should state what are the limitations that exist in CL literature. Then, this paper should state how their proposed method addresses this specific problem.  Second, the motivation of introducing Online Weight Approximation (OWA) to continual learning is unclear. After reading the paper, it is unclear how OWA addresses the forgetting issue. Third, in the related work section, not only related works should be presented, but also their limitations and relation of the proposed OWA with existing methods should be clearly presented. Lastly, the method description should be clearly connected with continual learning. \n\n\n* Lack of insight into how the proposed OWA mitigates forgetting. It would be better to provide more insights and illustrations of OWA and the connection with catastrophic forgetting. \n\n\n* It is unclear the advantage of the proposed method compared to other related methods. In the introduction and the method sections, the paper should state the advantages of the proposed method compared to others. This would make the positions of the paper more clear.   \n\n\n* The compared baselines are too weak. OWA is only compared to a simple replay method. More recent memory-replay methods should be compared. For example, [1, 2] should be compared.\n\n\n\n\nReference\n\n\n[1]  Dark Experience for General Continual Learning: a Strong, Simple Baseline. Neurips 2020\n\n[2]  Gradient Projection Memory for Continual Learning.   ICLR 2021"
                },
                "questions": {
                    "value": "N/A"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6374/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1697677696810,
            "cdate": 1697677696810,
            "tmdate": 1699636704915,
            "mdate": 1699636704915,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "EaqOrB4sPR",
                "forum": "HCCkCjClO0",
                "replyto": "LI6hrs8thg",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6374/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6374/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Answer to Reviewer Si3p"
                    },
                    "comment": {
                        "value": "We thank the reviewer for their suggestion regarding the scope of the paper\nand the provided reference for further experimental comparison.\n\nRegarding the scope, we should probably specify better which particular\ntarget we checked in the experiment. However, we thought that our\ncontribution could go beyond the tasks tested in the experimental campaign,\nsince the whole continual learning community could benefit from the\nintuitions and results provided in this paper. Also, since our contribution\ndo not build upon any previous method, we thought not to be fair to criticize\nthe approaches of related works or highlight their limitations.\n\nThe advantage of the proposed method consists in the possibility to train a\nsingle model on several tasks while retaining the capability to predict on\nprevious tasks by means of a simple weight adaptation. The memory required\nfor this adaptation is limited, being only N times the number of parameter in\nthe network, where N is the number of coefficients required to approximate\nthe trajectory of the weights across the task.  As we show in the\nexperiments, the proposed approach is particularly efficient in scenarios\nwith many tasks with respect to a simple experience replay method, which\nwould require much more memory to obtain similar results."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6374/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700725636651,
                "cdate": 1700725636651,
                "tmdate": 1700725636651,
                "mdate": 1700725636651,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "PWQqnt3N6r",
            "forum": "HCCkCjClO0",
            "replyto": "HCCkCjClO0",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6374/Reviewer_nrVT"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6374/Reviewer_nrVT"
            ],
            "content": {
                "summary": {
                    "value": "The paper presents a method based on online weight approximation for task-incremental learning."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "The proposed method is new, but I believe it is weaker than some existing methods."
                },
                "weaknesses": {
                    "value": "As stated in the paper, “in this work we concentrate on scenarios where at test time the identifier of the distribution from which the sample was collected is predetermined or known in advance.” You are in effect solving the task-incremental learning (TIL) problem. Many TIL techniques can already achieve forgetting-free. Your method is also weaker than some existing methods. So, the value of your method is limited. Please check out the following,\n\n(1)\tSerra et al. Overcoming catastrophic forgetting with hard attention to the task. ICML-2018.\n(2)\tWortsman et al. Supermasks in superposition. NeurIPS-2020. \n(3)\tKe, et al. Achieving Forgetting Prevention and Knowledge Transfer in Continual Learning. NeurIPS-2021. \n(4)\tLin et al. Trgp: Trust region gradient projection for continual learning, ICLR-2022\n(5)\tLin et al. Beyond not-forgetting: Continual learning with backward knowledge transfer. NeurIP-2022. \n\nThe paper seriously lacks citations and discussion of and experimental comparisons with related literature. The systems in the above references and (6) below should be compared. \n\nIn the later part of the paper, you stated, “Throughout this paper we will assume the more definite scenario of task incremental learning.” But in the abstract and introduction, you said domain-incremental learning and class-incremental learning. \n\nYour first set of experiments (section 4.1) should have some knowledge transfer. References (3), (4) and (5) can transfer knowledge across tasks. Your method by nature cannot perform knowledge transfer. \n\nIn your second set of experiments (section 4.2), you claimed that you are doing class-incremental learning, but since you have no task identification prediction, you are doing TIL. Your evaluation metric is average incremental accuracy, and the results are weak. Please see reference (6) below, which gives the last accuracy after all tasks are trained. The last accuracy should be much lower than average incremental accuracy. A principled way for task identification prediction is also offered in (6). \n\n(6). Kim et al. A theoretical study on solving continual learning. NeurIPS-2022\n\nWhat data is used to train eq 7? It isn’t described explicitly in the paper. My understanding is that it is just the data of each task. Then, your method is very similar to SupSup (2). The size of C^j for each task j is potentially the full network size. \n\nIs w^i represents the set of weights for task i?\n\nWhat is N is eq 3? I am unfamiliar with the order of approximation. \n\nWhy do you use ResNet10 for some datasets and ResNet18 for some other datasets?"
                },
                "questions": {
                    "value": "The questions are included in the weakness section."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6374/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698686045291,
            "cdate": 1698686045291,
            "tmdate": 1699636704739,
            "mdate": 1699636704739,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "zd9KTIIBRw",
                "forum": "HCCkCjClO0",
                "replyto": "PWQqnt3N6r",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6374/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6374/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Answer to Reviewer nrVT"
                    },
                    "comment": {
                        "value": "We thank the reviewer for their valuable comments.\n\nHowever, we do not understand the comment, “Your method by nature cannot\nperform knowledge transfer”. The manner in which the coefficients\napproximating the weight trajectory among different tasks are adjusted,\ndistinctly retains a memory of the previous tasks. Conversely, newer tasks\nmodify the weight approximation even at the outset of the task sequence. We\nwould greatly appreciate it if you could provide further clarification on\nthis remark.\n\nRegarding the accuracy, what we are displaying in the plots is actually the\naccuracy on current and previous tasks after training on the current task.\nIt is not the average incremental accuracy which would be, clearly, much\nhigher.\n\nRegarding the data used to train Eq. (7), the update of the coefficient is\nsolely based on the value of the $i$-th weight of the network at a specific\ntraining epoch, as outlined in Algorithm 1. The notation $w_i^k$ denotes the\nvalue of the $i$-th weight of the network at the $k$-th update step in our\nmethod. If we employ an update policy that adjusts the coefficients only once\nper task, then indeed $w_i^k$ represents the value of the $i$-th parameter of\nthe network at the conclusion of the $k$-th task.\n\nThe parameter $N$ represents the number of Legendre polynomials utilized in\nthe approximation, as in Eq. (2). We acknowledge that our definition of this\ncrucial parameter should be clearer, and we addressed it."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6374/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700725593060,
                "cdate": 1700725593060,
                "tmdate": 1700725593060,
                "mdate": 1700725593060,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "muvhBkt3Mu",
            "forum": "HCCkCjClO0",
            "replyto": "HCCkCjClO0",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6374/Reviewer_fbhj"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6374/Reviewer_fbhj"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes an \"online weight approximation\" scheme to enable continual learning in challenging domain incremental and class incremental learning setups."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. The paper is well written, and the problem setup is mostly clear.\n2. Mentioned problem setups are challenging and interesting."
                },
                "weaknesses": {
                    "value": "My main concern is the scalability of the proposed method and also the limited empirical evaluations.\n\n1. The proposed uses $O(n^{2})$ training time for each parameter of the model, which seems quite large, considering the number of parameters present in a typical deep neural network. Therefore, I believe it is necessary to compare the time required to train the proposed method with the other baselines.\n\n2. Empirical evaluation does not include large deep neural networks. For CIFAR10 experiment, authors have used ResNet-10, however, it is not that deep. I suggest the authors to use deeper neural networks, like ResNet-34/50, Vgg-16/19, WideResNet.\n\n3. Additionally, the datasets used for empirical evaluation is not large scale dataset. I suggest the authors to experiment with ImageNet-1k. If it is not possible due to limited resources, then try to evaluate on ImageNet-100.\n\n4. I also think that it is not fair to reduce the number of replay samples of a rehearsal based methods such as Experience Replay, as you are model (parameters) is using very limited memory. This type of comparison is unfair to a rehearsal based methods. In that case, I would suggest the authors to not to use any memory at all and simply compare with regularization based methods such as EWC[1], MAS[2] etc.\n\n5. Finally, this paper does not compare with recent continual learning baselines, EWC[1], MAS[2], GDumb [3], REMIND[4], DER++[5], CLS-ER[6].\n\n[1] Kirkpatrick, James, Razvan Pascanu, Neil Rabinowitz, Joel Veness, Guillaume Desjardins, Andrei A. Rusu, Kieran Milan et al. \"Overcoming catastrophic forgetting in neural networks.\" Proceedings of the national academy of sciences 114, no. 13 (2017): 3521-3526.\n\n[2] Aljundi, Rahaf, Francesca Babiloni, Mohamed Elhoseiny, Marcus Rohrbach, and Tinne Tuytelaars. \"Memory aware synapses: Learning what (not) to forget.\" In Proceedings of the European conference on computer vision (ECCV), pp. 139-154. 2018.\n\n[3] Prabhu, Ameya, Philip HS Torr, and Puneet K. Dokania. \"Gdumb: A simple approach that questions our progress in continual learning.\" In Computer Vision–ECCV 2020: 16th European Conference, Glasgow, UK, August 23–28, 2020, Proceedings, Part II 16, pp. 524-540. Springer International Publishing, 2020.\n\n[4] Hayes, Tyler L., Kushal Kafle, Robik Shrestha, Manoj Acharya, and Christopher Kanan. \"Remind your neural network to prevent catastrophic forgetting.\" In European Conference on Computer Vision, pp. 466-483. Cham: Springer International Publishing, 2020.\n\n[5] Buzzega, Pietro, Matteo Boschini, Angelo Porrello, Davide Abati, and Simone Calderara. \"Dark experience for general continual learning: a strong, simple baseline.\" Advances in neural information processing systems 33 (2020): 15920-15930.\n\n[6] Arani, Elahe, Fahad Sarfraz, and Bahram Zonooz. \"Learning fast, learning slow: A general continual learning method based on complementary learning system.\" arXiv preprint arXiv:2201.12604 (2022)."
                },
                "questions": {
                    "value": "Refer to the weakness section."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission6374/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6374/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6374/Reviewer_fbhj"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6374/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698751734857,
            "cdate": 1698751734857,
            "tmdate": 1699636704586,
            "mdate": 1699636704586,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "XQdGCjo4rk",
                "forum": "HCCkCjClO0",
                "replyto": "muvhBkt3Mu",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6374/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6374/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Answer to Reviewer fbhj"
                    },
                    "comment": {
                        "value": "We thank the reviewer for proposing several improvements regarding the\nclarity of the paper and for providing valuable suggestions regarding the\nexperimental comparisons.\n\nOur method necessitates the storage and the update of $N$ coefficients for\neach model parameter, resulting in $N$ times the number of parameters in the\nmodel. More precisely, $N$ represents the number of terms used in the\nexpansion for parameter trajectory approximation. The update of these\ncoefficients between different tasks is accomplished through linear\ncomputations (refer to Eq. 7) involving fixed, known matrices that are shared\namong all network parameters, making the process highly\nefficient. Experimentally, we did not observe a significant computational\nburden, and the experiments exhibited similar running times compared to the\nbaselines.  In response to the reviewer's comments, incorporating a\nquantitative measure of this efficiency will undoubtedly enhance the\narticle's quality.\n\nRegarding the choice on the number of replay samples, we agree that\nincreasing the number of samples would have increased the performance of the\ncompared replay method. However, we think that employing a number of samples\nequivalent to the memory required by our method would be the most fair\nsetting."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6374/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700725523102,
                "cdate": 1700725523102,
                "tmdate": 1700725523102,
                "mdate": 1700725523102,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "B8PikuW8KC",
            "forum": "HCCkCjClO0",
            "replyto": "HCCkCjClO0",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6374/Reviewer_AoB5"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6374/Reviewer_AoB5"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes a continual learning scheme named Online Weight Approximation (OWA) motivated by the theory of online function approximation. The proposed method models the dynamics of the weights in deep neural networks and aims to alleviate catastrophic forgetting in task-incremental learning scenario. It is evaluated on multiple continual learning datasets and compared with a replay strategy, demonstrating its negligible loss of performance."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "1 poor"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1) The proposed method focuses on the capacity problem of continual learning, which is a core and meaningful side in the long view of CL research. Their approach tries to fix the model capacity by sampling weights rather than storing it, which is creatively motivated from function approximation.\n2) The method is based on a solid theory from computational mathematics. The paper also provides certain rigorous theorems for their method."
                },
                "weaknesses": {
                    "value": "1. The experiment lacks diversity. The authors made the same experiment repeatedly on different datasets, which resulted in similar conclusions. \n2. The datasets benchmarked by their experiment are relatively simple.\n3. The experiment compared with too few and simple baselines, in which “Vanilla”is literally not a continual learning method."
                },
                "questions": {
                    "value": "1.  It is  mentioned in the paper that memory budget in your method is constant. Could you explain that? Particularly, I wonder the number of Euler steps $S$  in the coefficients $\\tilde{C}_i^S$ was fixed or not. If not, how does it evolve properly, without proportional increasing?\n2. Which replay method did you compare with specifically? Replay methods have had a long history since the emergence of continual learning research, and their performances varied quite a lot. But the performance in your experiment is not so good, which is hard to believe as a state-of-the-art. It would be valuable to discuss how OWA compares to other methods."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6374/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698843150723,
            "cdate": 1698843150723,
            "tmdate": 1699636704455,
            "mdate": 1699636704455,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "il5JRZ3Ef0",
                "forum": "HCCkCjClO0",
                "replyto": "B8PikuW8KC",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6374/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6374/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Answer to Reviewer AoB5"
                    },
                    "comment": {
                        "value": "We thank the reviewer for their specific questions, helping us to enhance the\npresentation of our work.\n\nOur method relies on the concept of approximating the trajectory of weights\nacross different tasks. We achieve this by introducing a technique to update\nthe coefficients of a specific polynomial expansion for each weight in the\nneural network (NN). Once we determine the order of the approximation,\ndenoted as $N$ (representing the number of coefficients to retain in the\nexpansion presented in Eq. 2), irrespective of the Euler's step performed,\nonly $N$ values need to be stored in memory for each weight of the\nnetwork. The elegance of the method lies in the fact that we simply\n*update* these coefficients rather than adding new ones. The update is\nperformed in a manner that preserves the memory of the information observed.\n\nRegarding the replay strategy, we employed a straightforward experience\nreplay method, determining the size of the buffer as outlined in the paper."
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6374/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700725433401,
                "cdate": 1700725433401,
                "tmdate": 1700725433401,
                "mdate": 1700725433401,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]