[
    {
        "title": "G4SATBench: Benchmarking and Advancing SAT Solving with Graph Neural Networks"
    },
    {
        "review": {
            "id": "9Qa21ParFF",
            "forum": "iUD9FklwQf",
            "replyto": "iUD9FklwQf",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6864/Reviewer_Enee"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6864/Reviewer_Enee"
            ],
            "content": {
                "summary": {
                    "value": "Despite GNNs showing promise in SAT solving, a standard dataset and comparison benchmark were lacking. The paper introduced G4SATBench, the first benchmark for evaluating GNNs in solving SAT.  G4SATBench, comprising 7 problems with 3 difficulty tiers, assesses several GNN models across various prediction tasks, training objectives, and inference algorithms. Empirical evaluation using G4SATBench indicate GNNs excel at greedy local search strategies but struggle with backtracking search in latent spaces."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. The problem the paper is trying to address is important. Indeed, we should have a uniform way for evaluating the GNN-for-SAT approaches emerging in recent years.\n2. I appreciate the large amount of experiments (consuming 8,000 GPU hours) and data the author put effort to in studying GNN for SAT. \n3. The way of comparing the training and solving processes of GNNs with both CDCL and local search in SAT solvers is interesting to me."
                },
                "weaknesses": {
                    "value": "1. G4SATBench contains only small scale formulas with at most 400 variables. However, industrial-level SAT formulas and formulas in SAT competitions can easily have thousands or even millions of variables. In order to make GNN-for-SAT approach practically applicable, the benchmarks using in the evaluation should also consider real-world level cases, such as large SAT formulas. I would encourage the authors to include such cases in G4SATBench. \n\n2. GNN models evaluated in the study only contains basic ones, including NeuroSAT (the first GNN-for-SAT model), GCN, GGNN, and GIN. It would be interesting to compare GNN models applied by recent GNN-for-SAT approaches, and see how they perform in G4SATBench,  instead of only considering basic GNN models. \n\n3. For experiments comparing with CDCL heuristics, the authors apply contrastive pretraining to pretrain the representation of CNF formulas to be close to their augmented ones with learned clauses. I have some doubts on the experimental setup. The learned clauses are not static and can vary depending on which CDCL solver we use. Studying whether GNN can learn these learned clauses is not quite reasonable to study if CNN can mimic CDCL. Furthermore, even though GNN can infer a bunch of learned clauses, can we say that CNN can learn a solving strategy akin to CDCL? As we know that CDCL not only involves clause learning, but also variable branching, etc."
                },
                "questions": {
                    "value": "1. Why only small scale SAT formulas are included in the benchmark?\n2. Why only basic GNN models are applied in the paper?\n3. What is the rationale behind the comparison between GNN and CDCL heuristics? Can you illustrate in more details?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "details_of_ethics_concerns": {
                    "value": "N/A"
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission6864/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6864/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6864/Reviewer_Enee"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6864/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698529258099,
            "cdate": 1698529258099,
            "tmdate": 1699636796986,
            "mdate": 1699636796986,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "d4ZNdI1XkA",
                "forum": "iUD9FklwQf",
                "replyto": "9Qa21ParFF",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6864/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6864/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for your thorough review of our paper. We value your insights and would like to address your questions as follows:\n\n> Why only small scale SAT formulas are included in the benchmark?\n\nWe acknowledge the potential value of including industrial-scale SAT instances in G4SATBench. However, our decision to exclude these instances is based on several considerations:\n\n- Firstly, the size of industrial SAT instances often exceeds 1 million variables and clauses, which poses significant challenges for training GNN models effectively within GPU memory constraints. Furthermore, they are always limited in number (e.g., the industrial instances in SAT competitions are less than 1,000 instances), making it harder to train a good GNN model, as a diverse and ample dataset is critical for effective training.\n- Secondly, we find that small-sized industrial instances in SAT Competitions often exhibit a high degree of similarity in their clauses, particularly within the same domain. This limits the ability of GNN models trained and evaluated on these instances to demonstrate true generalization across varied SAT problems.\n- Thirdly, to partially address this, G4SATBench incorporates pseudo-industrial generators (CA and PS) to emulate some characteristics of industrial instances. This approach allows us to simulate the structure complexity of industrial scenarios while maintaining manageable dataset sizes and instance sizes.\n- Lastly, our core objective is to establish a comprehensive framework for evaluating GNN-based SAT solvers and investigate how and what can (standalone) GNN models learn to solve SAT. Our results show that GNN models can develop a novel solving heuristic akin to local search, but fail to learn or mimic CDCL heuristic. Consequently, for broader applicability in industrial instances, we suggest future research could develop *neural-guided* SAT solvers that integrate the strengths of GNN models with modern CDCL-based approaches. We expect that our insights from G4SATBench will be instrumental in guiding such advancements.\n\n> Why only basic GNN models are applied in the paper?\n\nWe observe that many existing GNN architectures for SAT solving only perform minor modifications to the original NeuroSAT [1,2], and the difference in performance between their architectures and NeuroSAT is marginal (experiments in G4SATBench also demonstrate that the performance between different GNN models is always similar). While there are some indeed novel GNN architectures for SAT solving [3,4], they are tailored for instances *not in CNF* and specialized to specific applications (like CircuitSAT), rather than general purposes. Due to this specialized nature, we've chosen to keep them outside the current scope of G4SATBench. Although using more advanced GNN models could achieve better performance, we believe our findings on the learning ability and limitations of GNN-based SAT solvers are still valid for these static GNN models, given their shared fundamental message-passing framework."
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6864/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1699924620632,
                "cdate": 1699924620632,
                "tmdate": 1699924620632,
                "mdate": 1699924620632,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "OauoWOqsqA",
                "forum": "iUD9FklwQf",
                "replyto": "9Qa21ParFF",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6864/Reviewer_Enee"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6864/Reviewer_Enee"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for your clarification. For future work, I would suggest 1) expanding G4SATBench by adding more real-world SAT formulas from the industry with moderate sizes, 2) expanding the GNN models under study with more recent GNN models, and 3) developing more convincing methods to study GNN for CDCL heuristics. I would like to keep my current score."
                    }
                },
                "number": 14,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6864/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700588251967,
                "cdate": 1700588251967,
                "tmdate": 1700588345404,
                "mdate": 1700588345404,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "UjZk4eEnvh",
            "forum": "iUD9FklwQf",
            "replyto": "iUD9FklwQf",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6864/Reviewer_Fzt9"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6864/Reviewer_Fzt9"
            ],
            "content": {
                "summary": {
                    "value": "This paper studies Graph neural networks for the Boolean Satisfiability Problem. As claimed by the authors, previous research pays little attention on the dataset and benchmark to evaluate and compare existing approaches. In this work, the authors propose G4SATBench, which accounts those aspects ignored by previous research works. The authors claim that their proposed G4SATBench is  the first benchmark study that establishes a comprehensive evaluation framework for GNN-based SAT solvers."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. This paper focus on benchmark studying, which is a foundational work in GNN-based SAT solvers.\n2. G4SATBench contains a diverse set with enough domain areas and difficulty levels.\n3. Publicly available source code is provided."
                },
                "weaknesses": {
                    "value": "I have several comments regarding this submission.\n\n1. As described in this submission, the G4SATBench benchmark consists of 3 instance families, including random instances, pseudo-industrial instances, and combinatorial instances. However, SAT is so fascinating because of its great importance in real-world industrial applications. As a top-tier conference submission that focuses on proposing a SAT benchmark, it is needed to include industrial SAT instances. Hence, the lack of industrial SAT instances degrades the significance of this work.\n\n2. It seems that the technical merit of this work is a bit thin. This paper describes a SAT benchmark, rather proposing new SAT solving techniques. Also, the authors claim that an insight obtained from this paper is that GNN models can effectively learn a simple greedy local search strategy (such as GSAT algorithm), but it is difficult to learn backtracking search strategy (such as DPLL and CDCL). Since it is well-known that, for solving application SAT instances, CDCL-based SAT solvers greatly outperform local search SAT solvers. The insight of this work seems to argue that GNN-based SAT solvers are not promising to solve application SAT instances, which also degrades the significance of this work."
                },
                "questions": {
                    "value": "Please see my comments in the Weaknesses section."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "details_of_ethics_concerns": {
                    "value": "I have no ethic concern about this submission."
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission6864/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6864/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6864/Reviewer_Fzt9"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6864/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698564236224,
            "cdate": 1698564236224,
            "tmdate": 1699636796848,
            "mdate": 1699636796848,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "PyKZlZaJMM",
                "forum": "iUD9FklwQf",
                "replyto": "UjZk4eEnvh",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6864/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6864/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for the feedback and comments! In the following, we hope to answer the concerns you have mentioned:\n\n> The lack of industrial SAT instances degrades the significance of this work.\n\nWe acknowledge the potential value of including industrial-scale SAT instances in G4SATBench. However, our decision to exclude these instances is based on several considerations:\n\n- Firstly, the size of industrial SAT instances often exceeds 1 million variables and clauses, which poses significant challenges for training GNN models effectively within GPU memory constraints. Furthermore, they are always limited in number (e.g., the industrial instances in SAT competitions are less than 1,000 instances), making it harder to train a good GNN model, as a diverse and ample dataset is critical for effective training.\n- Secondly, we find that small-sized industrial instances in SAT Competitions often exhibit a high degree of similarity in their clauses, particularly within the same domain. This limits the ability of GNN models trained and evaluated on these instances to demonstrate true generalization across varied SAT problems.\n- Thirdly, to partially address this, G4SATBench incorporates pseudo-industrial generators (CA and PS) to emulate some characteristics of industrial instances. This approach allows us to simulate the structure complexity of industrial scenarios while maintaining manageable dataset sizes and instance sizes.\n- Lastly, our core objective is to establish a comprehensive framework for evaluating GNN-based SAT solvers and investigate how and what can (standalone) GNN models learn to solve SAT. Our results show that GNN models can develop a novel solving heuristic akin to local search, but fail to learn or mimic CDCL heuristic. Consequently, for broader applicability in industrial instances, we suggest future research could develop *neural-guided* SAT solvers that integrate the strengths of GNN models with modern CDCL-based approaches. We expect that our insights from G4SATBench will be instrumental in guiding such advancements.\n\n> The insight of this work seems to argue that GNN-based SAT solvers are not promising to solve application SAT instances, which also degrades the significance of this work.\n\nOne of our key contributions is to shed light on the capabilities and limitations of (standalone) GNN-based SAT solvers. While existing studies have mainly focused on developing various GNN architectures and methods to enhance solver performance, our work uniquely delves into understanding the mechanisms of how GNNs can learn to solve SAT problems. We acknowledge that CDCL-based SAT solvers currently outperform local search SAT solvers in most practical SAT applications. Given this nature, in Appendix E, we highlight the potential for future research to build *neural-guided* SAT solvers by integrating GNN models with modern CDCL-based solvers. For instance, GNN models could be employed as advanced local search heuristics, activated during the restart phases of CDCL-based SAT solvers. Or, leveraging the strong performance of GNN models in predicting unsat-core variables, as evidenced in G4SATBench, we could utilize these predictions to inform the branching decisions of CDCL-based solvers, thereby enhancing their efficiency. The goal of G4SATBench is not necessarily to develop a state-of-the-art SAT solver but rather to offer valuable insights into the strategies of GNN models for SAT solving. We hope these insights can lay the groundwork for future innovations and hybrid approaches in this area."
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6864/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1699924572176,
                "cdate": 1699924572176,
                "tmdate": 1699924572176,
                "mdate": 1699924572176,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "QzYrJrBr2j",
                "forum": "iUD9FklwQf",
                "replyto": "PyKZlZaJMM",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6864/Reviewer_Fzt9"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6864/Reviewer_Fzt9"
                ],
                "content": {
                    "comment": {
                        "value": "Thanks very much for your response! However, as a top-tier conference submission that describes a benchmark on SAT instances, it is desirable to include industrial SAT instances. Also, in the community of SAT solving, CDCL has become the mainstream method for about two decades, so it is interesting to improve the performance of CDCL-based SAT solvers. As a result, I have to maintain my score."
                    }
                },
                "number": 15,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6864/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700633713088,
                "cdate": 1700633713088,
                "tmdate": 1700633713088,
                "mdate": 1700633713088,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "un6TA9fN8N",
            "forum": "iUD9FklwQf",
            "replyto": "iUD9FklwQf",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6864/Reviewer_1zwz"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6864/Reviewer_1zwz"
            ],
            "content": {
                "summary": {
                    "value": "The authors present a comprehensive benchmark for the development of Graph Neural Network (GNN)-based approaches for satisfiability (SAT) solving. They compile all relevant work in the field into a unified benchmark, facilitating direct comparison of various methods. This benchmark is poised to be a pivotal resource, bridging the research efforts in deep learning and SAT solving. The paper also offers an extensive empirical analysis of different GNN architectures, providing insights into their performance across the benchmark's datasets, and highlighting certain limitations in current methodologies."
                },
                "soundness": {
                    "value": "4 excellent"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "**Consolidation of GNN-Based SAT Solving:** The paper's primary strength lies in amalgamating all existing GNN-based SAT-solving methods into a single codebase and publication. This centralization is an invaluable contribution to the field and sets a firm foundation for subsequent research.\n\n**Innovative Comparison Techniques:** The authors introduce inventive strategies for comparing GNN-based SAT solvers with traditional heuristics. These comparisons are crucial for contextualizing the performance of the proposed methods within the broader landscape of SAT-solving techniques."
                },
                "weaknesses": {
                    "value": "**Benchmarking Against Traditional Heuristics:** Despite the thorough comparison within GNN-based methods, the benchmarking against traditional SAT-solving heuristics remains unclear. For this study to significantly impact SAT-solving, a more explicit comparison using time-to-solve metrics (preferably both arithmetic and geometric means, in accordance with standard practices) with leading industrial solvers or mainstream heuristics is needed.\n\n**Gap Analysis:** There is a lack of detailed discussion on where GNN-based SAT solvers fall short when compared to state-of-the-art (SOTA) SAT solvers. The authors should elaborate on the deficiencies of GNN-based methods and propose what advancements are necessary to surpass traditional SOTA SAT solvers.\n\n**Addressing Gaps:** While the paper stands as a considerable contribution to the field, I think it could have been better with novel contributions by proposing solutions to address the gaps identified in the work, e.g., a proposal to increase generalization performance."
                },
                "questions": {
                    "value": "1. There appears to be a typographical error in the paragraph following Equation 1. Aggr(a)gation → Aggr(e)gation \n\n2. In Section 4.3,  \"Training Objectives,\" the relationship between S(x), S_min, and S_max could benefit from clarification. Additionally, the use of N(a) within this context is ambiguous."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6864/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699090652526,
            "cdate": 1699090652526,
            "tmdate": 1699636796740,
            "mdate": 1699636796740,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "qH4zBs8LqU",
                "forum": "iUD9FklwQf",
                "replyto": "un6TA9fN8N",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6864/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6864/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for your positive review and valuable feedback! In the following, please let us address the concerns and questions you've pointed out.\n\n> Benchmarking Against Traditional Heuristics\n\nThe primary objective of G4SATBench is to establish a comprehensive framework for evaluating GNN-based approaches to SAT solving and shed light on the learning capabilities and strategies of GNNs in SAT solving. To this end, our current framework does not include direct time-to-solve metric comparisons with modern SAT solvers. To enable such comparisons, we further conduct additional experiments using the local search solver Sparrow and CDCL SAT solver CaDiCaL on the instances in G4SATBench. Each experiment is repeated three times with different random seeds, and the mean results are reported.\n\nWe first set Sparrow to output the same number of solutions (i.e., 32) as NeuroSAT in our G4SATBench experiments. The following tables show the solving accuracy and running time of Sparrow:\n\nSolving accuracy of Sparrow (%):\n\n| Difficulty | SR    | 3-SAT | CA    | PS    | K-Clique | K-Domset | K-Vercov |\n|------------|-------|-------|-------|-------|----------|----------|----------|\n| Easy       | 56.03 | 52.09 | 85.48 | 77.25 | 53.68    | 37.15    | 31.61    |\n| Medium     | 1.64  | 1.85  | 12.68 | 10.72 | 12.99    | 1.27     | 0.53     |\n\nRunning time of Sparrow (seconds per instance)\n\n| Difficulty | SR    | 3-SAT | CA    | PS    | K-Clique | K-Domset | K-Vercov |\n|------------|-------|-------|-------|-------|----------|----------|----------|\n| Easy       | 0.005 | 0.005 | 0.006 | 0.006 | 0.005    | 0.005    | 0.005    |\n| Medium     | 0.008 | 0.007 | 0.006 | 0.006 | 0.006    | 0.007    | 0.006    |\n\nWe then allow Sparrow and CaDiCaL to run without constraints to fully solve the satisfiable instances in G4SATBench and report the running time of each solver:\n\nRunning time of Sparrow (seconds per instance)\n\n| Difficulty | SR    | 3-SAT | CA    | PS    | K-Clique | K-Domset | K-Vercov |\n|------------|-------|-------|-------|-------|----------|----------|----------|\n| Easy       | 0.007 | 0.007 | 0.008 | 0.008 | 0.007    | 0.009    | 0.009    |\n| Medium     | 0.013 | 0.013 | 0.010 | 0.013 | 0.013    | 0.012    | 0.011    |\n\nRunning time of CaDiCaL (seconds per instance)\n\n| Difficulty | SR    | 3-SAT | CA    | PS    | K-Clique | K-Domset | K-Vercov |\n|------------|-------|-------|-------|-------|----------|----------|----------|\n| Easy       | 0.013 | 0.013 | 0.012 | 0.011 | 0.014    | 0.012    | 0.011    |\n| Medium     | 0.014 | 0.043 | 0.016 | 0.018 | 0.015    | 0.013    | 0.012    |\n\nIt's important to note that both CaDiCaL and Sparrow are highly optimized SAT solvers with advanced solving heuristics and engineering features. As a result, current *standalone* GNN-based SAT solvers face challenges competing with them. However, our findings indicate that when constrained to output the same number of solutions, GNN-based heuristics perform more effectively than modern local search solvers like Sparrow. Yet, when such a constraint is removed, as stated in our experiment section, GNN models may struggle to explore the vast solution space as efficiently as Sparrow and CaDiCaL.\n\n> Gap Analysis & Addressing Gaps\n\nOur experimental results reveal that *standalone* GNN-based SAT solvers can develop a novel solving heuristic similar to local search. However, they currently fall short in emulating the CDCL heuristic, primarily due to the static nature of their message-passing framework that struggles to encapsulate the dynamic clause learning process inherent in CDCL. This limitation becomes evident when comparing their performance with CDCL-based solvers, particularly on large-scale industrial SAT instances where CDCL solvers excel.\n\nTo bridge this gap, as outlined in Appendix E, one avenue to enhance *standalone* GNN-based SAT solvers is to leverage *dynamic* GNN architectures to learn the CDCL heuristic within the latent space. Furthermore, our experiments demonstrate that GNN models excel in unsat-core variable prediction, pointing to another promising path toward achieving a state-of-the-art solver. This could be achieved by integrating GNN models with modern CDCL-based SAT solvers, combining their strengths for more effective SAT solving. For instance, GNN models could be employed initially to predict unsat-core variables, guiding CDCL-based SAT solvers to prioritize these variables in their branching strategies. Alternatively, GNN-based SAT solvers could be viewed as novel local search heuristics, complementing CDCL solvers in tackling SAT instances that are challenging for the CDCL heuristic alone."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6864/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1699924506193,
                "cdate": 1699924506193,
                "tmdate": 1699924506193,
                "mdate": 1699924506193,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "zatAxaNvrb",
                "forum": "iUD9FklwQf",
                "replyto": "qH4zBs8LqU",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6864/Reviewer_1zwz"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6864/Reviewer_1zwz"
                ],
                "content": {
                    "title": {
                        "value": "thank you!"
                    },
                    "comment": {
                        "value": "Thank you for the detailed clarification. I have no further questions. \n\nI believe that incorporating this detailed discussion can significantly enhance the comprehension and impact of your work. Additionally, it might be beneficial to explore the solutions to the gaps you've identified in your research. Such an inclusion could further bolster the technical contribution of your manuscript."
                    }
                },
                "number": 10,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6864/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700464284841,
                "cdate": 1700464284841,
                "tmdate": 1700464284841,
                "mdate": 1700464284841,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "EwvG1MmHFv",
            "forum": "iUD9FklwQf",
            "replyto": "iUD9FklwQf",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6864/Reviewer_E9kP"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6864/Reviewer_E9kP"
            ],
            "content": {
                "summary": {
                    "value": "The paper presents G4SATBench, the first benchmark study framework for GNN-based SAT solvers.  The experiments provided insights and valuable comparisons between some current GNN-based SAT solvers"
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "Originality: The new framework G4SATBENCH provides a flatform for comprehensive comparisons on existing GNN-based SAT solvers.  \n\nQuality: The overall quality is good. The authors performed substantial experiments and comparison with exiting solvers on several testing datasets. \n\nClarity: The paper is generally well-written, and the overall clarity is good.\n\nSignificance: The experiments were substantial and significantly showed the advantage of the framework in conducting experiments on GNN-based SAT solvers. It served as a platform to provide insight comparisons, which is helpful in understanding limitations and advantages of current GNN-based SAT solvers.\nHowever, I would like to see more experiments and comparisons on the dataset published with NeuroSAT and GGNN. I also want to see the running time of these solvers in Table 1, table 2, and table 3."
                },
                "weaknesses": {
                    "value": "The G4SATBench integrates the methodologies and evaluation metrics of existing GNN-based SAT solvers, which is very useful for reviewing the current GNN-based SAT solvers. However, I could not find the significant contribution and innovation towards the state-of-the-art of SAT solvers."
                },
                "questions": {
                    "value": "Can you provide the running time of these solvers in Table 1, table 2, and table 3?\nCan you provide your definitions of how to categorise easy datasets (vs) medium datasets?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission6864/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6864/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6864/Reviewer_E9kP"
                    ]
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6864/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699528201955,
            "cdate": 1699528201955,
            "tmdate": 1699636796623,
            "mdate": 1699636796623,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "dRWEsL3wLJ",
                "forum": "iUD9FklwQf",
                "replyto": "EwvG1MmHFv",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6864/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6864/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for your feedback on our paper! We hope to address your concerns and questions about our paper as follows:\n\n> I would like to see more experiments and comparisons on the dataset published with NeuroSAT and GGNN.\n\nThe original NeuroSAT paper [1] trained its model on SR(U(10, 40)) instances (i.e., 10 to 40 variables in a SAT instance) and primarily evaluated it on SR(40) instances. While it also explored smaller graph combinatorial problems (around 10 nodes in an instance), these evaluations were somewhat limited in scope and depth (they only provided a rough description of the results). In G4SATBench, we offer a richer set of benchmarks with 7 different problems across 3 difficulty levels. Our benchmarks not only cover the original NeuroSAT datasets but also significantly extend them, enabling a more thorough assessment of GNN-based SAT solvers.\n\n> However, I could not find the significant contribution and innovation towards the state-of-the-art SAT solvers.\n\nWe hope that G4SATBench could serve as the first comprehensive framework for GNN-based SAT solving. Toward this goal, we provide a unified interface and establish a comprehensive benchmark for evaluation. Beyond the datasets and evaluation, we further explore how and what GNN models can learn to solve SAT and unveil some critical insights previously unexplored in this field:\n\n- For satisfying assignment prediction, using unsupervised training could yield better solving accuracy than supervised learning, especially in scenarios with multiple solutions.\n- Representation learning (e.g., contrastive learning/learnable node features) has limited influence on enhancing the performance of GNN-based SAT solvers.\n- Standalone GNN-based SAT solvers struggle to learn or mimic the CDCL heuristics in the latent space.\n- Standalone GNN-based SAT solvers could learn a solving heuristic akin to the greedy local search to solve SAT when trained for satisfiability prediction or assignment prediction.\n\nWhile our current focus is not on developing a state-of-the-art (GNN-based) SAT solver, our work provides valuable insights into how GNNs can approach SAT solving and what heuristics they can learn. As stated in Appendix E, to develop a state-of-the-art SAT solver, we could leverage these insights to combine GNN models with a modern SAT solver. For instance, GNN models could be utilized as local search heuristics to assist CDCL-based SAT solvers. Or they could predict the unsat-core variables to inform the branching decisions of CDCL-based solvers, thereby enhancing their efficiency. We hope our work could pave the way for future developments in this area and inspire further advancements to develop *neural-guided* SAT solvers.\n\n> Can you provide the running time of these solvers in Table 1, table 2, and table 3?\n\nA key advantage of employing GNNs in SAT solving is their capability to process multiple instances simultaneously in parallel on a single GPU, greatly enhancing computational efficiency. In our experiments, we set the batch size to 512 for testing and calculate the average running time per instance by dividing the total time by the number of instances. We also find that various GNN architectures exhibit very similar running times. Therefore, for clarity and conciseness, we present here the running times of NeuroSAT for the three tasks in G4SATBench:\n\nRunning time for satisfiability prediction (seconds per instance)\n\n| Difficulty | SR    | 3-SAT | CA    | PS    | K-Clique | K-Domset | K-Vercov |\n|------------|-------|-------|-------|-------|----------|----------|----------|\n| Easy       | 0.002 | 0.002 | 0.003 | 0.002 | 0.003    | 0.003    | 0.002    |\n| Medium     | 0.007 | 0.004 | 0.010 | 0.012 | 0.010    | 0.007    | 0.008    |\n\nRunning time for satisfying assignment prediction (seconds per instance)\n\n| Difficulty | SR    | 3-SAT | CA    | PS    | K-Clique | K-Domset | K-Vercov |\n|------------|-------|-------|-------|-------|----------|----------|----------|\n| Easy       | 0.002 | 0.002 | 0.002 | 0.002 | 0.003    | 0.002    | 0.003    |\n| Medium     | 0.008 | 0.006 | 0.009 | 0.010 | 0.009    | 0.006    | 0.007    |\n\nRunning time for unsat-core variable prediction (seconds per instance)\n\n| Difficulty | SR    | 3-SAT | CA    | PS    | K-Clique | K-Domset | K-Vercov |\n|------------|-------|-------|-------|-------|----------|----------|----------|\n| Easy       | 0.002 | 0.002 | 0.002 | 0.003 | 0.002    | 0.003    | 0.003    |\n| Medium     | 0.004 | 0.003 | 0.007 | 0.005 | 0.008    | 0.007    | 0.009    |\n\nNote that using more advanced GPUs (e.g., NVIDIA A100) and a larger batch size, can further reduce the running times of GNN models, thereby improving efficiency."
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6864/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1699924397118,
                "cdate": 1699924397118,
                "tmdate": 1699924397118,
                "mdate": 1699924397118,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "Enc1LTbq1A",
                "forum": "iUD9FklwQf",
                "replyto": "3MTHZyBzmR",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6864/Reviewer_E9kP"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6864/Reviewer_E9kP"
                ],
                "content": {
                    "title": {
                        "value": "Thank you"
                    },
                    "comment": {
                        "value": "Thank you authors for addressing the questions. I do not have any further questions."
                    }
                },
                "number": 16,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6864/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700707890763,
                "cdate": 1700707890763,
                "tmdate": 1700707890763,
                "mdate": 1700707890763,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]