[
    {
        "title": "An Axiomatic Approach to Model-Agnostic Concept Explanations"
    },
    {
        "review": {
            "id": "BojoVH4yaj",
            "forum": "J0qgRZQJYX",
            "replyto": "J0qgRZQJYX",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6654/Reviewer_NFev"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6654/Reviewer_NFev"
            ],
            "content": {
                "summary": {
                    "value": "In this paper, authors propose a method for concept explanations that satisfy three axioms. Such explanation is verified to provide insights into model selection, optimizer selection, and model improvement."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "+ Concept explanation is an important direction in explainable AI research.\n+ It is interesting to connect the proposed method with existing methods including TCAV."
                },
                "weaknesses": {
                    "value": "- It seems that the proposed method is only applicable to datasets with pre-defined concept annotations c(x).\n- Though authors show some connections between the proposed method and two existing methods, there still lacks baseline comparisons in the experiment part. For example, why not compare the proposed method with existing methods (such as [cite 1,2]) for model improvement.\n- As typical concept explanations usually provide visualizations of extracted concepts. It will help a lot if authors also provide such visualizations, and compare their method with existing concept explanations from this perspective.\n\n\n[cite 1] This Looks Like That: Deep Learning for Interpretable Image Recognition (NeurIPS 2019)\n\n[cite 2] Concept-level Debugging of Part-Prototype Networks (ICLR 2023)"
                },
                "questions": {
                    "value": "none"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6654/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698675324240,
            "cdate": 1698675324240,
            "tmdate": 1699636760802,
            "mdate": 1699636760802,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "uwlNfqZJRu",
                "forum": "J0qgRZQJYX",
                "replyto": "BojoVH4yaj",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6654/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6654/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Thanks for your review"
                    },
                    "comment": {
                        "value": "We thank the review for their review, please see our responses below.\n\n- Note that the proposed method is not only applicable to datasets with pre-defined concept annotations. In Section 5.3 we discussed how to automatically label concepts.  \n\n\n- Thank you for the references you provided, we will add them in future versions of the paper. However, please note that in this paper, we adopt a black-box approach and intentionally avoid limiting ourselves to neural networks. In the related work section, specifically at the end of the paragraph discussing \"concept-based explanations\", we discussed papers where concepts constitute part of the model’s hidden representation, similar to [cite 1] and [cite 2]. \n\n- We appreciate the reviewer's perspective on the value of visualizations in evaluating XAI methods and understand their importance in certain contexts. However, we hold a different view in this instance. We believe that our approach, which focuses on more quantifiable and objective metrics, offers a complementary perspective to the prevalent use of visualizations. This approach, we argue, adds to the diversity of evaluation methods in the field and strengthens the paper by providing an alternative lens through which XAI methods can be assessed."
                    }
                },
                "number": 10,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6654/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700595450768,
                "cdate": 1700595450768,
                "tmdate": 1700595450768,
                "mdate": 1700595450768,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "mrrOUUjFxR",
            "forum": "J0qgRZQJYX",
            "replyto": "J0qgRZQJYX",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6654/Reviewer_QfZD"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6654/Reviewer_QfZD"
            ],
            "content": {
                "summary": {
                    "value": "This paper introduces an axiomatic framework for generating concept-based explanations for a given model. This approach generalizes existing methods, such as TCAV and the completeness score, under specific conditions."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "Interpretable and explainable machine learning holds substantial societal implications, warranting its significance as a crucial area of research.\n\nConcept explanation emerges as a compelling avenue within the realm of interpretable machine learning.\n\nThe axiomatic approach to concept explanation is interesting and makes sense to me."
                },
                "weaknesses": {
                    "value": "Some assertions within the paper are inaccurate. Specifically, the authors incorrectly categorize SHAP and LIME as model-specific techniques that necessitate white-box access to the model. Contrary to these claims, SHAP and LIME are model-agnostic and can operate on black-box models. They generate explanations by probing the model with varying input combinations to obtain SHAP and LIME scores.\n\nFurthermore, the terminology used in the problem formulation section lacks precision. The term \"measure\" is ambiguously defined— it is unclear whether it refers to a \"score\" or \"measurement,\" or to a \"measure\" in the context of measure theory. A more mathematically rigorous exposition of the problem setting would be beneficial.\n\nWhile the abstract and the introduction draw a grand picture of a unified approach that encompasses different existing methods, but ultimately only discussed TCAV and completeness-aware explanations in the paper. The proposed measure is also somewhat similar to how [1] parameterizes a self-explaining neural network (e.g., the product of h(x) and c(x)). \n\nAdditional points of concern include: (1) the assertion that the proposed approach subsumes TCAV is not entirely accurate. According to Theorem 4.2, it approximates TCAV in an asymptotic sense rather than subsuming it exactly. (2) The claim that the approach unifies TCAV and completeness-aware explanations is also not entirely precise. Specifically, the class-conditioned variant of the proposed method is linearly correlated with a subset of the completeness score, while its concept-conditioned variant approximates the continuous case of TCAV.\n\nFrom Section 3, it seems the proposed approach is limited to binary classification. This is a limitation. Would it be generalizable to other cases, e.g., multi-class classification? \n\nAnother significant issue that I have is the absence of comparative results with baseline methods. Unless I overlooked it, the paper does not present any performance metrics juxtaposed with at least TCAV and completeness-aware explanations. Such comparative analysis is essential for rigorously assessing the technical and empirical merits of the proposed approach. Without it, evaluating the method's substantive contribution becomes challenging.\n\n[1] Towards Robust Interpretability with Self-Explaining Neural Networks. NeurIPS 2018."
                },
                "questions": {
                    "value": "Would it be generalizable to other cases, e.g., multi-class classification?\n\nThe definition of “measure” in the problem formation paragraph is a bit vague. By “measure\" do you mean a “score/measurement” or a “measure” as in the measure theory?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6654/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698680034595,
            "cdate": 1698680034595,
            "tmdate": 1699636760682,
            "mdate": 1699636760682,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "yg5DB7nnq8",
                "forum": "J0qgRZQJYX",
                "replyto": "mrrOUUjFxR",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6654/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6654/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Thanks for your review"
                    },
                    "comment": {
                        "value": "We would like to thank the review for their suggestions. Here are our response:\n\n**SHAP and LIME**. In our discussion of these methods in the related section, we highlight their model-agnostic nature, please refer to Section 2 paragraph “model-agnostic explanations”. \n\n**Problem formulation**. We formally defined the problem in section 3, stating that the objective is to find $M$, a function that maps the following parameters to $\\mathbb{R}$: (i) the model $h$, (ii) the concept $c$, and (iii) the a priori probability $p(\\cdot)$ over the examples.\n\n**“Assertion that the proposed approach subsumes TCAV…”** we aim to establish connections between our approach and TCAV, rather than make such assertion. We will revise our presentation to reflect this point more clearly. \n\n**Generalizable to multi-class classification.** Yes, it is possible to generalize to multi-class classification and select the relevant symmetry function in Axiom 3. For simplicity we focused on the basic setup of binary classification. Also see Section 3 “notation”, where we mentioned how it can be extended to multiclass by using the one-vs-all reformulation.\n\n**Comparative results.** Our goal in the paper is not to claim that our approach is better than TCAV or completeness-aware methods. This is why we chose not to compare them empirically. One exception to this rule is that we mentioned our method's faster computational speed compared to those approaches and provided an explanation for it  at the end of sections 4.1 and 4.2. However, we can also test it empirically. Thank you for your suggestion."
                    }
                },
                "number": 9,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6654/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700595347465,
                "cdate": 1700595347465,
                "tmdate": 1700595347465,
                "mdate": 1700595347465,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "4o0VQqL50n",
            "forum": "J0qgRZQJYX",
            "replyto": "J0qgRZQJYX",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6654/Reviewer_iv2S"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6654/Reviewer_iv2S"
            ],
            "content": {
                "summary": {
                    "value": "Their objective is to design a model-agnostic concept explainer; Existing concept explanation methods assume the model-to-be-explained has a representation layer limiting their application to DNNs.\nThey begin with a presentation of three axioms, which must hold for any concept explainer, and draw connections to previous estimators.\nThe paper claims that their framework enables efficient implementation and helps interpret concept scores estimated by existing estimators. \n\nThe paper does bring some structure to the problem but I have strong concerns regarding faithfulness of their overly-simplified estimator and reservations about their compute efficiency claims."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "- The paper unifies and reinterprets two popular concept explanation techniques (Kim et.al. and Yeh et.al.), which is neat.\n- The motivation for a model-agnostic explainer is a valid concern. Concept explanations are biased towards DNNs."
                },
                "weaknesses": {
                    "value": "- **Presentation issues**. The notation is confusing. Concept is denoted with c(x) and is used to denote either set of concepts (i.e. a concept vector) or a scalar score interchangeably causing much confusion, see (1), (2). Yeh et.al. 2020 should be explained in more details in Sec 4.1. h is overloaded to map from example or representations to the label. (2) uses y to enumerate over concept values, which can be confusing.\n- **Faithfulness is not established**. (This is less a weakness and more a show-stopper). The premise of an explanation is its faithfulness, which surprisingly is not one of the axioms. All their estimators at best measure the correlation in activation of concept and the model-to-be-explained. They need to establish the faithfulness of their estimator with the evaluation suite of TCAV or Yeh et.al. to first establish theirs as an explanation. Imagine a model trained on a dataset with two co-occurring concepts but the model may only exploit one of the concepts for prediction (say because one concept is way easier than the other), however none of their estimators can bring out the asymmetric concept importance.\n- **Unconvincing evaluation**. The paper evaluates on a gamble of tasks. The prediction tasks considered are to predict *cat*, *chair*, *motorbike*, *bottle* in Figure 2, 3, 4 respectively. Some rationale on choice of tasks is expected, and some evaluation using established benchmarks is also expected. \n- **Computational efficiency not presented.** They claim computational efficiency but do not present any empirical evidence supporting the claim.\n- **Sufficiency vs necessary based score**. The paper discusses concept scores based on sufficiency or necessity, but do not discuss their practical implications. When is one better than the other?"
                },
                "questions": {
                    "value": "Please see above.\n\n---\n**Post-rebuttal comment**\n\nI thank the authors for providing clarifications and for keeping it short. \n\nA-Pascal may is a recognised benchmark in the CV community but it is not a standard benchmark for evaluating explanations. Besides, different sections of the paper considered widely different labels for evaluation or presentation without much explanation. \n\nThe concern regarding faithfulness with the paper is severe because their estimated importance scores seem model-agnostic. TCAV, for instance, accounts the effect of concept interventions on the representation to measure the importance. Nevertheless, experiments proving faithfulness are much needed."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission6654/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6654/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6654/Reviewer_iv2S"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6654/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698766125120,
            "cdate": 1698766125120,
            "tmdate": 1700757613028,
            "mdate": 1700757613028,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "F7ejVXjILO",
                "forum": "J0qgRZQJYX",
                "replyto": "4o0VQqL50n",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6654/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6654/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Thanks for your review"
                    },
                    "comment": {
                        "value": "We would like to thank the reviewer for their thoughtful comments. Please see our responses below.\n\n**Presentation issues**.Thank you for your suggestion regarding notation. We will incorporate it into future versions of the paper. \n\n**Faithfulness**. Thank you for providing an example to illustrate your point. It's important to note that ANY black-box explainer that only uses examples from the given distribution, which is the focus of our work, cannot detect the case of two different-impact co-occurring concepts.\n\n**Evaluation**. We used the a-Pascal dataset with its 20 classes, this dataset is acknowledged in the CV community. See [1,2,3]. The structure of this dataset also suits our task at hand.\n\n**Computational efficiency**. At the end of sections 4.1 and 4.2, we elaborate on why these methods are more efficient. Thank you for suggesting an empirical examination of this aspect as well.\n\n**Sufficiency vs necessary based score.** It's not a matter of one being better than the other. Rather, it's about understanding how a concept influences a prediction. We've explored two types of influence: necessary and sufficient. There isn't a definitive choice between them; the selection depends on your specific application.\n\n[1] Paco: Parts and attributes of common objects\n\n[2]: Ovarnet: Towards open-vocabulary object attribute recognition\n\n[3]: Open-vocabulary attribute detection"
                    }
                },
                "number": 8,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6654/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700595255772,
                "cdate": 1700595255772,
                "tmdate": 1700595255772,
                "mdate": 1700595255772,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "1IqfRFMq6s",
            "forum": "J0qgRZQJYX",
            "replyto": "J0qgRZQJYX",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6654/Reviewer_rtvs"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6654/Reviewer_rtvs"
            ],
            "content": {
                "summary": {
                    "value": "This paper addresses the problem of obtaining model-agnostic and human-understandable concept explanations of deep networks, specifically in the context of image classification. It first defines a set of general axioms that a concept explanation should follow, and shows that some of the existing approaches to concept explanations (e.g. TCAV) can be viewed as a part of this framework. It then defines measures that satisfy the axioms and explores their use for model selection (for models that use appropriate features), model optimizer selection (SGD vs AdamW), and prompt editing (to improve models)."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. The paper addresses the important problem of obtaining human-understandable faithful explanations of the decisions of deep networks, which is crucial for trusting model decisions.\n1. It proposes a systematic, model-agnostic approach using a set of axioms that a concept explanation should satisfy. It shows that some of the prior work on concept explanations can be placed within this general framework."
                },
                "weaknesses": {
                    "value": "1. The experimental evaluation appears to be limited. The analysis in Section 5.2 is limited to a small set of classes, and it is unclear how generally the trends observed hold. The evaluation for model selection also uses very simple models (linear regression and random forest). For broader applicability, it would be useful to evaluate whether this generalizes to deep networks, and whether one can select between different networks and network architectures with this approach.\n1. The evaluations in Sectionn 5.2 appear to focus on images that were predicted to be a given class. For different models and different optimizers, this set of images could be different. Given that the ground truth labels of the images do not seem to have been taken into account, it is unclear if the presence of \"spurious\" concepts observed is due to the model relying on spurious correlations for images where the ground truth class is the same as the predicted class being considered, or due to the model simply misclassifying images of other classes as the predicted class being considered. This would be important to properly evaluate the proposed approach.\n1. Given the efficiency and equivalence arguments between the proposed approach and prior work (completeness-aware and TCAV, Section 4), it would be helpful to have an experimental comparison between these approaches in the application settings in Section 5, both in terms of performance and computational efficiency.\n1. The formulation of TCAV as an instantiation of the proposed framework seems to only apply to explanations at the last layer, while the TCAV formulation as originally proposed is more general. If this is the case, then this should be made clear."
                },
                "questions": {
                    "value": "Clarifications on the points raised in Weaknesses would be helpful."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission6654/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6654/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6654/Reviewer_rtvs"
                    ]
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6654/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699567630290,
            "cdate": 1699567630290,
            "tmdate": 1699636760458,
            "mdate": 1699636760458,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "PwtBBPZmwt",
                "forum": "J0qgRZQJYX",
                "replyto": "1IqfRFMq6s",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6654/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6654/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Thanks for your review"
                    },
                    "comment": {
                        "value": "We would like to thank the reviewer for their thoughtful comments. Please see our responses below.\n1. In Section 5.2.1, we deliberately utilized linear regression and random forest to demonstrate one of the benefits of our method. Specifically, previous methods were tailored for neural networks, whereas our approach also accommodates other methods like linear regression and random forest models. Additionally, we also employed neural networks, detailed in sections 5.2.2 and 5.2.3.\n2. Spurious correlation refers to the scenario wherein a model learns to depend on features that lack a causal relationship with the target variable but exhibit strong correlation within the training data. Our measure identifies concepts on which a model relies, enabling human judgment regarding their relevance to accurate predictions—thereby detecting spurious correlations. While dissecting the reasoning behind spurious correlation, as you suggested, could be interesting, it extends beyond the scope of the current research.  \n3. At the end of sections 4.1 and 4.2, we elaborate on why these methods are more efficient. Thank you for suggesting an empirical examination of this aspect as well.\n4. We apologize for any confusion caused. We will make sure to provide clarification in future versions of the paper."
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6654/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700595154001,
                "cdate": 1700595154001,
                "tmdate": 1700595154001,
                "mdate": 1700595154001,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]