[
    {
        "title": "Feasibility-Guided Safe Offline Reinforcement Learning"
    },
    {
        "review": {
            "id": "fJhN8Sv5JM",
            "forum": "j5JvZCaDM0",
            "replyto": "j5JvZCaDM0",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7310/Reviewer_axZi"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7310/Reviewer_axZi"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes an algorithm for safe offline RL problems. Unlike most of the existing studies that deals with expected form of safety constraints, this paper deals with hard safety constraint (i.e., probability-1 constraints). The authors discover that the hard safety constraint can be equivalently translated to identifying the largest feasible region given the offline dataset, which leads to a feasibility-dependent objective which can be further solved using three simple decoupled learning objectives. The authors compare their proposed algorithm called FISOR against baselines on DSRL benchmark for safe offline RL."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "- This paper is well-written and easy to follow. The problem settings are motivated and I think it is an important direction for safe RL research.\n- The proposed method is solid and looks sound to me.\n- The empirical evaluation are conducted in various benchmark tasks."
                },
                "weaknesses": {
                    "value": "### Related Work\n\nHard constraints in safe RL have been studied in online RL settings. There are several important missing references as being represented by:\n\n- Sootla, Aivar, et al. \"Sauté rl: Almost surely safe reinforcement learning using state augmentation.\" International Conference on Machine Learning. PMLR, 2022.\n- Wang, Yixuan, et al. \"Enforcing hard constraints with soft barriers: Safe reinforcement learning in unknown stochastic environments.\" International Conference on Machine Learning. PMLR, 2023.\n- Wachi, Akifumi, and Yanan Sui. \"Safe reinforcement learning in constrained Markov decision processes.\" International Conference on Machine Learning. PMLR, 2020.\n\nI agree with the authors that there is litte literature on safe **offline** RL and know that there is Table 4 in the Appendix. However, there are existing studies that are directly related to this paper. For example, Sootla et al. (2022) can be easily extended to the offline RL settings since all we have to do is to augment the state and provide a large penalty for violating the hard safety constraint.\n\n### Experiments\nWhile I would like to thank the authors for conducing good experiments, I am not fully convinced by the experimental results. First, all the baselines are based on the soft safety constraint and it seems unfair to simply compare their safety performances (Note that I do not say that such baseline methods should not be compared given there is few exising paper with the same problem settings). I personally consider that, if safe online RL algorithm can be extended to offline settings, such algorithms should be additionally included as a baseline. Second, I want the authors to discuss the experimental results on the reward performance. I understand sinec FISOR is enforced a hard constraint, it is natural that reward performance is deteriorated. However, under the condition that most of the baseline methods do not satisfy the safety constraint (because safety requirements are different by nature), I feel that it is rather arbitrary to compare the reward peformance **within** safe agents. Though the authors say that \" FISOR is the only method that can\nguarantee safety satisfaction in all tasks, while achieving top returns in most tasks\", I personally feel that this claim is overstated. I think the experimental results are interesting; hence, I would like the authors to discuss more on the **Main Results** paragraph for future readers (e.g., why CPQ satisfy the safety constraints, why FISOR does not perform well in Safety Gym tasks, etc.)"
                },
                "questions": {
                    "value": "[Q1] I consider that there are several safe online RL algorithms with hard constraints. And some of them can be easily extended to offline RL settings. Could you give me some comments about my thoughts?\n\n[Q2] In general, the performance of an offline RL algorithm largely depends on the data coverage of the offline dataset. Could you explain the (empirical) relationship of the performance if FISOR and the data coverage? Is FISOR more efficient in terms of the data coverage compared to other baselines?\n\n[Q3] Why only CPQ satisfies the safety constraints within the baseline methods?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission7310/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission7310/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission7310/Reviewer_axZi"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7310/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698383700054,
            "cdate": 1698383700054,
            "tmdate": 1700088821651,
            "mdate": 1700088821651,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "dfzy2Jvxbn",
                "forum": "j5JvZCaDM0",
                "replyto": "fJhN8Sv5JM",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7310/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7310/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer axZi"
                    },
                    "comment": {
                        "value": "We thank the reviewer for the constructive comments and positive feedback on our paper. Regarding the concerns of the reviewer axZi, we provide the following responses:\n> **W1 & Q1 & W2.1 Some of safe online RL methods can be easily extended to offline RL settings, such algorithms should be included as a baseline.**\n\nWe thank the reviewer for these works and we are happy to compare against them in our revised paper! We have added comparison with Sauté [1] and RCRL [2], since Sauté [1] is relatively versatile and RCRL [2] also adopts HJ Reachability to enforce hard constraints. Results can be found in Table 6, Appendix D.7 in our revised paper.\n- Note that applying safe online RL methods in offline settings faces distributional shifts. To address this, we add a BC constraint in Sauté [1] and RCRL [2] similar to an offline RL method TD3+BC [3] to combat distributional shifts. Also, we swept the conservatism strength to find a good balance between safety constraint and behavior constraint to obtain the best possible results.\n    - However, Table 6 shows that we cannot obtain good results with direct adaptations of safe online RL methods into offline settings, even with carefully tuned hyper-parameters, due to the intricate coupled training processes.\n    - FISOR, however, enjoys good results thanks to its decoupled learning objectives.\n\nBesides the experiments, we briefly discussed these safe online RL methods here:\n- For Sauté[1], similar to CPQ[4], safety constraints are handled by integrating them into the state space and modifying the objective accordingly. They struggle to handle zero cost limit, thus we still consider it to be a type of soft constraint method.\n- For [5], the intertwined learning process (barrier function, model, policy) is not suitable for offline scenarios.\n- For [6], its online safe exploration with environments is not compatible for offline settings.\n\n> **W2.2. Discuss the experimental results on the reward performance.**\n- The comparison criteria strictly follows the DSRL benchmark [7] (Q1 in general response), where safety is prioritized over rewards. We believe this makes sense as discussing the rewards is only meaningful when safety constraints are met in safety-critical tasks.\n- Previous methods may prioritize reward maximization while overlooking safety constraints. Thus, some baselines can obtain high rewards. Figure 3 shows that some baselines even encounter more safety violations than the ones trained without any safety constraint. This shows that existing safe offline RL methods are hard to strike the right balance between reward maximization and safety satisfaction. Thus, we didn't evaluate solely based on rewards, but filtered out the safe agents, and then compared the rewards, strictly following the DSRL [7]. We believe this evaluation protocol is more reasonable.\n\n> **W2.3. Discuss more on the Main Results**\n- Why does CPQ satisfy the safety constraints? \n    - CPQ is an over-conservative method that prioritizes safety rather than reward maximization. Specifically, CPQ harshly penalizes unsafe areas by pulling up the cost values on those regions using value penalty [8]. However, value penalty is proved over-conservative [9], making CPQ primarily focus on safety constraints. For example, CPQ obtains good safety results on MetaDrive tasks but performs poorly in terms of rewards.\n    - In addition, the offline value regularization is hard to tune [10], making CPQ perform not very well on other tasks.\n- Why FISOR does not perform well in Safety Gym tasks?\n    - No. Table 1 shows that FISOR meets safety requirements (normalized cost<1 according to the DSRL evaluation protocol) and meanwhile achieves competitive rewards on all SafetyGym tasks as compared to baselines. Moreover, FISOR has the lowest average cost scores as compared to all other baselines. It would be appreciated if the reviewer could tell us why the reviewer thinks FISOR does not perform well in Safety Gym tasks.\n\n> **Q2.  Could you explain the (empirical) relationship of the performance if FISOR and the data coverage? Is FISOR more efficient in terms of the data coverage compared to other baselines?**\n- We have added experiments on small data settings in Figure 10, Appendix D.8 in our revised paper. FISOR shows great stability across different dataset sizes, while other methods fail miserably under small data settings. We think the robustness in the low-data regime of FISOR is attributed to its stable decoupled learning procedure and policy extraction using weighted behavior cloning.\n\n> **Q3.  Why only CPQ satisfies the safety constraints within the baseline methods?**\n\nPlease see the responses for W2.3 for details. Note that although being very conservative, CPQ still fails to satisfy safety constraints in many tasks as the value regularization of CPQ is hard to tune. We use bold black and blue to represent safe agents in Table 1. For specific evaluation protocol, please see the general response in Q1 and Q2."
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7310/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700042226941,
                "cdate": 1700042226941,
                "tmdate": 1700042226941,
                "mdate": 1700042226941,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "KY2wWz03SN",
                "forum": "j5JvZCaDM0",
                "replyto": "fJhN8Sv5JM",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7310/Reviewer_axZi"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7310/Reviewer_axZi"
                ],
                "content": {
                    "title": {
                        "value": "Thank you!!"
                    },
                    "comment": {
                        "value": "I respectfully appreciate the authors for their clarifications and for adding new experiments. I've read the authors' feedback, other reviews, and revised manuscript.\n\n**W1 & Q1 & W2.1: Some safe online RL methods can be easily extended to offline RL settings, such algorithms should be included as a baseline.**\n- Thank you for adding informative experiments. I do appreciate the authors' effort in a short period. I am satisfied and convinced about this point.\n\n**W2.2, W2.3: Discuss the experimental results on the reward performance.**\n- Though I more or less agree with the authors, there is room to consider whether the authors' proposed method (FISOR) successfully solves the Safety-Gym environment given the low reward performance. I do agree that FISOR performs **better** than the baselines in most of the benchmark tasks, but there are several tasks that I personally think all algorithms could not solve. To put it in an extreme way, a very conservative policy (e.g., continuing to stay at the initial safe position) may be evaluated as a better policy if an agent does not have to get much reward.\n\n**Q3: Data coverage in offline RL settings.**\n- Thank you!! I think it is a nice addition for future readers.\n\n**W2.2 & Q3: Regarding CPQ**\n- Thank you for your explanation. I understand the reason why CPQ satisfies safety constraints.\n\nThe authors have addressed most of my concerns at the time of the initial review, I increased my score from 6 to 8. I think this paper has been substantially improved. Thank you!!"
                    }
                },
                "number": 8,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7310/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700088769677,
                "cdate": 1700088769677,
                "tmdate": 1700117188837,
                "mdate": 1700117188837,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "46qs7esPo2",
            "forum": "j5JvZCaDM0",
            "replyto": "j5JvZCaDM0",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7310/Reviewer_3zVo"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7310/Reviewer_3zVo"
            ],
            "content": {
                "summary": {
                    "value": "This paper studies safe offline reinforcement learning by introducing feasibility into the RL problem for safety-critical systems. The authors convert the safe offline RL problem into a feasibility-dependent optimization problem, i.e., when feasible, maximize reward, when infeasible reduce the safety violation as much as possible."
                },
                "soundness": {
                    "value": "4 excellent"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "4 excellent"
                },
                "strengths": {
                    "value": "1. The paper is novel and the idea is interesting. It scales the HJ reachability to the high-dimensional RL problem and leverages it to offline compute feasible regions, which helps build feasibility-dependent RL problems to encode hard constraints. \n2. The paper is well-motivated, well-organized, and in general easy to follow. \n3. The paper is sound, at least from the writing logic, given the fact I didn't check the math details in the appendix. \n4. The experiments are comprehensive and the results are quite significant compared to the existing work."
                },
                "weaknesses": {
                    "value": "1. The authors may need to add more references to cover \"safe RL with hard constraints\" to better motivate this work and claim the differences. A quick search gives me several recent papers, such as\na. Wang, Yixuan, et al. \"Enforcing hard constraints with soft barriers: Safe reinforcement learning in unknown stochastic environments.\" International Conference on Machine Learning. PMLR, 2023.\nAnd those in \nb. Zhao, Weiye, et al. \"State-wise safe reinforcement learning: A survey.\" arXiv preprint arXiv:2302.03122 (2023). \n\n2. It seems that the baselines in the experiments all consider soft safety constraints. The reviewer would like to see the comparison with baselines belonging to safe offline RL with hard constraints if there is such work."
                },
                "questions": {
                    "value": "1. because this work uses learning to learn feasible regions by HJ reachability, how \"accurate\" the learned regions are? How does the learning region error affect the optimization problem and safety violations?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission7310/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission7310/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission7310/Reviewer_3zVo"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7310/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698804111317,
            "cdate": 1698804111317,
            "tmdate": 1700155756090,
            "mdate": 1700155756090,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "n685e1cBjt",
                "forum": "j5JvZCaDM0",
                "replyto": "46qs7esPo2",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7310/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7310/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer 3zVo"
                    },
                    "comment": {
                        "value": "We thank the reviewer for the constructive comments and positive feedback on our paper. Regarding the concerns of the reviewer 3zVo, we provide the following responses.\n\n> **W1. The authors may need to add more references to cover \"safe RL with hard constraints\" to better motivate this work and claim the differences.**\n\nWe really appreciate the reviewer for providing these relevant works and we are more than happy to include them in our revised paper! Here, we briefly summarize the differences and relations with these related works:\n\n- For [1], the authors proposed a method for learning safe policy with joint soft barrier function learning, generative modeling, and policy optimization. Compared to HJ reachability, barrier functions may be overly conservative [2]. Also, the intertwined learning process is not suitable for offline RL scenarios.\n- For [3], although it considers state-wise constraints, this type of problem still allows for a certain degree of constraint violation. Therefore, we classify it as a soft constraint.\n\nAdditionally, we have included more discussions of related works in Appendix A. Here, we provide a brief summarization.\n\n- For [4], although this method can achieve zero constraint violations, it requires domain knowledge of the task to design specific safety constraints, and thus is not suitable for general and more complex tasks.\n- For [5], the authors primarily focus on the expansion of safe regions in online exploration. However, interaction with the environment is not permitted in an offline setting. In contrast, we learn the feasible region directly from the dataset.\n\n> **W2. It seems that the baselines in the experiments all consider soft safety constraints.**\n\n To the best of our knowledge, **FISOR is the first that considers hard constraints in the offline setting**. Please see Table 4 for details. This is why we only compared soft constraints in the safe offline benchmark DSRL [6].\n- The soft constraint baselines reported in our paper can be transformed into hard constraints by setting the cost limit to $0$. However, as shown in our paper (Figure 3), they suffer from extremely inaccurate estimations of the cost value and leads to increased safety violations (Table 2).\n- Some safe online RL methods that consider hard constraints can be extended to the offline RL settings by introducing some regularization to combat distributional shift. We combined RCRL [7], a safe online RL method that also uses HJ reachability, with TD3+BC [8] to adapt RCRL into the offline setting. The results can be found in Table 6, Appendix D.7 in our revised paper. Table 6 shows that RCRL+TD3BC fails miserably as it is hard to achieve a good balance between reward maximization, constraint satisfaction and distributional shift avoidance. FISOR, on the other hand, obtains great performance in the offline setting due to its decoupled learning procedure.\n\n> **Q1. How \"accurate\" the learned regions are? How does the learning region error affect the optimization problem and safety violations?**\n\nPlease see Figure 1 for illustration. The learned feasible regions in FISOR are far more accurate than the ones learned by cost value functions. \n- In addition, we can select a small $0<\\tau<1$ in $L_{rev}^{\\tau}(u)$ of Eq.(8) to avoid infeasible states being mistakenly learned as feasible states. We have added demonstrative results in Figure 6, Appendix D.1 of the revised manuscript. Results show that a small $\\tau$ will induce a smaller-sized learned feasible region, which is acceptable in safety-critical scenarios as it will induce safer policies. Figure 4(a) also supports this argument.\n- Moreover, estimation errors may increase as the amount of offline data decreases. We have added experiments on small dataset settings in Figure 10, Appendix D.8. Results show that FISOR is robust to small dataset settings as compared to baselines, thanks to its great training stability.\n\n\n[1] Enforcing hard constraints with soft barriers: Safe reinforcement learning in unknown stochastic environments. ICML 2023.\n\n[2] Lyapunov density models: Constraining distribution shift in learning-based control. ICML 2022.\n\n[3] State-wise safe reinforcement learning: A survey. 2023\n\n[4] Model-free safe control for zero-violation reinforcement learning. CoRL 2021.\n\n[5] Safe reinforcement learning in constrained Markov decision processes. ICML 2020.\n\n[6] Datasets and Benchmarks for Offline Safe Reinforcement Learning. 2023\n\n[7] Reachability constrained reinforcement learning. ICML 2022.\n\n[8] A minimalist approach to offline reinforcement learning. NeurIPS 2021."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7310/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700042063152,
                "cdate": 1700042063152,
                "tmdate": 1700042063152,
                "mdate": 1700042063152,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "D1serUuZ6U",
                "forum": "j5JvZCaDM0",
                "replyto": "n685e1cBjt",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7310/Reviewer_3zVo"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7310/Reviewer_3zVo"
                ],
                "content": {
                    "comment": {
                        "value": "I appreciate the feedback from the authors. The responses have fully answered my questions. I am happy to raise the value to an 8 and hope to see the paper get accepted."
                    }
                },
                "number": 11,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7310/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700155723182,
                "cdate": 1700155723182,
                "tmdate": 1700155723182,
                "mdate": 1700155723182,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "8aQjR96y9n",
            "forum": "j5JvZCaDM0",
            "replyto": "j5JvZCaDM0",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7310/Reviewer_FU8i"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7310/Reviewer_FU8i"
            ],
            "content": {
                "summary": {
                    "value": "Safe offline reinforcement learning aims to develop safe policies without risky online interactions, but most existing methods risk potential safety violations by only enforcing soft constraints. This work presents a new approach, FISOR (FeasIbility-guided Safe Offline RL), utilizing reachability analysis from safe-control theory to enforce hard safety constraints, by maximizing rewards within a feasible region determined by the offline dataset and minimizing risks elsewhere. FISOR decouples the process into safety adherence and reward maximization. The result outperforms baselines in safety satisfaction and return performance in the DSRL benchmark for safe offline RL."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "- The idea of including reachability analysis into the learning for safety satification is interesting.\n- The paper is well-written."
                },
                "weaknesses": {
                    "value": "- There seems to be an inconsistency between the goal and the actual approach. The paper aims for 100% guarantee in safety. However, the approach still need to estimate the feasible areas and then to yield the value function threshold. There could be estimation error and this estimation requires very thorough dataset provided, which may not be practical in reality.\n- The learnt infeasible states may be false negative. How do you assure that the infeasible states are really unsolvable instead of you able not able to solve it?"
                },
                "questions": {
                    "value": "- How do you guarantee the gap between the ground-truth infeasible regions and the learnt infeasible regions?\n- How do you measure the normalized cost in the evaluation? Why is it not zero for cases that are 100% safe?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission7310/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission7310/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission7310/Reviewer_FU8i"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7310/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698883231209,
            "cdate": 1698883231209,
            "tmdate": 1700094794942,
            "mdate": 1700094794942,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "nYf8neK30a",
                "forum": "j5JvZCaDM0",
                "replyto": "8aQjR96y9n",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7310/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7310/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer FU8i"
                    },
                    "comment": {
                        "value": "We thank the reviewer for the constructive comments. Regarding the concerns of the reviewer FU8i, we provide the following responses.\n\n> **W1. There seems to be an inconsistency between the goal and the actual approach. The paper aims for 100% guarantee safety. However, the approach still needs to estimate the feasible areas and then yield the value function threshold. There could be estimation error and this estimation requires very thorough dataset provided, which may not be practical in reality.**\n\nWe agree with the reviewer that we use deep neural networks to estimate the feasible regions and approximation errors could exist. However, we must clarify the following major misunderstandings. \n\n- First, note that the feasible areas assessed using HJ reachability are **far more accurate and robust** as compared to those measured using cost value functions, which are widely used in previous works, as demonstrated in Figure 1. Therefore, introducing HJ reachability into safe offline RL contributes a major step towards ensuring safety in safe offline RL settings.\n- Moreover, It can be quite challenging to accurately specify feasible regions in high-dimensional continuous control tasks without functional approximators such as deep neural networks. For example, MetaDrive tasks have extremely complex state spaces with over 250 dimensions. In this sense, it is **impractical** to enforce hard constraints without functional approximators. Specifically, previous safe online RL methods, that aim for 100% safety guarantee, also require to estimate the feasible regions, and approximation errors also exist [1][2][3]. None of these methods can achieve the ideal 100% safety guarantee unless the full state-action space is fully explored.\n\nTo further address the reviewer's concern, we evaluated FISOR in small dataset settings. Please see Figure 10, Appendix D.8 for details. \n\n- Briefly, Figure 10 shows that a small offline dataset doesn't greatly impact FISOR's safety or performance. **This shows that FISOR is robust for small-sample scenarios**.\n- In addition, FISOR is the first offline RL method that considers hard constraints and proposes a stable decoupled training procedure. As shown in Table 1, FISOR is the only method that can ensure safety in all 26 benchmark tasks, while maintaining the highest reward in most of the tasks as compared to other safe baseline agents. This is a remarkable result since the safe offline RL problem with hard constraint satisfaction itself is an extremely challenging task, as it requires seeking the tricky balance among reward maximization, safety constraints satisfaction and distributional shift avoidance.\n\n\n> **W2. The learned infeasible states may be false negative. How do you assure that the infeasible states are really unsolvable?**\n\nControlling $\\tau$ in Eq. (8) adjusts the feasible region's conservatism. A higher $\\tau$ near 1 means learning near-maximum feasible regions, while lowering $\\tau$ leads to a smaller feasible region.\n\n- We added the visualization of learned feasible regions using different $\\tau$ values in Figure 6, Appendix D.1 in our revised paper. Figure 4(a) also supports this argument.\n- In practice, we select $\\tau=0.9<1$, from which a smaller feasible region will be learned and enforces harder safety constraints, where small errors will not likely lead to false negative but false positive. However, a false positive is acceptable since it will lead to a more conservative and safe policy. Although this may lead to some reward loss, it is acceptable in safety-critical scenarios.\n- If false negative leads to unsatisfactory unsafety by chance, we can increase the algorithm's conservatism by reducing the value of $\\tau$.\n\n> **Q1. How do you guarantee the gap between the ground-truth infeasible regions and the learnt infeasible regions?**\n\nPlease see the responses to W2 for details.\n\n> **Q2.1. How do you measure the normalized cost in the evaluation? Why is it not zero for cases that are 100% safe?**\n\nFor the calculation method of normalized cost, please see the general response Q1. We respond to the latter question in W1.\n\n\n[1] Reinforcement Learning for Safety-Critical Control under Model Uncertainty, using Control Lyapunov Functions and Control Barrier Functions. RSS 2020.\n\n[2] Model-free safe reinforcement learning through neural barrier certificate. RAL 2023\n\n[3] Enforcing hard constraints with soft barriers: Safe reinforcement learning in unknown stochastic environments. ICML 2023."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7310/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700041955558,
                "cdate": 1700041955558,
                "tmdate": 1700041955558,
                "mdate": 1700041955558,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "CW2YOrIF7m",
                "forum": "j5JvZCaDM0",
                "replyto": "nYf8neK30a",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7310/Reviewer_FU8i"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7310/Reviewer_FU8i"
                ],
                "content": {
                    "title": {
                        "value": "Thank you for your clarification."
                    },
                    "comment": {
                        "value": "I appreciate the authors for their thorough reply. My major concerns have been addressed. Thus, I increased the score to 6."
                    }
                },
                "number": 9,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7310/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700094776629,
                "cdate": 1700094776629,
                "tmdate": 1700094776629,
                "mdate": 1700094776629,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "SoT8fuiweg",
            "forum": "j5JvZCaDM0",
            "replyto": "j5JvZCaDM0",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7310/Reviewer_5fk7"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7310/Reviewer_5fk7"
            ],
            "content": {
                "summary": {
                    "value": "The paper introduces a method for safe offline policy learning with hard constraints, called FISOR. The method works through three dedicated learning objects that separate the feasible and infeasible region plus satisfaction of safety constraints. Policy learning is performed via a guided diffusion model and experiments show that FISOR is both effective int terms of high rewards and safety."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "Safety in RL is an important and relevant topic and this paper is a nice addition to the existing body of work. The approach to introduce safety via the three learning objectives is well motivated and substantially explained (although I did not follow all details). The usage of the diffusion model for policy learning is interesting. \n\nExtensive experiments including ablation studies are performed on well-known environments.\nWhile FISOR does not achieve the highest rewards in these environments, it consistently is safe and has lower cost than the baseline methods, except for CPQ in the metadrive environment."
                },
                "weaknesses": {
                    "value": "The presentation of the results in Table 1 is a bit confusing. What is the criterion for an agent to be safe? Is it formulated as a threshold on the cost or do you count actual safety violations and only indicate those?\n\nI would like a more thorough discussions of limitations of the method. In the conclusion the limited availability of offline RL data is mentioned, but it is (if I didn't miss something) not well motivated or shown how this limitation affects the method or if it is more a general concern.\nWhat are other limitations? Are there safety constraints that cannot be handled or that are substantially more difficult?\n\nThe figures are a bit blurry on my reader, maybe they can be converted to a different format."
                },
                "questions": {
                    "value": "Table 1: What is the criterion for an agent to be safe? Is it formulated as a threshold on the cost or do you count actual safety violations and only indicate those?\n\nWhat are other limitations? \n\nAre there safety constraints that cannot be handled or that are substantially more difficult?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7310/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698913916280,
            "cdate": 1698913916280,
            "tmdate": 1699636872938,
            "mdate": 1699636872938,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "eLPjKBBHYK",
                "forum": "j5JvZCaDM0",
                "replyto": "SoT8fuiweg",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7310/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7310/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer 5fk7"
                    },
                    "comment": {
                        "value": "We thank the reviewer for the constructive comments and positive feedback on our paper. Regarding the concerns from the reviewer 5fk7, we provide the detailed responses separately as follows:\n\n> **W1. & Q1. What is the criterion for an agent to be safe? Is it formulated as a threshold on the cost or do you count actual safety violations and only indicate those?**\n\n- Please refer to Q1 and Q2 in general response for details about our evaluation protocol.\n\n> **W2.1. How does limited data affect the method ?**\n\n- Limited data may have negative impacts on the performances, which is a common issue with existing offline algorithms, as high-performance offline policy learning usually requires a reasonable amount of offline training data as well as good state-action space coverage.\n- We have added new experiments on small data settings in Figure 10, Appendix D.8 in our revised paper. Figure 10 shows that FISOR can still maintain satisfactory safety levels with limited data, with a lower level of safety performance degeneration as compared to other methods. This could be attributed to the decoupled training approach in FISOR, which enhances policy learning stability under a low-data regime.\n\n> **W2.2. & Q2. What are other limitations?**\n\nBesides the limitation mentioned in the conclusion, please see Appendix F for more discussions on the potential limitations of FISOR. For other potential limitations:\n- FISOR contains four hyper-parameters, such as the forward/reverse expectile and policy extraction temperatures. However, we find that FISOR is not very sensitive to hyper-parameter changes and is robust to different tasks with the same hyper-parameters. We used **only one set** of hyper-parameters ($\\tau=0.9$ for both forward/reverse expectile value), $\\alpha_1=3, \\alpha_2=5$) and achieved consistently good safety performances and reward returns among 26 tasks, as shown in Table 1.\n\n> **W2.3. & Q3. Are there safety constraints that cannot be handled or that are substantially more difficult?**\n\nWe appreciate the reviewer for the constructive comment. We have added the following limitation in Appendix F. \n- In our setting, FISOR considers a very general form of constraint, which sets the safety violation signal to $0$ if safe and $1$ if unsafe. This allows flexible extension to a wide range of hard constraint satisfaction problems. However, this setup may not be applicable to constraints involving environmental disturbances [1] or probabilistic constraints [2]. These safety constraints might impact cost value estimations, thereby affecting the performance of the algorithm.\n\n> **W3. The figures are a bit blurry.**\n\nWe thank the reviewer for this kind comment. We have increased the resolution of the images. We would really appreciate it if the reviewer could provide more specific suggestions so that we can make further improvements.\n\n[1] Safe reinforcement learning using robust control barrier functions. RAL 2022.\n\n[2] Separated proportional-integral lagrangian for chance constrained reinforcement learning. IEEE Intelligent Vehicles Symposium 2021."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7310/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700041842509,
                "cdate": 1700041842509,
                "tmdate": 1700041842509,
                "mdate": 1700041842509,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "JR3QXuxcX6",
                "forum": "j5JvZCaDM0",
                "replyto": "eLPjKBBHYK",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7310/Reviewer_5fk7"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7310/Reviewer_5fk7"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for your reply and answering my questions/concerns.\n\nThe answers (and the other responses) take into account my criticism and the revision of the paper has also improved it.\nThis is a good paper and I hope to see it accepted."
                    }
                },
                "number": 10,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7310/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700122012291,
                "cdate": 1700122012291,
                "tmdate": 1700122012291,
                "mdate": 1700122012291,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]