[
    {
        "title": "DePT: Decomposed Prompt Tuning for Parameter-Efficient Fine-tuning"
    },
    {
        "review": {
            "id": "kMnHEm2Ljd",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission725/Reviewer_XBEs"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission725/Reviewer_XBEs"
            ],
            "forum": "KjegfPGRde",
            "replyto": "KjegfPGRde",
            "content": {
                "summary": {
                    "value": "The paper proposes Decomposed Prompt Tuning (DePT), which decomposes the soft prompt into a shorter soft prompt and a pair of low-rank matrices optimized with two different learning rates. The authors conduct experiments to evaluate the effectiveness and efficiency of the proposed DePT."
                },
                "soundness": {
                    "value": "1 poor"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "- the paper is easy to follow\n- extensive experiments on simple datasets are conducted to evaluate the proposed method"
                },
                "weaknesses": {
                    "value": "- **motivation is weak**: \n  - soft prompts are already very parameter-efficient; it is not necessary to reduce the #parameters in prompt tuning\n  - usually, the length of soft prompts is small, e.g., 8, 16, 32; the additional inference cost is minor compared with the current LLM, which can accept thousands of tokens as input\n  - though prompt tuning is sensitive to initialization, there are some recent methods to deal with this problem, e.g.,\n    - Effective Structured Prompting by Meta-Learning and Representative Verbalizer, ICML 2023\n    - MetaPrompting: Learning to learn better prompts, COLING 2022\n- for the method, the idea of using a LoRA matrix to approximate part of soft prompts is odd to me. Can the authors visualize the learned A and B matrices to explain why DePT is better than Prompt tuning?\n- the tasks used in experiments are too simple; better to try more challenging tasks, like GeoQuery (Zelle & Mooney, 1996), NL2Bash (Lin et al., 2018), WebQS (Berant et al., 2013). \n- datasets in GLUE and SuperGLUE are sensitive to hyperparameters. What are the hyperparameters for each dataset?\n-  In Table 3, DePT is much worse than FT on VQA, but can perform better on MSCOCO; why?\n- how to initialize the soft prompt in prompt tuning? Usually, they can be initialized randomly or use the embeddings of label tokens."
                },
                "questions": {
                    "value": "See the questions mentioned above."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission725/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission725/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission725/Reviewer_XBEs"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission725/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1697177565040,
            "cdate": 1697177565040,
            "tmdate": 1700538419596,
            "mdate": 1700538419596,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "NtVQLcxG4E",
                "forum": "KjegfPGRde",
                "replyto": "kMnHEm2Ljd",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission725/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission725/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Author Rebuttal by Authors (1/2)"
                    },
                    "comment": {
                        "value": "We appreciate the effort and time by the reviewer (XBEs).\n\n`soft prompts are already very parameter-efficient; it is not necessary to reduce the #parameters in prompt tuning`\n\nWe thank the reviewer for the feedback. We agree that prompt tuning is very parameter-efficient. However, this weakness is not applicable to our work, because we do **NOT** reduce the number of parameters compared to prompt tuning.\n\n`Usually, the length of soft prompts is small, e.g., 8, 16, 32; the additional inference cost is minor compared with the current LLM, which can accept thousands of tokens as input`\n\nWe would like to express our appreciation for the reviewer's feedback. However, we respectfully present a different perspective:\n\n- Previous works [1,2,3,4,5,6,7,8] typically use soft prompts with a default length exceeding 100 virtual tokens. To support this point, we can directly quote previous work [5], which states that \"***for hard sequence tasks, usually, a longer prompt than 100 would be helpful***\". Similar claims can be found throughout the literature. To the best of our knowledge, there is no existing work that utilises soft prompts with a length of fewer than 32 virtual tokens while accepting thousands of tokens as the input.\n- Let's take a step back and consider the situation more broadly. Assuming that we can only add at most 32 virtual tokens to the soft prompt, our proposed method allows us to achieve a highly competitive or even better performance than using around 100 virtual tokens, with minor operations and costs (*i.e.,* add the multiplication of low-rank matrices element-wisely to frozen word embeddings at the input sequence). We believe that this should be regarded as a notable strength of our work.\n\n`though prompt tuning is sensitive to initialization, there are some recent methods to deal with this problem e.g., Effective Structured Prompting by Meta-Learning and Representative Verbalizer, ICML 2023. MetaPrompting: Learning to learn better prompts, COLING 2022.`\n\nWe thank the reviewer for the feedback. We respectively argue that this weakness is not applicable to our work because:\n- Our main goal is **NOT** to address the initialisation problem of the prompt tuning. Instead, our work primarily addresses the increased computational demands, in terms of training, inference time, and memory costs, which arise from the increased input sequence length due to adding the soft prompt.\n- In our work, we have extensively discussed these Parameter-efficient Transfer Learning (PETL) approaches by previous works, which aim to solve the initialisation problem. In Section 3.4 of our paper, we have empirically demonstrated that our proposed method complements PETL approaches in the few-shot learning setting. This substantiates our position that the initialisation challenge, while relevant in other contexts, is not applicable to our method.\n\nWe appreciate the reviewer for suggestions on related works. We will make sure to discuss these works in our revised version. \n\n`the tasks used in experiments are too simple; better to try more challenging tasks, like GeoQuery (Zelle & Mooney, 1996), NL2Bash (Lin et al., 2018), WebQS (Berant et al., 2013).`\n\nWe thank the reviewer for this suggestion. However, we respectfully disagree with the reviewer:\n\n- All other reviewers (`mz3i`,`BZux`,`yLsP`) have commented positively on the thoroughness of our experiments, suggesting that they find our current evaluation to be adequate.\n- Our work has already included a comprehensive evaluation of 23 datasets. These tasks range from natural language inference and sentiment analysis to open-domain question answering, common-sense reasoning, and even visual-language tasks. We believe that these tasks collectively represent a diverse and challenging set, and we do not consider them to be simple.\n- Our experiments adhere to the settings and tasks used in previous works [1,2,3,4,5,6,7,8], strictly following the two most recent works [7,8].\n- WebQs is a question-answering task, while GeoQuery and NL2Bash are generation tasks. Both of these task types have already been covered by the existing datasets in our work.\n\n### References:\n\n[1] The Power of Scale for Parameter-Efficient Prompt Tuning. EMNLP 2021.\n\n[2] On Transferability of Prompt Tuning for Natural Language Processing. NAACL 2022.\n\n[3] SPoT: Better Frozen Model Adaptation through Soft Prompt Transfer. ACL 2022.\n\n[4] PPT: Pre-trained Prompt Tuning for Few-shot Learning. ACL 2022.\n\n[5] P-Tuning: Prompt Tuning Can Be Comparable to Fine-tuning Across Scales and Tasks. ACL 2022.\n\n[6] PSP: Pre-trained Soft Prompts for Few-Shot Abstractive Summarization. COLING 2022.\n\n[7] ATTEMPT: Parameter-Efficient Multi-task Tuning via Attentional Mixtures of Soft Prompts. EMNLP 2022.\n\n[8] Multitask Prompt Tuning Enables Parameter-Efficient Transfer Learning. ICLR 2023."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission725/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700169247747,
                "cdate": 1700169247747,
                "tmdate": 1700169476764,
                "mdate": 1700169476764,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "OV4e3v3wK0",
                "forum": "KjegfPGRde",
                "replyto": "OmwTf6AsY5",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission725/Reviewer_XBEs"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission725/Reviewer_XBEs"
                ],
                "content": {
                    "title": {
                        "value": "Thanks for your response"
                    },
                    "comment": {
                        "value": "Thank for the author's reply, which resolved my major concerns.\nThus, I increased my score to 6."
                    }
                },
                "number": 8,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission725/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700538406209,
                "cdate": 1700538406209,
                "tmdate": 1700538406209,
                "mdate": 1700538406209,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "RCJ3b8YYKb",
            "forum": "KjegfPGRde",
            "replyto": "KjegfPGRde",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission725/Reviewer_mz3i"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission725/Reviewer_mz3i"
            ],
            "content": {
                "summary": {
                    "value": "The work introduces decomposed prompt tuning for parameter-efficient fine-tuning, or DEPT. They propose to reduce the prompt and add a decomposable matrix to the word embeddings. The experiments on GLUE and SuperGLUE show the method's effectiveness while being more efficient than prompt tuning. The few-shot learning experiments show that the method is competitive with other parameter-efficient fine-tuning methods with more parameters. Overall, the method improves prompt tuning while being 20% efficient in training."
                },
                "soundness": {
                    "value": "4 excellent"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "**Paper quality.** The paper is well written. The organization of the paper is clear and well thought out. I enjoyed reading the paper. \n\n**Extensive experiments.** The paper extensively experiments with improved results compared to prompt tuning while being more efficient during training and inference. The authors have done a great job comparing the work with other recent methods in the literature and show that DEPT outperforms them on GLUE and SuperGLUE. They further provide evidence of their efficiency on GPT and Llama2 models. \n\n**Code.** The code is well organized and easy to understand (see https://anonymous.4open.science/r/DePT-8F43/README.md)."
                },
                "weaknesses": {
                    "value": "**The architecture is not well motivated.** \nThe architecture appears to be a combination of prompt tuning and LoRA. But, unlike LoRA, DEPT still suffers from prompt length compared to architectures at inference time. While DEPT can also achieve the same inference speed as the base model, like LoRA, when the prompt length is 0, in Figure 3, we see that the performance is about 20 points below the DEPT performance reported in Table 1. Furthermore, decomposing the prompts does not offer any conceptual understanding or insight into the learned prompts. \n\n**Experiments with only smaller models (<1B model parameters).**\nAll experiments in the main paper are conducted on smaller models which hurt the technical contribution of the work. The paper presents improved results over several parameter-efficient methods, by a small margin, on models that have less than 1 billion parameters. The authors have included results of Llama2 in Appendix B but show improvements over prompt tuning on only one dataset (SST-2). It would be of interest to the community to know if the work is applicable to larger models say T5-XL, T5-XXL, or Llama2 on more datasets.\n \n**Missing experiments.**\nI noticed that the authors do not include results on SuperGLUE for LoRA in Table 1. Since the results for DEPT and LoRA are so close on GLUE, I would be curious to see how close the results are on SuperGLUE. \n\n**Suggestions.**\n- Related work: The title of your work is similar to the below papers [a,b] but the proposed work differs. You could choose to cite them and clarify the differences in the next version of the paper. \n- Move the 3.3 #2 (DEPT grows more efficient with model size increases) to the Appendix and move Llama2 to the main paper as it is obvious that the inference time will improve with model parameter size. The Llama2 results, on the other hand, are more interesting.\n- For completeness, it would be great if the authors could include the GPT-2 results in the Appendix on GLUE and SuperGLUE. I’d be curious to see if there are any changes in the performance. \n\nReferences:\n\n[a] Decomposed prompting: A modular approach for solving complex tasks. ICLR 2023.\n\n[b] ​​Learning to compose soft prompts for compositional zero-shot learning. ICLR 2023."
                },
                "questions": {
                    "value": "- In implementation details, you have included that the soft prompts and low rank matrices are initialized from soft prompts derived from one of the source tasks. Could you clarify this detail? It is unclear why this is necessary. \n- Do you think $\\mathbf{BA}$ could use a scaling factor like $\\frac{\\alpha}{r}$? It is possible that this could be causing the low performance due to when only the decomposed matrices are trained. \n- In the background, you have mentioned that $s$ is the maximum sequence length. How would you set $s$ for Llama2 or models that do not have a fixed maximum sequence length?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission725/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission725/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission725/Reviewer_mz3i"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission725/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698708930633,
            "cdate": 1698708930633,
            "tmdate": 1699635999592,
            "mdate": 1699635999592,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "Xgg1TkKb7x",
                "forum": "KjegfPGRde",
                "replyto": "RCJ3b8YYKb",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission725/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission725/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Author Rebuttal by Authors (1/2)"
                    },
                    "comment": {
                        "value": "We appreciate the effort and time by the reviewer (mz3i).\n\n`The architecture is not well motivated. The architecture appears to be a combination of prompt tuning and LoRA. But, unlike LoRA, DEPT still suffers from prompt length compared to architectures at inference time.`\n\nWe thank the reviewer for the insightful suggestion. In response, we would like to discuss the comparison between Prompt Tuning (PT) and LoRA, as our work aims to improve the PT, in the following points:\n\n- **Relative Performance of LoRA and PT.** When adapting language models (LMs) to specialised domains, like mathematical reasoning, which requires much different knowledge than what LLMs have been trained on, LoRA may perform better than Prompt Tuning (PT). However, in case tasks have already been somewhat understood by LMs and the key challenge is just to properly prompt the LMs, PT can be the better option. PT modifies minimal model parameters, focusing instead on improving the input prompt, which has been proven more effective than LoRA in prior studies [1,2].\n- **Specific Use Cases for PT.** PT offers advantages in particular cases. For example, soft prompts can be used to compress few-shot examples in the prompt or long context [3,4]. While the number of trainable parameters is low, LoRA updates the weight matrices across the whole model. In contrast, PT only improves the input of the LM through the soft prompt, which helps the model focus on understanding the task and context better rather than learning new knowledge.\n- **Parameter Efficiency.** Unlike LoRA, which requires trainable parameters at each layer, PT's trainable parameters are more concentrated and less extensive.\n- **Parameter-efficient transfer learning (PETL) Framework.**  PETL framework (e.g., [1,2]) can effectively improve the performance of the PT and make it easier to use. In our work, we have demonstrated that our approach is compatible with PEFL framework.\n\n`Experiments with only smaller models (<1B model parameters).`\n\nWe respectfully disagree with the reviewer. While we acknowledge the importance of exploring this avenue, we are currently constrained by limited computing resources. This is a common issue faced by many researchers and practitioners. Therefore, the findings of this paper are relevant not just to us but also to others in a similar situation. However, also in response to this complain, we have conducted additional experiments on T5-3B. We report the average performance on the Glue dataset as well as inference speed, measured in inference samples per second. Our findings indicate that DePT (m=60, r=30) outperforms PT in terms of inference speed by 37%. This suggests the advantage of DePT increases as the model size increases. \n\n|  | Average Glue Performance | Inference Speed |\n| --- | --- | --- |\n| DePT (m=60, r=30) | 86.4 | 8.9 |\n| PT (m=100) | 85.6 | 6.5 |\n\n(*m indicates the length of the soft prompt*, *r indicates the rank of low rank matrices*)\n\nWe will do our best to get the necessary resources to investigate this important direction, and we leave this to future work.\n\n`Missing experiments. I noticed that the authors do not include results on SuperGLUE for LoRA in Table 1. Since the results for DEPT and LoRA are so close on GLUE, I would be curious to see how close the results are on SuperGLUE.`\n\nWe thank the reviewer for the insightful suggestion. In response, we have add LoRA and IA3 as baselines and filled the missing number for Table 1. Specifically, we train LoRA and IA3 with 30k steps with a batch size of 16. We use the rank as 35 for LoRA. We perform a learning rate search among 3e-3, 5e-4, 1e-4, and 5e-5, and report the test results of the best model on the development set. Our experiment show that DePT obtains better mean performance on SuperGlue benchmark.\n\n|                                | Multirc | Bool   | WiC   | WSC | CB    | Mean |\n|----------------    |-------  |-------|----    |----    |------|------|\n|LoRA                       | 72.6     | 81.3    |  68.3 | 67.3   | 89.3  | 75.8 |\n|IA3                           | 73.3    | 80.9    |  67.7 | 73.1    | 85.7  | 76.1  | \n\n### References:\n\n[1] ATTEMPT: Parameter-Efficient Multi-task Tuning via Attentional Mixtures of Soft Prompts. EMNLP 2022.\n\n[2] Multitask Prompt Tuning Enables Parameter-Efficient Transfer Learning. ICLR 2023.\n\n[3] Prompt Compression and Contrastive Conditioning for Controllability and Toxicity Reduction in Language Models, EMNLP 2022.\n\n[4] Adapting Language Models to Compress Contexts. EMNLP 2023."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission725/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700167724454,
                "cdate": 1700167724454,
                "tmdate": 1700167744978,
                "mdate": 1700167744978,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "7VTUSttfN6",
                "forum": "KjegfPGRde",
                "replyto": "SUjdSUiRVw",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission725/Reviewer_mz3i"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission725/Reviewer_mz3i"
                ],
                "content": {
                    "title": {
                        "value": "Reply to the Authors"
                    },
                    "comment": {
                        "value": "Thank you for your response. I am happy to see that DEPT performs better than all the previous parameter-efficient learning methods. I appreciate you clarifying most of my queries and updating your paper. However, the intuition behind the architecture (included in the updated paper) is still not convincing and the overall results are better than previous methods but they are not significantly higher. These factors could limit the impact of the work. For this reason, I am going to keep my score at 6."
                    }
                },
                "number": 9,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission725/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700569567758,
                "cdate": 1700569567758,
                "tmdate": 1700569567758,
                "mdate": 1700569567758,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "thsOvXB1LM",
                "forum": "KjegfPGRde",
                "replyto": "RCJ3b8YYKb",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission725/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission725/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Official Comment by Authors"
                    },
                    "comment": {
                        "value": "Thank you so much for your continued discussion and feedback! We appreciate the opportunity to clarify and discuss:\n- **Architecture Justification**. We understand the reviewer’s question about the architecture's intuition. It's important to highlight that the series of Prompt Tuning works, which form the core of our architecture, has shown distinct advantages in certain tasks over other Parameter-Efficient Fine-Tuning (PEFT) approaches, as we discussed in the previous reply. Therefore, we believe that our work, with the goal of improving the design of prompt tuning, remains a promising avenue for future research.\n- **Model Performance and Efficiency**. Our work focuses not only on improving the model performance. An important contribution of our work is addressing the increased computational demands, in terms of training, inference time, and memory costs, which arise from the increased input sequence length due to adding the soft prompt. Although the improvement in performance may not be dramatic, the efficiency gains are notable. For example, as in our previous reply, when T5-3B is used as the backbone, we find the DePT (m=60, r=30) outperforms PT in terms of inference speed by 37%, underscoring the efficiency enhancements our proposed method has achieved."
                    }
                },
                "number": 11,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission725/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700580327828,
                "cdate": 1700580327828,
                "tmdate": 1700580600545,
                "mdate": 1700580600545,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "ifMjA3SLcr",
                "forum": "KjegfPGRde",
                "replyto": "thsOvXB1LM",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission725/Reviewer_mz3i"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission725/Reviewer_mz3i"
                ],
                "content": {
                    "title": {
                        "value": "Acknowledging the Response"
                    },
                    "comment": {
                        "value": "Thanks for the reply. I will wait for other reviewers to give their thoughts on the paper before deciding on my final score."
                    }
                },
                "number": 12,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission725/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700580753463,
                "cdate": 1700580753463,
                "tmdate": 1700580753463,
                "mdate": 1700580753463,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "auYorQiSuM",
            "forum": "KjegfPGRde",
            "replyto": "KjegfPGRde",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission725/Reviewer_BZux"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission725/Reviewer_BZux"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes a novel parameter efficient tuning method for language models named decomposed prompt tuning or DePT. Compared with popular parameter efficient tuning method prompt tuning, deft aims to learn more compact soft prompt and a pair of low-rank matrices for updating the vocabulary embeddings. The key innovation for DePT is to offload the potential need for long soft prompts and decompose them into a pair of low rank matrices. Through experiments with both language models and vision-language models across various tasks, the authors find that DePT can achieve advantageous performance while saving approximately 20% memory cost."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "To the best of the reviewer’s knowledge, the method proposed in this paper DeFT is novel. The authors also provide solid intuitions and reasoning for this method. Besides the method constructions, the experiments are comprehensive. I also appreciate the authors’ efforts in organizing the anonymous project code that covers the experiments."
                },
                "weaknesses": {
                    "value": "The key contribution of DePT lies in that it is both optimizing a soft context as long as the vocabulary in an efficient manner. The decomposition idea, although novel in its current form, is incremental to current PEFT methods. There is also existing work (e.g. [1]) that explored tuning subsets of vocabularies as a way of PEFT. That being said, DePT still has the advantage of efficient vocabulary tuning. The 20% efficiency advantage also is only revealed with one soft prompt length of 100. It would be appreciated if the authors are to disclose more performance comparison under different prompt length scenarios. \n\nRef: \n[1] Nayak, N. V., Yu, P., & Bach, S. (2022, September). Learning to Compose Soft Prompts for Compositional Zero-Shot Learning. In The Eleventh International Conference on Learning Representations."
                },
                "questions": {
                    "value": "I appreciate the ablation experiments on the significance of different learning rates for the soft prompts and low rank matrices. I also wonder if there are other intuitive explanations."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission725/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission725/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission725/Reviewer_BZux"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission725/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698768223717,
            "cdate": 1698768223717,
            "tmdate": 1699635999522,
            "mdate": 1699635999522,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "B9LLCkCCQC",
                "forum": "KjegfPGRde",
                "replyto": "auYorQiSuM",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission725/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission725/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Author Rebuttal by Authors"
                    },
                    "comment": {
                        "value": "We appreciate the effort and time by the reviewer (BZux).\n\n`The key contribution of DePT lies in that it is both optimizing a soft context as long as the vocabulary in an efficient manner. The decomposition idea, although novel in its current form, is incremental to current PEFT methods. There is also existing work (e.g. [1]) that explored tuning subsets of vocabularies as a way of PEFT. That being said, DePT still has the advantage of efficient vocabulary tuning.`\n\nWe thank the reviewer for the suggestion. We appreciate the opportunity to clarify: the meaning of “compose” and the method are fundamentally different between CSP [1] and our work:\n\n- **What is the difference?** CSP treats the attributes and objects that are composed to define classes as learnable tokens within the vocabulary. In contrast, our proposed method DePT does not train soft prompts associated with any vocabulary token, nor does it add additional tokens to the vocabulary. The main goal of DePT is to improve the efficiency of Prompt Tuning (PT) due to the increased input sequence. **DePT does not tune or update anything related to the vocabulary, including tokens and embeddings.** \n- **Which work is closely related to CSP and DePT respectively.** CSP [1] aligns more closely with prompt-based fine-tuning [2,3,4] where the soft prompts are trained associated with specific prompts and label words. In contrast, DePT aligns more closely with PT. While soft prompts in DePT and PT could be initialised with word embedding, these prompts are not updated in association with any existing or newly added vocabulary tokens. We will make this clear in our revised version.\n- **Comments from the reviewer (mz3i).** We appreciate that the reviewer (mz3i) has pointed out that while the title of our work is similar to the CSP work [1], the proposed methods are different. We have discussed this in the Appendix of our revised version.\n\n`The 20% efficiency advantage also is only revealed with one soft prompt length of 100. It would be appreciated if the authors are to disclose more performance comparison under different prompt length scenarios`\n\nWe appreciate the reviewer's question. In response, we have performed additional experiments, as shown in the Table below. Specifically, we have increased the size of trainable parameters in both DePT and PT by a factor of two. We use the T5-base as the backbone. We report the average performance on the Glue dataset as well as inference speed, measured in inference samples per second. Our findings indicate that DePT (m=120, r=60) outperforms PT in terms of inference speed by 34%. We believe that this performance advantage can be further enhanced by reducing the value of m, which represents the length of the soft prompt. To provide a concrete example, on the SST-2 dataset, DePT can achieve an inference speed of 77.2 samples per second, while PT can only infer 57.4 samples per second. This suggests the advantage of DePT over PT increases as the model size increases.\n \n|                 | Mean Glue Performance  | Inference Speed  (Samples Per Second)| \n|-------     |-------|----|\n| DePT (m=120, r=60) | 86.0 |  54.8 |\n| PT (m=200) | 85.2 | 40.8 |\n\n(*m indicates the length of the soft prompt*, *r indicates the rank of low-rank matrices.*)\n\n\n`I appreciate the ablation experiments on the significance of different learning rates for the soft prompts and low-rank matrices. I also wonder if there are other intuitive explanations.`\n\nWe thank the reviewer for the insightful suggestion. The intuition of our method is that (1) **given the same number of trainable parameters, allowing some updates for word embeddings will improve the performance**; and (2) **shorter soft prompt will improve the efficiency.** To illustrate, the previous study [5] has shown that a soft prompt can interpolate between many token embeddings, enabling the representation of more abstract concepts compared to relying on a single discrete token. However, the soft prompt in the Prompt Tuning is consistently added at the beginning of the frozen word embedding. In contrast, we propose DePT, which decomposes the long soft prompt into a short soft prompt and a pair of low-rank matrices. This approach can (1) reduce the length of the soft prompt for better efficiency; and (2) permit representation updates within the frozen word embedding, thereby increasing the adaptability of input representations that were previously unavailable. \n\n### References:\n\n[1] Learning to Compose Soft Prompts for Compositional Zero-Shot Learning. ICLR 2023.\n\n[2] Exploiting cloze-questions for few-shot text classification and natural language inference. EACL 2021.\n\n[3] Differentiable prompt makes pre-trained language models better few-shot learners. ICLR 2022.\n\n[4] Don’t Stop Pretraining? Make Prompt-based Fine-tuning Powerful Learner, NeurIPS 2023.\n\n[5] Prompt Compression and Contrastive Conditioning for Controllability and Toxicity Reduction in Language Models. Findings of EMNLP 2022."
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission725/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700165963599,
                "cdate": 1700165963599,
                "tmdate": 1700166910937,
                "mdate": 1700166910937,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "P55ispDvmX",
            "forum": "KjegfPGRde",
            "replyto": "KjegfPGRde",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission725/Reviewer_yLsP"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission725/Reviewer_yLsP"
            ],
            "content": {
                "summary": {
                    "value": "The paper proposes a new PEFT method that falls under the prompt tuning category. The paper is motivated by the fact that soft prompts increase the sequence length which results in increased training and inference time. The main idea of the paper is to reduce the number of soft prompt tokens and use the remaining parameters to perform low-rank updates to the embedding matrix. The DePT method outperforms vanilla prompt tuning in almost all cases and is competitive with many other PEFT methods."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "S1: The idea is very simple and leads to decent improvements over the baseline methods. Also, the paper is very easy to read and understand. \n\nS2: The experiments are thorough enough, however, I have some mild additional suggestions that might make the experimental section more complete."
                },
                "weaknesses": {
                    "value": "W1: Some of the important baseline methods like IA3 are missing. See questions below. \n\nW2: The idea is interesting, however some more intuition on why this works might strengthen the paper."
                },
                "questions": {
                    "value": "**For me to retain my current score**\n\nQ: Many of the tables have inconsistent baseline and incomplete results. All the superglue results should be filled in Table 1. I understand that the numbers are not available in past papers but it is not hard to obtain these numbers. This is important because the LORA method is the closet peft method on the glue benchmark however it is missing when looking at Superglue. Similarly, Table 2 should have LoRA as a baseline.\n\nQ: IA3 is a recent PEFT method that is very parameter efficient and is missing from the baseline comparison. It is a crucial baseline, especially in the case of the few-shot adaptation. It should be added at least to Tables 4 and 5 and adding it to Tables 1-2 would also be good.\n\n\n\n**Other Questions**\n\nQ: Most of the improvement in the table-1 glue task seems to come from 1-2 tasks like cola, rte any specific reason for this?\n\n\nNote for other reviewers and AC: I am not sure of the related work section, there might be some relevant prompting-related baselines that I am not aware of."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission725/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698894807830,
            "cdate": 1698894807830,
            "tmdate": 1699635999413,
            "mdate": 1699635999413,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "W4PKFqNkbK",
                "forum": "KjegfPGRde",
                "replyto": "P55ispDvmX",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission725/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission725/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Author Rebuttal by Authors"
                    },
                    "comment": {
                        "value": "We appreciate the effort and time spent by the reviewer (yLsP).\n\n`W1: Some of the important baseline methods like IA3 are missing. See questions below.`\n\nWe thank the reviewer for the insightful suggestion. In response, we have performed additional experiments as follows:\n\n(1) Firstly, we have added LoRA and IA3 as baselines and filled in the missing numbers for Table 1. Specifically, we train LoRA and IA3 with 30k steps with a batch size of 16. We use the rank as 35 for LoRA. We perform a learning rate search among 3e-3, 5e-4, 1e-4, and 5e-5, and report the test results of the best model on the development set. Our experiment shows that DePT obtains better mean performance on Glue and SuperGlue benchmarks.\n\n|                 | MNLI | QQP | QNLI | SST-2 | STS-B | MRPC | RTE | CoLA | Mean |\n|----------|-------|-------|----|----|------|------|------|------|------|\n|LoRA        | 86.3  | 89.0  | 93.2  | 94.3  | 90.9  | 90.1  | 75.5  | 63.3  | 85.3 | \n|IA3           |  85.7|  90.3 | 93.6 | 94.2 |   90.5 | 86.8 | 82.0  | 58.3 | 85.2 |\n\n|                                | Multirc | Bool   | WiC   | WSC | CB    | Mean |\n|----------------    |-------  |-------|----    |----    |------|------|\n|LoRA                       | 72.6     | 81.3    |  68.3 | 67.3   | 89.3  | 75.8 |\n|IA3                           | 73.3    | 80.9    |  67.7 | 73.1    | 85.7  | 76.1  | \n|Fine-tuning(m)       |  74.4     | 81.1     | 70.0  | 71.2    |  85.7 | 76.1  |\n|Adapter(m)             | 72.6  | 82.3     |  66.5 | 67.3   |  89.3  |  75.6 |\n|HyperFormer(m)    | 72.9  | 82.5      |  69.0 | 67.3   | 85.7  | 75.4 |\n|HyperDecoder(m)  | 70.4 |  78.8     | 67.1    | 61.5   | 82.1  | 72.0 |\n*m indicates multi-task learning*\n\n(2) We also add LoRA as a baseline in Table 2. While it is worth noting that LoRA performs highly competitively on WinoGrande, YelpPolarity, SciTail, and PAWS datasets, we have encountered challenges when training LoRA on certain MRQA tasks, such as HotpotQA. Our experiment shows that the advantage of DePT persists.\n\n|                 | NQ        | HP      | SQA  | News | Mean |\n|----------|-------  |-------|----    |----   |------  |\n|LoRA        | 69.7      |  61.6  |71.9   | 56.6  |    65.0 |\n|DePT   | 73.2 | 76.8 | 77.6 | 64.4 | 73.0 |\n\n| |  WG | Yelp      | SciTail | PAWS | Mean |\n|----------|-------  |-------|----      |----   |----   |\n|LoRA        | 58.2 | 97.1       | 94.7   | 94.0    | 86.0 |\n|DePT   | 59.0 | 96.8 | 95.6 | 93.7 | 86.3 |\n\n(3) In addition, we have added IA3 as a baseline to Table 4 in the few-shot learning setting (4, 16, or 32 training examples). We report average results across three seeds. Specifically, we find that DePT, along with other PT variants (ATTEMPT and MPT), can outperform IA3, highlighting the effectiveness of DePT with transfer learning approaches.\n\n|                 | 4  | 16  | 32  | \n|-------     |-------|----|----   |\n| Boolq      | 56.7  | 62.0 | 67.2 |\n| CB          | 65.5 | 71.4 | 75.0 |\n| SciTail      | 65.4 | 74.4 | 80.4 | \n\n`W2: The idea is interesting, however some more intuition on why this works might strengthen the paper.`\n\nWe acknowledge the reviewer's inquiry regarding the intuition of our method. The intuition of our method is that (1) **given the same number of trainable parameters, allowing some updates for word embeddings will improve the performance**; and (2) **shorter soft prompt will improve the efficiency.** To illustrate, the previous study [1] has shown that a soft prompt can interpolate between many token embeddings, enabling the representation of more abstract concepts compared to relying on a single discrete token. However, the soft prompt in the Prompt Tuning is consistently added at the beginning of the frozen word embedding. In contrast, we propose DePT, which decomposes the long soft prompt into a short soft prompt and a pair of low-rank matrices. This approach can (1) reduce the length of the soft prompt for better efficiency; and (2) permit representation updates within the frozen word embedding, thereby increasing the adaptability of input representations that were previously unavailable. \n\n[1] Prompt Compression and Contrastive Conditioning for Controllability and Toxicity Reduction in Language Models. Findings of EMNLP 2022.\n\n`Q: Most of the improvement in the table-1 glue task seems to come from 1-2 tasks like cola, rte any specific reason for this?`\n\nWe appreciate the reviewer's question. Our main objective in this study is not solely to improve performance metrics in the table. Instead, we seek to demonstrate that DePT can deliver highly competitive or even better overall performance while substantially enhancing overall efficacy in terms of computational time and memory usage, which is especially useful for large language models."
                    }
                },
                "number": 1,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission725/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700165149672,
                "cdate": 1700165149672,
                "tmdate": 1700165149672,
                "mdate": 1700165149672,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "vp3ZsKdmPA",
                "forum": "KjegfPGRde",
                "replyto": "W4PKFqNkbK",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission725/Reviewer_yLsP"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission725/Reviewer_yLsP"
                ],
                "content": {
                    "title": {
                        "value": "Response"
                    },
                    "comment": {
                        "value": "I thank the authors for their reply.  I have read the reply and will retain my score. \n\nJust a small question, in table 2 the performance of lora for mrqa seem really low I would suggest the authors to recheck their implementation and tuning it more for the final version."
                    }
                },
                "number": 14,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission725/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700584461018,
                "cdate": 1700584461018,
                "tmdate": 1700584461018,
                "mdate": 1700584461018,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]