[
    {
        "title": "Thin-Shell Object Manipulations With Differentiable Physics Simulations"
    },
    {
        "review": {
            "id": "xGyMxZtuu7",
            "forum": "KsUh8MMFKQ",
            "replyto": "KsUh8MMFKQ",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6426/Reviewer_k5Lf"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6426/Reviewer_k5Lf"
            ],
            "content": {
                "summary": {
                    "value": "This work develops ThinShellLab, a simulator and benchmark for robotic learning in thin-shell material manipulation.\nThe simulator models volumetric and thin-shell materials with finite-element methods with tetrahedral and triangular elements, and is differentiable.\nThe robotic manipulation benchmark defines tasks including lifting, separating, following, folding, pick-folding, and forming. The benchmark is used to evaluate manipulation methods including sampling-based, gradient-based, and hybrid trajectory optimization, as well as reinforcement learning methods.\nThe simulator is also shown to support system identification, which allows transferring certainly simulated policies to be deployed in the real world."
                },
                "soundness": {
                    "value": "4 excellent"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "4 excellent"
                },
                "strengths": {
                    "value": "- This work is the first to properly implement a differentiable thin-shell object simulator for robotic manipulation.\n- The paper is overall written clearly.\n- The manipulation tasks are well-designed to reflect properties of thin-shell materials. The benchmarked methods have good coverage."
                },
                "weaknesses": {
                    "value": "- Some details of the simulator are not clear (see Questions section).\n- Some useful simulation features are not shown in this paper.\n  - It seems the system does not fully support/couple with rigid-body simulation, which is important for modeling robots.\n  - The paper does not show any tasks involving constraint simulation (e.g., cloth with one end fixed).\n- Real-world manipulation only contains a single case. It is not convincing that in general the described system identification method will improve sim-to-real policy deployment."
                },
                "questions": {
                    "value": "- The contact model uses quadratic energy instead of barrier. How does the system correctly identify that 2 triangles are penetrating? Based on the paper, it seems it is based on normal direction, however, this does not seem correct since the normal would flip if one of the contacting shell is flipped.\n- The paper describes the system as simulating tetrahedral and triangular elements, how is the rigid-body action space achieved?\n- Newton's method requires solving a large linear system. How is this implement on the GPU? Is it solved through sparse matrix algorithms, conjugate gradient methods, or some other method?\n- What is the speed/performance of this simulator? What are the bottlenecks?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6426/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698531818150,
            "cdate": 1698531818150,
            "tmdate": 1699636717336,
            "mdate": 1699636717336,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "gbpM5kduc6",
                "forum": "KsUh8MMFKQ",
                "replyto": "xGyMxZtuu7",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6426/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6426/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer k5Lf"
                    },
                    "comment": {
                        "value": "*Thank you for your insightful and constructive comments! We discuss some of your questions and concerns below.*\n\n**1. Rigid body dynamics & action space**\n\nWhile we can directly integrate the rigid body dynamics into the implicit-time integration scheme, the system will become quite cumbersome and therefore we decide to process the deformable and rigid system separately. Currently the robot manipulator is modelled by position-based control, i.e., the action space of rigid body end-effectors are defined as SE(3) movements within each timestep, and therefore the elastomers are attached to moving rigid boundaries controlled by the actions.\n\nWe are still working on further modelling of rigid body dynamics. For the rigid manipulated objects, we plan to support them by adding an stiff orthogonality potential energy on a deformable mesh as in ABD[1]. We also plan to include the penalty energies of joint constraints to model the dynamics behavior of articulated body system.\n\n**2. Constrainted simulation**\n\nWe support the constraints of fixing vertex positions. In **Folding** and **Forming**, we fix one end of the paper on the table. In **Separating** and **Following**, we fix two manipulator in a gripper shape.\n\nThe technique to simulate the constraints is simple. To fix one vertex (or even one dimension of this vertex), we simply set the derivative and hessian matrix related to this dimension to zero before solving the equation. This will result in an unchanged position for this vertex while modeling it's force and influence to other vertices.\n\n**3. Real-world manipulation**\n\nWe add more real-world manipulation cases identical to **Folding** tasks in simulation. We use a rigid manipulator to interact with a curved paper and try to fold on different creases. \n\n### Questions\n\n> **Q1: The contact model uses quadratic energy instead of barrier. How does the system correctly identify that 2 triangles are penetrating? Based on the paper, it seems it is based on normal direction, however, this does not seem correct since the normal would flip if one of the contacting shell is flipped.**\n\nTo model contact behavior, we apply quadratic penelty energies on a dynamic set of contact constraints. The reason of not using a barrier function is that we observe that the quadratic model converges much faster than the log-barrier model on complex scenes involving multiple layers of thin-shell material. With quadratic energies, we actually make non-penetration a soft constraint with a large stiffness coefficient. When a constraint is established between a vertex and a shell surface, we maintain a \"side\" property between them, whose value is one of the shell's two sides. This property remains unchanged until the vertex's projection falls on the shell's boundary. When dealing with contact between the vertex and the shell, all faces of the shell will be assigned with a normal direction pointing towards the corresponding side. In this way, we avoid the ambiguity problem of shell surface's normal direction, and also the penetration problem caused by the soft constraint, since a vertex slightly penetrating into a surface will be repulsed towards a consistent direction.\n\n> **Q2: The paper describes the system as simulating tetrahedral and triangular elements, how is the rigid-body action space achieved?**\n\nIt is addressed above in point 1.\n\n> **Q3: Newton's method requires solving a large linear system. How is this implement on the GPU? Is it solved through sparse matrix algorithms, conjugate gradient methods, or some other method? What is the speed/performance of this simulator? What are the bottlenecks?**\n\nFor linear equation solving, we use a python binding of the cuSPARSE library, which supports solving sparse matrices using Cholesky Factorization on GPU. The speed is around 2.74 FPS in one case and the bottlenecks are **1) linear equation solving at each iteration of Newton's method** and **2) Hessian matrices building and SPD projecting**.\nThe details could be found in general response point 4.\n\n\n[1] Lan, Lei, et al. \"Affine body dynamics: Fast, stable & intersection-free simulation of stiff materials.\" arXiv preprint arXiv:2201.10022 (2022).\n\n*We sincerely appreciate your comments. Please feel free to let us know if you have further questions.*\n\nBest,\nAuthors"
                    }
                },
                "number": 14,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6426/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700324442243,
                "cdate": 1700324442243,
                "tmdate": 1700324442243,
                "mdate": 1700324442243,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "ot8dSXsBbh",
                "forum": "KsUh8MMFKQ",
                "replyto": "gbpM5kduc6",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6426/Reviewer_k5Lf"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6426/Reviewer_k5Lf"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for the clarification and it has answered my questions resolved my concerns. I will keep the accept recommendation."
                    }
                },
                "number": 24,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6426/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700598952251,
                "cdate": 1700598952251,
                "tmdate": 1700598952251,
                "mdate": 1700598952251,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "4ewyeC2z65",
            "forum": "KsUh8MMFKQ",
            "replyto": "KsUh8MMFKQ",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6426/Reviewer_BtTD"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6426/Reviewer_BtTD"
            ],
            "content": {
                "summary": {
                    "value": "This study focuses on teaching robots to manipulate a variety of thin-shell materials. It includes the introduction of ThinShellLab, a fully differentiable simulation platform that is specifically designed for robotic interactions with an array of thin-shell materials. The researchers conduct numerous experiments using reinforcement learning (RL) algorithms, in conjunction with sampling-based, gradient-based, and hybrid trajectory optimization methods, across 10 different thin-shell manipulation tasks."
                },
                "soundness": {
                    "value": "4 excellent"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "4 excellent"
                },
                "strengths": {
                    "value": "1. The ThinShellLab is unique, standing as the first simulator of its kind to support a diverse range of thin-shell materials while also maintaining differentiability.\n\n2. Unlike existing simulators, it has the capability to support Bending Plasticity.\n\n3. This innovative simulator offers a benchmark for understanding prevalent methods associated with thin-shell objects, accommodating various types of approaches such as RL, and trajectory optimization."
                },
                "weaknesses": {
                    "value": "1. The overall presentation is good. However, there could be improvements in clearly labeling the three system identification inverse tasks - Sliding, Bouncing, and Card - in both Table 2 and Figure 3. Their current placement together without clear labels within the table or graph is confusing. \n\n2. Furthermore, it would enhance the paper if some clear conclusions were drawn, along with providing some directions or suggestions to guide readers to explore each type of method."
                },
                "questions": {
                    "value": "Interested to know what is the speed of the simulation? Is multiple GPU parallelization supported by the simulation?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission6426/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6426/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6426/Reviewer_BtTD"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6426/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698640262414,
            "cdate": 1698640262414,
            "tmdate": 1699636717213,
            "mdate": 1699636717213,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "wTR2XhZmzU",
                "forum": "KsUh8MMFKQ",
                "replyto": "4ewyeC2z65",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6426/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6426/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer BtTD"
                    },
                    "comment": {
                        "value": "*We appreciate your positive and insightful comments! Below, we address your concerns in detail.*\n\n**1. Labeling inverse tasks**\n\nWe have separate those tasks in tables and figures in our main paper. Thank you for pointing them out!\n\n**2. Conclusion and future directions**\n\nWe draw a conclusion that RL methods are of low data efficiency in most of the times and it would be good to seek a combination of sample-based methods (maybe RL) and gradient based method. More discussions about this are shown in General Response point 7.\n\n### Questions\n\n> **Q1: Interested to know what is the speed of the simulation? Is multiple GPU parallelization supported by the simulation?**\n\nThe speed is approximately 2.74 FPS in a test case. Currently, there are no obstacles preventing us from running parallel environments on different GPUs. However, we haven't pursued this option because the GD method does not derive any benefits from parallelization. More details can be found in General Response point 4.\n\n*We sincerely appreciate your comments. Please feel free to let us know if you have further questions.*\n\nBest,\nAuthors"
                    }
                },
                "number": 13,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6426/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700324336988,
                "cdate": 1700324336988,
                "tmdate": 1700324336988,
                "mdate": 1700324336988,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "32QgZYRv5g",
            "forum": "KsUh8MMFKQ",
            "replyto": "KsUh8MMFKQ",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6426/Reviewer_j6Cr"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6426/Reviewer_j6Cr"
            ],
            "content": {
                "summary": {
                    "value": "The paper shows a comprehensive benchmark framework for thin-shell object manipulation. A simulation environment is provided that expands upon previous work by including bending-stiffness and frictional contact. Since this simulation is differentiable, the authors show how gradient-based optimization can be used to enhance existing gradient-free methods for finding better performing policies for various robotics tasks. Real-world validation is shown on a specific subset of tasks for sim-to-real accuracy."
                },
                "soundness": {
                    "value": "4 excellent"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "4 excellent"
                },
                "strengths": {
                    "value": "A much needed framework for robotic manipulation of general thin-shell objects is proposed by the authors, which will enable the robotics community to tackle more challenging problems in the future. Although the separate parts in the simulation is not a novelty in itself, the whole framework and its validation in benchmarks is a valuable addition to the field. The paper describes the tasks clearly, and the accompanying website is easy to understand and shows the core contributions well. A lot of analysis was provided as well to all the tasks, and on how and why the hybrid optimization method helps in solving the given problems."
                },
                "weaknesses": {
                    "value": "The presentation in the paper does not feel quite as refined as the website, especially the figures, feel like they could use some work. For example, Figure 2 does not have the image bounding boxes align, and within the Sliding subfigure you can see how the edges of the images don't match up. A similar small issue is present in Figure 3 with a typo in \"Separatering\". Unfortunately, most of the presented tasks are dynamic, hence images don't capture them all that well, and hence the animations on the website do a more convincing job on why this particular application case matters.\nAnother point is that a lot of information is pushed to the Appendix, even though it could be beneficial to have in the main text. For example, the description of the hybrid method, which is a quite large engineering contribution of the paper to show working policies, is described on a high-level. A more detailed description would help here, and mentioning how much work it was to tune/balance the gradient-free and gradient-based steps could help the community. Another example is how the real-to-sim system identification is performed, how the disparity between simulation and reality is computed, these details should be included."
                },
                "questions": {
                    "value": "How well does the simulation environment run in practice, is it achieving something close to real-time, or how long does simulation take? When parallelizing the simulations on GPU, does that only benefit CMA-ES and RL, or is GD also gaining some advantage from the parallelized environments?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission6426/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6426/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6426/Reviewer_j6Cr"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6426/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698676337806,
            "cdate": 1698676337806,
            "tmdate": 1699636717093,
            "mdate": 1699636717093,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "NziEFsXJBA",
                "forum": "KsUh8MMFKQ",
                "replyto": "32QgZYRv5g",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6426/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6426/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer j6Cr"
                    },
                    "comment": {
                        "value": "*We appreciate the positive and insightful comments from you! We adress your concerns in details below.*\n\n**1. Typo and figure quality**\n\nThank you for pointing them out, we have made the revisions.\n\n**2. Real-to-sim disparity**\n\nWhile we are using tactile sensor and force feedbacks as observations in the real-world, we compute the disparity by the L2 loss between the simulated tactile markers (projected into 2D images given the camera parameters) and the images collected in real-world, and by the L2 loss between the simulated forces and the real-world force feedbacks. The loss of several experiments and 2D images of markers are ploted in the appendix.\n\n**3. Hybrid method details**\n\nThis information has been incorporated into General Responses point 5. In essence, we apply a fixed proportion to the steps of CMA-ES and GD in the hybrid method. Additionally, we introduce specific constraints to shape the behavior and enhance the learning process of CMA-ES.\n\n### Questions\n\n> **Q1: How well does the simulation environment run in practice, is it achieving something close to real-time, or how long does simulation take?**\n\nWe test the speed under a specific setting, and it's 2.74 FPS for forward simulation. Details are included in General Response point 4.\n\n> **Q2: When parallelizing the simulations on GPU, does that only benefit CMA-ES and RL, or is GD also gaining some advantage from the parallelized environments?**\n\nThe feature of massive parallelism provided by Taichi is designed to parallelize the computing process within a single environment, resulting in faster speeds. Consequently, all algorithms benefit from this improvement.\n\nIt's worth noting that it's also possible to run multiple environments on different GPUs, which provides advantages for CMA-ES and RL (while GD does not gain advantages from this feature). In our testing, we ensure a fair comparison by using a single GPU to run a single experiment.\n\n*We additional explanations have convinced you of the merits of our work. Please do not hesitate to contact us if you have other concerns.*\n\n*We appreciate your time! Thank you so much!*\n\nBest,\nAuthors"
                    }
                },
                "number": 12,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6426/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700324196533,
                "cdate": 1700324196533,
                "tmdate": 1700324196533,
                "mdate": 1700324196533,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "Uep9a8T6lu",
                "forum": "KsUh8MMFKQ",
                "replyto": "32QgZYRv5g",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6426/Reviewer_j6Cr"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6426/Reviewer_j6Cr"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for the extensive replies to all the reviewers, and for grouping the concerns into specific categories. Excellent clarification of the solver that was implemented. The detailed runtimes now make the usability very clear for practical users of the framework. Thank you to the authors for the extra time on the rebuttal!"
                    }
                },
                "number": 23,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6426/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700598632942,
                "cdate": 1700598632942,
                "tmdate": 1700598632942,
                "mdate": 1700598632942,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "JcwMZ7MmTM",
            "forum": "KsUh8MMFKQ",
            "replyto": "KsUh8MMFKQ",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6426/Reviewer_3BVm"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6426/Reviewer_3BVm"
            ],
            "content": {
                "summary": {
                    "value": "The paper introduces ThinShellLab, a differentiable simulation platform tailored for robotic interactions with diverse thin-shell materials possessing varying material properties, enabling flexible thin-shell manipulation skill learning and evaluation. The experiments highlight unique challenges in thin-shell manipulation, such as reliance on frictional forces, sensitivity to minimal variations in interactions, and frequent contact pair changes. The authors also study a hybrid optimization scheme that combines sampling-based trajectory optimization and gradient-based optimization. They also showcase the proposed simulation platform allows for a smooth transition from simulation to real-world robot deployment."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "1. The proposed simulator can model diverse thin-shell materials with a wide range of bending-stiffness and bending plasticity, as well as frictional contact between thin-shell materials and end-effectors, which is hardly modeled in prior benchmarks."
                },
                "weaknesses": {
                    "value": "1. The writing is not clear enough. Please see the *Questions* section for details.\n2. Figure 2 can be improved. The images are not well aligned. There is not a clear boundary between \"left\" and \"right\" mentioned in the caption, which makes it hard to distinguish 7 manipulation tasks and 3 inverse design tasks.\n3. It is better to have some success indicators for tasks in the benchmark. Otherwise, it is hard for readers to understand difference in performance between methods, if only rewards are provided (e.g., Table 2).\n\nMinor typo: In B.1, the table is linked to the section B.1 instead of Table 3."
                },
                "questions": {
                    "value": "1. In Sec 4.1, it seems that the observation includes a set of points. Does the order of points matter? How do the learning algorithms (SAC, PPO) used in the paper handle the observation if the input observations (points) are unordered?\n2. In Sec 4.1, does the 6DoF stand for the pose change in SE(3), and does the 7DoF include one more DoF for gripper closeness (mimic behaviors for two finger tips)?\n3. In Sec 5.1, the authors mentioned that they reported \"the maximum scores achieved within a specified number of timesteps\". Does it mean that the benchmark currently focuses on \"optimization\" rather than \"generalization\"? Besides, how do the authors count \"timesteps\" for CMA-ES and GD methods?\n4. What's the meaning of \"episode\" (x-axis) for GD and CMA-ES in Figure 3?\n5. In Sec 5.2, for \"our gradient-based method converges these parameters towards a uniform outcome.\", do the authors mean that the method converges to similar solutions despite different initialization?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission6426/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6426/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6426/Reviewer_3BVm"
                    ]
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6426/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698917122146,
            "cdate": 1698917122146,
            "tmdate": 1700503789069,
            "mdate": 1700503789069,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "tGPfuOCCP4",
                "forum": "KsUh8MMFKQ",
                "replyto": "JcwMZ7MmTM",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6426/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6426/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer 3BVm"
                    },
                    "comment": {
                        "value": "*We appreciate the positive and constructive comments from you! We have modified our paper according to your comments.*\n\n**Success Indicators**\nWhile we design continuous rewards without a distinct boundary between success and failure and primarily assess the success of a policy through visualization, we also present scores for human-designed policies, theoretical analyses, and success indicators in General Responses point 6.\n\n### Questions\n\n> **Q1: In Sec 4.1, it seems that the observation includes a set of points. Does the order of points matter? How do the learning algorithms (SAC, PPO) used in the paper handle the observation if the input observations (points) are unordered?**\n\nThe order of points matters in the observation. As we uniformly sample points in the full state, the sequence of selected nodal points remains constant within a given task.\n\n> **Q2: In Sec 4.1, does the 6DoF stand for the pose change in SE(3), and does the 7DoF include one more DoF for gripper closeness (mimic behaviors for two finger tips)?**\n\nYes, the 6DoF stand for the pose change in SE(3) (x, y, z, roll, pitch, yaw), and the 7DoF include one more DoF for gripper closeness.\n\n> **Q3: In Sec 5.1, the authors mentioned that they reported \"the maximum scores achieved within a specified number of timesteps\". How do the authors count \"timesteps\" for CMA-ES and GD methods?\nWhat's the meaning of \"episode\" (x-axis) for GD and CMA-ES in Figure 3?**\n\n**The \"episode\" means a rollout which is a full sequence of actions from the initial state to a final state.** \n\nThe \"timesteps\" here has the same meaning of the previous \"episode\". As a result, we can simply count the number of full action sequences executed in GD, CMA-ES, and RL to count the episode. We will change them into a uniform one to avoid confusing. Thank you for pointing it out.\n\n\n> **Q4: Does it mean that the benchmark currently focuses on \"optimization\" rather than \"generalization\"?**\n\nThe experiment setting we currently test on indeed focuses on \"optimization\" rather than \"generalization\". \n\nHowever, we still want to share vision about how to address generalization in General Response point 7. Concretely, we can switch the initial state and parameters in one task and evaluate close-loop policies. Another way is to use open-loop method to collect successful trajectories under different initial state, parameters or even different tasks, then we can use imitation learning with those data to obtain a generalist policy.\n\n> **Q5: In Sec 5.2, for \"our gradient-based method converges these parameters towards a uniform outcome.\", do the authors mean that the method converges to similar solutions despite different initialization?**\n\nYes. While the **Card** still have a respectively large standard deviation in the end, it is clearly shown in **Sliding** that they converges to similar solutions. \n\n\n*Please let us know if you have any further questions for our paper. We really appreciate your time! Thank you!*\n\nBest,\nAuthors"
                    }
                },
                "number": 11,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6426/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700324070499,
                "cdate": 1700324070499,
                "tmdate": 1700324070499,
                "mdate": 1700324070499,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "zMnxdrkWK0",
                "forum": "KsUh8MMFKQ",
                "replyto": "tGPfuOCCP4",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6426/Reviewer_3BVm"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6426/Reviewer_3BVm"
                ],
                "content": {
                    "comment": {
                        "value": "Thank the authors for the detailed response. It resolves my concern, and I will increase my rating."
                    }
                },
                "number": 16,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6426/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700503861069,
                "cdate": 1700503861069,
                "tmdate": 1700503861069,
                "mdate": 1700503861069,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "SZQ8HmKXnI",
            "forum": "KsUh8MMFKQ",
            "replyto": "KsUh8MMFKQ",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6426/Reviewer_Vd5A"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6426/Reviewer_Vd5A"
            ],
            "content": {
                "summary": {
                    "value": "The paper introduces a differentiable simulator designed to handle thin shell materials such as sheets of paper and cloth to explore manipulation of such objects. To this end a set of tasks are defined to challenge various methods. Finally, an approach to tackle the proposed tasks using combining sampling and optimization is proposed."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "- Development of a simulator for specific kind of object geometries\n- Definition of a set of tasks to challenge manipulation methods on thin objects\n- Overall easy to understand and follow"
                },
                "weaknesses": {
                    "value": "The idea of the paper are clear and the writing is easy to follow. Some of that, however, stems from a lack of detail regarding the simulator and the tasks. The description of the simulator, one of the core contributions, is barely a page long and mostly covers high-level concepts, physical quantities being modeled, and methods used to implement the simulator. I would have expected to see greater detail about this as currently it's hard to assess if this is a straight forward task of writing up a few equations or involved required complex derivations and developments. What also would be good is a discussion regarding the chosen way of modeling thin objects, as the approach selected is likely not the only one and a discussion of the pros and cons of modeling the interactions one way or another would be a valuable contribution.\n\nAnother aspect where more detail would be expected are the task descriptions. The tasks are easy to understand at a high level. However, their actual definition is omitted which makes it unclear what objective the various methods are required to optimize for later on. As there are many ways to formulate the described tasks it is important to have this information present.\n\nOne aspect of the experiments that could be improved is conveying what the goal is. The only information is that the goal is to evaluate the performance and behavior of the simulator and methods. Being more concrete and actually laying out the things to be investigated would improve the readability of the entire section.\n\nThe presentation of the results is at times incomplete. For example, Table 2 shows numbers with +/- values but there is no mention of what those values are. One can assume that it is mean +/- standard deviation, however, this should be stated clearly. In that table there is also a single row which has no +/- values, why? There are also various cells in the table that are lacking values, which is not explained. The results list score values for each of the tasks, but without knowing level of \"success\" these scores correspond to it is impossible to know whether the differences in scores are significant or not.\n\nThe presentation of the real-world experiments does not convey any information and fails to provide information. This section should either be improved to add actual experimental data, as opposed to referring the reader to an appendix with a handful of plots, and provide a discussion.\n\nThe paper describes a hybrid approach, though details are extremely limited. Due to the lack of detail of that approach and the focus being about the simulator, it is unclear why this was added nor that it adds anything. The idea of combining global search with local refinement is sensible. However, I would expect this to be common knowledge in the RL community given the (by default) unguided nature of RL exploration and the fact that RL tends to perform well once it finds a solution to a problem. There are also odd behaviors of the hybrid method that are not discussed. In some of the curves shown in Figure 3 the variance in the scores are excessively large, why does this occur?\n\nAnother question that should be addressed is the benchmark aspect. The paper states that the goal is for this to be used as a benchmark. Is the idea to use this similar to gym and atari game setups, or more like the benchmarks used in the computer vision community with tasks on withheld data to counteract overfitting on a set of tasks?\n\nThe core aspects of the paper, i.e. the simulator and task descriptions, are good yet could benefit from additional detail. The experiments are ok, though need to be improved to more clearly convey their information."
                },
                "questions": {
                    "value": "- What solution quality / success rate do the various rewards correspond to?\n- How fast does the simulator run, is it real-time, faster, slower?\n- What is the limit of object complexity that can be simulated?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission6426/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6426/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6426/Reviewer_Vd5A"
                    ]
                }
            },
            "number": 5,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6426/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699214588554,
            "cdate": 1699214588554,
            "tmdate": 1701059801538,
            "mdate": 1701059801538,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "SG5GLqoObw",
                "forum": "KsUh8MMFKQ",
                "replyto": "SZQ8HmKXnI",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6426/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6426/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer Vd5A"
                    },
                    "comment": {
                        "value": "*Thank you for your insightful and constructive comments! We have added additional experiments and modified our paper according to your comments.*\n\n**1.Simulation details**\n\nThis is addressed in General Response point 3. The detailed equations are too extensive to include in the main paper.\n\n**2.What is the level of success for each task**\n\nAs demonstrated in the General Response point 6, we integrate the theoretically highest scores with human-intuitive policies to derive the success score for each task. The success rate is then computed based on the mean and standard deviation for the CMA-ES + GD method.\n\n**3.Actual definition of task objective**\nAlthough we have detailed the reward function in Appendix B.2, we provide the exact formulas of the reward functions for further clarification.\n\n**Lifting**: Let $B$ be the set of vertex positions on the block and $B^T$ be the target vertex positions, and $B[i]$ be the $i_{th}$ vertex in $B$.\n$reward=-\\sum_{i}\\{(B[i].x - B^T[i].x)^2 + (B[i].y - B^T[i].y)^2 + (B[i].z - B^T[i].z)^2\\}$\n\n**Separating**: Let $B$ be the set of vertex positions on the block and $C$ be the set of vertex positions on the paper. Since there are $256$ vertices in the shell and $144$ vertices in the block, we multiply the sume of block vertices with $256 / 144$.\n$reward=256 / 144 * \\sum_{i}B[i].x - \\sum_{i}C[i].x$\n\n**Following**: $reward=-\\sum_{i}B[i].x$\n\n**Folding-U**: Let U be the set of rest angle (angle at rest position) on the upper crease and L be the set of rest angle on the lower crease.\n$reward=\\sum_{i}U[i] - \\sum_{i}L[i]$\n\n**Folding-L**: $reward=-\\sum_{i}U[i] + \\sum_{i}L[i]$\n\n**Pick-Folding**: Let M be the set of rest angle (angle at rest position) on the middle of the paper.\n$reward=\\sum_{i}M[i]$\n\n**Forming**: Let $S$ be the set of vertex positions on the shell and $S^T$ is the target vertex positions, and $S[i]$ be the $i_{th}$ vertex in $S$.\n$reward=-\\sum_{i}\\{(S[i].x - S^T[i].x)^2 + (S[i].y - S^T[i].y)^2 + (S[i].z - S^T[i].z)^2\\}$\n\n**Sliding**: Let $S$ be the set of vertex positions on the bottom shell.\n$reward=-\\sum_{i}S[i].x$\n\n**Bouncing**: Let $S$ be the set of vertex positions on the shell.\n$reward=\\sum_{i}S[i].z$\n\n**Card**: Let $C$ be the set of vertex positions on the card.\n$reward=-\\sum_{i}C[i].x$\n\n**4.The presentation of the results**\n\nThe symbol $\\pm$ in the table denotes the standard deviation resulting from multiple runs. Notably, the GD method exhibits no standard deviation as it lacks randomness in its multiple executions. In the context of inverse design tasks, the optimization is solely focused on the parameters. Consequently, we evaluate a distinct set of methods for these tasks, which explains the absence of certain rows in the table.\n\nWe will ensure to articulate these details more explicitly in the main paper. Thank you for bringing this to our attention.\n\n**5.Conveying the goal**\n\nOur goal of the experiment section is to delve into task behavior to highlight the inherent challenges, and analyze the strengths and limitations of various methods in addressing these challenges. This analysis serves as  the groundwork for the future development of innovative algorithms for thin-shell manipulation tasks. \nWe've add this to our main paper, thank you for metioning it.\n\n**6.Real world experiment**\n\n* **[Real-to-sim system identification]** We have introduced more detailed experimental results for the real-to-sim system identification tasks [Appendix C]. These results are analyzed through the observation of the 2D marker pose differences, presented qualitatively, and the loss curve, presented quantitatively. Although tactile simulation is not the primary focus of this paper, we argue that it demonstrates satisfactory alignment with the real world.\nWe have encountered challenges in accurately retrieving small-scale bending stiffness from the real world using tactile sensors. This difficulty arises from the sensitivity of results to the Poisson ratio of the tactile material. We deem that a better way to estimate small-scale bending stiffness is to first use vision method to obtain it's state and subsequently estimating it using the balance between gravitational and bending forces.\n\n* **[Sim-to-real manipulation tasks]** In the real-world execution of the **Separating** task, our paper discusses that the bending stiffness of the thin shell significantly influences the final policy. Successfully deploying this policy to the real world serves as evidence of our effective approximation of the bending stiffness of the card paper.\nWe have also incorporated additional real-world manipulation results. In the **Folding** task, we employ a rigid manipulator with 3 Degrees of Freedom (DoFs) and train a new policy in the simulator, which is subsequently deployed into the real world. The outcome illustrates our success in capturing the dynamics of the paper and accomplishing the task in the real-world setting."
                    }
                },
                "number": 9,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6426/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700323861209,
                "cdate": 1700323861209,
                "tmdate": 1700359891532,
                "mdate": 1700359891532,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "8RH41cI7Lm",
                "forum": "KsUh8MMFKQ",
                "replyto": "SZQ8HmKXnI",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6426/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6426/Authors"
                ],
                "content": {
                    "title": {
                        "value": "part 2"
                    },
                    "comment": {
                        "value": "**7.Hybrid method**\nIn this work, we focus more on how to utilize the gradient in simulation to train an open-loop policy within limited time. While RL policy can generalize better to unseen state, open-loop methods employing differentiable physics prove to be more data-efficient. CMA-ES, GD, and our hybrid method all operate as open-loop trajectory optimization approaches. The concept of combining CMA-ES and GD with differentiable physics is proposed to alleviate the issue of local minima associated with the GD method in scenarios characterized by rich contact interactions, while design of RL policy considers no physics properties.\nMore details of this hybrid method is shown in the general response.\n\n### Questions\n\n> **Q1: The paper states that the goal is for this to be used as a benchmark. Is the idea to use this similar to gym and atari game setups, or more like the benchmarks used in the computer vision community with tasks on withheld data to counteract overfitting on a set of tasks?**\n\nIt is similar to gym and atari game setups, where users can generate their own data and build their own experiment.\n\n> **Q2: What solution quality / success rate do the various rewards correspond to?**\n\nAs outlined in General Response point 6, we have established a set of scores to signify success in our benchmark. It is crucial to note, however, that we consider these tasks to be continuous rather than discrete. Our primary method of assessing success revolves around visualizations, and the success indicators are primarily employed for comparative purposes.\n\n> **Q3: How fast does the simulator run, is it real-time, faster, slower?**\n\nIt's about 2.74 FPS as discussed in the General Response point 4.\n\n> **Q4: What is the limit of object complexity that can be simulated?**\n\nWe employ 3D meshes to simulate objects, enabling the simulation of any object that can be represented using a 3D mesh. It's important to note, however, that simulations may experience decreased speed and increased memory requirements when dealing with objects with a high number of vertices.\n\n*We wish that our response has addressed your concerns, and turns your assessment to the positive side. If you have any more questions, please feel free to let us know during the rebuttal window.*\n\nBest,\nAuthors"
                    }
                },
                "number": 10,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6426/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700323930222,
                "cdate": 1700323930222,
                "tmdate": 1700359903640,
                "mdate": 1700359903640,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "Rfkz0LUhNU",
                "forum": "KsUh8MMFKQ",
                "replyto": "8RH41cI7Lm",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6426/Reviewer_Vd5A"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6426/Reviewer_Vd5A"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for the detailed comments and additional information provided, it definitely improved my view of the paper. While it might be hard to fit all the additional detail into the main text of the paper I would to see some of these at least alluded to with more detail being provided in the appendix."
                    }
                },
                "number": 17,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6426/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700536862596,
                "cdate": 1700536862596,
                "tmdate": 1700536862596,
                "mdate": 1700536862596,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "UfNKnmrT49",
                "forum": "KsUh8MMFKQ",
                "replyto": "SZQ8HmKXnI",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6426/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6426/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Supplementary Simulation Details"
                    },
                    "comment": {
                        "value": "We provide additional details about the implementation of our simulation, specifically addressing the process and methods we used to compute the derivatives and Hessian matrix to address your concerns.\n\n**1. Contact Energy**\nAccording to Section 3.2, the contact energies $U_r$ and $U_f$ are defined as\n$$\nU_r(d)=\\frac{k_r}2\\max(d-\\epsilon_r, 0)^2,U_f(\\mathbf u)=\\mu\\lambda f_0(\\epsilon_v,\\|\\mathbf u\\|),\n$$\n\nwhere the distance $d$ is a signed distance between vertex $\\mathbf p$ and its projection to a triangle $(\\mathbf p_1,\\mathbf p_2,\\mathbf p_3)$, whose normal direction is represented by $(\\mathbf p_2-\\mathbf p_1)\\times(\\mathbf p_3-\\mathbf p_1)$. $k_r$ stands for a constant stiffness parameter, $\\mu$ stands for a friction coefficient, and $\\lambda$ stands for the contact force along normal direction at last timestep. The signed distance $d$ is then calculated as\n$$\n\\begin{aligned}\nd=\\frac{(\\mathbf p-\\mathbf p_1)\\cdot[(\\mathbf p_2-\\mathbf p_1)\\times(\\mathbf p_3-\\mathbf p_1)]}{\\|(\\mathbf p_2-\\mathbf p_1)\\times(\\mathbf p_3-\\mathbf p_1)\\|}\\\\\n=\\frac{(\\mathbf p-\\mathbf p_1)\\cdot\\det\n[\\mathbf p_2-\\mathbf p_1,\\mathbf p_3-\\mathbf p_1,(\\hat{\\mathbf x},\\hat{\\mathbf y},\\hat{\\mathbf z})]}{\\|(\\mathbf p_2-\\mathbf p_1)\\times(\\mathbf p_3-\\mathbf p_1)\\|}\\\\\n=\\frac{\\det[\\mathbf p_2-\\mathbf p_1,\\mathbf p_3-\\mathbf p_1,\\mathbf p-\\mathbf p_1]\n}{\\|(\\mathbf p_2-\\mathbf p_1)\\times(\\mathbf p_3-\\mathbf p_1)\\|},\n\\end{aligned}\n$$\n\nin which the 3D vertices are represented as column vectors. Let $\\mathbf x=[\\mathbf p_1,\\mathbf p_2,\\mathbf p_3,\\mathbf p]\\in\\mathbb R^{12}$ denote the involved variables, we implemented tool functions in Taichi to calculate\n$$\n\\begin{aligned}\nD(\\mathbf x)&=\\det[\\mathbf p_2-\\mathbf p_1,\\mathbf p_3-\\mathbf p_1,\\mathbf p-\\mathbf p_1]\n,\\\\\nC(\\mathbf x)=\\|(\\mathbf p_2-\\mathbf p_1)\\times(\\mathbf p_3-\\mathbf p_1)\\|,\n\\end{aligned}\n$$\n\ntogether with the gradients $\\partial D/\\partial\\mathbf x,\\partial C/\\partial\\mathbf x$ and Heissan matrices $\\partial^2 D/\\partial \\mathbf x^2,\\partial^2 C/\\partial\\mathbf x^2$. With the help of SymPy library for symbolic computation, we optimized the computation graph and hard coded it into Taichi snippets. The repulsive energy $U_r$ is then a composition function on $D(\\mathbf x),C(\\mathbf x)$, and therefore we use the chain rule to calculate its gradient and Hessian matrix.\n\nFor the friction energy $U_f(\\mathbf u)$, we follow IPC [1] to calculate the $f_0(\\epsilon_v,\\|\\mathbf u\\|)$ function, its derivative $f_1(\\epsilon_v,\\|\\mathbf u\\|)$ and second derivative $f_2(\\epsilon_v,\\|\\mathbf u\\|)$. Once we get the $\\partial U_f/\\partial \\|\\mathbf u\\|$ and $\\partial^2 U_f/\\partial \\|\\mathbf u\\|^2$, we transform it back to the tangential space to get $\\partial U_f/\\partial\\mathbf u$ and $\\partial^2U_f/\\partial\\mathbf u^2$.\n\n**2. Elastic Energy**\n\nWe follow Stable Neo-Hookean [2] to define the elastic energy as\n$$\nU_e(\\mathbf F)=\\frac{\\mu}{2}(I_C-3)-\\mu(J-1)+\\frac\\lambda2(J-1)^2,\n$$\nin which $\\mathbf F$ denote the deformation gradient of one tetrahedral element, $I_C=\\text{tr}(\\mathbf F^T\\mathbf F)$ and $J=\\det \\mathbf F$. The motivation of replacing the original $\\log J$ term in original Neo-Hookean model to $J-1$ is that $J-1$ is stable even for $J\\le0$. Therefore, even if the whole tetrahedral element is inverted, this Stable Neo-Hookean model still works robustly and can provide gradients & Hessian matrices to recover the element (See the original paper of Stable Neo-Hookean [2]). This situation is common in our simulator, since the robot manipulator involves a moving boundary and can easily cause invertion when the moving speed is large. We observe that Stable Neo-Hookean perfectly addresses this problem.\n\nThe gradient $\\partial U_e/\\partial \\mathbf F$ can be computed easily. To compute the Hessian matrix $\\partial ^2U_e/\\partial\\mathbf F^2$, we first enumerate the differential $\\delta F_{ij}$ for single entry and then calculate the correponding force differential $\\delta(\\partial U_e/\\partial\\mathbf F)$. We follow a well-known tutorial on FEM [3] to calculate the force differentials, and then concatenate them into the Hessian matrix $\\partial^2 U_e/\\partial \\mathbf F^2$."
                    }
                },
                "number": 18,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6426/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700537144889,
                "cdate": 1700537144889,
                "tmdate": 1700537144889,
                "mdate": 1700537144889,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "x3QPUDCMph",
                "forum": "KsUh8MMFKQ",
                "replyto": "SZQ8HmKXnI",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6426/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6426/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Supplementary Simulation Details Part 2"
                    },
                    "comment": {
                        "value": "**3. Thin-Shell Energy**\n\nFollowing [4], we apply the stretching energy $U_s$ and the bending energy $U_b$ for thin-shell materials. We further divide the stretching energy into $U_s^e$ and $U_s^a$, representing stretching energy for edges and areas of triangles. The energy formula is as follows:\n$$\n\\begin{aligned}\nU_s^e=\\sum_{e}K_e(1-|e|/|\\overline{e}|)^2|\\overline{e}|,\nU_s^a=\\sum_{A}K_a(1-|A|/|\\overline{A}|)^2|\\overline{A}|,\nU_b=\\sum_{e}K_b(\\theta_e-\\overline{\\theta_e})^2|\\overline{e}|/|\\overline{h_e}|,\n\\end{aligned}\n$$\nwhere $e$ represents all the edges, $A$ represents all the triangles, and $\\theta_e$ represents the angle on edge $e$. $|\\overline{e}|$, $|\\overline{A}|$, $|\\overline{h_e}|$, and $\\overline{\\theta_e}$ respectively represent the rest length of the edge, the rest area for the triangle, one-third of the average height of the two adjacent triangles of the edge, and the rest angle on this edge. $K_e$, $K_a$, and $K_b$ are the coefficients.\n\nFor $U_s^e$, it's simple to calculate the derivatives and Hessian matrix. The derivative of the length $|e|$ to the nodal point positions $x_0$ and $x_1$ is $\\frac{\\partial |e|}{\\partial x_0}=(x_0 - x_1)/|e|$. The Hessian matrix will require the calculation of $\\frac{\\partial^2 |e|}{\\partial a_0^2}$ and $\\frac{\\partial^2 |e|}{\\partial a_0 \\partial b_0}$ due to symmetry, where $x_0=(a_0,b_0,c_0)$.\n\nFor $U_s^a$, it becomes more complex to compute the derivatives and Hessian matrix. Assume the triangle is $(x_0, x_1, x_2)$ and $x_0=(a_0, b_0, c_0)$. Similar to the calculation of the contact energy, we use math tools to generate the symbolic formula of the derivative $\\frac{\\partial |A|}{\\partial a_0}$ and hard code it with Taichi; then, we can calculate all the derivatives due to symmetry. For the Hessian matrix, we use math tools to generate formulas for $\\frac{\\partial^2 |A|}{\\partial a_0^2}$, $\\frac{\\partial^2 |A|}{\\partial a_0 \\partial a_1}$, $\\frac{\\partial^2 |A|}{\\partial a_0 \\partial b_0}$, $\\frac{\\partial^2 |A|}{\\partial a_0 \\partial b_1}$; then, we can calculate the full matrix using symmetry.\n\nFor $U_b$, the Hessian matrix is too complex to compute, even when we try to use some math tools. As a result, we follow [5] to compute the derivatives and Hessian matrix for bending energy. This paper discusses how to compute the Hessian matrix of bending energy in a simplified form."
                    }
                },
                "number": 19,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6426/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700537242487,
                "cdate": 1700537242487,
                "tmdate": 1700537242487,
                "mdate": 1700537242487,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "WCceqDsnIo",
                "forum": "KsUh8MMFKQ",
                "replyto": "SZQ8HmKXnI",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6426/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6426/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Supplementary Simulation Details Part 3"
                    },
                    "comment": {
                        "value": "**4. Back-Propagation**\n\nThis part has been briefly discussed in Appendix A.2. The equation to be solved in forward simulation is \n$$\n\\mathbf 0=\\nabla \\mathbf g(\\mathbf x) = \\frac 1{2h^2}\\mathbf M(\\mathbf x - 2 \\mathbf x^{t} + \\mathbf x^{t-1} - h^2\\mathbf M^{-1}\\mathbf f_{ext}) - \\mathbf f_{int}(\\mathbf x, \\mathbf x_{fixed}^t, \\mathbf x^t, \\overline{\\mathbf \\theta}^t,\\mathbf \\eta), (1)\n$$\nwhere $\\mathbf x^t$ and $\\mathbf x^{t-1}$ are node positions of $t_{th}$ and $(t-1)_{th}$ timestep, \n\n$\\overline{\\mathbf \\theta}^t$ are undeformed angles for $t_{th}$ timestep, \n$\\mathbf x_{fixed}^t$ are positions of fixed nodes in the beginning of $(t+1)_{th}$ timestep, \n\nand $\\mathbf\\eta$ is the material parameters.\nHere, $\\overline{\\mathbf \\theta}^t$ is actually a function of $\\mathbf x^{t}$ and $\\overline{\\mathbf \\theta}^{t - 1}$, and the friction force is a function of $\\mathbf x_{i}$ and $\\mathbf x_{i - 1}$. DiffPD [6] discusses the general idea of how to pass gradient in the implicit time integration:\n\n$$\n\\frac{\\partial \\nabla \\mathbf g(\\mathbf x)}{\\partial \\mathbf x}\\frac{\\partial \\mathbf x}{\\partial \\mathbf y} + \\frac{\\partial \\nabla \\mathbf g(\\mathbf x)}{\\partial \\mathbf y} = \\frac{\\partial }{\\partial \\mathbf y}\\mathbf 0\n$$\n$$\n\\frac{\\partial }{\\partial \\mathbf x}[\\frac{1}{h^2}\\mathbf M(\\mathbf x-\\mathbf y)+\\nabla \\mathbf E(\\mathbf x)]\\frac{\\partial \\mathbf x}{\\partial \\mathbf y} + \\frac{\\partial }{\\partial \\mathbf y}[\\frac{1}{h^2}\\mathbf M(\\mathbf x-\\mathbf y)] = 0\n$$\n$$\n[\\frac{1}{h^2}\\mathbf M + \\nabla^2 \\mathbf E(\\mathbf x) ]\\frac{\\partial \\mathbf x}{\\partial \\mathbf y} - \\frac{1}{h^2}\\mathbf M = 0\n$$\n$$\n\\frac{\\partial \\mathbf x}{\\partial \\mathbf y} = \\frac{1}{h^2}[\\nabla^2 \\mathbf g(x)]^{-1}\\mathbf M\n$$\nWith $\\frac{\\partial \\mathbf x}{\\partial \\mathbf y}$ in hand, we can backpropagate the gradient from $x^{t+1}$ to $y^t$. Given $y^t=2x^t-x^{t-1}+h^2M^{-1}f_{ext}$, we can deliver the gradient to both $x^t$ and $x^{t-1}$.\n\nSimilarly, by substituting $y$ in the above equation with other variables like $\\mathbf x_{fixed}^t$ or $\\overline{\\mathbf \\theta}^t$, we can calculate the gradient. The remaining challenge is computing the term $\\frac{\\partial \\nabla \\mathbf g(\\mathbf x)}{\\partial \\mathbf y}$ in the first line when changing $y$ into other variables. For these variables, this term will involve the Jacobian matrix for the force, as shown in Equation (1).\n\nFor $\\overline{\\mathbf \\theta}^t$ and $\\mathbf\\eta$, their relationship to the forces is linear, allowing us to calculate the Jacobians directly. Regarding $\\mathbf x_{fixed}^t$, the Jacobians are computed during forward simulation, where they are set to zeros. We can apply the same procedure in forward simulation and retain the Jacobians during the backpropagation process.\n\nConcerning $\\mathbf x^t$, it primarily influences the friction force since we utilize the pressure force, contact surface, and the original projected point from the last timestep. We observe that [7] calculates the derivative for friction similarly to our approach. The distinction lies in our choice not to pass the gradient through the surface change during backpropagation\n\n*Again, thank you for your insightful and constructive comments!*\n\n[1] Li, Minchen, et al. \"Incremental potential contact: intersection-and inversion-free, large-deformation dynamics.\" ACM Trans. Graph. 39.4 (2020): 49.\n\n[2] Smith, Breannan, Fernando De Goes, and Theodore Kim. \"Stable neo-hookean flesh simulation.\" ACM Transactions on Graphics (TOG) 37.2 (2018): 1-15.\n\n[3] Eftychios Sifakis and Jernej Barbic. Fem simulation of 3D deformable solids: A practitioner’s guide to theory, discretization and model reduction. ACM SIGGRAPH 2012 Courses, 2012. 4\n\n[4] Grinspun, Eitan, et al. \"Discrete shells.\" Proceedings of the 2003 ACM SIGGRAPH/Eurographics symposium on Computer animation. 2003.\n\n[5] Tamstorf, Rasmus, and Eitan Grinspun. \"Discrete bending forces and their Jacobians.\" Graphical models 75.6 (2013): 362-370.\n\n[6] Du, Tao, et al. \"Diffpd: Differentiable projective dynamics.\" ACM Transactions on Graphics (TOG) 41.2 (2021): 1-21.\n\n[7] Huang, Zizhou, et al. \"Differentiable solver for time-dependent deformation problems with contact.\" arXiv preprint arXiv:2205.13643 (2022)."
                    }
                },
                "number": 20,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6426/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700537938819,
                "cdate": 1700537938819,
                "tmdate": 1700537938819,
                "mdate": 1700537938819,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]