[
    {
        "title": "Topology-Informed Graph Transformer"
    },
    {
        "review": {
            "id": "eHLwRPOOq0",
            "forum": "lYy9zPOxXS",
            "replyto": "lYy9zPOxXS",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission3132/Reviewer_Cu2Y"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission3132/Reviewer_Cu2Y"
            ],
            "content": {
                "summary": {
                    "value": "Current graph transformers lack the ability to distinguish isomorphisms of graphs, thus affecting the predictive performance of the methods. To address this problem, this paper proposes Topology-Informed Graph Transformer (TIGT). TIGT contains four components: a topological positional embedding layer, a dual-path message-passing layer, a global attention mechanism, and a graph information layer. Also, a mathematical analysis of the discriminatory ability of TIGT is given in this paper."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "1 poor"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1.This paper is well structured.\n2.In this paper, experiments are conducted on several datasets and a rich theoretical proof is given."
                },
                "weaknesses": {
                    "value": "1.Lack of review of related work and comparison of TIGT with other work.\n2.A graph is vertex-biconnected if it is connected and does not have any cut vertex. The definition of vertex biconnected in this paper is wrong.\n3.The case used in Appendix A.2 for the proof of Theorem 3.2 is too particularized, so that the generalization of the theory and the proof cannot be guaranteed.\n4.Missing ablation of the component “global attention layer” in ablation study.\n5.The performance improvement of TIGT is not significant and in many cases it is not as good as GRIT."
                },
                "questions": {
                    "value": "1.Can you describe the main innovations of your method compared to previous graph transformer methods?\n2.The theoretical proof of Theorem 3.1 in Appendix A.1 is highly similar to the reference[1], can you specify the innovation of the theory in this paper?\n3.Are the values shown in Table 1 the F1 value? How are the results obtained for the TIGT achieve 100% with variance 0.0? How are the results obtained for GRIT+RRWP?\n\nReferences:\n[1]Yun Young Choi, Sun Woo Park, Youngho Woo, and U Jin Choi. Cycle to clique (cy2c) graph\nneural network: A sight to see beyond neighborhood aggregation. In The Eleventh International\nConference on Learning Representations, 2023."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission3132/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698140437873,
            "cdate": 1698140437873,
            "tmdate": 1699636260060,
            "mdate": 1699636260060,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "vxXUJsRn0F",
                "forum": "lYy9zPOxXS",
                "replyto": "eHLwRPOOq0",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3132/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3132/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer Cu2Y"
                    },
                    "comment": {
                        "value": "We thank the reviewer for providing helpful comments to our manuscript. Please find our responses to the weaknesses of the manuscript and questions pointed out by the reviewer.\n\n- Weakness 2: We thank the reviewer for pointing out the issue. We added a condition that the graph G is a connected graph. Nevertheless, we would like to note that the given definition of biconnectivity of graphs, assuming G is connected, is correct. The vertex v and edge e of the graph G such that the number of components of G \\ {v} and G \\ {e} is greater than 1 correspond to a cut vertex and a cut edge of the graph G.\n- Weakness 3: Theorem 3.2 shows that there exists a pair of graphs such that TIGT can distinguish whereas 3-WL cannot distinguish. The theorem does not claim that all graphs not distinguishable by 3-WL can be distinguished by TIGT. Hence, the current proof of Theorem 3.2 in the appendix of the manuscript is correct, because it presents a particula pair of graphs that 3-WL cannot distinguish whereas TIGT can.\n- Weakness 1, Question 1:  One prominent novelty of this work comes from obtaining an optimal balance among encapsulating the merits of Cy2C-GNNs in incorporating topological invariants of graph datasets, utilizing the advantages of Graph Transformers in effectively analyzing node and edge features of graph datasets, and sustaining the expressive power of GNNs even under increases in number of hidden layers. Our newly added implementations demonstrate that TIGT successfully implements the optimal balance of the aforementioned three conditions, whereas other GNNS or transformer architectures may not effectively satisfy all three conditions simultaneously.\n- Question 2: The theoretical innovation of the paper focuses on the capability to incorporate cyclic substructures of graphs to graph transformers, and demonstrate how cyclic substructures are related to geometric properties of graphs analyzed from previous studies. We note that Cy2C-GNN does not incorporate cyclic substructure to graph transformers. As such, Theorem 3.1 and 3.2 demonstrates that cyclic substructures can be also incorporated into graph transformer architecture, the proof of which utilizes the theoretical results from Choi et al. (2023). The manuscript also proves new theoretical results which relates cyclic substructures of graphs with previously studied innate properties of graphs (graph biconnectivity), and analyzes limitations of previously studied techniques which utilize positional encoding of graph datasets. In particular, Theorem 3.3 utilizes Euler characteristics of graphs to show that biconnectivity of graphs can be detected from analyzing cyclic substructures of graphs. Theorem 3.4 utilizes geometric ergodicity of Markov chains (i.e. that the rate that a probability distribution converges to a stationary distribution of a Markov chain is comparable to the rate that a geometric sequence converges to a limit) to show potential limitations in attempting to distinguish geometric properties of graphs without directly utilizing the cyclic substructures of graphs.\n- Question 3: The results obtained from Table 1 consist of accuracies in classifying graph datasets from CSL dataset. We note that the standard deviations are obtained from 4 runs of graph classification with different random seeds. The results from Table 1 show that TIGT is able to fully distinguish cyclic graph datasets presented in CSL dataset. For further information on implementation with CSL dataset, we added Table 7 and Appendix C.3 to the newly updated manuscript, along with supplementary submission which contains a configuration file along with sample experimental results. Using the configuration file, one can implement the graph classification using the code provided on GRIT Github repository. (Here, we set the edge and node features to be all equal to 1). Along with GRIT, we also implemented classifying CSL datasets using GAT and Cy2C-GNNs, the results of which can be observed from Table 1. We find that TIGT outperforms all the baseline models in encapsulating cyclic substructures of graphs in CSL datasets."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3132/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700534346935,
                "cdate": 1700534346935,
                "tmdate": 1700534346935,
                "mdate": 1700534346935,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "DBdJnyWVLD",
            "forum": "lYy9zPOxXS",
            "replyto": "lYy9zPOxXS",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission3132/Reviewer_apGs"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission3132/Reviewer_apGs"
            ],
            "content": {
                "summary": {
                    "value": "This paper introduces the Topology-Informed Graph Transformer (TIGT), a novel graph transformer architecture designed to improve the discriminative capability for detecting graph isomorphisms. The TIGT model consists of four key components: a topological positional embedding using cyclic subgraphs of graphs, a dual-path message-passing layer, a global attention mechanism, and a graph information layer. Experimental results on various graph classification tasks illustrate the effectiveness of the proposed method."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "- The writing of this paper is easy to follow.\n- The problem of strengthening the discriminative power of distinguishing isomorphisms of graphs is crucial.\n- This paper conducts extensive experiments."
                },
                "weaknesses": {
                    "value": "- Originality/Novelty: The main theoretical results (Theorem 3.1 and Theorem 3.2) are mainly based on previous work (Choi et al., 2023).\n- The assumptions made in Theorem 3.3, which requires two graphs to have the same number of nodes and edges, and Theorem 3.4, which assumes that all graphs have the same number of nodes with degree $d$, may have limitations in practical applications. \n- It would be valuable if the authors could discuss the presence of cyclic structures in graph datasets and its impact on the proposed architecture's performance, whether it is missing or not.\n- Ablation study: The authors have provided an ablation study for key components of the method. However, the topological positional embedding layer, the main contribution of this paper, appears to have a marginal effect.\n- Although the authors have provided an analysis of the computational complexity for the proposed method, they have not provided empirical results regarding running time compared to baselines. I would suggest the authors also measure the running time of the method and other baselines.\n- Baselines: Some baselines on graph transformer are either missing or not adequately discussed:\n1. Kong, Kezhi, et al. \"GOAT: A Global Transformer on Large-scale Graphs.\" ICML 2023.\n2. Zhang, Zaixi, et al. \"Hierarchical graph transformer with adaptive node sampling.\" NeurIPS 2022."
                },
                "questions": {
                    "value": "See weaknesses above"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission3132/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698695572634,
            "cdate": 1698695572634,
            "tmdate": 1699636259982,
            "mdate": 1699636259982,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "mVSb7MreZs",
                "forum": "lYy9zPOxXS",
                "replyto": "DBdJnyWVLD",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3132/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3132/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer apGs"
                    },
                    "comment": {
                        "value": "We thank the reviewer for pointing out constructive comments which helped us improve the manuscript. Please find our response to the weaknesses of the manuscript pointed out by the reviewer.\n\n- Weakness 1: While we utilized the results from Choi et al. (2023) to prove the theoretical effectiveness in incorporating cyclic structures of graphs, one prominent novelty of this work comes from obtaining an optimal balance among encapsulating the merits of Cy2C-GNNs in incorporating topological invariants of graph datasets, utilizing the advantages of Graph Transformers in effectively analyzing node and edge features of graph datasets, and sustaining the expressive power of GNNs even under increases in number of hidden layers. Our newly added implementations demonstrate that TIGT successfully implements the optimal balance of the aforementioned three conditions. Furthermore, we also added new theoretical results which relates cyclic substructures of graphs with previously studied innate properties of graphs (graph biconnectivity), and analyzes limitations of previously studied techniques which utilize positional encoding of graph datasets.\n- Weakness 2: The conditions on pairs of graphs indicated in Theorems 3.3 and 3.4 correspond to pairs of graphs that conventional GNN may not be able to distinguish as non-isomorphic pairs. In fact, if it is the case that any pairs of two graphs does not satisfy the conditions in Theorems 3.3 and 3.4, then conventional GNNs are able to distinguish two graphs as non-isomorphic. As an example, suppose G and H are two graphs whose number of nodes are different but the number of edges are identical. Then there exists a pair of nodes v of G and w of H such that the degree of v and degree of w are not equal to each other. This implies that the universal covers of G and H are not isomorphic, in particular at the nodes of the universal covers of G and H which, respectively, project to nodes v and w. Theorem 3.3 shows that biconnectivity of graphs can be detected from analyzing cyclic substructures of graphs, and Theorem 3.4 shows potential limitations in attempting to distinguish geometric properties of graphs without directly utilizing the cyclic substructures of graphs.\n- Weakness 3: As the reviewer suggested, in Table 5 of the updated manuscript, we added a summary of cyclic substructures inherent in the graph datasets utilized in our experiments.\n- Weakness 4: In Tables 1 through 4, we added new implementations of graph classifications and graph regressions by utilizing GATs and Cy2C-GNNs. The empirical results obtained in these tables demonstrate that TIGT outperforms both techniques in both classification and regression experiments. Unlike Cy2C-GNNs, TIGT effectively incorporates clique adjacency matrices, global attention layers, and graph information layers, the architectural design of which contributes to outperformance in graph classifications and regressions.\n- Weakness 5: In Table 7, we added specifications of hyperparameters and computation time taken in classifying graph datasets from utilizing TIGT and baseline techniques.\n- Weakness 6: We thank the reviewer for suggesting new references. We realized that the new references mostly focus on node classification of graph datasets, the results of which are difficult to make direct comparisons to TIGT which focuses primarily on graph classifications. Nevertheless, we added the new references to the introduction of the manuscript."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3132/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700534301013,
                "cdate": 1700534301013,
                "tmdate": 1700534301013,
                "mdate": 1700534301013,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "oV3nipWykz",
            "forum": "lYy9zPOxXS",
            "replyto": "lYy9zPOxXS",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission3132/Reviewer_8s8z"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission3132/Reviewer_8s8z"
            ],
            "content": {
                "summary": {
                    "value": "The authors have introduced an innovative Graph Transformer designed to enhance its discriminative capabilities. This paper demonstrates the ability of the proposed method to effectively distinguish graph isomorphisms through a novel dual-path message-passing layer. Both experimental and theoretical findings substantiate the authors' assertions. Moreover, the study delves into a novel positional embedding layer, aiming to harness topological information more efficiently within the Graph Transformer framework. Experimental evaluations further underscore the method's proficiency in graph-level benchmarks."
                },
                "soundness": {
                    "value": "4 excellent"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "1. **Performance.** The introduced methodology exhibits outstanding performance, notably excelling on the CSL dataset and outperforming the expressive power of contemporary Graph Transformers.\n2. **Theoretical Development.** Comprehensive theoretical exploration confirms that the proposed approach encompasses and advances beyond current graph transfomers."
                },
                "weaknesses": {
                    "value": "1. **Novelty.** This work is merely a simple adoption of Cy2C-GNNs with multi-head attention to package that as a graph transformer. The authors present the same layer, except for edge features E^{l-1}, as two different layers in Section 3.1 and Section 3.2. They are called Topological positional embedding layer and Dual-path MPNNs, respectively. After getting node features, then some multi-head attention-based graph transformer.\n2. **Scalability.** The authors discuss the scalability of the proposed method regarding the number of nodes, edges, and edges in cyclic subgraphs. The method has a quadratic complexity in terms of the number of nodes. This indicates that the method does not scale well, and it might be difficult to apply it to large-scale graphs.\n3. **Applicability.** The authors showed the effectiveness of the proposed methods only on graph-level benchmarks. As the authors mentioned, the demonstration in other-level tasks, such as node classification/clustering, link prediction, and community detection, is needed to check the applicability."
                },
                "questions": {
                    "value": "1. Provide more baselines, including GNNs. Especially the proposed method is very similar to Cy2c-GNN and the key module is from that paper, but the authors did not compare their method with Cy2-GNN in Table 1, where the proposed method show significant improvement against graph transformers. In Table 2 and 3, Cy2-GNNs are missing. \n2. Please provide more implementation details of Cy2-GNN-1 and compare its computational cost and model [parameters.Is](http://parameters.Is) it fair to compare between TIGT and Cy2-GNN-1."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission3132/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698769727881,
            "cdate": 1698769727881,
            "tmdate": 1699636259877,
            "mdate": 1699636259877,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "LizBNwpMyX",
                "forum": "lYy9zPOxXS",
                "replyto": "oV3nipWykz",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3132/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3132/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer 8s8z"
                    },
                    "comment": {
                        "value": "We thank the reviewer for kindly providing constructive feedbacks and comments to the manuscript. Please find our responses to some of the questions in the list provided below.\n\n- Weakness 1: One prominent novelty of this work comes from obtaining an optimal balance among encapsulating the merits of Cy2C-GNNs in incorporating topological invariants of graph datasets, utilizing the advantages of Graph Transformers in effectively analyzing node and edge features of graph datasets, and sustaining the expressive power of GNNs even under increases in number of hidden layers. Our newly added implementations demonstrate that TIGT successfully implements the optimal balance of the aforementioned three conditions, whereas other GNNS or transformer architectures may not effectively satisfy all three conditions simultaneously.\n- Question 1: In Table 1 of the updated manuscript, we added new comparisons of performances of TIGT to other baseline GNNs and transformers. In particular, we added new implementations of classifying graph datasets by utilizing GATs and Cy2C-GNNs. We observe that while Cy2C-GNN performs well with a single hidden layer, its performance in classifying graph datasets decreases as the number of layer increases. In addition, additional implementations demonstrate that GATs cannot effectively distinguish cyclic substructure of graph datasets.\n- Weakness 2, Question 2: In Table 7, we added a comparison of the pre-processing computation time, computation time per epoch, and the number of hyperparameters utilized in classifying graph datasets by using Cy2C-GNNs, GPS+LapPE+RWSE, GRIT+RRWP, and TIGT. In Table 4, we also added the empiricial results obtained from Cy2C-GNNs with increased number of hyperparameters. While TIGT exhibits slightly increased computational costs and hyperparameters because it is comprised of various architectural components, we observe that TIGT exhibits meaningful performance boosts in graph classifications and regressions."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3132/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700534225171,
                "cdate": 1700534225171,
                "tmdate": 1700534225171,
                "mdate": 1700534225171,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]