[
    {
        "title": "Time Series Anomaly Detection using Reconstruction and RBF Similarity Scores"
    },
    {
        "review": {
            "id": "eFIcCEZAmA",
            "forum": "N1TyUhkvjW",
            "replyto": "N1TyUhkvjW",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission3783/Reviewer_ewvW"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission3783/Reviewer_ewvW"
            ],
            "content": {
                "summary": {
                    "value": "In order to mitigate the impact of smoothing effects and improve the network's sensitivity to anomalies, the author brings RBF to current time-series anomaly detection methods like LSTM and Transformer. By constructing a clustering-based middle layer with RBF, all the input samples are projected to cluster space for comparing their distances to cluster centroids, which is benefit for separating anomalies from samples. Besides, an RBF-similarity-score-based criterion is proposed for optimizing the parameters as well as evaluating the effect of proposed methods."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "Strengths:\n1)\tThe motivation of the work is quite direct and practical in anomaly detection fields, which is easy to catch up;\n2)\tExperiments with LSTM and Transformer on 3 different datasets demonstrate the effectiveness of proposed methods, and the performance improvement brought by the proposed module is stable;\n3)\tAblation study on initialization methods, inserting position and number of cluster centroids firmly analyzed the effectiveness of proposed methods under different circumstances;"
                },
                "weaknesses": {
                    "value": "1)\tIn review part, only Xu et al. (2021) is reviewed for describing current time-series anomaly detection methods, but several works in 2022 and 2023 are missed in reviewing and experimental parts, which have also performed greatly in multiple time-series anomaly detection datasets, such as:\n[1] Zhang Z, Li W, Ding W, et al. STAD-GAN: unsupervised anomaly detection on multivariate time series with self-training generative adversarial networks[J]. ACM Transactions on Knowledge Discovery from Data, 2023, 17(5): 1-18.\n[2] Xia F, Chen X, Yu S, et al. Coupled Attention Networks for Multivariate Time Series Anomaly Detection[J]. IEEE Transactions on Emerging Topics in Computing, 2023.\n[3] Ding C, Sun S, Zhao J. MST-GAT: A multimodal spatial–temporal graph attention network for time series anomaly detection[J]. Information Fusion, 2023, 89: 527-536.\n2)\tThe experiments were only conducted on LSTM and Transformer, which are some out of-date baselines, more experiments on current SOTA methods (as baselines) should be conducted for validating the performance of proposed module, since the author mentioned that the proposed method is generic and can be applied to a wide range of deep learning architectures. For instance, the Anomaly Transformer can be regarded as a good baseline to testify the proposed RBF-based module."
                },
                "questions": {
                    "value": "Refering to above"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission3783/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698048289483,
            "cdate": 1698048289483,
            "tmdate": 1699636335019,
            "mdate": 1699636335019,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "M2oj5L9GUv",
                "forum": "N1TyUhkvjW",
                "replyto": "eFIcCEZAmA",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3783/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3783/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer ewvW"
                    },
                    "comment": {
                        "value": "Thank you for your valuable suggestions and comments regarding our paper. We have carefully considered your feedback and updated our manuscript accordingly.\n\n### **Q1. Miss of related Works:**\n\nFollowing your suggestions, we have updated the related research section in the introduction of our paper to include the recent works and baselines. This addition has enriched our paper by providing a more comprehensive overview of the recent methods. \n\n&nbsp;\n\n### **Q2. Lack of Baseline** (Application of SimRec in other baselines):\n\nWe understand your curiosity about the application of our SimRec method to more specialized anomaly detection models. We address your point in the following details:\n\n- **Rationale Behind the Selected Baselines:** Our study specifically focuses on enhancing the anomaly detection in models based on Reconstruction Error (RE). This focus derives from the identified gap where these models often struggle with detecting subtle anomalies. Our selection of LSTM and Transformer baselines is relevant to the scope of the paper and is driven by their widespread use as RE-based benchmarks in anomaly detection literature. Many papers employ these models as reconstruction-error based benchmarks when comparing new methods. This choice allows us to demonstrate the significant improvements our SimRec method can bring to widely recognized models in the field of RE-based anomaly detection.\n\n- **Exploring Beyond Initial Scope (Potential Application to Specialized Models):** In response to your suggestion, we appreciated the potential value of exploring the application of SimRec to more specialized models like Anomaly Transformer or Omny, despite them operating on different principles such as association discrepancy. This exploration was not part of our original research plan but was undertaken to address your feedback.\n  - **Challenges with Implementation:** We encountered challenges while attempting to apply SimRec to the Anomaly Transformer model due to discrepancies between the published paper and the public code. Notably, the model's code includes a \"temperature\" parameter set to a value of 50, a critical detail that is absent in the original paper. When we adjusted this parameter to a value of 1, more in line with standard practice and implied by the paper, we observed a substantial drop in performance on datasets like MSL. For instance, the F1-score decreased from 0.95 to 0.88, and the AUC from 0.98 to 0.92. This discrepancy highlights the difficulties in replicating and adapting methods when crucial implementation details are omitted in the publication.\n\n    Despite reaching out for clarification, we have not received a response, which makes it hard to properly integrate SimRec with their model. The limited time frame of the rebuttal period and complexities in adapting SimRec due to unclear published core and details constrained our ability to extend our research in this direction. This point brings us back to the choice of our baselines as they were not just arbitrary but a strategic decision to demonstrate the impact of SimRec within a well-recognized and relevant framework in the field.\n\n- **Focused Approach with Openness to Future Research:** We recognize the potential benefits of integrating SimRec with the specialized models, but it should be noted that our research is dedicated to addressing challenges within the pure RE-based anomaly detection domain. We would like to keep the scope of the study in establishing the foundational effectiveness of SimRec in the targeted context of RE score. We believe this focused approach better illustrates the impact of SimRec. Nevertheless, exploring the applicability of SimRec to a broader range of models, including specialized ones, is an exciting direction for future research which can be now opened by our study. We updated the paper accordingly to show this point. \n\nWe hope that the revisions and provided responses address your concerns adequately."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3783/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700304709344,
                "cdate": 1700304709344,
                "tmdate": 1700305269891,
                "mdate": 1700305269891,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "wNZPK3pFkA",
                "forum": "N1TyUhkvjW",
                "replyto": "M2oj5L9GUv",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3783/Reviewer_ewvW"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3783/Reviewer_ewvW"
                ],
                "content": {
                    "title": {
                        "value": "Comments/suggestions"
                    },
                    "comment": {
                        "value": "1)\tIn the mentioned rationale the author claimed that LSTM and Transformer are universally adopted as RE-based benchmark, but in recent years GAN and AE based time series anomaly detection methods, which also utilize reconstruction error as one of their principles, have been proposed and become mainstream methods, I wonder if your proposed SimRec can work well with GAN or AE based methods.\n2)\tThe reproduction of Anomaly Transformer is to set another baseline for you to validate the effectiveness of your proposed method with other baselines. No matter how unstable the baseline is, if your method can improve its performance according to your reproduced results (under the same experimental settings), the effectiveness can still be proved. Besides, you can also try to test the performance of your module with different “temperature” settings. If your method can stably improve the performance of the baseline, then the stability and effectiveness can be further testified.\n3)\tExcept Anomaly Transformer, I also find another transformer-based baseline for you to test your method.\n[1] Tuli S, Casale G, Jennings N R. TranAD: deep transformer networks for anomaly detection in multivariate time series data[J]. Proceedings of the VLDB Endowment, 2022, 15(6): 1201-1214.\nArxiv: https://arxiv.org/pdf/2201.07284.pdf\nCode: https://github.com/imperial-qore/TranAD\nThe methods are experimented on multiple time-series AD datasets (including the ones in your article), which is also a good baseline method for validation."
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3783/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700480840145,
                "cdate": 1700480840145,
                "tmdate": 1700480840145,
                "mdate": 1700480840145,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "EOy3eNscN1",
            "forum": "N1TyUhkvjW",
            "replyto": "N1TyUhkvjW",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission3783/Reviewer_L6VE"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission3783/Reviewer_L6VE"
            ],
            "content": {
                "summary": {
                    "value": "Until recently, anomaly detection was mainly done using unsupervised learning and autoencoder-based methods due to the lack of label data. Learning methods based on reconstruction error cannot detect subtle anomalies in multivariate dataset/high-dimensional dataset.\n\nIn this paper, to solve these limitations, Radial Basis Function (RBF) neurons are applied to deep learning architecture.\n\nIn other words, this paper proposes a new anomaly score called SimRec. SimRec is an anomaly score that combines RBF score and reconstruction error. By using this score, subtle existing anomalies can be detected."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. In particular, in unsupervised anomaly detection, a motif to overcome the limitations of reconstruction error-based anomaly detection is reasonable.\n2. The paper is overall understandable and neatly written."
                },
                "weaknesses": {
                    "value": "1. There is a lack of baseline. Since neither LSTM nor Transformer are models specialized for anomaly detection, I am curious about the results when applied to more specialized models. In particular, I would like to see the results of applying SimRec to the Anomaly Transformer. In addition, Omni Anomaly\n2. The effect of SimRec is clearly visible, but it seems to be more affected by threshold selection. I would like to see the reconstruction error graph of the anomaly transformer using the same threshold selection method.\n3. This paper clearly has good motivation, but it feels somewhat lacking in terms of experimental performance, experimental content, and contribution."
                },
                "questions": {
                    "value": "1. There is a lack of baseline. Since neither LSTM nor Transformer are models specialized for anomaly detection, I am curious about the results when applied to more specialized models. In particular, I would like to see the results of applying SimRec to the Anomaly Transformer. In addition, Omni Anomaly\n2. The effect of SimRec is clearly visible, but it seems to be more affected by threshold selection. I would like to see the reconstruction error graph of the anomaly transformer using the same threshold selection method."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission3783/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission3783/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission3783/Reviewer_L6VE"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission3783/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698594680547,
            "cdate": 1698594680547,
            "tmdate": 1699636334944,
            "mdate": 1699636334944,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "yTFJr6At94",
                "forum": "N1TyUhkvjW",
                "replyto": "EOy3eNscN1",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3783/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3783/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer L6VE"
                    },
                    "comment": {
                        "value": "Thank you for your insightful feedback. We carefully addressed them point-by-point and tried to make possible revisions accordingly.\n\n### **Q1. Lack of Baseline** (Application of SimRec in other baselines):\n\nWe understand your curiosity about the application of our SimRec method to more specialized anomaly detection models. We address your point in the following details:\n\n- **Rationale Behind the Selected Baselines:** Our study specifically focuses on enhancing the anomaly detection in models based on Reconstruction Error (RE). This focus derives from the identified gap where these models often struggle with detecting subtle anomalies. Our selection of LSTM and Transformer baselines is relevant to the scope of the paper and is driven by their widespread use as RE-based benchmarks in anomaly detection literature. Many papers employ these models as reconstruction-error based benchmarks when comparing new methods. This choice allows us to show the significant improvements our method can bring to widely recognized models in the field of RE-based anomaly detection.\n\n- **Exploring Beyond Initial Scope (Potential Application to Specialized Models):** In response to your suggestion, we appreciated the potential value of exploring the application of SimRec to more specialized models like Anomaly Transformer or Omny, despite them operating on different principles such as association discrepancy. This exploration was not part of our original research plan but was undertaken to address your feedback.\n\n  - **Challenges with Implementation:** We faced challenges while trying to apply SimRec to the Anomaly Transformer model due to discrepancies between the published paper and the public code. Notably, the model's code includes a \"temperature\" parameter set to a value of 50, a critical detail that is absent in the original paper. When we adjusted this parameter to a value of 1, more in line with standard practice and implied by the paper, we observed a substantial drop in performance on datasets like MSL. For instance, the F1-score decreased from 0.95 to 0.88, or the AUC from 0.98 to 0.92. This discrepancy highlights the difficulties in replicating and adapting methods when crucial implementation details are omitted in the publication.\n\n    Despite reaching out for clarification, we have not received a response, which makes it hard to properly integrate SimRec with their model. The limited time frame of the rebuttal period and complexities in adapting SimRec due to unclear published core and details constrained our ability to extend our research in this direction. This point brings us back to the choice of our baselines as they were not just arbitrary but a strategic decision to show the impact of SimRec within a well-recognized and relevant framework in the field.\n\n- **Focused Approach with Openness to Future Research:** We recognize the potential benefits of integrating SimRec with the specialized models, but it should be noted that our research is dedicated to addressing challenges within the pure RE-based anomaly detection domain. We would like to keep the scope of the study in establishing the foundational effectiveness of SimRec in the targeted context of the RE score. We believe this focused approach better illustrates the impact of SimRec. Nevertheless, exploring the applicability of SimRec to a broader range of models, including specialized ones, is an exciting direction for future research which can be now opened by our study. We updated the paper accordingly to show this point. \n\n&nbsp;\n\n### **Q2. Effect of the Threshold**\n\n- **Threshold Selection Methodology:** In our research, the threshold for anomaly detection was carefully chosen based on the well-accepted method used in the literature, specifically referencing the approach used in the Anomaly Transformer paper.\n\n- **Use of ROC-AUC and AUC-PR:** To provide a more comprehensive evaluation that is not solely dependent on threshold selection, we have employed ROC-AUC and AUC-PR metrics which offer a threshold-independent assessment and a general view of the effect of our method.\n\n- **Incorporation of New Evaluation Metrics:** Following the suggestion of reviewer \\#GeHM, we have added new evaluation metrics to our paper that are not dependent on threshold selection. These additional results align with our initial findings and support the claims of our study. Results can be found in Table 1 in the updated paper.\n\n- **Consistency Across Comparisons:** We have ensured that the comparison of our method with other models is fair by using the same threshold and settings. Also, to provide a robust evaluation, we have reported the mean performance over multiple runs in all our experiments. We kept this practice not only for our model but also in comparisons with other methods.\n\nFor concerns about the experimental content and contribution (noted in **weaknesses**), please kindly refer to our detailed response to Reviewer #GeHM (Qs 1& 2), which covers these points."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3783/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700304533643,
                "cdate": 1700304533643,
                "tmdate": 1700305437540,
                "mdate": 1700305437540,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "rs4FUkyAkO",
                "forum": "N1TyUhkvjW",
                "replyto": "yTFJr6At94",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3783/Reviewer_L6VE"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3783/Reviewer_L6VE"
                ],
                "content": {
                    "title": {
                        "value": "Maintaining my original score"
                    },
                    "comment": {
                        "value": "All of my concerns have been addressed, and I maintain my original score."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3783/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700381134922,
                "cdate": 1700381134922,
                "tmdate": 1700381134922,
                "mdate": 1700381134922,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "sNWWfW0a6Z",
            "forum": "N1TyUhkvjW",
            "replyto": "N1TyUhkvjW",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission3783/Reviewer_GeHM"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission3783/Reviewer_GeHM"
            ],
            "content": {
                "summary": {
                    "value": "This work introduces SimRec score, an anomaly score to improve detection of anomalies by combining the reconstruction score with a similarity score. The similarity score is computed via density estimations using a layer of RBF neurons in DNNs. Experimental results on various time-series anomalies demonstrate the performance of the proposed solution"
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "- Significant value in improving anomaly detection methods by \"small\" modifications in current methodologies\n- Experimental results support the claims of the paper\n- Technical sound ideas"
                },
                "weaknesses": {
                    "value": "- Novelty is somewhat low\n- Unclear experimental settings\n- Missing related work, datasets, new benchmarks"
                },
                "questions": {
                    "value": "- Novelty is somewhat low\n\nThe idea seems technical sound as sub-components already exist. The technical novelty is somewhat low. For example, there is lack of preliminaries to help understand if something is brand new, but several of these questions are simple adaptation of the original equations applied to this new problem (e.g., k-means-type optimization in eq 3, RBF kernel already exists, combination of two scores is trivial, etc.)\n\nThe core idea of using sim to centroids has been applied many times (see work below), maybe not explicitly combined with the reconstruction error.\n\n- Unclear experimental settings\n\nThe settings and parameters for baselines are not clear. Questions can be raised about fairness in comparisons when details from settings are omitted\n\n- Missing related work, datasets, new benchmarks\n\nThe work focuses on a very narrow part of the literature (emerging due to the rise of DNN solutions) but definitely omits new progress on benchmarks, baselines, new evaluation measures [a,b].\n\nNew benchmarks, ~20 datasets, ~2000 timeseries, 10+ baselines\n[a] TSB-UAD: an end-to-end benchmark suite for univariate time-series anomaly detection.\" Proceedings of the VLDB Endowment 15.8 (2022): 1697-1711.\n\nNew evaluation measures\n[b] \"Volume under the surface: a new accuracy evaluation measure for time-series anomaly detection.\" Proceedings of the VLDB Endowment 15.11 (2022): 2774-2787."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission3783/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission3783/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission3783/Reviewer_GeHM"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission3783/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698809908131,
            "cdate": 1698809908131,
            "tmdate": 1700523596697,
            "mdate": 1700523596697,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "HSnqXhZX0c",
                "forum": "N1TyUhkvjW",
                "replyto": "sNWWfW0a6Z",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3783/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3783/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer GeHM - Part (1/2)"
                    },
                    "comment": {
                        "value": "We would like to thank you for your valuable comments and suggestions. We carefully addressed them point-by-point and made revisions to our manuscript accordingly.\n\n### **Q1. Novelty is somewhat low:**\n\nWe appreciate the opportunity to further clarify and underscore the contributions of our work, considering your concerns regarding the novelty of our methodology:\n\n- **Identification of a New Problem (Addressing a Specific Gap):** Our research has identified and addressed a previously unexplored challenge in anomaly detection models based on reconstruction error — specifically, their limited effectiveness in detecting subtle anomalies. Uncovering this issue is an important contribution to the field.\n\n- **Innovative Application of Existing Methods:** We agree with your point regarding the established nature of methods like the RBF, and we have already acknowledged this in the introduction of our paper. However, one of the novelties of our work lies in the specific application of these methods to address a specific problem. The combination of the RBF similarity score with traditional reconstruction error, while conceptually straightforward, is a strategic choice. This is not just a trivial combination but a carefully considered approach to enhance the sensitivity and robustness of anomaly detection for subtle anomalies (addressing the gap).\n\n    As you mentioned, this combination has not been explicitly explored in the literature, and our experimental results (provided by detailed comparative analysis) validate the effectiveness of our approach in addressing the identified gap.\n\n    We have updated the paper to elaborate more on how the combination of RBF similarity score and reconstruction error is not trivial and it has specific advantages - This claim is now even more supported by empirical results (using the new evaluation metrics suggested by you).\n\n- **Innovative Density Loss Term:** A key innovation in our approach is the introduction of a novel density loss term in the loss function, specifically designed for training the RBF kernel in this context. This term is detailed in the context of Formula 4 in our paper. We present the term here for reference:\n\n    $$\n    \\text{Density Loss} = \\lambda \\frac{1}{N} \\sum_{i=1}^{N} \\frac{1}{T} \\sum_{t=1}^{T} \\log \\left( \\frac{1}{M} \\sum_{m=1}^{M} (\\mathbf{z}_{i,t})_m + \\epsilon \\right)\n    $$\n\n    This is a substantial technical contribution that enhances the effectiveness of our method and is not found in existing literature (as far as we were able to find).\n\n- **Efficiency of Practical Implications:** We demonstrate that next to using the novel density loss term, random initialization of the RBF parameters is as effective as more complex well-established initialization methods like K-means. This finding has significant practical implications, making our method more accessible and easier to implement in various settings.\n\n    &nbsp;\n\nIn general, we have updated the paper to give a better overview of the contribution and novelty of the work. We hope that these points, along with the additional details and empirical evidence provided in the revised paper, address your concerns regarding the novelty of our work.\n\n&nbsp;\n\n### **Q2. Unclear experimental settings:**\n\nWe would like to clarify that detailed information about the settings and parameters is comprehensively provided in the appendix section of our paper. Additionally, we have made the full code of our experiments available to ensure transparency and facilitate reproducibility.\n\nTo address your concern, we have now updated the key experimental details regarding the primary parameters, model architectures, and settings with a better overview of our experimental approach.\n\nWe believe these updates will enhance the clarity of our experimental framework and ensure that our comparisons are both fair and easily replicable by other researchers in the field. We hope that these modifications address your concerns effectively."
                    }
                },
                "number": 1,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3783/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700304000982,
                "cdate": 1700304000982,
                "tmdate": 1700304957467,
                "mdate": 1700304957467,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "MlwkDiyVJY",
                "forum": "N1TyUhkvjW",
                "replyto": "sNWWfW0a6Z",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3783/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3783/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer GeHM - Part (2/2)"
                    },
                    "comment": {
                        "value": "### **Q3. Missing related work, datasets, new benchmarks**\n\n- **Incorporation of New Evaluation Metrics:** Following your recommendation, we have incorporated the new evaluation metric \"Volume under the surface\" from the referenced work [b]. This inclusion has not only validated our initial findings but has also strengthened the overall results and conclusions of our paper. We have updated our manuscript with the new results showcasing these results, demonstrating the added robustness and validity that this metric brings to our research. Your suggestion has significantly contributed to enhancing the quality of our work. (Due to space limitations, we only provide the new metrics here. See Table 1 from the updated paper for the complete results)\n\n**Table 1**. Mean performance (std). Initialization methods are denoted as (R) for Random and (K) for K-means.\n\n| Models                  | (SMD) VUS-ROC | | (SMD) VUS-PR | | (MSL) VUS-ROC | | (MSL) VUS-PR | | (PSM) VUS-ROC | | (PSM) VUS-PR |\n|-------------------------|---------------|-|--------------|-|---------------|-|--------------|-|---------------|-|--------------|\n| LSTM                    | 61(0)         | | 55(0)        | | 72(1)         | | 61(0)        | | 72(1)         | | 61(0)        |\n| SimRec-LSTM (R)         | **65(2)**     | | **60(3)**    | | **78(1)**     | | **65(2)**    | | **78(1)**     | | **65(2)**    |\n| SimRec-LSTM (K)         | **66(2)**     | | **61(2)**    | | **80(0)**     | | **66(2)**    | | **80(0)**     | | **66(2)**    |\n|                         |               | |              | |               | |              | |               | |              |  <!-- This is the empty row -->\n| Transformer             | 59(2)         | | 52(3)        | | 70(2)         | | 59(2)        | | 70(2)         | | 59(2)        |\n| SimRec-Transformer (R)  | **64(3)**     | | **57(3)**    | | **80(1)**     | | **64(3)**    | | **80(1)**     | | **64(3)**    |\n| SimRec-Transformer (K)  | **66(2)**     | | **61(4)**    | | **79(2)**     | | **66(2)**    | | **79(2)**     | | **66(2)**    |\n\n- **Benchmark Recommendations:** We understand your point regarding the inclusion of more diverse benchmarks, such as the TSB-UAD suite for univariate time-series anomaly detection. While we acknowledge the value of such comprehensive datasets, our research has targeted more challenging datasets. This is why we selected the multivariate time series datasets which are widely acknowledged and used in this field. We believe that focusing on these datasets allows us to show the effectiveness of our method in more complex, real-world scenarios. Other research has shown that simpler models can often effectively address anomaly detection in univariate datasets (refer to [a1]). However, our work aims to tackle the subtleties and complexities inherent in more challenging benchmarks. We appreciate your suggestion and will consider exploring a broader range of datasets, including univariate ones, in our future works.\n\n- **Expansion of Related Work:** We have updated the related research section in the introduction of our paper to include recent works and baselines in the field of anomaly detection. This addition ensures that our paper provides a comprehensive overview of the recent methods.\n\n- **Clarification on the Scope of the paper:** While acknowledging the variety of innovative approaches in anomaly detection, our research specifically focuses on addressing issues within Reconstruction Error (RE) based methods. Therefore, we have chosen baselines (for applying SimRec score) that are directly relevant to this focus. For instance, STAD-GAN [a2] is based on reconstruction error anomaly score, but a baseline like OmniAnomaly [a3], although effective, diverge from our core research area as they are based on different principles such as reconstruction probability, distance-based methods, or association discrepancy.\n\n    We believe that our focus on enhancing RE-based anomaly detection is a significant contribution to the field (both fundamentally and in terms of competitive performance compared to the recent SOTA method). Also, by identifying and addressing a specific limitation in these methods, our work opens up new opportunities for future research. For example, the integration of RBF kernels, as proposed in our method, could potentially benefit other baseline models.\n\nReferences:\n- [a1] Schmidl, Sebastian, et al. \"Anomaly detection in time series: a comprehensive evaluation.\" Proceedings of the VLDB Endowment 15.9 (2022): 1779-1797.\n- [a2] Zhang, Zhijie, et al. \"STAD-GAN: Unsupervised anomaly detection on multivariate time series with self-training generative adversarial networks.\" ACM Transactions on Knowledge Discovery from Data 17.5 (2023): 1–18.\n- [a3] Su, Ya, et al. \"Robust anomaly detection for multivariate time series through stochastic recurrent neural network.\" Proceedings of the 25th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining. 2019."
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3783/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700304187704,
                "cdate": 1700304187704,
                "tmdate": 1700304187704,
                "mdate": 1700304187704,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "UQQ4IT7wOg",
                "forum": "N1TyUhkvjW",
                "replyto": "MlwkDiyVJY",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3783/Reviewer_GeHM"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3783/Reviewer_GeHM"
                ],
                "content": {
                    "comment": {
                        "value": "Thanks for addressing my concerns and clarifying the novelty aspects. With the new eval measures, I think the paper is much stronger now. You should make an additional effort to include many more baselines (TSBUAD identified 10 SOTA methods for example). As other reviewers point out, it's as if you mainly compare against a very narrow collection of methods, ignoring literature from data mining, databases, signal processing, and other areas. No matter what I increase my score but more SOTA methods, more datasets, can strengthen even more the paper."
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3783/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700523568340,
                "cdate": 1700523568340,
                "tmdate": 1700523568340,
                "mdate": 1700523568340,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]