[
    {
        "title": "Lagrangian Flow Networks for Conservation Laws"
    },
    {
        "review": {
            "id": "M1iXKsk5fI",
            "forum": "Nshk5YpdWE",
            "replyto": "Nshk5YpdWE",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6062/Reviewer_RQ15"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6062/Reviewer_RQ15"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes LFlow, a neural parameterization of both the density and the velocity field that adhere to the continuity equation. This is achieved with a link between time-conditioned diffeomorphisms and Lagrangian solution maps for the continuity equation. Two application settings were considered, where in one setting the user has sparse data on both density and velocity, and in another setting, the user has no data but knows the equations. Low-dimensional experiments are done to demonstrate the effectiveness of the proposed parameterization."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "* The writing of the paper is clear.\n* Both settings are interesting and the proposed method has been shown to outperform the alternatives (PINN, DFNN, SLDA)."
                },
                "weaknesses": {
                    "value": "* To my knowledge, the idea of using the Lagrangian view of the continuity equation to build a neural parameterization that gives both velocity and density access is not new. \n  * In Section 3.1 and 3.2 of [1], the TIPF parameterization appears to be identical to LFlow proposed in the present paper, with the only difference being that in (13) of the present paper, $\\Phi_t$ appears instead of the inverse, which is the case of TIPF.\n  * This is a minor difference for TIPF, since in [1] the conditional normalizing flow used is RealNVP [2], which has ready access to the inverse flow map.\n  * Could the authors elaborate on the advantages of avoiding the inverse here?\n  * Could the authors also comment on the choice of the Lipschitz-constrained invertible densenets as the backbone architecture? What is the advantage/disadvantage compared to e.g. RealNVP [2]?\n* The experiments section is weak in my opinion, and weaker than that in [Richter-Powell 2022]. If I understand correctly, all experiments are in 2D. How would the parameterization fare in higher dimensions? Higher dimensional experiments are done in [Richter-Powell 2022]. In [1] it is found that TIPF does not work well in dimension >= 10. I suspect the same behavior occurs here, due to the reason that invertible pushforward networks might not be expressive (or might be hard to train).\n\n[1] Li, Lingxiao, Samuel Hurault, and Justin Solomon. \"Self-consistent velocity matching of probability flows.\" arXiv preprint arXiv:2301.13737 (2023).\n\n[2] Dinh, Laurent, Jascha Sohl-Dickstein, and Samy Bengio. \"Density estimation using real nvp.\" arXiv preprint arXiv:1605.08803 (2016)."
                },
                "questions": {
                    "value": "1. At the bottom of the first page, it reads \"in setting (ii) we measure only the density of the fluid but we know additional equations defining the velocity.\" If density is already known for all time, then isn't it already enough to reconstruct the velocity without needing to know any additional equations, by simply solving the continuity equation?\n2. In the evaluation in Section 5.2, the gold standard of $W_2^2$ is computed using discrete estimates (and then averaged). However, the discrete estimate of W2 is known to be biased. How can one be sure that the red bars on the right of Figure 3 are accurate? Would the bar shift if more samples were used?\n3. In (15), how is the double integral computed in practice? It looks like it requires uniform samples from the domain $\\Omega$, which could be very ineffective if the flow only concentrates on a small portion of the domain."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission6062/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6062/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6062/Reviewer_RQ15"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6062/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698114748630,
            "cdate": 1698114748630,
            "tmdate": 1700349394147,
            "mdate": 1700349394147,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "AzoECMOiJq",
                "forum": "Nshk5YpdWE",
                "replyto": "M1iXKsk5fI",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6062/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6062/Authors"
                ],
                "content": {
                    "title": {
                        "value": "i) Comparison to TIPF"
                    },
                    "comment": {
                        "value": "We are thankful to the reviewer for pointing out a related work, which we will include in the revised version of the paper. However, we respectfully disagree that this constitutes lack of novelty. \n\nThe proposed approach shares only a high-level similarity with TIPF. Both papers use known results from classical theory, namely that conditional diffeomorphisms define probability densities that satisfy the continuity equation by construction. However, (i) the class of problems addressed by the two papers is fundamentally different and (ii) the proposed architectures are consequently designed for different purposes.\n \n&nbsp;\n\n### (i) Scope of the papers:\n- TIPF consider well-posed forward problems for probability flows, where initial conditions, boundary conditions, and the full system of equations are known. Initial conditions are evolved forward in time with conditional bijections that fulfill the continuity equation by construction, providing an advantage compared to numerical methods.\\\n\n&nbsp;\n\n- In contrast, we consider inverse problems for real physical phenomena. We rely only on sparse (and noisy) observations, with unknown initial conditions, velocity and total mass. This is a challenging ill-posed setting and cannot be directly approached with classical numerical forward solvers.\n \n&nbsp;\n### (ii) Proposed architecture:\n- TIPF evolve a known initial density $p_{t_0}$ over time by directly parameterizing the Lagrangian flow map, which we denote as $X_t$ in Section 3.1. We shortly discuss this parameterization in Section 3.2. As $X_t$ is directly parameterized, $X_{t_0}$ must be enforced to be the identity map with an additional loss. Since there is no base density, observations are always mapped back to the known initial density $p_{t_0}$. One important limitation is that the bijection has to be inverted, which is computationally expensive. Therefore, TIPF rely on bijections with analytical inverses, which however severely limit the expressivity of the model.\n\n&nbsp;\n- In contrast, LFlows do **not** directly parameterize $X_t$ and $\\rho_{t_0}$. Instead, only a single time-conditioned bijection $\\Phi_t$ is learned, such that $X_t(x) = \\Phi_t^{-1}(\\Phi_{t_0}(x))$ (see Section 3.2). By mapping the time dependent density to a common base density, we do not even need an explicit $\\rho_{t_0}$. Importantly, our approach enables us to avoid computing the inverse explicitly. We can compute the velocity by simply inverting the Jacobian of $\\Phi_t$ instead of explicitly inverting $\\Phi_t$. We would like to highlight that this is a significant contribution, since unlike TIPS we are free to choose highly flexible bijections with unknown or expensive inverses. \n\n&nbsp;\n\n## Questions \nWe first address questions and concerns raised in the \"weaknesses\" sections. We will address the remaining questions in a separate post.\n\n>Could the authors elaborate on the advantages of avoiding the inverse here?\n\nHighly expressive bijective layers usually result in the loss of an efficient (analytical) inverse. Lipschitz constrained residual networks for example require a fixed-point iteration for obtaining the inverse. Backpropagating through such an operation (for minimizing a velocity loss) quickly turns infeasible for moderately sized networks. By completely avoiding the inverse we do not share the same limitations for the choice of the bijective layers as TIPF.\n\n>Could the authors also comment on the choice of the Lipschitz-constrained invertible densenets as the backbone architecture? What is the advantage/disadvantage compared to e.g. RealNVP [2]?\n\nInvertible densenets have free-form Jacobians and showed high performance on generative modeling tasks compared to other models [3], including RealNVP. We further found them easy to finetune and less prone to training instabilities and overfitting compared competing bijective layers.\n\n>If I understand correctly, all experiments are in 2D. How would the parameterization fare in higher dimensions?\n\nWe would like to correct the misunderstanding regarding the dimension. Both the  experiments in section 5.1 and the real-world bird migration experiment in 5.3 are in 3D. In the simulated fluid experiment we also show that the proposed LFlow outperforms competing methods by an even greater margin when going from 2D to 3D (see Figure 2, top right)\n\n>The experiments section is weak in my opinion, and weaker than that in [Richter-Powell 2022].\n\nConcerning the experiments, we respectfully disagree that our section is weaker compared to [Richter-Powell 2022]. From our point of view, the main purpose of PDE-constrained neural networks is the seamless incorporation of measurements for solving ill-posed inverse problems. Different to [Richter-Powell 2022], we actually evaluate such a setting with the bird migration experiment. \n\n[3] Perugachi-Diaz, et al. Invertible densenets with concatenated LipSwish. NeurIPS 2021.\n\n&nbsp;\n\nPlease let us know if there are any raised concerns we missed to address."
                    }
                },
                "number": 1,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6062/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1699914621768,
                "cdate": 1699914621768,
                "tmdate": 1699914621768,
                "mdate": 1699914621768,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "KfX8yDFXBI",
                "forum": "Nshk5YpdWE",
                "replyto": "Runc5AjXAJ",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6062/Reviewer_RQ15"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6062/Reviewer_RQ15"
                ],
                "content": {
                    "title": {
                        "value": "Reply to authors"
                    },
                    "comment": {
                        "value": "Thank you for your thorough rebuttal and revision. I have read it closely and I agree a few of my critiques were not accurate. Thanks for the explanation. As such, I have increased my score. \n\nHere are some more comments.\n* The revised discussion of TIPF in the related work section is adequate. Previously I was concerned about a few overclaiming statements in the original submission. I think those statements have been revised.\n* While I agree the scope of this present paper is different than that of [1] in the (i) scenario of having data but without equations, I found the novelty aspect limited since the idea of using the same parameterization to automatically satisfy CE is not entirely new, and PINN is originally proposed to handle this scenario using the same idea of regressing the parameterized flow to observation data.\n  - I think it can be made more explicit in Section 3.2 of the difference between the proposed parameterization and that of [1]. To me, the two main differences are 1) LFlows avoids inverting the flow map Phi and instead inverts a Jacobian matrix, and 2) LFlow uses a flow map that pushes from a base reference distribution rather than an initial distribution.\n* In terms of the exhaustiveness of experiments compared to [Richter-Powell 2022], I now agree the current set of experiments is more practical due to the bird migration experiment."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6062/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700349352250,
                "cdate": 1700349352250,
                "tmdate": 1700349352250,
                "mdate": 1700349352250,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "8gx1x6FYaf",
            "forum": "Nshk5YpdWE",
            "replyto": "Nshk5YpdWE",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6062/Reviewer_fhDc"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6062/Reviewer_fhDc"
            ],
            "content": {
                "summary": {
                    "value": "This paper expresses the continuity equation into the time-dependent density transformation to model the fluid densities and velocities. By introducing differentiable and invertible maps, the proposed LFlows can ensure the continuity equation inherently. The authors provide complete proof to support their insights. Typical experiments are also included. Experimentally, LFlows performs best in both performance and efficiency."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "1.\tThe paper starts from an interesting insight. The proposed method is reasonable and well-supported.\n\n2.\tThe authors conduct extensive experiments, covering both simulated and real-world dataset. \n\n3.\tThe propose LFlows performs well in both performance and efficiency."
                },
                "weaknesses": {
                    "value": "1.\tAbout the presentation.\n\nFor me, the writings in Section 3.1 and 4 are confusing and hard-to-read.\n\nIn Section 3.1, the authors use several theorems in an informal way and sometimes not give the exact formalization of theorem. I prefer to place the definitions of theorems in the main text and leave the proof in appendix, such as Theorem 1,2 and the existence and uniqueness of Lagrangian flows for smooth vector fields.\n\nIn Section 4, I don’t think the implementation of LFlows are well described. The model architecture in Appendix A.3 should be placed in main text. Besides, the implementation for baselines should be deferred into the Appendix.\n\n2.\tHow to adopt LFlows to process the spatially sparse data? More details are expected.\n\n3.\tAbout the noise observations in the real-world dataset. Since LFlows enable the strict continuity equation, does it come across problems when the input data is noisy even wrong? Some discussions are expected."
                },
                "questions": {
                    "value": "All the questions are listed above."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission6062/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6062/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6062/Reviewer_fhDc"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6062/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698340284351,
            "cdate": 1698340284351,
            "tmdate": 1700559773296,
            "mdate": 1700559773296,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "jXoVxrkumB",
                "forum": "Nshk5YpdWE",
                "replyto": "8gx1x6FYaf",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6062/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6062/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "We thank the reviewer for the valuable feedback on the presentation of our work. We are eager to make the paper clearer and more accessible.\n\n--------\n&nbsp;\n\n> For me, the writings in Section 3.1 [...] are confusing and hard-to-read.\n> In Section 3.1, the authors use several theorems in an informal way and sometimes not give the exact formalization of theorem. I prefer to place the definitions of theorems in the main text and leave the proof in appendix, such as Theorem 1,2 and the existence and uniqueness of Lagrangian flows for smooth vector fields.\n\nWe understand the argument with respect to the exact formulation of the theorems, and would generally agree with this preference. \n\nHowever, in a previous submission, we did provide exact formalizations and statements of the theorems in 3.1, which we now moved to A.1.1. This led to large misunderstandings among the reviews. We received the unanimous feedback that including the formal and large theorems in the main text decreased the clarity and potentially led the reader to believe that it was the main constribution of the work, instead of the starting point.\n\nWe would thus lean towards keeping the current version of Section 3.1, with the full theorems provided in the Appendix A.1.\n\n\n-----------------\n&nbsp;\n\n\n> [...] the writings in Section [...] 4 are confusing and hard-to-read.\n> In Section 4, I don’t think the implementation of LFlows are well described. The model architecture in Appendix A.3 should be placed in main text. Besides, the implementation for baselines should be deferred into the Appendix.\n\nWe thank the reviewer for highlighting these clarity issues, and agree that Section 4 can be improved by following these recommendations.\n\nWe rewrote the implementation section accordingly. That is, Section 4 now only discusses the implementation of LFlows, and does so in a clearer way. The implementation of the baselines were deferred to the Appendix A.3.\n\n-----------------\n&nbsp;\n\n> How to adopt LFlows to process the spatially sparse data? More details are expected.\n\nLFlows were directly designed for sparse data and do not need any adaption. Since LFlows provide continuous predictions in space and time and do not rely on a grid, we can predict the density and velocity at any point in space and time. To avoid overfitting in very sparse data regimes, we recommend additional regularization to limit the capacity of LFlows, such as the weight decay we employ for the Bird Migration.\n\nAll the experiments cover data regimes with some level of sparsity, be that in space or time. The synthetic 2D/3D experiments showcase continuous observations but only for parts of the domain. A truly sparse setting with irregularly spaced observations is explored with the bird migration experiment where 37 radar stations are the only information for three countries. Due to the nature of the Radar-Ornithology preprocessing pipeline, we only obtain a single density and velocity measurement for each radar at each time. This value does correspond to an average over a larger radius, but we never have access to the full radar volume scans. We refer to [1] for details on the radar data preprocessing.\n\n[1] Dokter, Adriaan M., et al. \"Bird migration flight altitudes studied by a network of operational weather radars.\" Journal of the Royal Society Interface 8.54 (2011): 30-43.\n\n\n--------------\n&nbsp;\n\n> About the noise observations in the real-world dataset. Since LFlows enable the strict continuity equation, does it come across problems when the input data is noisy even wrong? Some discussions are expected.\n\nWe do not observe issues with respect to noisy observations. We think such noise should be addressed in the loss function / likelihood. For example, by minimizing the MSE on the log1p transformed density we assume log(1p)-Gaussian noise. The problem of designing a problem specific noise model is however not unique to our method, and is an essential part of many classical machine learning and data assimilation problems.\n\nAnother point is that we are in highly ill-posed settings. From the data alone it can not be determined whether mass is strictly conserved and comes from an unobserved region, or whether there is a sink or source. Thus, we argue that the motivation for enforcing a physical constraint in such a setting must come from domain knowledge. We assume that for few consecutive nights during migration, there is a negligible change in bird-mass compared to the resolution and accuracy of our sensors. If this assumption is wrong, then of course the strict enforcement of the constraint will be unhelpful and even harming for the prediction."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6062/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700058172433,
                "cdate": 1700058172433,
                "tmdate": 1700058172433,
                "mdate": 1700058172433,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "Q2traLTyUE",
                "forum": "Nshk5YpdWE",
                "replyto": "8gx1x6FYaf",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6062/Reviewer_fhDc"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6062/Reviewer_fhDc"
                ],
                "content": {
                    "title": {
                        "value": "Thanks for your response and raise the score"
                    },
                    "comment": {
                        "value": "I would like to thank the authors' efforts in clarifying my concerns. Considering the overall quality and experiments of this paper, I would like to raise my score to 8."
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6062/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700559756559,
                "cdate": 1700559756559,
                "tmdate": 1700559805317,
                "mdate": 1700559805317,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "ICFJDgfNOh",
            "forum": "Nshk5YpdWE",
            "replyto": "Nshk5YpdWE",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6062/Reviewer_1yfJ"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6062/Reviewer_1yfJ"
            ],
            "content": {
                "summary": {
                    "value": "The paper introduces a neural network-based model designed to adhere to the continuity equation, even when dealing with scenarios where precise boundary and initial conditions are unknown. The core technical foundation relies on the classical theory of Lagrangian flows, providing a toolbox that ensures the evolution of density and velocities complies with the continuity equation."
                },
                "soundness": {
                    "value": "4 excellent"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "4 excellent"
                },
                "strengths": {
                    "value": "The paper significantly contributes to the field of neural PDE methods by focusing on enforcing constraints. It marries neural networks with conditioning normalization flows, resulting in LFlows that satisfy the continuity equation by design.\n\nThe method is validated across various 2D and 3D problems, including a real-world bird migration dataset, which could potentially serve as a standard benchmark dataset for similar problems. Unlike previous methods that often require known PDEs, initial, and boundary conditions, this approach tackles data assimilation-style problems where many system parameters are unknown. This kind of problem could be particularly useful for biomedical imaging applications.\n\nThe paper rigorously compares its approach to Richter-Powell's divergence-free neural networks, showcasing the computational efficiency of its method without the need for higher-order autodiff. Additionally, it compares favorably against other standard baselines, such as PINNs, especially in spatially sparse settings."
                },
                "weaknesses": {
                    "value": "The proposed method inherits limitations associated with normalizing flows and bijective layers, such as difficulties in handling discontinuities."
                },
                "questions": {
                    "value": "Could the authors comment on the challenges they anticipate when scaling this approach to larger problems, such as modeling large turbulent flows in aerodynamics? How might the complexity of LFlows impact scalability in such scenarios?\n\nHow does the computational complexity of LFlows compare to existing methods for solving hydrodynamic flow problems, especially in high-dimensional scenarios? Are there specific trade-offs or advantages in terms of computational efficiency?\n\nDoes the methodology proposed in this paper have the potential to be generalized to tackle other partial differential equations (PDEs) beyond the continuity equation? If so, what challenges or modifications might be necessary when applying it to different PDEs?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission6062/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6062/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6062/Reviewer_1yfJ"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6062/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698675137145,
            "cdate": 1698675137145,
            "tmdate": 1699636652306,
            "mdate": 1699636652306,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "ljcgW08zR8",
                "forum": "Nshk5YpdWE",
                "replyto": "ICFJDgfNOh",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6062/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6062/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "We thank the reviewer for the interest in our work and share their enthusiasm.\n\n&nbsp;\n-----\n### Question 1 \n> Could the authors comment on the challenges they anticipate when scaling this approach to larger problems, such as modeling large turbulent flows in aerodynamics? How might the complexity of LFlows impact scalability in such scenarios?\n\nWe estimate that large-scale turbulent flows are currently outside the scope of LFlows. Our current applications mostly consider rather smooth spatiotemporal interpolations, while turbulent flows consist of complex and chaotic dynamics on multiple scales. Nonetheless, to approach such complex dynamics with LFlows, we would recommend to use neural spline transformations [0] as bijective layers. These are extremely flexible and provide localized (bin-wise) transformations, but very easily overfit in our settings with sparse measurements.\n\nIn future work we plan to upscale the bird migration setting to longer time scales and consider covariates/hyperparameters influencing the density movement. This includes e.g. wind and rain data changing the migration behavior. In this upscaled setting we plan to condition each individual night on available covariates via the embedding networks, effectively splitting the problem into many (coupled) intra-night dynamics. Challenges mostly consider the design of the Embedding networks, as we currently rely on very simple architectures (MLPs with skip connections).\n\n[0] Durkan, Conor, et al. \"Neural spline flows.\" Advances in neural information processing systems 32 (2019).\n\n&nbsp;\n-----\n### Question 2 \n>How does the computational complexity of LFlows compare to existing methods for solving hydrodynamic flow problems, especially in high-dimensional scenarios? Are there specific trade-offs or advantages in terms of computational efficiency?\n\nAs we compared our work to multiple data assimilation methods, we assume this question refers to solving forward problems. LFlows were however mainly designed with ill-posed data-assimilation settings in mind, as they enable a seamless and straightforward integration of many and various data sources to inform the dynamics. In general, we do not expect LFlows to be competitive for (hydrodynamic) forward problems compared to highly specialized classical forward solvers.\n\nNonetheless, one key advantage is the mesh-free nature of the model without the need for representing particles explicitly (as in e.g. Smoothed Particle Hydrodynamics (SPH)). It should be noted that weakly enforcing _additional_ equations with a PDE loss might still require the use of many collocation points as in PINNs.\n\nSome additional equations can however be enforced by construction with LFlows. For incompressible fluid-flow problems, iterative solvers often require reprojections for ensuring divergence-free velocities [1]. In LFlows one could directly parameterize incompressible flows by ensuring that all time-dependent bijections have a Jacobian determinant of 1 (e.g. with shifts and rotations), resulting in divergence free velocities by construction. (The time-dependent bijections would have to be in the initial layers of $\\Phi_t$, and all time-independent bijections with Jacobian determinant != 1 would have to follow in later layers.)\n\n\n[1] Guermond, Jean-Luc, Peter Minev, and Jie Shen. \"An overview of projection methods for incompressible flows.\" Computer methods in applied mechanics and engineering 195.44-47 (2006): 6011-6045.\n\n&nbsp;\n-----\n### Question 3 \n>Does the methodology proposed in this paper have the potential to be generalized to tackle other partial differential equations (PDEs) beyond the continuity equation? If so, what challenges or modifications might be necessary when applying it to different PDEs?\n\nOur method for modeling densities is applicable to all systems of PDEs that are based on the continuity equation with a non-negative density, such as for example Fokker-Planck or Navier-Stokes like equations.\n\nAs LFlows strongly rely on the push-forward of a density, we unfortunately do not see a direct way to generalize the concept to other PDEs."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6062/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1699997066046,
                "cdate": 1699997066046,
                "tmdate": 1699997066046,
                "mdate": 1699997066046,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "kFhmveSKgK",
                "forum": "Nshk5YpdWE",
                "replyto": "ljcgW08zR8",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6062/Reviewer_1yfJ"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6062/Reviewer_1yfJ"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for the additional responses! It really helps me position this work in the literature. I would keep the current accept rating."
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6062/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700582620621,
                "cdate": 1700582620621,
                "tmdate": 1700582620621,
                "mdate": 1700582620621,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]