[
    {
        "title": "Long-tailed Diffusion Models with Oriented Calibration"
    },
    {
        "review": {
            "id": "pN9gvyUfTX",
            "forum": "NW2s5XXwXU",
            "replyto": "NW2s5XXwXU",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission1786/Reviewer_Uefc"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission1786/Reviewer_Uefc"
            ],
            "content": {
                "summary": {
                    "value": "In this paper, the author's primary focus is on tackling the diffusion model generation tasks in the context of long-tailed training scenarios. Different from previous works that enhance tail generation by relying on the abundant diversity derived from the head class (the condition capacity of the model prediction), this paper directly establishes the knowledge transfer from head data samples, based on the multi-objective characteristics of the score function in the diffusion process. A directional calibration for the estimation of noisy tail sample score is performed towards the clean head samples (T2H), leveraging the similarity within the data distribution from head to tail classes. Meanwhile, H2T is proposed for the unconditional generation. Extensive experiments demonstrate the effectiveness of the proposed method."
                },
                "soundness": {
                    "value": "4 excellent"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "4 excellent"
                },
                "strengths": {
                    "value": "1. This paper presents a novel idea that calibrates the estimation of noisy tail sample score by the clean head samples instead of relying on the condition capacity of the model prediction. \n2. This paper has a well-organized structure which makes it easy for readers to understand the research.\n3. The paper is well-supported by a strong theoretical foundation, which robustly underpins the proposed solutions.\n4. The text is clear with a good writing style."
                },
                "weaknesses": {
                    "value": "1. The explanations of some figures are not sufficiently comprehensive. For instance, the author could enhance the clarity of differentiation by adding annotations or captions to both the top and bottom parts of Figure 1.\n2. Some problems, which I will raise in the following section."
                },
                "questions": {
                    "value": "1. In the paper, T2H is utilized to estimate noisy tail samples using clean head samples, and this process is explained as a way to enhance the performance of long-tailed conditional generation. However, I have difficulty understanding why H2T, which estimates noisy head samples using clean tail samples, would improve the performance of unconditional generation. This is because, in my view, the style of the tail samples should be relatively homogeneous and might not provide substantial knowledge for estimating the head samples. Could the authors please provide an explanation?\n2. In Table1, why the \"Full\" (allowing both transfer directions) performs worse than the H2T and T2H (only allowing one direction) under the unconditional generation? Meanwhile, I'd like to see the performance of \"Full\" for the conditional generation.\n3. The author should explain more about why the baseline DDPM has a higher IS than T2H (Table 2 and Table 3)."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission1786/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission1786/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission1786/Reviewer_Uefc"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission1786/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698375220567,
            "cdate": 1698375220567,
            "tmdate": 1699636108076,
            "mdate": 1699636108076,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "AGizXhEIdE",
                "forum": "NW2s5XXwXU",
                "replyto": "pN9gvyUfTX",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1786/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1786/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer Uefc"
                    },
                    "comment": {
                        "value": "### W1\n> The explanations of some figures are not sufficiently comprehensive. For instance, the author could enhance the clarity of differentiation by adding annotations or captions to both the top and bottom parts of Figure 1\n\nThank you for the suggestion. We follow the reviewer's advice and have improved the caption of the figures including Figure 1 in the revised submission.\n\n### Q1\n> In the paper, T2H is utilized to estimate noisy tail samples using clean head samples, and this process is explained as a way to enhance the performance of long-tailed conditional generation. However, I have difficulty understanding why H2T, which estimates noisy head samples using clean tail samples, would improve the performance of unconditional generation. This is because, in my view, the style of the tail samples should be relatively homogeneous and might not provide substantial knowledge for estimating the head samples. Could the authors please provide an explanation?\n\nThanks for the comments. In unconditional generation, the most difficult challenge to tackle is **the balanced generation**. Unlike the conditional generation that could be achieved by sampling labels with balance, as shown in the table below, on the imbalanced cifar10lt dataset, the FID score with a balanced reference set (26.22) is significantly higher compared to that based on conditional generation (8.38).  However, training an unconditional model directly with a long tail dataset means that in the space, **the score for a noisy sample is predominantly influenced by the head samples**. The H2T strategy enhances the tendency to generate tail samples, thereby better ensuring the balance of the generated dataset. \n\n\n**FID scores&thinsp;$\\downarrow$ with balanced and non-balanced datasets**\n\n|    Reference Dataset     | No-Bal reference Set | Bal Generation DataSet |\n|:------------------------:|:--------------------:|:----------------------:|\n| No-Bal reference DataSet |          -           |         33.19          |\n|  Bal reference DataSet   |        26.22         |          8.38          |\n\nMore experimental details could be found in Appendix. G.\n### Q2\n> In Table1, why the \"Full\" (allowing both transfer directions) performs worse than the H2T and T2H (only allowing one direction) under the unconditional generation? Meanwhile, I'd like to see the performance of \"Full\" for the conditional generation.\n\nThank you for the comments. The answers are listed below:\n- **'Full' worse then T2H and H2T**\nFor unconditional generation, as former discussed, H2T could alleviate the un-balanced problem and T2H could improve the head-to-tail knowledge transfer. \nHowever, the 'Full' mode is not a mere overlay of H2T and T2H strategies. This is because, during the score mixing as described in Equation 6, it is impossible to simultaneously increase the contributions of both head class and tail class samples under the condition of Eq. 7. The integration of these two methods is a challenge we plan to address in our future work.\n\n- **'Full' mode in condition generation**  We have added the corresponding results in Table 1 (i.e. model I). According to the results, we can see that the performance of 'Full' is better than H2T but weaker than T2H under conditional generation. The T2H still remains the most effective method.\n### Q3\n> The author should explain more about why the baseline DDPM has a higher IS than T2H (Table 2 and Table 3).\n\nThanks for the comments. This is a really interesting phenomenon and need to find clues within the calculation method of IS. The Inception scores:\n$$\nIS(G)=\\exp \\mathbb{E} _{x \\sim g} D _{KL}(p(y|x)||p(y))) \n\\approx \\exp \\frac{1}{N}\\sum _i D _{KL}(p(y|x _i)||p(y))\n$$\nThe each term in exponential is a KL divergence between the label distribution $p(y|x_i)$ for each sample and the overall balanced distribution. When the $p(y|x_i)$ is sharper and more concentrates to one class, the KL divergence become larger.\nSince both our method and baseline method CBDM involve the score transfer among classes, the probability distribution $p(y∣x)$ might not be as sharp as in the base DDPM, especially in scenarios involving a large number of categories. This account for a slight decrease in performance of IS score, which is also observed in larger dataset ImageNetLT:\n\n| Method    | FID &thinsp;$\\downarrow$  | IS &thinsp;$\\uparrow$    |\n|:---------:|:-----:|:------:|\n| base DDPM | 26.95 | **15.99**  | \n| CBDM      | 26.12 | 15.86  | \n| T2H(Ours) | **25.42** | 15.96  |"
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1786/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700348766810,
                "cdate": 1700348766810,
                "tmdate": 1700373577960,
                "mdate": 1700373577960,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "L7ZMuNzRMQ",
            "forum": "NW2s5XXwXU",
            "replyto": "NW2s5XXwXU",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission1786/Reviewer_PNyr"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission1786/Reviewer_PNyr"
            ],
            "content": {
                "summary": {
                    "value": "This paper presents an algorithm for calibrating diffusion models for long-tailed data. Based on the recent work by Xu et al., 2023, in this work, the target for the score estimation is re-written as a mixture of multiple targets computed from a reference batch. The reference batch, unlike the work of Xu et al,. 2023, is sampled from a class-balanced distribution in order to calibrate the model for tail-class samples. For the conditional generation, the authors further propose a strategy called Tail-to-Head (T2H), where the target of the score estimation for a tail class sample is chosen to be a clean head class sample. The paper also suggests a variant called Head-to-Tail (H2T), where in this case a noisy head sample takes a clean tail sample as a target. The proposed method is demonstrated to improve image fidelity when applied to popular imbalanced image benchmarks."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "1 poor"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "- The paper is tackling an interesting problem.\n- The proposed method is simple and easy to implement.\n- The experimental results, at least for the simple benchmarks, is promising."
                },
                "weaknesses": {
                    "value": "- The presentation is poor. I don't really follow the description of the intuition behind the presented method. Please see my questions below.\n- Again, probably related to the first point, I don't see how the proposed method yields a valid regression target. The algorithm seems to be a heuristics without considering correctness.\n- Batch-Resample cannot be considered a novel contribution, as it is one of the standard approaches one could take for a problem involving a long-tailed dataset (e.g., long-tailed image classification)."
                },
                "questions": {
                    "value": "- I'm very confused about the argument around Proposition 3.1. First, it is not clear from the text what the \"score weight\" or \"weight of score\" means and why it is important. I guess this term refers to the mixing coefficients (normalized transition probabilities) appearing in the multi-target representation of the score function. Secondly, what is the author trying to make out of Proposition 3.1? How is it related to the algorithm? The sentence \"Intuinitively (intuitively, I guess), improving the score weight of head-class samples for the noisy $x_t$ from tail-class samples, increases the generation diversity of tail categories\" is not clear at all. What is \"improving\" the score weight? Is it increasing the value of the score weight? If so, how is it related to increasing the generation diversity?\n- The introduction of the selection procedure (equation (11)) comes without sufficient explanation. If I have to understand it, the random sampling for $z$ can be understood as a Monte-Carlo estimator of equation (8); But then the proposed algorithm alters the target score if $q(z_y) \\geq q(y_i)$; as a result, the target of the score estimation becomes something different, yielding a biased estimator of the original target. Is this intended? If so, how do you guarantee that the proposed algorithm is learning a correct target?\n- In the beginning you assumed $q(x_t|x_0, y_0) \\propto B q(y_0)^\\beta \\exp(-\\Vert x_t-x_0\\Vert_2^2/2\\sigma_t^2)$, but $p_\\text{sel}(z)$ described to computed only with $C \\exp(-\\Vert x_z-x_t\\Vert_2^2/2\\sigma_t^2)$ without $q(y)^\\beta$ term. Is this a typo or am I missing something here?\n- Similarly, I don't get the intuition behind the H2T, since from the beginning I failed to follow how Proposition 3.1 is linked to the T2H. What is the meaning of setting $\\beta=-1$ and why is it beneficial for unconditional sampling? \n- The experiments mostly show the results of T2H on class conditinal generation and H2T for unconditional generation, but how do they work for opposite settings (T2H for unconditional and H2T for conditional)? Is the direction of transfer matters? Or both direction helps in either cases, but the effectiveness of transfer may vary depending on the task?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission1786/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission1786/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission1786/Reviewer_PNyr"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission1786/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698673261942,
            "cdate": 1698673261942,
            "tmdate": 1700576587147,
            "mdate": 1700576587147,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "1mWT82ZOsP",
                "forum": "NW2s5XXwXU",
                "replyto": "L7ZMuNzRMQ",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1786/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1786/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer PNyr[1/2]"
                    },
                    "comment": {
                        "value": "### Q1 & W1\n> The presentation is poor. I don't really follow the description of the intuition behind the presented method. Please see my questions below.\n\n> I'm very confused about the argument around Proposition 3.1. First, it is not clear from the text what the \"score weight\" or \"weight of score\" means and why it is important. I guess this term refers to the mixing coefficients (normalized transition probabilities) appearing in the multi-target representation of the score function. Secondly, what is the author trying to make out of Proposition 3.1? How is it related to the algorithm? \n\nThanks for the comment.\n- **About score weight**\n1. We define the term \"score weight\" or \"weight of score\" in Equation (6). \n2. Importance of the score\n    i) From the perspective of methodology, this weight is derived from the estimation of the score function used in the denoising model. \n    ii) We use Proposition 3.1 to show the potential challenges in allowing diffusion models trained on such a long-tailed distribution with adjusting this weight to produce sample distributions with balanced labels. \n    iii) Empirically, our experiments in Table 2 also demonstrate the performance can be significanly improved using the score weight in this context.\n\n\n- **About Proposition3.1** \nWe agree the Proposition 3.1 is not suitable for introducing the T2H method. \"In fact, the Proposition **sets an upper limit on the transfer strength between different categories**, particularly for head-to-tail class transfer. Actually, this proposition is more suitable for highlighting the importance of batch resampling. That is to say, if we increase the sampling probability of the head class based on Eq. 7, then without batch resampling, the strength of the head-to-tail transfer would be constrained.\n\n\n\n\n> The sentence \"Intuinitively (intuitively, I guess), improving the score weight of head-class samples for the noisy $x_t$ from tail-class samples, increases the generation diversity of tail categories\" is not clear at all. What is \"improving\" the score weight? Is it increasing the value of the score weight? If so, how is it related to increasing the generation diversity?\n\n- We re-write and re-organize the section here, and trying to make the illustration more clear. In essence, our objective here is to enable the score of the current noisy tail sample, as demonstrated in Proposition 3.1,  encourging the head-to-tail transfer in order to promote the tail generation diversity.\n\n\n### W2 and Q2\n>Again, probably related to the first point, I don't see how the proposed method yields a valid regression target. The algorithm seems to be a heuristics without considering correctness.\n\n> The introduction of the selection procedure (equation (11)) comes without sufficient explanation. If I have to understand it, the random sampling for $z$ can be understood as a Monte-Carlo estimator of equation (8); But then the proposed algorithm alters the target score if $q(z_y) \\geq q(y_i)$; as a result, the target of the score estimation becomes something different, yielding a biased estimator of the original target. Is this intended? If so, how do you guarantee that the proposed algorithm is learning a correct target?\n\nThanks for the comments. In fact, theoretically we want to acquire a $\\nabla_{x_t}\\log q^{\\star}(x_t|y)$ under full balanced distribution so it is truely a biased estimator of initial $\\nabla_{x_t}\\log q(x_t|y)$ with long tailed distribution. Empirically, we improve the head class samples contribution in Eq. 6 to augment the tail sample generation. We first transform the score mixing as a score selection way and then alter the target intentionally. We verify the validity and correctness of our target transfer from three aspects:\n- The score transfer here is based on a Gaussian Kernel $\\exp - \\frac{||x_t-x_0||^2_2}{2\\sigma_t^2}$, which ensures a certain degree of **similarity between the transfer target and the original image** for a given time step. As detailed discussed in the Appendix H.1, **the L2 norm of transferred target and initial target** is constrained by an upper limit of sampling probability:\n$$||x _0-x _z|| _2^2  \\leq -2\\sigma _t^2(\\log (p _t ~ p _{sel}(z))+\\log (p _t+p _{sel}(z)) + 2\\log \\sigma _t)$$\nhere $p _t$ and $p _{sel}(z)$ are the two sampling probability during the training process. \n- Furthermore, under the single target denoising condition, the current noisy sample **$x_t$ still has a relatively high probability $p_t^z$ of being obtained by adding noise to the transferred target**, as detailed illustrated in Appendix H.2:\n$$p_t^z \\geq \\frac{p_{sel}(z)~p_t}{1-p_{sel}(z)}.$$\nThe equation means the current $x_t$ is also likely to obatain from $x_z$ under the single one-to-one noisy clean pairs training strategy.\n- Our target transfer only occurs after 400 steps; essentially, there is no transfer within the first 400 steps, as shown in the left subfigure of Figure. 6. This evidence also make sure the stability of the target."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1786/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700348098922,
                "cdate": 1700348098922,
                "tmdate": 1700567144921,
                "mdate": 1700567144921,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "uHgGgMlYAb",
                "forum": "NW2s5XXwXU",
                "replyto": "L7ZMuNzRMQ",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1786/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1786/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer PNyr[2/2]"
                    },
                    "comment": {
                        "value": "### W3\n> Batch-Resample cannot be considered a novel contribution, as it is one of the standard approaches one could take for a problem involving a long-tailed dataset (e.g., long-tailed image classification).\n\nWe recognize that Batch Re-sample is a widely adopted technique for addressing long-tail issues. However, its application and impact in the context of long-tailed generative modeling, especially within diffusion models, remain underexplored. Nonetheless, the application of Batch Re-Sample in long-tail generation remains an un-explored area, especially **concerning its potential to alleviate the score dominance of head class samples in unconditional generation and to facilitate the transfer from head to tail classes** in conditional generation, which is studied firstly in our work. \n\n### Q3\n> In the beginning you assumed $q(x_t|x_0, y_0) \\propto B q(y_0)^\\beta \\exp(-\\Vert x_t-x_0\\Vert_2^2/2\\sigma_t^2)$, but $p_\\text{sel}(z)$ described to computed only with $C \\exp(-\\Vert x_z-x_t\\Vert_2^2/2\\sigma_t^2)$ without $q(y)^\\beta$ term. Is this a typo or am I missing something here? \n\nSorry for the confusion. Our aim is to reasonably increase the contribution of head samples in score mixing. Therefore, after transforming score mixing into score selection, we adopted a more direct method. **The approach of T2H permits targets to transfer only to the head classes, but exclusively under the L2 distance of the Gaussian Kernel**. Naturally, we also conducted experiments based on the Eq. 7 with $q(y_0)$ involved, as shown in the Figure 4. The result of $\\beta=1$ aligns perfectly with T2H. In the new version of the section, we are trying to make it more clear. \n\n### Q4\n> Similarly, I don't get the intuition behind the H2T, since from the beginning I failed to follow how Proposition 3.1 is linked to the T2H. What is the meaning of setting $\\beta=-1$ and why is it beneficial for unconditional sampling?\n\nThank you for the comments. The answers are listed below:\n- **About $\\beta=-1$ for H2T**\nWhen beta is set to -1, the smaller $q(y_T)$of tail class samples results in an increased probability of $q(x_t|x_T,y_T)$ from Eq. 7 in the batch as $x^{-1}$ is a decreasing function. Consequently, for a noisy head sample, **the contribution of the tail sample targets are enhanced**, corresponding to H2T algorithm.\n- **Why $\\beta=-1$ is beneficial for unconditional generation**\nIn unconditional generation, unlike conditional generation where labels are involved, **achieving balance is the greatest challenge**. As shown in the table below, for the imbalanced cifar10lt dataset we used, the FID score with a balanced reference set is significantly higher compared to a balanced dataset based on conditional generation. Therefore, the primary challenge in unconditional generation is to **generate samples more evenly across all categories**. However, training an unconditional model directly with a long tail dataset means that in the space, the score for a noisy sample is **predominantly influenced by the head samples**. To address this, we incorporate the H2T (Head to Tail) strategy, which enhances the tendency to generate tail samples, thereby better **ensuring the balance of the generated dataset**.\n\n**FID scores&thinsp;$\\downarrow$ with balanced and non-balanced datasets**\n|    Reference Dataset     | No-Bal reference Set | Bal Generation DataSet |\n|:------------------------:|:--------------------:|:----------------------:|\n| No-Bal reference DataSet |          -           |         33.19          |\n|  Bal reference DataSet   |        26.22         |          8.38          |\n### Q5\n> The experiments mostly show the results of T2H on class conditinal generation and H2T for unconditional generation, but how do they work for opposite settings (T2H for unconditional and H2T for conditional)? Is the direction of transfer matters? Or both direction helps in either cases, but the effectiveness of transfer may vary depending on the task?\n\nThank you for the comments. The answers are listed below:\n- **Conditional and Unconditional work for opposite settings**\nAs previously discussed, achieving a balanced generation is crucial in the realm of unconditional generation. The 'Head to Tail' (H2T) approach effectively **balances the generation tendency towards tail classes**. In contrast, for conditional generation, attaining label balance is more straightforward, as it can be managed by generating an equal number of samples for each class. However, the primary challenge in conditional generation lies in the **limited diversity of samples in the tail categories**. \n\n- **Effectiveness of transfer**\nYes, both direction helps in either cases. However, owing to **the difference for the main challenge of unconditional and conditional tasks**, the effectiveness of the H2T and T2H approaches varies under the two different scenarios"
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1786/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700348284860,
                "cdate": 1700348284860,
                "tmdate": 1700567316460,
                "mdate": 1700567316460,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "KFOS8ErT9x",
                "forum": "NW2s5XXwXU",
                "replyto": "uHgGgMlYAb",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1786/Reviewer_PNyr"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1786/Reviewer_PNyr"
                ],
                "content": {
                    "title": {
                        "value": "Response"
                    },
                    "comment": {
                        "value": "I appreciate the authors' response which resolves some of my concerns (especially on presentation);\nI strongly recommend enhancing the presentation further. I increase my score accordingly."
                    }
                },
                "number": 8,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1786/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700576568373,
                "cdate": 1700576568373,
                "tmdate": 1700576568373,
                "mdate": 1700576568373,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "rhha64ZzN5",
            "forum": "NW2s5XXwXU",
            "replyto": "NW2s5XXwXU",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission1786/Reviewer_i52Z"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission1786/Reviewer_i52Z"
            ],
            "content": {
                "summary": {
                    "value": "This paper addresses the problem of long tail diffusion model generation. In this paper, a directional calibration for the estimation of\nnoisy tail sample score is performed towards the clean head samples (T2H), leveraging the similarity within the data distribution from head to tail classes."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. This paper propose a strategy denoted as ”Batch Resample” to sample a more balanced reference batch. \n2.This paper has developed a method denoted as T2H based on the multi-target nature of score estimation to effectively calibrate and enhance the generation of tail classes in the semantic formation period, thereby significantly improving the overall generation performance."
                },
                "weaknesses": {
                    "value": "1. The paper introduces two optimization methods, Batch Resample and T2H. The Batch Resample is a common solution to the long-tailed problem, and it does not seem to bring any novelty. \n2. There is a lack of connection between the proof and implementation of T2H, especially the transition from equation 10 to equation 11.\n3. The author lacks experimental validation on large-scale datasets."
                },
                "questions": {
                    "value": "1. T2H enhances the quality of image generation for the current category by calculating the multi-nominal distribution in Equation 11, and then samples $z$ from this distribution, and selecting categories $y_z$ with a sample density greater than that of the category $y_i$. While the authors provide detailed theoretical proof, the transition from equation 10 to equation 11 seems to lack coherence. When sampling z, why not model the distribution based on the similarity between the original images (the current sample image and other images in the batch, as in equation 10), rather than through the noisy version of the current sample image and other images in the batch?\n2. In the T2H method mentioned, the distribution $p_{sel}(z)$ adds weight to the other images within the batch, encouraging similar images to have a greater influence on the current sample. So, what would happen if we do not consider the distribution $p_{sel}(z)$ and assume that all images will have an effect? Also, if we keep the distribution $p_{sel}(z)$ unchanged and assume that all $y_z$ will have an impact, not just those with a high sample density, would this be more reasonable?\n3. The authors seem to lack an analysis in their experiments regarding how much growth the proposed solutions have brought to both the head and tail categories in the dataset, respectively.\n4. How effective are the proposed methods on larger datasets (ImageNet-LT)?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission1786/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698742979144,
            "cdate": 1698742979144,
            "tmdate": 1699636107890,
            "mdate": 1699636107890,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "gyYDd11nuP",
                "forum": "NW2s5XXwXU",
                "replyto": "rhha64ZzN5",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1786/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1786/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer i52Z[1/2]"
                    },
                    "comment": {
                        "value": "### W1\n> The paper introduces two optimization methods, Batch Resample and T2H. The Batch Resample is a common solution to the long-tailed problem, and it does not seem to bring any novelty.\n\nWe recognize that Batch Re-sample is a widely adopted technique for addressing long-tail issues. However, its application and impact in the context of long-tailed generative modeling, especially within diffusion models, remain underexplored. In Proposition 3.1, we introduce an upper bound formulation for the rebalancing process. This framework ensures the feasibility of optimization when batch rebalancing is employed in these models.\n\n\n## W2 & Q1\n> There is a lack of connection between the proof and implementation of T2H, especially the transition from equation 10 to equation 11.\n\n> T2H enhances the quality of image generation for the current category by calculating the multi-nominal distribution in Equation 11, and then samples $z$ from this distribution, and selecting categories $y_z$ with a sample density greater than of the category $y_i$. While the authors provide detailed theoretical proof, the transition from equation 10 to equation 11 seems to lack coherence. When sampling z, why not model the distribution based on the similarity between the original images (the current sample image and other images in the batch, as in equation 10), rather than through the noisy version of the current sample image and other images in the batch?\n\nThanks for your comments. The answers are listed below:\n- **Lack of coherence from Eq.10 to Eq.11**\nThank you for pointing out this gap and we agree with this point. To Illustrate the 'Tail to Head' (T2H) concept more clearly, we have rewritten this section and incorporated illustrative diagrams, as shown in Figure 3. The motivation of T2H is to **improve the head samples contributions in the tail sample generation**. For Proposition 3.1, We believe that it is more appropriate to **demonstrate the enhancement for the strength of the transition from head to tail for batch resample**.\n\n- **Clean sample similarity**\nUtilizing the similarity between head and tail samples is indeed one of the core motivations of our work. However, the diffusion model generates images with a denoising process. Our approach make use of this evidence to different noise levels for better capture the similarity between them. Actually, **the transferred clean sample $x_z$ obtained using our method exhibits a certain degree of similarity with the original clean target $x_0$, measured with L2 norm** as:\n$$||x _0-x _z|| _2^2  \\leq -2\\sigma _t^2(\\log (p _t ~ p _{sel}(z))+\\log (p _t+p _{sel}(z)) + 2\\log \\sigma _t)$$\nwhere $p _t$ and $p _{sel}(z)$ are the two sampling probability during the training process. The detailed proof is provided in Proposition H.1in Appendix. H.\n\nThe sampling distribution is derived from Equations (5) and (6), with Equation (10) from Proposition 3.1 serving to interpret this distribution. That is, the sampling distribution is influenced by both the label $q(y)$ and clean image similarity. To clarify this concept, we made the following adjustments:\n\n- We move Eq (11) to the paragraph ahead of Eq (10). Now it is placed in Eq (8) and we use Figure 3 to illustrate the $p_{sel}(z)$. \n\n- We move proposition 3.1 in front of the paragraph of Batch Re-sample, explaining the motivation of batch resample technique. \n\n\n### Q2\n> In the T2H method mentioned, the distribution $p_{sel}(z)$ adds weight to the other images within the batch, encouraging similar images to have a greater influence on the current sample. So, what would happen if we do not consider the distribution $p_{sel}(z)$ and assume that all images will have an effect? Also, if we keep the distribution $p _{sel}(z)$ unchanged and assume that all $y_z$ will have an impact, not just those with a high sample density, would this be more reasonable?\n\nThanks for your comments. Actually, considering the effect from all samples on the present score is precisely what Eq. 6 illustrates. The $p _{sel}(z)$ comes from the normalized weight from the individual score in Eq. 6 and we **transform the weighted mixing problem to a score selection problem with the mixing weight as the selection probability**. I don't quite understand what is \"do not consider the distribution $p _{sel}(z)$\". Is that means $p _{sel}(z)$ follows a certain distribution?\n    1) if $p _{sel}(z)$ follows a delta distribution $\\delta _z^i$, which means the $p _{sel}^z = 1$ when $z=i$, then this would degrade into base DDPM.\n    2) if $p _{sel}(z)$ follows a uniform distribution(is this all $y _z$ have a impact?) without weighted, then the score is estimated with all scores averaging among all samples, then the generation will reach the average of the dataset. \n    \nIf we assume all $y_z$ has a impact based on Eq. 6 instead of samples with higher densities, that is the $\\beta=0$ in Figure 5. The performance is weaker than directly utilizing $\\beta=1$ or T2H for conditional generation."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1786/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700347773757,
                "cdate": 1700347773757,
                "tmdate": 1700566511590,
                "mdate": 1700566511590,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "KvMX95fw5Y",
                "forum": "NW2s5XXwXU",
                "replyto": "rhha64ZzN5",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1786/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1786/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer i52Z[2/2]"
                    },
                    "comment": {
                        "value": "### Q3\n> The authors seem to lack an analysis in their experiments regarding how much growth the proposed solutions have brought to both the head and tail categories in the dataset, respectively.\n  \nThank you very much for the advice. We have added a detailed performance table for seperate classes on CIFAR10LT, where the $q(y)$ is the class frequency for discriminating the head and tail categories.\n\n| Class   | Airpl | Auto  | Bird  | Cat   | Deer  | Dog   | Frog  | Horse | Ship   |\n|---------|-------|-------|-------|-------|-------|-------|-------|-------|--------|\n| $q(y)$   | 0.403 | 0.241 | 0.145 | 0.086 | 0.052 | 0.031 | 0.018 | 0.01  | 0.0067 |\n| BaseFID | 31.49 | 15.20  | 40.82  | 32.32 | 32.32 | 36.34 | 40.47 | 23.21  | 26.31  |\n| T2H     | 31.84 | 14.58 | 19.42 | 28.32 | 18.31  | 26.83 | 29.91  | 17.70  | 21.04  |\n\nAs you could see from the table, **except for the first class with largest label frequency, our method has promoted the performance of all remaining classes**. Besides, We also conducted an analysis of the FID scores for each class under a different assignment of head and tail categories. **The detailed information could be found in Appendix. F**.\n\n### W3 & Q4\n> The author lacks experimental validation on large-scale datasets.\n\n> How effective are the proposed methods on larger datasets (ImageNet-LT)?\n\nWe have added one experiments on ImageNet-LT dataset. The following table lists the results. Our results on large-scale are consistent to the observations on small-scale data, which validates the effectiveness of our method at scale.\n\n| Method    | FID &thinsp;$\\downarrow$  | IS &thinsp;$\\uparrow$    |\n|:---------:|:-----:|:------:|\n| base DDPM | 26.95 | **15.99**  | \n| CBDM      | 26.12 | 15.86  | \n| T2H(Ours) | **25.42** | 15.96  |\n\nWe have included this experiment and presented more discussion in Appendix. I."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1786/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700347893152,
                "cdate": 1700347893152,
                "tmdate": 1700566679053,
                "mdate": 1700566679053,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]