[
    {
        "title": "Semi-HyperGraph Benchmark: Enhancing Flexibility of Hypergraph Learning with Datasets and Benchmarks"
    },
    {
        "review": {
            "id": "KpfjmvlB4B",
            "forum": "NX0eNGXezp",
            "replyto": "NX0eNGXezp",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6950/Reviewer_Smxv"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6950/Reviewer_Smxv"
            ],
            "content": {
                "summary": {
                    "value": "The paper introduces the Semi-HyperGraph Benchmark (SHGB) to unify graph and hypergraph benchmarks, attempting to bridge an existing gap where these benchmarks are considered separately in the literature.\n\nSHGB integrates real-world datasets featuring both pairwise edges and hyperedges, enabling researchers to thoroughly assess Graph Neural Networks (GNNs) using a combination of edges and hyperedges.\n\nExperiments reveal that \n* GNNs on hypergraphs may not consistently outperform simple graph GNNs on large networks, \n* sampling strategies enhance GNN performance on hypergraphs, and \n* combining edge and hyperedge information improves predictions on complex graphs."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "### Clarity\n1. The paper provides a clear demonstration of edge and, more crucially, hyperedge construction through clear illustrations in Figures 1 and 2.\n2. The SHGB framework is effectively outlined in Figure 3, ensuring a clear and concise understanding of its structure and components.\n3. The paper is well-structured into clear sections, guiding readers logically from the introduction to the conclusion, ensuring a thorough understanding of the research content."
                },
                "weaknesses": {
                    "value": "### Originality\n1. The hyperedges in the datasets are *not natural* but derived from social networks' simple edges, a specified base pair distance in gene data, and e-commerce product image embeddings, which can be modelled as node features. \n2. The hyperedges introduced can be obtained solely from *appropriately chosen graph data and node features*, limiting the originality of the curated hyperedges.\n3. The HypergraphSAINT sampler is a straightforward application of GraphSAINT [Zeng et al., 2020] to hyperedges.\n\n$~$\n### Significance\n4. Appropriately chosen GNNs (e.g., subgraph GNNs, MixHop, JKNets) on meticulously chosen graph datasets would be able to model the information given by the curated hyperedges, limiting the benchmark's potential impact.\n5. The significance of the work can be improved by the inclusion of recent hypergraph neural networks [e.g., Chien et al., 2022, Wang et al., 2023] that generate hyperedge embeddings to fully exploit hyperedges.\n\n$~$\n### Quality\n6. Contrary to the stated claim of extending hypergraphs with simple edges, e.g., see contribution 1 on page 2, the actual contribution involves integrating *curated hyperedges* with *naturally occurring edges* such as mutual followers in social networks and regulatory effects between genes in biological networks.\n7. Four different GNNs on pairwise edges are tested in the experiments, whereas the selection of GNNs on hyperedges is restricted to those introduced in a single paper [Bai et al., 2021], further emphasising simple edges over hyperedges.\n\n\\\nReferences:\n* [Wang et al., 2023]: Equivariant Hypergraph Diffusion Neural Operators, ICLR'23\n* [Chien et al., 2022]: You are AllSet: A Multiset Function Framework for Hypergraph Neural Networks, ICLR'22\n* [Bai et al., 2021]: Hypergraph convolution and hypergraph attention, Pattern Recognition'21\n* [Zeng et al., 2020]: GraphSAINT: Graph Sampling Based Inductive Learning Method, ICLR'20"
                },
                "questions": {
                    "value": "1. From a pure dataset perspective, what unique information do the hyperedges contribute that is not already represented by carefully/appropriately/meticulously chosen graph data and node features?\n2. From a pure dataset perspective, are there unique insights into the specific reasons for choosing social networks' friend circles from pairwise edges, gene data within a user-specified base pair distance, and e-commerce product image embeddings as sources for deriving hyperedges?\n3.  Have there been examples or scenarios where such derived hyperedges have demonstrated real-world applicability or have been utilised successfully in practical applications?\n4. Considering the potential benefits of incorporating recent hypergraph neural networks [e.g., Chien et al., 2022, Wang et al., 2023], are there any challenges or limitations associated with their implementation, and if so, how could these challenges be addressed to ensure seamless integration into the proposed SHGB framework?\n5. In what ways do the hyperedges complement or enhance the information captured by naturally occurring edges, such as mutual followers in social networks and regulatory effects between genes in biological networks? \n6. In addition to Table 3, are there specific examples or case studies where this integration has led to unique insights or improved predictions compared to utilising simple edges alone?\n7. Why was the selection of GNNs for hyperedges limited to those introduced in a single paper [Bai et al., 2021]? \n8. Were there specific criteria or reasons for this restriction, and how does this choice impact the overall diversity and representation of GNN models applied to hyperedges?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6950/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1697552732568,
            "cdate": 1697552732568,
            "tmdate": 1699636811341,
            "mdate": 1699636811341,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "uqhjYiWLvw",
                "forum": "NX0eNGXezp",
                "replyto": "KpfjmvlB4B",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6950/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6950/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer Smxv (1)"
                    },
                    "comment": {
                        "value": "Thank you for your detailed review and insightful comments. Please kindly see below for our responses to your comments:\n\n### 1. From a pure dataset perspective, what unique information do the hyperedges contribute that is not already represented by carefully/appropriately/meticulously chosen graph data and node features?\n\nThe hyperedges contribute unique information for complex graphs from the following two perspectives:\n\n1. **Hyperedges can capture local clustering and homophilic properties of complex graphs more directly than simple edges.** As a simple edge can only connect two nodes, additional pre-computations are required to detect local clustering relations between multiple nodes if only simple edges are present, which could inevitably lead to a higher demand on compute resources and potentially hurt the training performance. In the MUSAE datasets of SHGB, we have pre-computed the hyperedges so that both works on simple graph GNNs and hypergraph GNNs can benefit from these datasets, and can be evaluated on a unified benchmark.\n2. **Hyperedges can contribute information about complex graphs from another perspective or even another data modality.** In the GRAND datasets of SHGB, hyperedges are constructed based on the geometric information of genes, while the node embeddings are constructed from the gene sequences, and the simple edges represent gene regulatory effects. In the Amazon datasets of SHGB, hyperedges are generated from another modality (image) from the node embeddings (text), whereas simple edges represent ground-truths about co-reviews and co-purchases. We have shown in Tables 3 and 12-17 that combining information from different perspectives or modalities can significantly improve the learning performance than only learning one of the two information views. In addition, if the hyperedges that come from a different modality are naively encoded into the node embeddings, it would create extra difficulties for a GNN to thoroughly learn both information, thereby potentially limiting its performance.\n\n### 2. From a pure dataset perspective, are there unique insights into the specific reasons for choosing social networks' friend circles from pairwise edges, gene data within a user-specified base pair distance, and e-commerce product image embeddings as sources for deriving hyperedges?\n\nThe hyperedges are constructed in three diverse processes in the three groups of our SHGB, which covers a wide range of unique insights for complex graph learning:\n\n- In the MUSAE datasets of SHGB, we construct hyperedges by pre-computing the clustering information from simple edges, which create conveniences for both simple graph GNN and hypergraph GNN works, and allow them to be evaluated under a unified benchmark.\n- In the GRAND datasets of SHGB, in addition to the simple edges that represent gene regulatory effects, we construct hyperedges from another perspective, which is the geometric information of the genes. Geometric information of the genes are unique and critical in gene regulatory element predictions and cannot be neglected. In addition, building geometric information into hyperedges can capture multi-node clustering information of the genes more directly then modelling them into positional encodings in individual node embeddings.\n- In the Amazon datasets of SHGB, the hyperedges are constructed from another data modality (image) from the node embeddings (text), which encourages the community to combine those information to perform multimodal learning on complex graphs.\n\n### 3. Have there been examples or scenarios where such derived hyperedges have demonstrated real-world applicability or have been utilised successfully in practical applications?\n\nWe have demonstrated in Section 4.2, Figure 4 and Appendix C of our paper that hypergraph GNNs perform better than simple graph GNNs in the Amazon datasets, equally in the GRAND datasets, and underperform in the MUSAE datasets. Therefore, we have shown that in the Amazon datasets, our derived hyperedge information contributes more to the prediction tasks than the simple edges and have already been utilised successfully. We would also like to use MUSAE and GRAND to challenge the hypergraph learning community, where the success of the existing works cannot be fully generalised to other domains and on a larger scale.\n\nFurthermore, we have demonstrated with our simple baseline model (LP-GNNs) which integrate simple edge and hyperedge information and can already improve the node prediction performance than pure simple graph GNNs and pure hypergraph GNNs. This shows that the our derived hyperedge information can be successfully utilised by combining with simple edge information, and highlights a great potential for future research.\n\n(To be continued in the next response)"
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6950/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700653130508,
                "cdate": 1700653130508,
                "tmdate": 1700653130508,
                "mdate": 1700653130508,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "zFqcZjuY4G",
                "forum": "NX0eNGXezp",
                "replyto": "KpfjmvlB4B",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6950/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6950/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer Smxv (2)"
                    },
                    "comment": {
                        "value": "(Continued from the previous response)\n\n### 4&7&8. Considering the potential benefits of incorporating recent hypergraph neural networks [e.g., Chien et al., 2022, Wang et al., 2023], are there any challenges or limitations associated with their implementation, and if so, how could these challenges be addressed to ensure seamless integration into the proposed SHGB framework? Why was the selection of GNNs for hyperedges limited to those introduced in a single paper [Bai et al., 2021]? Were there specific criteria or reasons for this restriction, and how does this choice impact the overall diversity and representation of GNN models applied to hyperedges?\n\nThank you very much for pointing out the more recent hypergraph GNNs in addition to the models that we have originally included [Bai et al., 2021]. We originally selected [Bai et al., 2021] as our experimented baselines for hypergraph GNNs, as it was a classical and representative work on hypergraph GNNs, and have been used as baselines in many hypergraph GNN works [Chien at el., 2022; Wang et al., 2023]. According to your recommendations, we have now also included the results of ED-HNN [Wang et al., 2023] in our revised paper, which are also reported below:\n\n| MUSAE Dataset | ED-HNN Accuracy | Best Simple GNN Accuracy  | Best Hyper GNN Accuracy | Best LP-GNN Accuracy |\n| --- | --- | --- | --- | --- |\n| GitHub | 0.862 ± 0.001 | 0.872 ± 0.000 (GCN) | 0.808 ± 0.001 (HyperConv) | 0.872 ± 0.000 (GCN+HyperConv) |\n| Facebook | 0.861 ± 0.004 | 0.902 ± 0.002 (GraphSAGE) | 0.792 ± 0.001 (HyperConv) | 0.905 ± 0.000 (GAT+HyperConv) |\n| Twitch_FR | 0.629 ± 0.011 | 0.625 ± 0.001 (GATv2) | 0.624 ± 0.002 (HyperConv) | 0.626 ± 0.000 (GCN+HyperConv) |\n| Twitch_EN | 0.603 ± 0.011 | 0.620 ± 0.003 (GCN) | 0.587 ± 0.007 (HyperConv) | 0.608 ± 0.003 (GAT+HyperConv) |\n| Twitch_ES | 0.722 ± 0.013 | 0.721 ± 0.004 (GCN) | 0.715 ± 0.001 (HyperConv) | 0.729 ± 0.001 (GCN+HyperConv) |\n| Twitch_PT | 0.695 ± 0.015 | 0.689 ± 0.006 (GCN) | 0.701 ± 0.005 (HyperConv) | 0.696 ± 0.004 (GCN+HyperConv) |\n| Twitch_RU | 0.751 ± 0.015 | 0.746 ± 0.002 (GraphSAINT) | 0.743 ± 0.000 (HyperAtten) | 0.744 ± 0.000 (GCN+HyperConv) |\n| Twitch_DE | 0.681 ± 0.006 | 0.657 ± 0.001 (GraphSAGE) | 0.654 ± 0.002 (HyperConv) | 0.657 ± 0.001 (GCN+HyperConv) |\n\n| GRAND Datasets | ED-HNN Accuracy | Best Simple GNN Accuracy | Best Hyper GNN Accuracy | Best LP-GNN Accuracy |\n| --- | --- | --- | --- | --- |\n| ArteryAorta | 0.667 ± 0.013 | 0.630 ± 0.000 (GATv2) | 0.647 ± 0.003 (HyperAtten) | 0.649 ± 0.001 (GAT+HyperConv) |\n| ArteryCoronary | 0.667 ± 0.015 | 0.663 ± 0.000 (GAT) | 0.670 ± 0.003 (HyperAtten) | 0.664 ± 0.001 (GAT+HyperConv) |\n| Breast | 0.661 ± 0.014 | 0.644 ± 0.000 (GraphSAGE) | 0.645 ± 0.001 (HyperConv) | 0.657 ± 0.001 (GAT+HyperConv) |\n| Brain | 0.663 ± 0.013 | 0.625 ± 0.000 (GCN) | 0.632 ± 0.003 (HyperAtten) | 0.645 ± 0.001 (GAT+HyperConv) |\n| Leukemia | 0.603 ± 0.013 | 0.604 ± 0.016 (GraphSAGE) | 0.593 ± 0.008 (HyperAtten) | 0.604 ± 0.004 (GCN+HyperConv) |\n| Lung | 0.670 ± 0.010 | 0.650 ± 0.000 (GCN) | 0.661 ± 0.004 (HyperAtten) | 0.662 ± 0.002 (GAT+HyperConv) |\n| Stomach | 0.661 ± 0.006 | 0.643 ± 0.000 (GCN) | 0.643 ± 0.000 (HyperConv) | 0.656 ± 0.002 (GAT+HyperConv) |\n| LungCancer | 0.602 ± 0.014 | 0.615 ± 0.015 (GraphSAGE) | 0.608 ± 0.008 (HyperAtten) | 0.618 ± 0.003 (GAT+HyperConv) |\n| StomachCancer | 0.610 ± 0.011 | 0.602 ± 0.007 (GCN) | 0.604 ± 0.022 (HyperAtten) | 0.621 ± 0.002 (GAT+HyperConv) |\n| KidneyCancer | 0.603 ± 0.011 | 0.596 ± 0.014 (GraphSAGE) | 0.578 ± 0.012 (HyperAtten) | 0.621 ± 0.002 (GAT+HyperConv) |\n\n| Amazon Dataset | ED-HNN Accuracy | Best Simple GNN Accuracy  | Best Hyper GNN Accuracy | Best LP-GNN Accuracy |\n| --- | --- | --- | --- | --- |\n| Photo | 0.786 ± 0.012 | 0.512 ± 0.141 (GraphSAINT) | 0.465 ± 0.033 (HyperAtten) | 0.715 ± 0.003 (GAT+HyperConv) |\n| Computer | 0.973 ± 0.002 | 0.875 ± 0.020 (GraphSAINT) | 0.842 ± 0.020 (HyperConv) | 0.930 ± 0.007 (GAT+HyperConv) |\n\nThe performance of ED-HNN is indeed better on HyperConv and HyperAtten, and becomes the only hypergraph GNN that outperforms simple graph GNNs on the GRAND datasets. In general, the results of ED-HNN is still consistent with the findings in our paper: it outperforms simple graph GNNs on GRAND-Tissues and Amazon, equally on MUSAE-Twitch and GRAND-Diseases, and underperform on MUSAE-GitHub and MUSAE-Facebook. In addition, our LP-GNNs, despite using only HyperConv as its hypergraph GNN component (which is less powerful than ED-HNN), can still outperform or match the performance of ED-HNN in many datasets, which clearly reinforce our claim that combining simple edge and hyperedge information can significantly improve complex graph learning performance. We believe that more appropriate and advanced hypergraph methods, such as ED-HNN, can also be combined with LP-GNN to further improve its performance, but this is beyond the scope of this paper.\n\n(To be continued in the next response)"
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6950/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700653370336,
                "cdate": 1700653370336,
                "tmdate": 1700653370336,
                "mdate": 1700653370336,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "670C9kI80h",
                "forum": "NX0eNGXezp",
                "replyto": "KpfjmvlB4B",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6950/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6950/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer Smxv (3)"
                    },
                    "comment": {
                        "value": "(Continued from the previous response)\n\n### 5&6. In what ways do the hyperedges complement or enhance the information captured by naturally occurring edges, such as mutual followers in social networks and regulatory effects between genes in biological networks? In addition to Table 3, are there specific examples or case studies where this integration has led to unique insights or improved predictions compared to utilising simple edges alone?\n\nIn the MUSAE datasets of SHGB, our hyperedges extracts the clustering information from the simple edges, which serves as a complement to the simple edges, as otherwise algorithms wishing to utilise hyperedge information would have to explicitly compute those hyperedges.\n\nIn the GRAND and Amazon datasets of SHGB, the geometric information of genes and image embeddings of the products are not captured by their simple edges or node embeddings, so our hyperedges provide not only a complement to the simple edges, but also an enhancement to the overall information, thereby helps in improving the learning performance.\n\nIn addition to Table 3, we have also provided full results of LP-GNNs on all datasets in Tables 12-17 of Appendix C. Notably, LP-GAT+HyperConv and LP-GCN+HyperConv surpass the other methods in 18 of the 23 graphs. These results underscore the benefits of multi-level information integration in hypergraph representation learning. Besides, LP-GAT+HyperConv and LP-GCN+HyperConv also consistently outperform LP-GCN+GAT, showing that it is genuinely the integration of both simple edge and hyperedge information that contributes to the improved prediction performance, rather than arbitrarily integrating two node embeddings.\n\nWe have now included the clarifications of whether these hyperedges are complementary or enhancing in Section 3.2 of our paper.\n\nWe hope our response and additional results can sufficiently resolve your concerns. We sincerely appreciate it if you could kindly consider improving the score, and are very happy to answer any further questions you may have.\n\n[Bai et al., 2021]: Hypergraph convolution and hypergraph attention, Pattern Recognition'21\n\n[Chien et al., 2022]: You are AllSet: A Multiset Function Framework for Hypergraph Neural Networks, ICLR'22\n\n[Wang et al., 2023]: Equivariant Hypergraph Diffusion Neural Operators, ICLR'23"
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6950/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700653443586,
                "cdate": 1700653443586,
                "tmdate": 1700653443586,
                "mdate": 1700653443586,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "le93yVOPli",
            "forum": "NX0eNGXezp",
            "replyto": "NX0eNGXezp",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6950/Reviewer_3S38"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6950/Reviewer_3S38"
            ],
            "content": {
                "summary": {
                    "value": "The paper proposes datasets that contains hyperedges and simple edges for GNNs. The paper reads well but motivation for proposing the \ndatasets combining hypergraphs and simple edges is unclear.  Datasets are not from the real-world. Insights for future research are not unclear.  Authors should fix the download links for codes and datasets."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "S1. Datasets cover various domains.\n\nS2. The paper reads well."
                },
                "weaknesses": {
                    "value": "W1. Motivation for proposing semi-hypergraphs is unclear.  Real-world applications for semi-hypergraphs are not discussed. Or importance of semi-hypergraphs for future research is not discussed. See Q1.\n\nW2. Datasets are not effective for GNNs. See Q2.\n\nW3. Datasets are not from the real-world but generated by rules and algorithms. See Q3. \n\nW4. Insights for future research is not clear. See Q4."
                },
                "questions": {
                    "value": "Q1: Can authors show real-world applications for semi-hypergraphs? Or can authors show evidences for that proposing semi-hypergraphs is important for future research?\n\nQ2: Figure 4 (a) shows that for most of the datasets, Hyper GNNs and simple GNNs have almost the same accuracy. Can authors give comments on this?\n\nQ3: Can authors explain why not search for real-word datasets but generate by rules or algorithms?\n\nQ4: Can authors show the insights for future research?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission6950/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6950/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6950/Reviewer_3S38"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6950/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698737172527,
            "cdate": 1698737172527,
            "tmdate": 1699636811222,
            "mdate": 1699636811222,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "Sxc2RHXXBC",
                "forum": "NX0eNGXezp",
                "replyto": "le93yVOPli",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6950/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6950/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer 3S38 (1)"
                    },
                    "comment": {
                        "value": "Thank you for the attentive review and insightful questions. Please kindly see below for our responses to your comments:\n\n### Q1: Can authors show real-world applications for semi-hypergraphs? Or can authors show evidences for that proposing semi-hypergraphs is important for future research?\n\nMost real-world complex networks preserve a mixture of pairwise node relations (simple edges) and local clustering node relations (hyperegdes). The two different relations not only capture different information about the graph, but also normally come from different modalities. This makes the semi-hypergraphs a valuable augmentation to simple graphs by allowing them to contain hyperedges, in order to capture information in both edge types. In addition to the semi-hypergraphs provided by SHGB:\n\n- Social networks that contain both mutual connections (simple edges) and friend circles (hyperedges);\n- Gene regulatory networks that contain both regulatory effects (simple edges) and geometric information between nearby genes (hyperedges);\n- E-commerce networks that contain both co-purchase and co-review relations (simple edges) and similarity between the images of the products (hyperedges),\n\nThere are also many real-world applications for semi-hypergraphs including:\n\n- Citation networks with citations between two papers (simple edges) and multiple papers containing the same author (hyperegdes) [1];\n- Biological networks with pairwise associations and interactions between chemicals, diseases, genes and phenotypes (simple edges), are research articles where multiple nodes (i.e. chemicals, diseases, genes, phenotypes) and edges (i.e., pairwise associations and interactions) are studied (hyperedges) [2];\n- Product networks where simple edges connects the same products of different brands or the different products manufactured by the same brand, and hyperedges contain sets of products bought on the same shopping trips [1].\n\nSince the datasets in our SHGB already cover the same or similar domains of the above-mentioned applications, we did not include them in the first version of SHGB. However, we shall endeavour to update SHGB on a regular basis to include more real-world semi-hypergraphs in diverse domains.\n\n### Q2: Figure 4(a) shows that for most of the datasets, hyper GNNs and simple GNNs have almost the same accuracy. Can authors give comments on this?\n\nThe scatter plot in Figure 4(a) illustrates the comparisons of accuracies between the *best-performing* hypergraph GNNs and simple graph GNNs, rather than all GNNs. It shows that the best-performing hypergraph GNNs match the best-performing simple graph GNNs’ accuracies on GRAND, underperform on MUSAE, and outperform on Amazon. We would like to kindly direct the reviewer’s attention to Tables 6–11 in Appendix C for the detailed results of all GNNs on SHGB, which clearly demonstrate distinct performance levels among the GNNs, thereby indicating that the SHGB datasets are indeed effective for GNNs.\n\nWe have now updated the caption of Figure 4 to enhance clarity and avoid confusion.\n\n### Q3: Can authors explain why not search for real-word datasets but generate by rules or algorithms?\n\nExisting hypergraph datasets can be divided into two main categories in terms of how hyperegdes are constructed: ground-truth based and rule based. While ground-truth based dataset do exist, they are usually limited in specific domains, and normally do not support the hyperedges to be constructed from a different data modality than simple edges. The rule based hypergraph datasets also serve as an important part of the benchmarks and cannot be neglected [4].\n\nOur datasets, while closer to the second category, provide more concrete rules that can be regarded as “almost” ground-truths, rather than just looking at the embedding space (MUSAE & GRAND), and allow the simple edges and hyperedges to be formed from different modalities (Amazon). We shall endeavour to update SHGB on a regular basis to include more real-world semi-hypergraphs with hyperegdes constructed under ground truths.\n\nWe have now included the above explanations in Sections 2 and 3.2 of our paper to enhance its clarity.\n\n[1] Ilya Amburg, Nate Veldt, and Austin R. Benson. Clustering in graphs and hypergraphs with categorical edge labels. WWW 2020.\n\n[2] Davis AP, Wiegers TC, Johnson RJ, Sciaky D, Wiegers J, and Mattingly CJ. Comparative Toxicogenomics Database (CTD): update 2023. Nucleic Acids Res. URL: http://ctdbase.org/\n\n[3] Philip S. Chodrow, Nate Veldt, and Austin R. Benson. Generative hypergraph clustering: from blockmodels to modularity. Science Adwvances, 2021.\n\n[4] Yifan Feng, Haoxuan You, Zizhao Zhang, Rongrong Ji, Yue Gao. Hypergraph neural networks. AAAI 2019.\n\n(To be continued in the next response)"
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6950/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700652936217,
                "cdate": 1700652936217,
                "tmdate": 1700652936217,
                "mdate": 1700652936217,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "Nlf0FfmF7f",
                "forum": "NX0eNGXezp",
                "replyto": "le93yVOPli",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6950/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6950/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer 3S38 (2)"
                    },
                    "comment": {
                        "value": "(Continued from the previous response)\n\n### Q4: Can authors show the insights for future research?\n\nWe would like to highlight insights for future research from the following two perspectives:\n\n1. Datasets and benchmarks: \n    - We bring the notion of unifying the benchmarks for GNNs on different types of graphs (simple graphs, hypergraphs, and potentially other higher-order graphs), so that the graph representation learning community can use SHGB to conveniently and effectively evaluate whether a particular model designed to capture hyperedge information can indeed leverage the graph learning performance;\n    - To facilitate convenient and flexible evaluation under SHGB, we have built a concrete Python library for the users to access our datasets and evaluate within our framework, which is installable via pip (we are unable to disclose the library name for anonymity). We have mentioned this in Appendix D of our paper.\n2.  Algorithms:\n    - With the simple model (LP-GNNs) integrating simple edge and hyperedge information that can already improve the node prediction performance, we would like to encourage the community to have more in-depth investigations on improving hypergraph learning performance by combining simple edge and hyperedge information;\n    - We build the Amazon datasets where simple edges and hyperedges are constructing from different data modalities, in order to show the research insights of multimodal learning on graphs, and combining information from different modalities for improving graph learning performance.\n\nWe have now included the above insights in the Conclusion section of our paper, in order to make those insights explicit, and to enhance the clarity of our paper.\n\nWe sincerely appreciate it if you could kindly consider improving the scores if the above response can sufficiently address your concerns. We are very happy to answer any further questions you may have."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6950/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700652983439,
                "cdate": 1700652983439,
                "tmdate": 1700652983439,
                "mdate": 1700652983439,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "evTvl0YYvy",
            "forum": "NX0eNGXezp",
            "replyto": "NX0eNGXezp",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6950/Reviewer_RFzy"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6950/Reviewer_RFzy"
            ],
            "content": {
                "summary": {
                    "value": "This work aims to provide a more complete evaluation of hypergraph deep learning models. The approach includes a) constructing new hypergraph datasets that consist of both simple edges and clique-based hyperedges, b) comparing hypergraph neural networks and graph neural networks, and c) properly combining the two types of neural networks. The work also studies hypergraph sampling approaches for hypergraph NNs."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "+ It is a valid idea to build hypergraph datasets that hold both simple edges and hyperedges. \n\n+ It is novel to investigate hypergraph sampling approaches for hypergraph neural networks.\n\n+ It is reasonable to combine GNNs and hypergraph NNs to achieve overall best performance."
                },
                "weaknesses": {
                    "value": "- The work misses some solid foundations. First, the work seems unaware of how practical hypergraphs are typically models. The work only discusses those datasets used to evaluate hypergraph NNs but really misses the discussion on the entire area that studies hypergraph modeling, higher-order graphs for data analysis, e.g. [1][2].\n\n- Because the work is unaware of that area. The claim that \"using hyperedges may overlook simple pairwise node relations and thus make hypergraphs substantially lose useful graph information\" is overclaimed. Properly modeling hyperedges as sets and using complex set functions essentially cover simple pairwise relations as a special case [3]. The set representation is much more powerful in principle. The not-idea performance of hypergraph NNs as opposed to GNNs is just due to the non-idea way to construct hypergraphs and the suboptimality of hypergraph NNs. \n\n- Some recent more principled hypergraph NNs are missing to discuss, e.g. [4][5]. This is a weak point for a benchmark paper. \n\n[1] Higher-order organization of complex networks, Science 2016\n\n[2] Networks beyond pairwise interactions: Structure and dynamics, Physics Report, 2020\n\n[3] Submodular hypergraphs: p-laplacians, cheeger inequalities and spectral clustering, ICML 2018\n\n[4] Unignn: a unified framework for graph and hypergraph neural networks, IJCAI 2021\n\n[5] Equivariant Hypergraph Diffusion Neural Operators, ICLR 2023"
                },
                "questions": {
                    "value": "no specific questions. \n\nThe authors are suggested to extensively discuss relevant works to address the listed weaknesses."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6950/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698820292922,
            "cdate": 1698820292922,
            "tmdate": 1699636811078,
            "mdate": 1699636811078,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "VvU6Fpt1uC",
                "forum": "NX0eNGXezp",
                "replyto": "evTvl0YYvy",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6950/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6950/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer RFzy (1)"
                    },
                    "comment": {
                        "value": "Thank you for the thoughtful questions. Please kindly see below for our responses to your comments:\n\n### The work misses some solid foundations. First, the work seems unaware of how practical hypergraphs are typically models. The work only discusses those datasets used to evaluate hypergraph NNs but really misses the discussion on the entire area that studies hypergraph modeling, higher-order graphs for data analysis, e.g. [1][2]. Because the work is unaware of that area. The claim that \"using hyperedges may overlook simple pairwise node relations and thus make hypergraphs substantially lose useful graph information\" is overclaimed. Properly modeling hyperedges as sets and using complex set functions essentially cover simple pairwise relations as a special case [3]. The set representation is much more powerful in principle. The not-idea performance of hypergraph NNs as opposed to GNNs is just due to the non-idea way to construct hypergraphs and the suboptimality of hypergraph NNs.\n\nOur work is focused on the practical, data-driven ML applications on complex networks, and unifying the benchmarks of GNNs across different graph types. Based on this core focus of this work, we argue that simple edges should not be only taken as a special case, but rather a parallel input and let the learning mechanics to determine which information is worth extracting. Allowing graphs to contain simple edges have the following benefits in ML applications:\n\n- As discussed in the Introduction section of our paper, although hypergraphs can include simple edges by using hyperedges with only two nodes, this is not a principled approach of utilising hyperedges, especially when they are employed to described clustering or homogeneity relations between multiple nodes from another perspective than the simple edges, and can still potentially hurt ML systems’ task performance.\n- Existing works on hypergraph GNNs and simple graph GNNs are normally evaluated separately on different datasets, and it is highly desired to develop a unified benchmark to evaluate whether hypergraph GNNs can indeed enhance learning performance on complex graphs than simple GNNs. This would also enable works on integrating simple edge and hyperedge information to be reliably trained and evaluated.\n- By allowing graphs to contain both hyperedges and simple edges, we can also enable the hyperedges and simple edges to be constructed from different perspectives (as in our GRAND datasets, where simple edges are constructed from pairwise gene regulatory effects, and hyperedges represent geometric information of nearby genes) or even different data modalities (as in our Amazon datasets, where hyperegdes are constructed from the image modality, and the node embeddings are collected from the text modality). This would allow the graph to capture much more concrete information about the real-world network, and enable works on those datasets to enhance their learning performance. With this notion, we also bring insights to the community of combining different types of edge information from different modalities, and perform multimodal learning on complex networks.\n\n[1] Higher-order organization of complex networks, Science 2016\n\n[2] Networks beyond pairwise interactions: Structure and dynamics, Physics Report, 2020\n\n[3] Submodular hypergraphs: p-laplacians, cheeger inequalities and spectral clustering, ICML 2018\n\n(To be continued in the next response)"
                    }
                },
                "number": 1,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6950/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700652521152,
                "cdate": 1700652521152,
                "tmdate": 1700652792221,
                "mdate": 1700652792221,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "RahMyyI6ff",
                "forum": "NX0eNGXezp",
                "replyto": "evTvl0YYvy",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6950/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6950/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer RFzy (2)"
                    },
                    "comment": {
                        "value": "(Continued from the previous response)\n\n### Some recent more principled hypergraph NNs are missing to discuss, e.g. [4][5]. This is a weak point for a benchmark paper.\n\nThank you very much for pointing out the more recent hypergraph GNNs in addition to the models that we have originally included [6]. We originally selected [6] as our experimented baselines for hypergraph GNNs, as it was a classical and representative work on hypergraph GNNs, and have been used as baselines in many hypergraph GNN works [5][7]. According to your recommendations, we have now also included the accuracies of ED-HNN [5] in our revised paper, which are also reported below:\n\n| MUSAE Dataset | ED-HNN Accuracy | Best Simple Graph GNN Accuracy  | Best Hypergraph GNN Accuracy | Best LP-GNN Accuracy |\n| --- | --- | --- | --- | --- |\n| GitHub | 0.862 ± 0.001 | 0.872 ± 0.000 (GCN) | 0.808 ± 0.001 (HyperConv) | 0.872 ± 0.000 (LP-GCN+HyperConv) |\n| Facebook | 0.861 ± 0.004 | 0.902 ± 0.002 (GraphSAGE) | 0.792 ± 0.001 (HyperConv) | 0.905 ± 0.000 (LP-GAT+HyperConv) |\n| Twitch_FR | 0.629 ± 0.011 | 0.625 ± 0.001 (GATv2) | 0.624 ± 0.002 (HyperConv) | 0.626 ± 0.000 (LP-GCN+HyperConv) |\n| Twitch_EN | 0.603 ± 0.011 | 0.620 ± 0.003 (GCN) | 0.587 ± 0.007 (HyperConv) | 0.608 ± 0.003 (LP-GAT+HyperConv) |\n| Twitch_ES | 0.722 ± 0.013 | 0.721 ± 0.004 (GCN) | 0.715 ± 0.001 (HyperConv) | 0.729 ± 0.001 (LP-GCN+HyperConv) |\n| Twitch_PT | 0.695 ± 0.015 | 0.689 ± 0.006 (GCN) | 0.701 ± 0.005 (HyperConv) | 0.696 ± 0.004 (LP-GCN+HyperConv) |\n| Twitch_RU | 0.751 ± 0.015 | 0.746 ± 0.002 (GraphSAINT) | 0.743 ± 0.000 (HyperAtten) | 0.744 ± 0.000 (LP-GCN+HyperConv) |\n| Twitch_DE | 0.681 ± 0.006 | 0.657 ± 0.001 (GraphSAGE) | 0.654 ± 0.002 (HyperConv) | 0.657 ± 0.001 (LP-GCN+HyperConv) |\n\n| GRAND Datasets | ED-HNN Accuracy | Best Simple Graph GNN Accuracy | Best Hypergraph GNN Accuracy | Best LP-GNN Accuracy |\n| --- | --- | --- | --- | --- |\n| ArteryAorta | 0.667 ± 0.013 | 0.630 ± 0.000 (GATv2) | 0.647 ± 0.003 (HyperAtten) | 0.649 ± 0.001 (LP-GAT+HyperConv) |\n| ArteryCoronary | 0.667 ± 0.015 | 0.663 ± 0.000 (GAT) | 0.670 ± 0.003 (HyperAtten) | 0.664 ± 0.001 (LP-GAT+HyperConv) |\n| Breast | 0.661 ± 0.014 | 0.644 ± 0.000 (GraphSAGE) | 0.645 ± 0.001 (HyperConv) | 0.657 ± 0.001 (LP-GAT+HyperConv) |\n| Brain | 0.663 ± 0.013 | 0.625 ± 0.000 (GCN) | 0.632 ± 0.003 (HyperAtten) | 0.645 ± 0.001 (LP-GAT+HyperConv) |\n| Leukemia | 0.603 ± 0.013 | 0.604 ± 0.016 (GraphSAGE) | 0.593 ± 0.008 (HyperAtten) | 0.604 ± 0.004 (LP-GCN+HyperConv) |\n| Lung | 0.670 ± 0.010 | 0.650 ± 0.000 (GCN) | 0.661 ± 0.004 (HyperAtten) | 0.662 ± 0.002 (LP-GAT+HyperConv) |\n| Stomach | 0.661 ± 0.006 | 0.643 ± 0.000 (GCN) | 0.643 ± 0.000 (HyperConv) | 0.656 ± 0.002 (LP-GAT+HyperConv) |\n| Lungcancer | 0.602 ± 0.014 | 0.615 ± 0.015 (GraphSAGE) | 0.608 ± 0.008 (HyperAtten) | 0.618 ± 0.003 (LP-GAT+HyperConv) |\n| Stomachcancer | 0.610 ± 0.011 | 0.602 ± 0.007 (GCN) | 0.604 ± 0.022 (HyperAtten) | 0.621 ± 0.002 (LP-GAT+HyperConv) |\n| KidneyCancer | 0.603 ± 0.011 | 0.596 ± 0.014 (GraphSAGE) | 0.578 ± 0.012 (HyperAtten) | 0.621 ± 0.002 (LP-GAT+HyperConv) |\n\n| Amazon Dataset | ED-HNN Accuracy | Best Simple Graph GNN Accuracy  | Best Hypergraph GNN Accuracy | Best LP-GNN Accuracy |\n| --- | --- | --- | --- | --- |\n| Photo | 0.786 ± 0.012 | 0.512 ± 0.141 (GraphSAINT) | 0.465 ± 0.033 (HyperAtten) | 0.715 ± 0.003 (LP-GAT+HyperConv) |\n| Computer | 0.973 ± 0.002 | 0.875 ± 0.020 (GraphSAINT) | 0.842 ± 0.020 (HyperConv) | 0.930 ± 0.007 (LP-GAT+HyperConv) |\n\nThe performance of ED-HNN is indeed better on HyperConv and HyperAtten, and becomes the only hypergraph GNN that outperforms simple graph GNNs on the GRAND datasets. In general, the results of ED-HNN is still consistent with the findings in our paper: it outperforms simple graph GNNs on GRAND-Tissues and Amazon, equally on MUSAE-Twitch and GRAND-Diseases, and underperform on MUSAE-GitHub and MUSAE-Facebook. In addition, our LP-GNNs, despite using only HyperConv as its hypergraph GNN component (which is less powerful than ED-HNN), can still outperform or match the performance of ED-HNN in many datasets, which clearly reinforce our claim that combining simple edge and hyperedge information can significantly improve complex graph learning performance. We believe that more appropriate and advanced hypergraph methods, such as ED-HNN, can also be combined with LP-GNN to further improve its performance, but this is beyond the scope of this paper.\n\nWe sincerely appreciate it if you could kindly consider improving the scores if we have sufficiently addressed the concerns. We are very happy to answer any further questions you may have.\n\n[4] Unignn: a unified framework for graph and hypergraph neural networks, IJCAI 2021\n\n[5] Equivariant Hypergraph Diffusion Neural Operators, ICLR 2023\n\n[6] Hypergraph convolution and hypergraph attention, Pattern Recognition 2021\n\n[7] You are AllSet: A Multiset Function Framework for Hypergraph Neural Networks, ICLR 2022"
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6950/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700652749278,
                "cdate": 1700652749278,
                "tmdate": 1700653397195,
                "mdate": 1700653397195,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]