[
    {
        "title": "Optimum Shifting to Stabilize Training and Improve Generalization of Deep Neural Networks"
    },
    {
        "review": {
            "id": "Ob0vpFWuaJ",
            "forum": "o4XNuQ5qft",
            "replyto": "o4XNuQ5qft",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4496/Reviewer_WtMt"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4496/Reviewer_WtMt"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes a method called optimum shifting (OS) to modify the parameters of a neural network from one point to a flatter one while keeping the training loss unchanged. It minimizes the Frobenius norm of the weight in the final fully connected layer of a neural network without changing the output of the final layer for given training data. Further, a stochastic version (SOS) is proposed to reduce the computational costs and provide more degrees of freedom for optimum shifting. Experiments show the proposed method improves the generalization ability on different vision tasks."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. This paper has a good motivation.\n2. SOS is efficient and compatible with traditional regularization techniques."
                },
                "weaknesses": {
                    "value": "This paper considers to modify the parameters of a neural network from one point to a flatter one while keeping the training loss unchanged for some training data. However, the specific implementation of this idea in this paper is very limited. Therefore, I think the current manuscript is not ready for publication.\n\n1. This paper is not very clear due to the inconsistent meanings of symbols and the incomplete description of experimental settings.\n2. The idea is not good enough. The implementation of the concept of optimum shifting is very limited."
                },
                "questions": {
                    "value": "1. Theorem results in section 3.2 are very monotonous. Four theorems say almost the same things.\n2. The role of gaussian elimination used in SOS is not clear. In fact, I cannot understand why the rows in input matrix A need to be independent.\n3. Hessian Analysis for section 5.2 is missing."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4496/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698413501596,
            "cdate": 1698413501596,
            "tmdate": 1699636425768,
            "mdate": 1699636425768,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "fX2uTYTm6B",
                "forum": "o4XNuQ5qft",
                "replyto": "Ob0vpFWuaJ",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4496/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4496/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "We appreciate the constructive comments on our paper. The raised concerns are addressed as follows.\n>**W1. This paper is not very clear due to the inconsistent meanings of symbols and the incomplete description of experimental settings.**\n\nThanks for your suggestion, we have detailed the description of experimental settings in line 4-10 in page 8 of our main paper. We demonstrate that SOS can also improve the generalization ability of neural networks when applied in the training process. We apply SGD to train the same four CNN models under the CIFAR10 and CIFAR100 datasets with the same data augmentation strategies. Following Huang et al. [4], the weight decay is 10e-4 and a Nesterov momentum of 0.9 without\ndamping. The batch size is set to be 64 and the models are trained for 300 epochs. The initial learning\nrate is set to be 0.1 and divided by 10 and is divided by 10 at 50$\\%$ and 75$\\%$ of the total number of\ntraining epochs. All images are applied with a simple random horizontal flip and normalized using\ntheir mean and standard deviation.\n\n>**W2. The idea is not good enough. The implementation of the concept of optimum shifting is very limited.**\n\nCurrent sharpness based minimization work mainly focus on image classification tasks such as [1, 2, 3]. Compared with them, we not only perform SOS on image classification tasks but also on object detection tasks to validate the effectiveness of our method. Moreover, our experiment and implementation is also acknowledged by Reviewer KEY9 in Strength 4 : the extensive experimental results on different datasets and network architecture provide a comprehensive demonstration of the proposed method.\n\n>**Q1. Theorem results in section 3.2 are very monotonous. Four theorems say almost the same things.**\n\nWe use different model architectures (CNNs, ResNets, DenseNets, et al.) in our experiment to test the effectiveness of SOS, so we have proved the theorems for different neural network models. We will put some relevant theorems in the Appendix in the final version.\n\n>**Q2. The role of gaussian elimination used in SOS is not clear. In fact, I cannot understand why the rows in input matrix A need to be independent.**\n\nWhen we calculate $A^T(AA^T)^{-1}b$ directly, if each row of $A$ is not independent, $AA^T$ will be irreversible.\nIn practice, $A$ may be row-dependent. However, after Gaussian elimination, each non-zero row of input matrix $A$ will be independent and those zero rows will be discarded.  Thus the $A_*$ (the matrix after Gaussian elimination) in our algorithm 1 will be row-independent and is easy to calculate the inverse matrix $(A_*A_*^T)^{-1}$.\n\n>**Q3. Hessian Analysis for section 5.2 is missing.**\n\nThanks for your suggestion, we have added the Hessian analysis of section 5.2 in the Appendix B. The trace of Hessian during training is keep increasing. However, when we apply SOS to the model during training, the trace of Hessian has been minimized, which indicates a better generalization ability. We thank your good suggestions again.\n\n**References:** \n* [1] Pierre Foret, Ariel Kleiner, Hossein Mobahi, and Behnam Neyshabur. Sharpness-aware minimization for efficiently improving generalization. In ICLR, 2021\n* [2] Jungmin Kwon, Jeongseop Kim, Hyunseo Park, and In Kwon Choi. Asam: Adaptive sharpness aware minimization for scale-invariant learning of deep neural networks. In ICML, 2021.\n* [3] Yang Zhao, Hao Zhang, and Xiuyuan Hu. Penalizing gradient norm for efficiently improving gen-\neralization in deep learning. In ICML, 2022.\n* [4] Gao Huang, Zhuang Liu, Laurens Van Der Maaten, and Kilian Q Weinberger. Densely connected\nconvolutional networks. In CVPR, 2017."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4496/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1699982149950,
                "cdate": 1699982149950,
                "tmdate": 1700529512442,
                "mdate": 1700529512442,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "hwWVIoAzUV",
                "forum": "o4XNuQ5qft",
                "replyto": "Ob0vpFWuaJ",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4496/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4496/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Kind Reminder"
                    },
                    "comment": {
                        "value": "Dear Reviewer,\n\nThank you again for your great efforts and valuable comments in reviewing our paper. We have carefully addressed the main concerns in detail in the rebuttal and we hope you might find the response satisfactory. As the discussion phase is about to close, we are very much looking forward to hearing from you about any further feedback. We will be very happy to clarify further concerns (if any).\n\nBest,\n\nAuthors"
                    }
                },
                "number": 9,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4496/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700537015362,
                "cdate": 1700537015362,
                "tmdate": 1700537015362,
                "mdate": 1700537015362,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "GzWH20bhA8",
            "forum": "o4XNuQ5qft",
            "replyto": "o4XNuQ5qft",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4496/Reviewer_KEY9"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4496/Reviewer_KEY9"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes a novel technique to change a trained neural network's parameters to a flat loss-landscape region without changing the training loss of the network, which is termed optimal shifting. The main idea is to treat the parameter of a neural network as a linear system and then minimize the trace of its Hessian. To overcome the computational challenge, i.e., the complete estimation of the Hessian matrix required for the whole training dataset, the author proposed an online optimization method motivated by the Stochastic Gradient Descent, where the author use a small batch of data to calculate the optimal shifting. Extensive experiments are conducted on different network architecture and computer vision tasks to demonstrate the effectiveness of the proposed method in improving the generalization of neural networks."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "1. Overall, the paper is very well written, with a clear demonstration of the main idea, and flows well in presenting the technical details. \n2. The perspective of viewing the parameters of a neural network as a linear system is refreshing, though it is not a ground-breaking idea. The proposed method is sound by connecting the flatness with the Hessian and also by providing the theoretical justification for minimizing the Frobenius norm of the weight in the final linear layer that can minimize the trace of the Hessian.\n3. The computational challenge is valid and significant, and it is good to see the author provide a very clean summary of the technical challenges for the reader to appreciate the contribution of the present work. The proposed Stochastic Optimum Shifting (SOS) seems very natural to deal with the issue, and it is interesting to see the author bridge the connection between Neural Collapse theory to provide an intuitive justification for the SOS.\n4. The extensive experimental results on different datasets and network architecture provide a comprehensive demonstration of the proposed method."
                },
                "weaknesses": {
                    "value": "1. In the introduction, the author claimed that:\n\n\"Assume that the rows in $A$ are independent without loss of generality, the equation $Ax=b$ is under-determined if $m<n$ and has infinite solutions for $v$.\"\n\nThe author should provide a more explicit explanation about how we can formally guarantee independence when $A$ is a neural network since, at least it is not very intuitive to the reviewer. \n\n2. The author considers the neural network a linear system, which is fine for the linear layers in the neural network when we omit the non-linear activation function. However, as modeled in Equation (3), the neural network is a stack of linear layers with corresponding nonlinear activation functions. How will the exact choice of the nonlinear activation function have an impact on the theoretical results?\n\n3. From Tables 1 and 2 we can observe that the SOS performs the best when it integrates with the Mixup. Can the author provide any interpretation and reasoning about this phenomenon? Why the basic training strategy can not bring sufficient benefit for the proposed method?\n\n4. The improvement in the object detection task in Table 4 is too marginal. It is better for the author to include the mean and std for this table and also for other tables."
                },
                "questions": {
                    "value": "Please refer to the Weaknesses section for more details."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission4496/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4496/Reviewer_KEY9",
                        "ICLR.cc/2024/Conference/Submission4496/Senior_Area_Chairs"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4496/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698642308538,
            "cdate": 1698642308538,
            "tmdate": 1700351879611,
            "mdate": 1700351879611,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "r29T6ULqRR",
                "forum": "o4XNuQ5qft",
                "replyto": "GzWH20bhA8",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4496/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4496/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "We appreciate the positive rating and constructive comments on our paper. The raised concerns are addressed as follows.\n\n>**Q1. In the introduction, the author claimed that:\n\"Assume that the rows in $A$ are independent without loss of generality, the equation $Ax = b$ is under-determined if $m<n$ and has infinite solutions for $v$.\" The author should provide a more explicit explanation about how we can formally guarantee independence when $A$ is a neural network since, at least it is not very intuitive to the reviewer.**\n\nThanks for your careful reading. First, we wish to emphasize that $A$ is not the neural network but the input matrix of the linear layer. Each row of the original input matrix A is not necessarily independent. So the Gaussian elimination was used (line 11 in our algorithm 1) to guarantee that e\nach non-zero row of input matrix A is independent. Thus, after Gaussian elimination, the condition that the rows in $A$ are independent is satisfied and we can use SOS to change the parameters of our neural network.\n\n>**Q2. The author considers the neural network a linear system, which is fine for the linear layers in the neural network when we omit the non-linear activation function. However, as modeled in Equation (3), the neural network is a stack of linear layers with corresponding nonlinear activation functions. How will the exact choice of the nonlinear activation function have an impact on the theoretical results?**\n\nWe wish to clarify that the nonlinear activation function has no impact on our method. \nThe linear lay with activation can be represented as:\n\\begin{equation}\n    \\sigma(Av + b) = c  \n\\end{equation}\nIn our method, the input $A$ and output $Av+b$ are both fixed, we only change the parameters $v$ to $v^*$ such that the output is unchanged.\nIn this case, no matter what the activation function is, the output of the linear layer will also not be changed.\n\n>**Q3. From Tables 1 and 2 we can observe that the SOS performs the best when it integrates with the Mixup. Can the author provide any interpretation and reasoning about this phenomenon? Why the basic training strategy can not bring sufficient benefit for the proposed method?**\n\nThe data augmentation strategy Mixup will increase the accuracy of the baseline. Our SOS is also compatible with those data augmentation strategies and thus can further improve the test accuracy. This phenomenon also appears in other sharpness minimization methods [1, 2].\n\n>**Q4. The improvement in the object detection task in Table 4 is too marginal. It is better for the author to include the mean and std for this table and also for other tables.**\n\nThanks for the suggestion, we have repeated the object detection experiment three times and added the mean and std for Table 4 in the revised version. As it takes time to repeat all experiments, the mean and std for other tables will be added in the final version.\n\n| VOC | Yolo-V5s | Yolo-V5x |\n| ----------- | ----------- | -------|\n| mAP w/ SOS  | $83.4_{\\pm 0.2}$  | $87.1_{\\pm 0.2}$|\n| mAP w/o SOS | $83.7_{\\pm 0.1}$ |$87.4_{\\pm 0.2}$ |\n\n**References:** \n* [1] Pierre Foret, Ariel Kleiner, Hossein Mobahi, and Behnam Neyshabur. Sharpness-aware minimization for efficiently improving generalization. In ICLR, 2021\n* [2] Yang Zhao, Hao Zhang, and Xiuyuan Hu. Penalizing gradient norm for efficiently improving gen-\neralization in deep learning. In ICML, 2022."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4496/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1699982912501,
                "cdate": 1699982912501,
                "tmdate": 1699983155730,
                "mdate": 1699983155730,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "Nmp82xTh3B",
                "forum": "o4XNuQ5qft",
                "replyto": "r29T6ULqRR",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4496/Reviewer_KEY9"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4496/Reviewer_KEY9"
                ],
                "content": {
                    "comment": {
                        "value": "Thanks to the author for the precise response, the reviewer is more convinced with the proposed method. This is a good paper and deserves to be seen by the community. I raised my score to 8."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4496/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700352086783,
                "cdate": 1700352086783,
                "tmdate": 1700352086783,
                "mdate": 1700352086783,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "s0zAEeTAIb",
            "forum": "o4XNuQ5qft",
            "replyto": "o4XNuQ5qft",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4496/Reviewer_urCd"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4496/Reviewer_urCd"
            ],
            "content": {
                "summary": {
                    "value": "This paper introduces optimum shifting (OS) to change the parameters of a neural network from sharper minima to a flatter one, while maintaining the same training loss. The authors prove that the minima got by their method is actually flatter than the original one. Furthermore they introduce a stochastic optimum shifting (SOS) utilizing neural collapse theory for practical implementations, which reduces computational costs and provide more degrees of freedom for optimum shifting."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "The paper is clearly written and the idea is easy to follow. \n\nThe proposed OS method is easy to understand and easy to implement.\n\nThe SOS technique seems to bring improvement to multiple tasks."
                },
                "weaknesses": {
                    "value": "1. The SOS which uses batched data instead of whole dataset for training relies on the neural collapse phenomenon, but neural collapse just happen in the terminal phase of training.  This means before the stage of getting 0 training error, the rely on neural collapse is not valid. Hence the assumption that \"if the loss of 100 images remains unchanged ... the loss of the entire dataset will also remain nearly unchanged\" will not hold for the stage of training before 0 error.\n\n2. The empirical results are only on image tasks and this makes the claim of improvement by SOS not very convincing."
                },
                "questions": {
                    "value": "Could you share your thoughts regarding weakness 1 (see above)?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4496/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698800563512,
            "cdate": 1698800563512,
            "tmdate": 1699636425621,
            "mdate": 1699636425621,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "pB7okiwwRE",
                "forum": "o4XNuQ5qft",
                "replyto": "s0zAEeTAIb",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4496/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4496/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "We appreciate the constructive comments on our paper. The raised concerns are addressed as follows.\n> **Q1. The SOS which uses batched data instead of\nwhole dataset for training relies on the neural col-\nlapse phenomenon, but neural collapse just happen\nin the terminal phase of training. This means before\nthe stage of getting 0 training error, the rely on neural collapse is not valid. Hence the assumption that\n”if the loss of 100 images remains unchanged ... the\nloss of the entire dataset will also remain nearly unchanged” will not hold for the stage of training before\n0 error.**\n\nThank you for the good question. The stochastic OS is inspired by the NC phenomenon to keep the loss unchanged on a small batch. Rigorously speaking, we can keep the loss unchanged on CIFAR100 with 100 samples in the latter training stage. However, in the mid and beginning training phase, the data points will not totally converge to the class mean. So we use more samples (300 in the experiments for CIFAR100) and hope it can also keep the loss unchanged in the mid and beginning training phase. Moreover,  from the experimental view (Figure 2 of our paper), we can see that the loss with stochastic OS is almost the same or lower than the loss without stochastic OS, which further validates our statement that stochastic OS will not affect the training loss value in the whole training process.\n\n> **Q2. The empirical results are only on image tasks and this makes the claim of improvement by SOS not very convincing.**\n\nFor other tasks such as NLP, the NC phenomenon may not exist and it needs other theory to guarantee the loss unchanged after SOS. So in this paper, we mainly focus on image tasks as in Foret et al [1], Kwon et al. [2] and Zhao et al. [3]. Thanks for the suggestion, the research of our SOS on other tasks is planned for our future work.\n\n**References:** \n* [1] Pierre Foret, Ariel Kleiner, Hossein Mobahi, and Behnam Neyshabur. Sharpness-aware minimization for efficiently improving generalization. In ICLR, 2021\n* [2] Jungmin Kwon, Jeongseop Kim, Hyunseo Park, and In Kwon Choi. Asam: Adaptive sharpness aware minimization for scale-invariant learning of deep neural networks. In ICML, 2021.\n* [3] Yang Zhao, Hao Zhang, and Xiuyuan Hu. Penalizing gradient norm for efficiently improving gen-\neralization in deep learning. In ICML, 2022."
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4496/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1699981732838,
                "cdate": 1699981732838,
                "tmdate": 1700469231902,
                "mdate": 1700469231902,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "TIHf7ZoAop",
                "forum": "o4XNuQ5qft",
                "replyto": "s0zAEeTAIb",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4496/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4496/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Kind Reminder"
                    },
                    "comment": {
                        "value": "Dear Reviewer,\n\nThank you again for your great efforts and valuable comments in reviewing our paper. We have carefully addressed the main concerns in detail in the rebuttal and we hope you might find the response satisfactory. As the discussion phase is about to close, we are very much looking forward to hearing from you about any further feedback. We will be very happy to clarify further concerns (if any).\n\nBest, \n\nAuthors"
                    }
                },
                "number": 8,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4496/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700536985913,
                "cdate": 1700536985913,
                "tmdate": 1700536985913,
                "mdate": 1700536985913,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "tMf32JbIeV",
            "forum": "o4XNuQ5qft",
            "replyto": "o4XNuQ5qft",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4496/Reviewer_DgxS"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4496/Reviewer_DgxS"
            ],
            "content": {
                "summary": {
                    "value": "Authors proposed an efficient method to improve the generalization of trained DNN models via stochastic optimum shifting on a small sample set leveraging neural collapse."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "Authors provided thorough proof on the theorems. This method seems to have marginal improvements over benchmark results using a small set of data to improve generalization. If there is a use case for this, it's a promising experiment."
                },
                "weaknesses": {
                    "value": "As the authors mentioned. \"there always exist models with good generalization but with arbitrarily large sharpness\". I question the contribution made here is significant enough."
                },
                "questions": {
                    "value": "why focus on generalization techniques after model is trained and not on producing a flatter minima during training. I think this is good after the fact but the effort is better spent on how to improve generalization during training."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4496/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698815031553,
            "cdate": 1698815031553,
            "tmdate": 1699636425463,
            "mdate": 1699636425463,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "Z2lasifY7O",
                "forum": "o4XNuQ5qft",
                "replyto": "tMf32JbIeV",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4496/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4496/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "We appreciate the constructive comments on our paper. The raised concerns are addressed as follows. \n\n> **Q1. As the authors mentioned.** **\"there always exist models with good generalization but with arbitrarily large sharpness\".** **I question the contribution made here is significant enough.**\n\nThanks for the comment. As lots of recent studies, such as Foret et al [1]; Kwon et al. [3] and Zhao et al. [4], propose to penalize the sharpness of the landscape for improving the generalization, the contribution to minimizing the sharpness of the loss\nlandscape is of vital importance. \n\nMoreover, theoretically, as we stated in line 7 in our related work, although there always exist models\nwith good generalization but with arbitrarily large sharpness, it does not contradict our main result and contribution here, which only asserts the interpolation solution with a minimal trace of Hessian generalizes well, but not vice versa. This is also stated and\nsupported by Gatmiry et al. [2].\n\nOur contribution is also acknowledged by Reviewer KEY9 in the reply: This is a good paper and deserves to be seen by the community.\n\n> **Q2. Why focus on generalization techniques after model is trained and not on producing a flatter minima during training. I think this is good after the fact but the effort is better spent on how to improve generalization during training.**\n\nThanks for your useful advice. Our experiment section focuses on both the trained model and during training process. We apply SOS to the trained model and during training separately in Sec. 5.1 and in Sec. 5.2. In Sec. 5.2, we present a thorough analysis of applying SOS during training, including loss, accuracy, and model weight analysis. Like Foret et al [1]; Kwon et al. [3] and Zhao et al. [4], we mainly focus on improving the test accuracy on image classification tasks on different models during training.  Moreover, we have also done experiment on object detection task and added the Hessian analysis during training in the Appendix of our updated paper for further verification. We thank your good suggestions again. \n\n**References:** \n* [1] Pierre Foret, Ariel Kleiner, Hossein Mobahi, and Behnam Neyshabur. Sharpness-aware minimization for efficiently improving generalization. In ICLR, 2021\n* [2] Khashayar Gatmiry, Zhiyuan Li, Ching-Yao\nChuang, Sashank Reddi, Tengyu Ma, and Stefanie Jegelka. The inductive bias of flatness regularization for deep matrix factorization. arXiv preprint arXiv:2306.13239, 2023.\n* [3] Jungmin Kwon, Jeongseop Kim, Hyunseo Park, and In Kwon Choi. Asam: Adaptive sharpness aware minimization for scale-invariant learning of deep neural networks. In ICML, 2021.\n* [4] Yang Zhao, Hao Zhang, and Xiuyuan Hu. Penalizing gradient norm for efficiently improving gen-\neralization in deep learning. In ICML, 2022."
                    }
                },
                "number": 1,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4496/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1699981346418,
                "cdate": 1699981346418,
                "tmdate": 1700529488944,
                "mdate": 1700529488944,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "hmTmGEF7EM",
                "forum": "o4XNuQ5qft",
                "replyto": "tMf32JbIeV",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4496/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4496/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Kind Reminder"
                    },
                    "comment": {
                        "value": "Dear Reviewer,\n\nThank you again for your great efforts and valuable comments in reviewing our paper. We have carefully addressed the main concerns in detail in the rebuttal and we hope you might find the response satisfactory. As the discussion phase is about to close, we are very much looking forward to hearing from you about any further feedback. We will be very happy to clarify further concerns (if any).\n\nBest, \n\nAuthors"
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4496/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700536955937,
                "cdate": 1700536955937,
                "tmdate": 1700536955937,
                "mdate": 1700536955937,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]