[
    {
        "title": "Latent Conservative Objective Models for Offline Data-Driven Crystal Structure Prediction"
    },
    {
        "review": {
            "id": "2XweSRajLh",
            "forum": "OnLAftJkhV",
            "replyto": "OnLAftJkhV",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission8545/Reviewer_FciH"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission8545/Reviewer_FciH"
            ],
            "content": {
                "summary": {
                    "value": "This work proposes a method named LCOMs for predicting equilibrium 3D crystal material structure from atom compositions. The proposed LCOMs method first maps crystals to latent vectors by CDVAE models, then optimize crystal structures by a conservative surrogate model. Experiments shown that LCOMs can successfully optimize crystal structures in higher probability than traditional methods."
                },
                "soundness": {
                    "value": "1 poor"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "1 poor"
                },
                "strengths": {
                    "value": "Originality: This work studies a relatively new and under-explored problem of crystal structure prediction.  \nQuality: This work conducts basic crystal structure prediction experiments on 26 crystals to show the advanges of the proposed method.  \nClarity: The writing of this paper is overall clear and well-organized. Method details is well elaborated.  \nSignificance: Promising results of crystal structure prediction on 26 crystals show that the proposed LCOMs method is somewhat valuable in crystal structure prediction."
                },
                "weaknesses": {
                    "value": "Major:  \n(1) A major limitation of this work lies in the lack of sufficient technical novelty contribution in the aspect of machine learning method. The proposed method is largely the combination of CDVAE model [1] and COMS method [2], and the only novelty contribution is proposing to apply the optimization procedure of COMs method to the latent vectors obtained by CDVAE. Most of the methodology description is describing the two existing methods, and no description about the motivation or significance of the novelty contribution in methodology is given. Hence, this work does not reach the bar of top-tier machine learning conferences like ICLR.  \n(2) Though the crystal structure prediction problem is largely under-explored, there exist a method DiffCSP [3] for solving this problem. As DiffCSP also adopts generative models to encode crystal materials, authors are recommended to discuss and clarify the difference between LCOMs and DiffCSP.  \n(3) Experimental results are not sound enough. Experiments are only conducted on 26 materials, this test set size is too small to make reliable conclusion from experiment results. Also, in experiments, whether a crystal is successfully optimized is determined by its difference in energy to the globally optimal structure. It would be better to also report the exact difference in structure themselves, which can be measured by match rate and structure RMSE used in [1][3]. Authors are recommended to use a large test set with at least hundreds of materials and add structure difference metrics.\n\nMinor:  \nThe bibliography citation notations are not appropriately used in many places. Please use citation with paratheses when the citation itself is not a main part of a sentence.\n\n[1] Crystal Diffusion Variational Autoencoder for Periodic Material Generation. ICLR 2022.  \n[2] Conservative Objective Models for Effective Offline Model-Based Optimization. ICML 2021.  \n[3] Crystal Structure Prediction by Joint Equivariant Diffusion on Lattices and Fractional Coordinates. ICLR 2023 ML4Materials Workshop."
                },
                "questions": {
                    "value": "No additional questions."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission8545/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698630347120,
            "cdate": 1698630347120,
            "tmdate": 1699637069302,
            "mdate": 1699637069302,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "bQO9ydqnYl",
            "forum": "OnLAftJkhV",
            "replyto": "OnLAftJkhV",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission8545/Reviewer_Ffti"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission8545/Reviewer_Ffti"
            ],
            "content": {
                "summary": {
                    "value": "In this paper, the authors propose LCOMs, applying COMs on the latent space of CDVAE [1] to address the crystal structure prediction (CSP) problem. The proposed method makes the latent space more robust for the gradient-descent optimization, leading to better performance against other optimization-based baselines."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "The paper focuses on an important problem and the proposed method is simple yet effective."
                },
                "weaknesses": {
                    "value": "1. The contribution is incremental. The paper directly applies the COMs technique [2] to regularize the energy prediction model from the latent space of CDVAE, without making significant modifications to either method. Although the proposed method technically achieves better results, the paper does not provide new insights or broader directions in the fields of crystal representation or latent optimization.\n2. The experimental dataset is limited. The main evaluation is conducted on a small dataset of only 26 compounds, which undermines the persuasiveness of the conclusions. Additionally, some results are unclear. In Table 2, LCOMs reduces the wall-clock time to 2 seconds, as it \"does not require running expensive message passing loops of a graph neural network encoder but rather runs relatively faster forward passes through small MLPs.\" It appears that the time calculation only considers the latent optimization phase, neglecting the decoding time, which requires a 5k-step Langevin Dynamics in the original CDVAE and should take more than 2 seconds.\n3. The writing needs improvement, and some details are missing. This paper uses CDVAE to address the CSP problem. As mentioned in Section 4.1, the encoder of CDVAE is Dimenet++, which requires a 3D structure as input. However, as defined in Problem 3.1, the goal of CSP is to predict the 3D structure from the composition, which means the 3D structure is UNKNOWN. It is unclear how the authors obtain the latent representation from the encoder without 3D input. Is there any data leakage? Moreover, when introducing CDVAE, there is a mistake that CDVAE does not decode from \"random lattice\", but the lattice predicted from the latent state.\n\n[1] Xie, Tian, et al. \"Crystal Diffusion Variational Autoencoder for Periodic Material Generation.\" International Conference on Learning Representations. 2021.\n[2] Trabucco, Brandon, et al. \"Conservative objective models for effective offline model-based optimization.\" International Conference on Machine Learning. PMLR, 2021."
                },
                "questions": {
                    "value": "Please see the weakness part above."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission8545/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698715703858,
            "cdate": 1698715703858,
            "tmdate": 1699637069183,
            "mdate": 1699637069183,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "Bg6khZn7Ch",
            "forum": "OnLAftJkhV",
            "replyto": "OnLAftJkhV",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission8545/Reviewer_YfQf"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission8545/Reviewer_YfQf"
            ],
            "content": {
                "summary": {
                    "value": "This paper addresses the CSP problem. The authors propose a surrogate model is trained to be conservative so as to prevent exploitation of its errors by the optimizer. The proposed method achieves the SOTA performance."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "Originality: This work has some novelty in general. The idea of the surrogate model is interesting to the materials science community. \n\nQuality: The quality of this work is above average. The technical part is sound for material science people with properly defined terms and clear problem formulation. \n\nClarity: This paper is clearly written. Each part of the proposed method is well-motivated. \n\nSignificance: The work solves a significant problem in material science."
                },
                "weaknesses": {
                    "value": "1. More discussions on the difference between [1] and the proposed method should be added.\n\n2. Some reference papers like [2[ should be added as well.\n\n[1] T. Xie, X. Fu, O.-E. Ganea, R. Barzilay, and T. Jaakkola. Crystal diffusion variational autoencoder\nfor periodic material generation. arXiv preprint arXiv:2110.06197, 2021.\n\n[2] Rui Jiao and Wenbing Huang and Peijia Lin and Jiaqi Han and Pin Chen and Yutong Lu and Yang Liu. Crystal Structure Prediction by Joint Equivariant Diffusion on Lattices and Fractional Coordinates. Workshop on ''Machine Learning for Materials'' ICLR 2023"
                },
                "questions": {
                    "value": "1. What are the main differences between [1] and the proposed method in terms of both the encoder and the decoder?\n\n[1] T. Xie, X. Fu, O.-E. Ganea, R. Barzilay, and T. Jaakkola. Crystal diffusion variational autoencoder\nfor periodic material generation. arXiv preprint arXiv:2110.06197, 2021."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission8545/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698745317642,
            "cdate": 1698745317642,
            "tmdate": 1699637069052,
            "mdate": 1699637069052,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "0oDeZ0wyqt",
            "forum": "OnLAftJkhV",
            "replyto": "OnLAftJkhV",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission8545/Reviewer_atym"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission8545/Reviewer_atym"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes a method to optimize crystal structures called \"Latent Conservative Objective Models\" (LCOMs). The method is essentially conservative objective models applied in the latent space of a variational autoencoder.\n\nI think this paper proposes a sensible method to solve a realistic problem. My main concern is that the machine learning novelty is fairly low. There is nothing wrong with the paper per se, but I think ICLR might not be the right venue for this kind of work."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "1 poor"
                },
                "strengths": {
                    "value": "- Good choice of problem\n- Writing is reasonably clear\n- Method proposed is a sensible combination of prior methods"
                },
                "weaknesses": {
                    "value": "- Novelty/significance: even though the method seems well-designed, I think it is more or less a straightforward combination of COMs and CD-VAE. Although this is probably a good choice for solving the problem, I don't think this adds new knowledge to the field of ML.\n- Experiments are very small-scale: the key experiments in this paper used a dataset of only 26 test crystal structures. It is unclear if a statistically significant comparison of different algorithms can be made with such a small test set."
                },
                "questions": {
                    "value": "My questions mainly follow from the weaknesses I identified:\n\n1. I suggest ICLR  might not be the right venue for this work. Do you agree with my points? If not, what aspects of this paper do you think make it in the scope of ICLR, which is a conference about ML methods?\n2. Do you have any kind of measurement of the statistical significance of the results in table 1? You say error bars are n/a, but all the algorithms studied have some randomness so I disagree with this."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission8545/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699010105848,
            "cdate": 1699010105848,
            "tmdate": 1699637068943,
            "mdate": 1699637068943,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    }
]