[
    {
        "title": "Prototypical Information Bottlenecking and Disentangling for Multimodal Cancer Survival Prediction"
    },
    {
        "review": {
            "id": "I1AW1ILGf0",
            "forum": "otHZ8JAIgh",
            "replyto": "otHZ8JAIgh",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission2319/Reviewer_G86X"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission2319/Reviewer_G86X"
            ],
            "content": {
                "summary": {
                    "value": "This work introduces two different information-theory-based modules for multimodal (histology and genomics) survival prediction problem. Based on information bottleneck theory, these modules aim to remove redundant information, which are prevalent in WSIs, within each modality and across different modalities. In the process, the concept of prototypes are introduced to guide the learning of the multimodal prognosis framework, while only retaining necessary information."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "1 poor"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "- While the use of information bottleneck theory is not new in computational pathology, the use of it for 1) survival prediction setting and 2) reduction of intra-modal redundant information is quite novel.\n- The authors conduct extensive baseline comparisons to demonstrate that PIBD framework indeed is better/highly-competitive compared to even the most recent baselines (MOTCat and SurvPath). This is to be appreciated by any fellow researchers looking to get understanding of the available survival prediction methods in CPath.\n- Probabilistic modeling of the bag of patch features (although it leads to several variational approximations), opens up new avenues for probabilistic approaches for CPath, which have been under-explored thus far."
                },
                "weaknesses": {
                    "value": "Clarity\n- The explanation around PIB and PID need to be much more straightforward for the work to be appreciated. In its current form, it is really hard to understand and Section 3 lacks clarity. The authors should understand that typical readership of this article will either be pathologist or ML practitioner who would be less-versed in probabilistic and variational language. This, in my opinion, significantly reduces the impact of the paper as any other researcher hoping to reuse the framework for their own experiments. Authors should try to inject more  pathology-related intuition throughout the work.\n\nDiscriminative assumption\n-  I am not sure if \"discriminative\" approach (despite its good performance as shown in the paper) is the right approach for survival. Different from diagnosis problems where subtype/grades are indeed decided with discriminative instances (patches), survival prediction problems are not as clear-cut. Certain morphological characteristics will overlap between different risk groups (or bands), which the current approach, centered around sampling positive/negative prototypes for maximum discrimination, is not well suited for.\n- Related to the comment above, this approach seems only applicable to NLL loss, which treats the problem as a classification problem and thus have \"different\" bins (i.e., discretized timeline). What if more common loss functions, such as Cox PH or rank losses, were to be used that do not rely on such discriminative hypothesis?\n\nKaplan-Meier analysis\n- In Kaplan-Meier analysis section, authors state that \"our approach demonstrates significantly improved discrimination.... as indicated by lower p-values\". While it is tempting to compare between p-values as a metric for separation of the risk groups, it is statistically not correct. Once these are below significance threshold, it shouldn't be over-interpreted. Maybe, use median survival days for each risk group?\n\nSampling operation\n- Since both PID and PIB rely on sampling from distribution, it does seem that the performance will indeed by affected by which samples are chosen or how many of them are sampled. The discussion around this point needs to be made explicit.\n\nInference\n- While there are detailed information about training procedure, not much is written about the actual inference step. For instance, how many samples for each prototype are required for reliable performance?"
                },
                "questions": {
                    "value": "- Motivation leading up to Eq. (5) is confusing. Why is large bag size an issue, if you can learn parametric mapping (via neural network) between z and x, similar to Eq. (4)? Wouldn't this simply be a matter of backpropagation in the training, which is scalable to numerous instances?\n- Variational approaches involving NNs are known to be prone to mode collapse - What are the tricks/methods used in the work to prevent it?\n- I think the introduction of Markov chains confuses the paper more - Perhaps better to remove it.\n- Eq. (6) - Can't we simply use KL divergence to assess the similiarity (distance), if both p(z|x) and p(\\hat{z}|y) are normal distributions?\n- Usually the use of \"Top-k\" refers to small number of instances being selected. However, from implementation section, it seems the authors are using 50~80% of the entire bag? Am I misunderstanding something?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission2319/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission2319/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission2319/Reviewer_G86X"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission2319/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698605723108,
            "cdate": 1698605723108,
            "tmdate": 1699636164379,
            "mdate": 1699636164379,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "8DxAbfIUih",
                "forum": "otHZ8JAIgh",
                "replyto": "I1AW1ILGf0",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2319/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2319/Authors"
                ],
                "content": {
                    "title": {
                        "value": "To Reviewer G86X [1/3]"
                    },
                    "comment": {
                        "value": "Thanks for your constructive comments and suggestions, they are exceeding helpful in improving our paper. We have carefully incorporated them in the revised paper. In the following, your comments are first stated and then followed by our point-by-point responses.\n\n---\n> **Q1) Clarity. The clarity of the PIB and PID explanations, particularly in Section 3, needs improvement for broader appreciation. The introduction of Markov chains confuses the paper more - Perhaps better to remove it.**\n> \n\nIn response to your valuable feedback, we have revised **Section 3** of the paper. The modifications include removing the introduction to Markov chains, emphasizing the changes made by the new approach more straightforward for conciseness and clarity. \n\n---\n> **Q2) Discriminative assumption.  1. The suitability of a \"discriminative\" approach for survival prediction. 2. The proposed approach seems only applicable to NLL loss. What if more common loss functions, such as Cox PH or rank losses, were to be used that do not rely on such discriminative hypothesis?**\n> \n1. We agree that survival prediction problems present greater complexity than diagnosis. In practical scenarios, there may exist deciding biomarkers within different risk bands, which leads to the “discriminative” method having demonstrated good performances in many cases [1,2].  Although some instances **related** to different risk groups may exhibit some overlap, these overlapping instances may not significantly contribute to **distinguishing** risk bands. Similarly, the same situation of overlapping can be observed in subtyping/grading as well. Therefore, our method, through the use of prototypes, excels in identifying discriminative features that are specifically associated with the positive risk level. Hence, discriminative assumption may not be a weakness but an advantage for biomarker discovery of different risk levels.\n\n2. Indeed, the prototype learning in the current approach primarily relies on cross-entropy(CE)-like loss. This is because the prototypes are constructed based on information bottleneck theory, in which the first term of the derivation in Eq. (8) is formulated as a form of cross-entropy. Fortunately, NLL loss, a CE-like loss, makes it feasible to employ IB for survival prediction task. \n    \n    Although the prototype component is based on CE-like loss, the task loss in our framework is still flexible and can be easily switched to Cox or rank loss. Furthermore, even in rank-based losses, which focus on relative comparisons between samples, discriminative information is still needed. Although not directly involving classification, the model needs to learn the differences between samples to correctly rank them. Hence, the assumption of PIB may not conflict in such scenarios.\n    \n    Despite the discriminative hypothesis, this work first attempts to directly model the bag-level representations for a bag structure through the probabilistic model in survival prediction task. There is undoubtedly significant value in expanding this approach to various hypotheses like rank-based hypothesis. Hence, further investigation is still warranted in the future.\n\n**REFERENCES**\n\n[1] Echle A, Rindtorff N T, Brinker T J, et al. Deep learning in cancer pathology: a new generation of clinical biomarkers[J]. British journal of cancer, 2021, 124(4): 686-696.\n\n[2] Wiegrebe, Simon, et al. \"Deep Learning for Survival Analysis: A Review.\" *arXiv preprint arXiv:2305.14961* (2023)."
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2319/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700242870269,
                "cdate": 1700242870269,
                "tmdate": 1700243154172,
                "mdate": 1700243154172,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "riO3ETnVCk",
            "forum": "otHZ8JAIgh",
            "replyto": "otHZ8JAIgh",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission2319/Reviewer_ottr"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission2319/Reviewer_ottr"
            ],
            "content": {
                "summary": {
                    "value": "This work presents PIBD (Prototypical Information Bottlenecking and Disentangling) for multimodal survival analysis using pathology and genomics, which extends previous progress thus far on co-attention-based early-based fusion [1] and learning information bottleneck [2] in computational pathology via two mechanisms: 1) a Prototypical Information Bottleneck (PIB) module for intra-modal redundancy and 2) a Prototypical Information Disentanglement (PID) module for inter-modal redundancy. Experimentation is performed on the same splits for disease-specific survival analysis in Jaume et al. [1], with comparisons against other relevant works (both unimodal and multimodal) and ablation experiments that assess PIB and PID independently.\n\n\nReferences\n1. Jaume, G., Vaidya, A., Chen, R., Williamson, D., Liang, P. and Mahmood, F., 2023. Modeling Dense Multimodal Interactions Between Biological Pathways and Histology for Survival Prediction. arXiv preprint arXiv:2304.06819.\n2. Li, H., Zhu, C., Zhang, Y., Sun, Y., Shui, Z., Kuang, W., Zheng, S. and Yang, L., 2023. Task-specific fine-tuning via variational information bottleneck for weakly-supervised pathology whole slide image classification. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (pp. 7454-7463)."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "- As summarized above, extensive experimentation regarding comparisons, ablation studies, and assessment of multiple cancer types is performed. In particular, this work compares with many state-of-the-art multimodal methods such as MCAT (both concatenation and Kronecker Product), SurvPath, MOTCat, and other relevant information bottleneck-related works. Beyond ABMIL and TransMIL, other strong unimodal methods such as the task-specific finetuning variant of CLAM is also considered. Background information and literature is also extensive, with many important studies related to PIBD cited in a comprehensive manner.\n- The proposed PID and PIB methodology, though largely adapted and inspired by other IB applications in computational pathology such as that of Li et al. 2023, is (on balance) appropriate for its extension into survival analysis w.r.t. addressing sparsity of patch features in MIL via prototypes. Figure 1 is informative and communciates how PID/PIB are used."
                },
                "weaknesses": {
                    "value": "- **Limited findings w.r.t. clinical application / multimodal interpretability**: PID/PIB is intuitive for solving multimodal integration problems of WSIs and gene sets, but the demonstrated findings of this work appears limited to only improvement of c-Index performance. Methodologies such as MOTCat and SurvPath, though not approaching survival analysis from an information bottleneck perspective, similarly resolve issues regarding redundancy of patch features in MIL and reach similar findings already established in prior works. The interpretability experiments, shown as attention heatmaps in the supplement, are difficult to interpret and draw conclusions from. As the improvement in c-Index is minor, it would be valuable to investigate the interpretability of PIBD, for example: (1) performing local and global interpretability to assess individual and cohort-level image-omic drivers of disease survival, or (2) experiment+showcase unique clinical applications that would arise from PIBD that cannot be performed in other methods, which would produce new scientific findings and expand this study's significance. In particular, I found the prototypical aspect of this work to be intriguing, with concurrent works also realizing (and finding new applications) of using prototypical patterns for pathology [5].\n- **Ablation Experiments for PIB/PID**: Some baselines do not seem fair in the PID/PIB ablation experiments.\n- - In ablating PID, the baseline model considered was average pooling the prototypical features - a more appropriate baseline would be to use a non-disentangled Transformer like TransMIL on top of the prototypical features. \n- - In ablating PIB, the reviewer is not certain what the baseline looks like (using PID without PIB), but would think that this comparison would be similar to having each modality being processed by a TransMIL-like encoder + PID (or SurvPath + PID). \n- **Using CTransPath for TCGA evaluation**: A limitation of this study is the usage of CTransPath (pretrained on TCGA) for training and evaluating MIL models for survival analysis in TCGA. Understandably, access to powerful pretrained encoders for pathology is challenging, due to: (1) lack of computing power, and (2) lack of diverse and independent data outside of TCGA, with other studies in computational pathology such as Jaume et al. [1] and Filliot et al. [2] having also conducted survival analyses via TCGA-pretrained encoders. This limitation could remain as \"a limitation of this study\" (fitted in the conclusion) as the novelties of this work are with respect to the MIL encoder (all comparisons are performed using the same features and evaluated in the same way), in combination with the aforementioned challenges in computational pathology. However, as the broader pathology and machine learning community is becoming more aware of potential biases that emerge from data contamination of self-supervised models that are also trained using the evaluation data (as seen in LLMs and other studies [3-7]), it is important for advances going forward to recognize and resolve this issue and to develop better standardization for developing and evaluating MIL methods. \n\nReferences\n1. Jaume, G., Vaidya, A., Chen, R., Williamson, D., Liang, P. and Mahmood, F., 2023. Modeling Dense Multimodal Interactions Between Biological Pathways and Histology for Survival Prediction. arXiv preprint arXiv:2304.06819.\n2. Filiot, A., Ghermi, R., Olivier, A., Jacob, P., Fidon, L., Mac Kain, A., Saillard, C. and Schiratti, J.B., 2023. Scaling Self-Supervised Learning for Histopathology with Masked Image Modeling. medRxiv, pp.2023-07.\n3. Guo, C., Bordes, F., Vincent, P. and Chaudhuri, K., 2023. Do SSL Models Have D\\'ej\\a Vu? A Case of Unintended Memorization in Self-supervised Learning. arXiv preprint arXiv:2304.13850.\n4. Xiang, J. and Zhang, J., 2022, September. Exploring low-rank property in multiple instance learning for whole slide image classification. In The Eleventh International Conference on Learning Representations.\n5. Chen, R.J., Ding, T., Lu, M.Y., Williamson, D.F., Jaume, G., Chen, B., Zhang, A., Shao, D., Song, A.H., Shaban, M. and Williams, M., 2023. A General-Purpose Self-Supervised Model for Computational Pathology. arXiv preprint arXiv:2308.15474.\n6. Jacovi, A., Caciularu, A., Goldman, O. and Goldberg, Y., 2023. Stop uploading test data in plain text: Practical strategies for mitigating data contamination by evaluation benchmarks. arXiv preprint arXiv:2305.10160.\n7. Kapoor, S. and Narayanan, A., 2023. Leakage and the reproducibility crisis in machine-learning-based science. Patterns, 4(9)."
                },
                "questions": {
                    "value": "Primary Questions and Suggestions\n- Current application and findings of PIBD overlap with other multimodal survival analysis works wr.t. to addressing patch feature redundancy, and having similar interpretability experiments. How does the contributions and findings of this work advance the field further?\n- Ablation experiments for PID/PIB can have stronger baselines.\n- Evaluating PIBD with a ResNet-50 encoder (ImageNet transfer) or a non-TCGA-pretrained encoder would strength the study and its findings.\n\nMinor Questions\n- How are CLAM-SB / CLAM-MB adapted for survival analysis? To the reviewer's knowledge, the implementation of the CLAM framework is mostly situated for slide classification (not survival), as the clustering constraints in CLAM are most appropriate for subtyping problems."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission2319/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission2319/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission2319/Reviewer_ottr"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission2319/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698809546333,
            "cdate": 1698809546333,
            "tmdate": 1699644604907,
            "mdate": 1699644604907,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "Gcm9tEBBgY",
                "forum": "otHZ8JAIgh",
                "replyto": "riO3ETnVCk",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2319/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2319/Authors"
                ],
                "content": {
                    "title": {
                        "value": "To Reviewer ottr [1/2]"
                    },
                    "comment": {
                        "value": "Thanks for your constructive comments and suggestions, they are greatly beneficial in enhancing the quality of our paper. We hope our answers will address the concerns and clarify the contributions of the paper. In the following, your comments are first stated and then followed by our point-by-point responses.\n\n---\n> **Q1) Limited findings w.r.t. clinical application / multimodal interpretability**\n> \n\nThank you for your feedback and suggestions! In order to present the concerns in a more organized manner, we will state our response point-by-point.\n\n**Contribution**. We'd like to emphasize the contributions of our method, as highlighted by Reviewers bKh7, HNZs, and G86X. Our approach achieves innovation by reducing redundant information within and between modalities for survival prediction through the information bottleneck in a quite novel prototypical method. Methods like MOTCat and SurvPath, which utilize co-attention mechanisms, focus specifically on gene-related instances of WSIs, emphasizing modality-common information. They failed to address the issues that we’re concerned about in the following aspects. First, these approaches ignored the distinct value of modality-specific information. Second, helpful instances in a bag only occupy an extremely small portion, which means massive intra-modal redundancy. Without explicit redundancy removal, such as MOTCat and Survpath, useful information will be flooded. Lastly, they cannot directly model at the bag-level, as noted by Reviewer G86X, \"probabilistic modeling on bags opens up new avenues for probabilistic approaches for CPath, which have been under-explored thus far.”\n\n**Interpretability**. For local interpretability of individual patients, we have visualized similarity scores of instances to each prototype of risk level and presented top-3 relevant patches and biological pathways, as well as top-3 irrelevant biological pathways. Through analyzing these instances, we may discover biomarkers of various risk levels. This is because prototypes are designed to be discriminative, which enforces selecting instances that are most distinctive for each risk level, potentially corresponding to biomarkers for different risk levels. In addition to what we have done, another potential way is to analyze the modality-specific features extracted from PID using CAM-based approaches, which will facilitate the discovery of unique biomarkers within each modality.\n\nSince prototypes represent the distribution for each risk band, they inherently possess a global nature. As a result, the global interpretability can be demonstrated in the following aspects. First, by collecting and organizing instances with high similarity to prototypes across a large patient cohort, we can assess cohort-level disease survival. Second, in PID, the joint distribution of histology and genomic data containing modality-common information, contributes to identifying paired instances related to both modalities and further establishing their relationship between patches and pathways. This also helps to understand their collaborative mechanisms.\n\n**Clinical applications.** We truly appreciate your suggestions and believe that the aforementioned way to interpret the model has the potential to provide some clinical value. However, the investigation of clinical applications requires collaborative efforts from experts across disciplines, such as pathologists, statisticians, AI experts, etc. For example, interpretability in clinical applications demands extensive review of pathology slides by pathologists and continuous enhancements in algorithms by AI engineers[1-3]. Therefore, it definitely takes a lot of time and effort in development and elaboration, which has gone beyond the scope of the current work. This work still primarily focuses on technical innovation in methodology. We acknowledge the importance of clinical applications, and we will continue to explore this area and hope to report the findings soon.\n\n**REFERENCES**\n\n[1] Hosseini, Mahdi S., et al. \"Computational Pathology: A Survey Review and The Way Forward.\" *arXiv preprint arXiv:2304.05482* (2023).\n\n[2] Berbís, M. Alvaro, et al. \"Computational pathology in 2030: a Delphi study forecasting the role of AI in pathology within the next decade.\" *EBioMedicine* 88 (2023).\n\n[3] Lu, Ming Y., et al. \"AI-based pathology predicts origins for cancers of unknown primary.\" *Nature* 594.7861 (2021): 106-110."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2319/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700242146250,
                "cdate": 1700242146250,
                "tmdate": 1700242146250,
                "mdate": 1700242146250,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "WfCmCSanuI",
            "forum": "otHZ8JAIgh",
            "replyto": "otHZ8JAIgh",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission2319/Reviewer_HNZs"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission2319/Reviewer_HNZs"
            ],
            "content": {
                "summary": {
                    "value": "The authors introduce a novel framework, Prototypical Information Bottlenecking and Disentangling (PIBD), comprising a Prototypical Information Bottleneck (PIB) module for handling intra-modal redundancy and a Prototypical Information Disentanglement (PID) module for addressing inter-modal redundancy. Extensive experiments conducted on five cancer benchmark datasets establish their method's superiority over other approaches."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "(1) The concept of Information Bottleneck (IB) is intriguing, as it offers a promising solution to eliminate unnecessary redundancy, and the PIB module effectively addresses computational challenges.\n(2) The technical details are presented with clarity and precision.\n(3) The thoroughness of the experiments conducted to validate the effectiveness of each component is commendable.\n(4) The quality of the visual presentations is noteworthy."
                },
                "weaknesses": {
                    "value": "(1) The Prototypical Information Disentanglement (PID) module could benefit from improved clarity in its description."
                },
                "questions": {
                    "value": "(1)What is the significance of the red arrows in Figure 1, particularly within the context of the PID module?\n(2)How does PIB save the computation? Please make quantitative analysis."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission2319/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698821811633,
            "cdate": 1698821811633,
            "tmdate": 1699636164237,
            "mdate": 1699636164237,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "o4eS74Nsfw",
                "forum": "otHZ8JAIgh",
                "replyto": "WfCmCSanuI",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2319/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2319/Authors"
                ],
                "content": {
                    "title": {
                        "value": "To Reviewer HNZs"
                    },
                    "comment": {
                        "value": "Thank you for your encouraging words and constructive comments. We sincerely appreciate your time in reading the paper. In the following, your comments are first stated and then followed by our point-by-point responses.\n\n---\n> **Q1) The Prototypical Information Disentanglement (PID) module could benefit from improved clarity in its description.**\n> \n\nRegarding the clarity of the PID module, we have revised the corresponding **section 3.3 on Page 6** in the manuscript to enhance the understanding for readers.\n\n---\n> **Q2) What is the significance of the red arrows in Figure 1, particularly within the context of the PID module?**\n> \n\nThe red arrows in Figure 1 signify the computation of the joint prototypical distribution, where each arrow connects to the positive prototype of a sample. The calculated joint distribution gives guidance for extracting modality-common and modality-specific information. \n\n---\n> **Q3) How does PIB save the computation? Please make quantitative analysis.**\n> \n\nThank you for your feedback. For the computation efficiency of PIB, it can be known that directly employing VIB would lead to intractable bag-level distribution $p(z|\\bf{x})$ due to the large number of individual instance distributions within a bag $\\bf{x}$, based on the analysis in the second paragraph **on Page 5**.  The proposed PIB can simplify this issue by modeling bag-level distribution with prototypes.\n\nWe can coarsely quantify the reduction in computational complexity compared to the original VIB. Assuming the sampling frequency is $K$, the number of samples per iteration is $N$, and there are $M$ instances of $D$-dimension in a bag, the computational complexity is $O(K\\cdot N\\cdot M\\cdot D)$. However, in PIB, we only need to sample from prototypes. Assume that the number of prototypes is $P$, the complexity becomes  $O(K\\cdot N\\cdot P\\cdot D)$, where $P << M$. For example, P is 8 in our work, while M is usually larger than 10,000."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2319/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700241538017,
                "cdate": 1700241538017,
                "tmdate": 1700241538017,
                "mdate": 1700241538017,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "JC1CbRQgVs",
            "forum": "otHZ8JAIgh",
            "replyto": "otHZ8JAIgh",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission2319/Reviewer_bKh7"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission2319/Reviewer_bKh7"
            ],
            "content": {
                "summary": {
                    "value": "This paper introduces a novel approach to predicting survival outcome by combining histology and genomics data. The model incorporates two novel components based on information bottlenecks in information theory: prototypical information bottleneck and prototypical information disentanglement."
                },
                "soundness": {
                    "value": "4 excellent"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "4 excellent"
                },
                "strengths": {
                    "value": "The problem is well defined and the introduced method is appropriate with detailed explanation and evaluation. Results represent a meaningful improvement on prior state of the art approaches. The analysis is thorough and builds upon established practices in the literature. Although the advances over the state of the art are modest, it does represent a consistent improvement compared to other methods across all datasets."
                },
                "weaknesses": {
                    "value": "There are very few weaknesses with this paper. \n\nThe evaluation could be improved by adding a “naive” combination of the risk scores from genomics and histology. This could be performed by taking the best performing models which look at an individual modality – i.e. SNNTrans and CLAM-MB – and then combining the predictions of these models using a Cox proportional hazards model against the original survival outcome data. This would act as a suitable baseline to see to what extent learning the combined risk prediction model as described in this work outperforms a naive approach to combining the risk prediction across the two modalities. This would allow the reader to fully understand the added benefit of the model described over the other approaches."
                },
                "questions": {
                    "value": "Kaplan-Meier analysis: please state how cut-offs were selected in the manuscript. \n\nPlease see comment about combining individual modality predictions using CoxPH as a “naive” baseline. \n\nThe appendix gives some discussion of hyperparameter choices, although it is not clear how these were selected with the dataset. As cross validation is used to generate the evaluation results, to what extent were the hyperparameters selected using the evaluation datasets and is there risk of selection bias as a result?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "10: strong accept, should be highlighted at the conference"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission2319/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698852079791,
            "cdate": 1698852079791,
            "tmdate": 1699636164171,
            "mdate": 1699636164171,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "VjmopHpjRP",
                "forum": "otHZ8JAIgh",
                "replyto": "JC1CbRQgVs",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2319/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2319/Authors"
                ],
                "content": {
                    "title": {
                        "value": "To Reviewer bKh7"
                    },
                    "comment": {
                        "value": "Thank you for your encouraging words and constructive comments. We sincerely appreciate your time in reading the paper. In the following, your comments are first stated and then followed by our point-by-point responses.\n\n---\n\n> **Q1) A “naive” baseline. The evaluation could be improved by adding a “naive” combination of the risk scores from genomics and histology. i.e. Combining individual modality predictions using CoxPH.**\n> \n\nThank you very much for this insightful comment! We follow your suggestion and combine the predictions of SNNTrans and CLAM-MB as a “naive” baseline. The results are added in **Table 1, Page 8**, and are also shown in the table below. \n\n| Methods | BRCA | BLCA | COADREAD | HNSC | STAD | Overall |\n| --- | --- | --- | --- | --- | --- | --- |\n| SNNTrans | 0.679(0.053) | 0.583(0.060) | 0.739(0.124) | 0.570(0.035) | 0.547(0.041) | 0.622 |\n| CLAM-MB | 0.696(0.098) | 0.623(0.045) | 0.721(0.159) | 0.620(0.034) | 0.648(0.050) | 0.662 |\n| SNNTrans+CLAM-MB(naive combination) | 0.699(0.064) | 0.625(0.060) | 0.716(0.160) | 0.638(0.066) | 0.629(0.065) | 0.661 |\n| PIBD | **0.736(0.072)** | **0.667(0.061)** | **0.768(0.124)** | **0.640(0.039)** | **0.684(0.035)** | **0.699** |\n\nFrom the results, it's clear that the \"naive\" combination approach at the prediction level yielded unsatisfactory results. The main reason behind this suboptimal performance is that this method focuses solely on single-modal learning, failing to extract relevant common information between modalities. This further underscores the superiority of our approach, which, through information disentanglement, eliminates redundancy between inter-models and effectively captures both specific and common information.\n\n---\n> **Q2) Kaplan-Meier analysis. Please state how cut-offs were selected in the manuscript.**\n> \n\nThank you for your suggestion.  We have provided more details about the Kaplan-Meier analysis in our manuscript. In our work, we employed a five-fold cross-validation evaluation, getting one model for every data fold. For every validation set, we determined the cut-offs by taking the median of the model-predicted risk values. Patients with a risk higher than the median are assigned as high risk, and patients with a risk lower than the median as low risk. In addition, in response to the suggestion from reviewer G86X, we have also reported the median survival months for each risk group on **Page 8**. \n\n---\n> **Q3) The hyperparameter choices. How hyperparameters were selected with the dataset. As cross-validation is used to generate the evaluation results, to what extent were the hyperparameters selected using the evaluation datasets and is there risk of selection bias as a result?**\n> \n\nThank you for bringing up this important point.  Due to the limited size of datasets, like many other methods, we chose cross-validation as the assessment approach, allowing us to effectively leverage the available data and enhance the reliability of our evaluation.\n\nIn our study, we adopted a careful approach to address the potential risk of selection bias in hyperparameter choices. To begin with, we defined the hyperparameter search space based on the commonly used ranges in information bottleneck methods like VIB[1] and MIB[2]. During the selection process, we implemented a grid search strategy. For each hyperparameter, while keeping others fixed, we conducted a five-fold cross-validation, selecting the hyperparameter that exhibited the best average performance across all validation sets. Furthermore, to further mitigate selection bias, these hyperparameters were selected on multiple datasets, ensuring the generalizability of the chosen configuration. By employing this approach, we aimed to minimize the risk of selection bias. \n\nwe have incorporated the introductions on this aspect into **Appendix C.2 on Page 19**. \n\n**REFERENCES**\n\n[1]  Alemi, Alexander A., et al. \"Deep Variational Information Bottleneck.\" *International Conference on Learning Representations*. 2016.\n\n[2] Federici, Marco, et al. \"Learning Robust Representations via Multi-View Information Bottleneck.\" *8th International Conference on Learning Representations*. OpenReview. net, 2020."
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2319/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700241437366,
                "cdate": 1700241437366,
                "tmdate": 1700241437366,
                "mdate": 1700241437366,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]