[
    {
        "title": "Hyper-parameter Tuning for Fair Classification without Sensitive Attribute Access"
    },
    {
        "review": {
            "id": "oB2af3OMOb",
            "forum": "p3vHM5e4Z0",
            "replyto": "p3vHM5e4Z0",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission3907/Reviewer_ig7f"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission3907/Reviewer_ig7f"
            ],
            "content": {
                "summary": {
                    "value": "•\tAs sensitive attribute information may be unavailable in training and validation sets, this paper proposes the Antigone algorithm. It leverages the classification outcomes of the classifier to generate pseudo-sensitive attributes on the validation set. Subsequently, it utilizes these generated pseudo-sensitive attributes to guide the hyperparameter tuning of the model.\n\n•\tTo generate high-quality pseudo-labels, Antigone selects the classifier with the maximum EDM as its labeling model.\n\n•\tBuilding upon some existing fairness methods, the experiments show that Antigone can further improve fairness by fine-tuning its hyperparameters."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "•\tThis paper proposes an new method to fine-tune hyperparameters for existing fairness methods, particularly in scenarios where sensitive attributes are not accessible. \n\n•\tThe method introduced in this paper, Antigone, efficiently utilizes the ERM model to produce high-quality pseudo-sensitive attribute labels, denoted as PSA."
                },
                "weaknesses": {
                    "value": "•\tTo the best of my knowledge, several methods currently exist that either generate pseudo-sensitive attribute or use proxy sensitive attribute in scenarios where sensitive attributes are unavailable [1,2,3]. However, the related work section provides only a concise overview of these methods. It is recommended to engage in a more comprehensive discussion, with particular emphasis on elucidating the distinctions between these approaches.\n\n•\tThe experimental section demonstrates that Antigone can yield improved results when fine-tuning existing fairness methods. However, I am still curious about how these results compare to those obtained by other methods that generate pseudo-sensitive attribute labels.\n\n•\tIn the theoretical section, the MC ideal model is used. To enhance reader comprehension, it would be beneficial to provide a more detailed introduction to the MC model, along with its theoretical guarantees.\n\n1.\tZhao, Tianxiang, et al. \"Towards fair classifiers without sensitive attributes: Exploring biases in related features.\" Proceedings of the Fifteenth ACM International Conference on Web Search and Data Mining. 2022.\n\n2.\tZhu, Zhaowei, et al. \"Weak Proxies are Sufficient and Preferable for Fairness with Missing Sensitive Attributes.\" (2023).\n\n3.\tGrari, Vincent, Sylvain Lamprier, and Marcin Detyniecki. \"Fairness without the sensitive attribute via causal variational autoencoder.\" arXiv preprint arXiv:2109.04999 (2021)."
                },
                "questions": {
                    "value": "See weakness."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission3907/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698738751296,
            "cdate": 1698738751296,
            "tmdate": 1699636350732,
            "mdate": 1699636350732,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "dNbYaFNE1M",
            "forum": "p3vHM5e4Z0",
            "replyto": "p3vHM5e4Z0",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission3907/Reviewer_ftMx"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission3907/Reviewer_ftMx"
            ],
            "content": {
                "summary": {
                    "value": "The paper studies how to mitigate bias without access to sensitive attributes. It features two things: (1) it does not require sensitive attributes on the validation set and (2) it does not need (extensive) hyper-parameter tuning.\n\nThe idea is to use the target label as the proxy of the sensitive attribute, and then use the metric of mean Euclidean distance between features to tune the hyper-parameters."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "The paper explores an important problem with appealing features (i.e. no hyper-parameter tuning and no sensitive attribute on the validation set), if true."
                },
                "weaknesses": {
                    "value": "1. I am puzzled by the design of using the target label as the sensitive attribute. I do not find any justification, either empirical or theoretical, other than claiming, in the introduction, that correctly classified samples would be over-represented and incorrectly classified samples would be under-represented. \n\nIf the target label can be used as a proxy of sensitive attributes, why would people still need sensitive attributes in fairness study at all? I find this is a very broad claim that should be heavily backed up by either strong empirical evidence or solid theoretical insights.\n\nIn addition, I can think of plenty of counter-examples to show it is not true. Consider the following tabular data with 5 samples:\n\n|           | $x_1$ | $x_2$ | $x_3$ | $x_4$ | $x_5$ |\n|-----------|-------|-------|-------|-------|-------|\n| Y         | 0     | 1     | 1     | 0     | 1     |\n| $\\hat{Y}$ | 1     | 1     | 0     | 0     | 1     |\n| A         | 1     | 0     | 1     | 0     | 0     |\n\n\nIn this case, the incorrectly classified samples ($x_1$ and $x_3$) are not over-presented by the disadvantaged group ($A=0$); in fact, they have no disadvantaged samples at all. The correctly classified samples (the remaining) are not over-represented by the advantaged group ($A=1$); in fact, they have no advantaged samples at all.\n\nThe authors might argue this is a cherry-picked corner case and not what happens statistically. But then the point is to have more justification for this strong and general claim.\n\n\n2. The theoretical justification for using EDM seems to me a misunderstanding of Lamy et al. The assumption of Lamy et al. is not the Eq. (7), but rather replace the $X$ in Eq.(7) with $D$ where $D$ is the joint distribution $P(X, Y, A)$. This difference is vital because in this work, the reason why EDM can be justified is the MC assumption is only applied to feature $X$ and therefore you can only look at feature distance to perform hyper-parameter; and since it assumes has nothing to do with either label $Y$ or sensitive attribute $A$, the work can claim it requires no sensitive attribute labeling on the validation set.\n\nHowever, this is not the assumption in Lamy et al. If I am not mistaken, the theory would not hold if you simply ignore the MC relationship on $A$ and $Y$ in the assumption. I am happy to change my mind if the authors can point out if I am mistaken. But if not, this seems to be a misquote of the results in Lamy et al., and the consequent justification of EDM does not hold."
                },
                "questions": {
                    "value": "See weakness."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission3907/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698778817143,
            "cdate": 1698778817143,
            "tmdate": 1699636350628,
            "mdate": 1699636350628,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "ydfJhj6w3c",
            "forum": "p3vHM5e4Z0",
            "replyto": "p3vHM5e4Z0",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission3907/Reviewer_WjCg"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission3907/Reviewer_WjCg"
            ],
            "content": {
                "summary": {
                    "value": "The paper explores the problem of balancing model performance across different demographic groups (fairness) without having access to the demographic information. The paper argues that most existing fairness methods without demographics require access to a validation dataset with demographic information, which might not be available. To solve this problem, Antigone is proposed. Antigone is a framework to train fair classifiers without access to demographic information on training or the validation dataset."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "•\tThe paper approaches the problem of hyperparameter tuning when sensitive attributes are unavailable in the validation dataset, an exciting and often overlooked problem. \n\n•\tThe results obtained using Antigone were close to the results of using the ground truth labels with JTT, as shown in Table 2. This result indicates that the assumption of demographic information in the validation dataset is unnecessary. \n\n•\tMoreover, the comparison with ARL in Table 4 indicates that Antigone may also improve the performance of methods that do not use sensitive information during validation.\n\n•\tThe last two points show the flexibility of Antigone and demonstrate how it can be used to improve (either by relaxing data assumptions or improving the performance of existing methods) existing approaches."
                },
                "weaknesses": {
                    "value": "•\tThe paper only compares its results for WGA when using GEORGE. Why not show the results for DP and EO too?\n\n•\tThe paper could compare the results acquired by Antigone with other methods that assume access to sensitive attributes during validation. This could make the point that Antigone is flexible and can successfully replace sensitive attributes in the validation dataset clearer.\n\n•\tHow does Antigone compare with other methods of predicting PSA?"
                },
                "questions": {
                    "value": "How could Antigone be modified to account for various demographic groups, i.e., A = {1, 2, 3, …, m} with m potentially exponentially large? Does ensuring that the fairness metric for the binary PSA is sufficient in this case? I ask this question because of Lemma 2.2."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission3907/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission3907/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission3907/Reviewer_WjCg"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission3907/-/Official_Review"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699647875847,
            "cdate": 1699647875847,
            "tmdate": 1699647875847,
            "mdate": 1699647875847,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    }
]