[
    {
        "title": "Near-Optimal Quantum Algorithm for Minimizing the Maximal Loss"
    },
    {
        "review": {
            "id": "DZfZWfUhDu",
            "forum": "pB1FeRSQxh",
            "replyto": "pB1FeRSQxh",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission5095/Reviewer_gKCY"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission5095/Reviewer_gKCY"
            ],
            "content": {
                "summary": {
                    "value": "The paper considers a convex optimization problem where the function to be minimized is the maximum of $N$ convex Lipschitz functions. The paper presents a quantum algorithm which finds an $\\epsilon$-good solution using $\\tilde{O}(\\sqrt{N}\\epsilon^{-5/3} + \\epsilon^{-8/3})$ queries. The paper complements the algorithmic result with a lower bound showing that the dependence on $N$ is optimal up to logarithmic factors.\n\nThe paper builds on the classical algorithm of Carmon et. al. which is based on the Ball optimization acceleration technique, and then identifies parts where a quadratic quantum speedup can be applied."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "The results of the paper are novel and interesting. Furthermore, the dependence of the number of queries of the algorithm that is presented in the paper on the number of functions $N$ is shown to be optimal up to logarithmic factors.\n\nI also find the paper to be generally well written."
                },
                "weaknesses": {
                    "value": "There is still a gap between the query-complexity of the algorithm and the shown lower bound in terms of the dependence on $\\epsilon$, but this is not a significant weakness of the paper."
                },
                "questions": {
                    "value": "The quadratic speedup is a recurring feature of quantum algorithms and in many cases the phenomenon at the core of the speedup is the same. The techniques described in this paper can perhaps be applied to other computational/optimization problems. I wonder if one can state a general meta-theorem of the form: \"For a wide class of computational/optimization problems, if we have a classical algorithm that solves it and which satisfy some properties, then we can find a corresponding quantum algorithm with a quadratic speedup\"."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission5095/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission5095/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission5095/Reviewer_gKCY"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission5095/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698864828081,
            "cdate": 1698864828081,
            "tmdate": 1699636501018,
            "mdate": 1699636501018,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "C4QS5KO0bz",
                "forum": "pB1FeRSQxh",
                "replyto": "DZfZWfUhDu",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5095/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5095/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "We appreciate your positive feedback and detailed suggestions!\n\nPlease refer to our general response for your comment on the gap between our upper bound and lower bound.\n\nRegarding your question on a potential meta-theorem, we agree that it is indeed a good research question to ask.\nThere have been many quantum algorithms on important subroutines adopted in many classical algorithms.\nFor example, our paper exploits a quantum speedup for multiple sampling from the same distribution found by Hamoudi [1].\nHowever, the possibility of deriving a meta-theorem appears uncertain to us. Distinct quantum approaches and techniques, albeit that the source of the speedup might be the same, are needed for different scenarios with different settings.\nIn particular, conceptually Gao et al. [2] and Bouland et al. [3] both achieve speedup on sampling, but the sampling tasks are slightly different, leading to entirely different algorithms compared to the one used in our algorithm.\nGenerally, we think it is nontrivial to summarize types of sampling tasks with similar quantum speedup due to the diversity and specificity of scenarios.\n\n**References**\n\n[1] Yassine Hamoudi. \"Preparing Many Copies of a Quantum State in the Black-Box Model.\" In Phys. Rev. A, vol. 105, no. 6, p. 062440, Jun. 2022, doi: 10.1103/PhysRevA.105.062440. arXiv:2207.11014\n\n[2] Minbo Gao, Zhengfeng Ji, Tongyang Li, and Qisheng Wang. \"Logarithmic-Regret Quantum Learning Algorithms for Zero-Sum Games.\" To appear in the Conference on Neural Information Processing Systems, 2023. arXiv:2304.14197\n\n[3] Adam Bouland, Yosheb M. Getachew, Yujia Jin, Aaron Sidford, and Kevin Tian. \"Quantum speedups for zero-sum games via improved dynamic Gibbs sampling.\" In International Conference on Machine Learning, pp. 2932-2952. PMLR, 2023. arXiv: 2301.03763"
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5095/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700290633932,
                "cdate": 1700290633932,
                "tmdate": 1700290633932,
                "mdate": 1700290633932,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "OyRwKq9Jq0",
            "forum": "pB1FeRSQxh",
            "replyto": "pB1FeRSQxh",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission5095/Reviewer_ixEA"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission5095/Reviewer_ixEA"
            ],
            "content": {
                "summary": {
                    "value": "The paper studies the question of minimizing the maximum of N convex Lipschitz loss functions f1, f2,...,fN. It is known that you can do so with O(N eps^{-2/3} + eps^{-8/3}) queries. The paper here studies a quantum version of the problem and achieve a complexity that is sqrt{N} eps^{-5/3} + eps^{-8/3}. While the eps-dependence is slightly worse, the dependence on N has improved by a quadratic factor. \n\nThe main idea is to take a classical algorithm for the problem and modify one of the key-steps to exploit quantum advantage. Specifically, the authors exploit the fact that the classical algorithm uses a regularized ball optimization oracle (BROO) which is similar to a Gibbs sampling problem. The latter is known to have a quantum advantage and exploiting the better algorithms for that gives the final result."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "The paper studies a natural problem in optimization and shows that quantum algorithms could do better."
                },
                "weaknesses": {
                    "value": "A disadvantage is that the algorithm in a sense takes an existing classical algorithm and replaces a step in it with a suitable, known, quantum algorithm. So novelty is a bit low."
                },
                "questions": {
                    "value": "None."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission5095/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699077014573,
            "cdate": 1699077014573,
            "tmdate": 1699636500914,
            "mdate": 1699636500914,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "BA1qFQOaJM",
                "forum": "pB1FeRSQxh",
                "replyto": "OyRwKq9Jq0",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5095/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5095/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "We appreciate your positive feedback and detailed comments!\n\nPlease refer to our general response for your comment on the novelty of our algorithm."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5095/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700290555176,
                "cdate": 1700290555176,
                "tmdate": 1700290555176,
                "mdate": 1700290555176,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "idSq67uRjG",
            "forum": "pB1FeRSQxh",
            "replyto": "pB1FeRSQxh",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission5095/Reviewer_J3o2"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission5095/Reviewer_J3o2"
            ],
            "content": {
                "summary": {
                    "value": "This paper designs new quantum algorithm for the problem of minimizing the maximum of $N$ convex functions with near optimal quantum query complexity. \n\nGiven $f_1,\\ldots, f_N$ convex and $L$-Lipschitz functions from $\\mathbb{R}^d$ to $\\mathbb{R}$. The function $F_{max}(x)$ is defined as:  $F_{max}(x)$  = ${max}_{i} \\\\{f_i(x)\\\\}$. \n\nThe goal is to find an $x*$ so that $F_{max}(x*) - inf_{x} F_{max}(x) \\leq \\epsilon$. \n\nThis is a fundamental optimization task and substantial research has gone in identifying the number of oracle queries required (say to $f_i$s and its gradients - called the first order oracle) as a function of both $N$ -- the number of functions, and $\\epsilon$ -- the error parameter. Tight results have been established (matching upper and lower bounds in the number of queries) in the literature for some regimes of parameters (especially for $\\epsilon \\geq 1/\\sqrt{N}$).  However, these prior research only focused on 'classical queries.' In this paper the authors consider 'quantum query complexity' of the problem.  It is well established that in general quantum query algorithms can get a quadratic speed up over classical query algorithm. The present paper extends that to the above described minimizing-the-maximum-loss problem.  \n\nThe paper establishes an upper bound of $\\tilde{O}(\\sqrt{N} \\epsilon^{-5/3} + \\epsilon^{-8/3})$ and a lower bound of $\\tilde{\\Omega}(\\sqrt{N}\\epsilon^{-2/3})$ on the number of quantum queries required for solving the problem. \n\nThus with respect to $N$, the established results are optimal. But there is a gap in upper and lower bounds in terms of $\\epsilon$. Closing this gap, the authors pose as a natural open question. The quantum oracle model they use is what is typically seen in the literature and is called the zeroth-order oracle  in the optimization terminology."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "The strength is that the paper  reports progress on a fundamental and well-studied optimization task. It is natural to consider the question whether the speed up you get in other quantum search algorithms (such as in Grover's algorithm) can be lifted to the optimization literature also.  So in that sense, the results established are clean and informative."
                },
                "weaknesses": {
                    "value": "A weakness is the originality. It appears that nothing very new is going on here and the results (at least with respect to $N$) are expected. Also, it is not optimal with respect to $\\epsilon$. In fact, known classical algorithms do better with respect to $\\epsilon$. So in that sense the picture is not complete, which the authors do not seem to address."
                },
                "questions": {
                    "value": "It will be nice to further explain  the reason for the gap in upper and lower bounds, in particular in comparison with classical algorithms. Is the reason classical algorithm does better in $\\epsilon$ is because of more powerful (first order as opposed to zeroth order) oracle? Also, I am not clear what you mean by the statement \"However, as far as we know, ...\" the last sentence before Contributions. Probably it is good idea to make sure it is indeed open.  It is probably fine for smaller results in the paper, but for the main question you are considering, it is better to make sure that the status of the problem."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "details_of_ethics_concerns": {
                    "value": "No Concern."
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission5095/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699244406581,
            "cdate": 1699244406581,
            "tmdate": 1699636500833,
            "mdate": 1699636500833,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "qiwhHUAmy4",
                "forum": "pB1FeRSQxh",
                "replyto": "idSq67uRjG",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5095/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5095/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "We appreciate your detailed suggestions!\n\nPlease refer to our general response for your comment and question on the novelty and unmatched bounds.\n\nRegarding your comment on the uncertainty in the wording of the contribution part of our paper, we have made sure that the problem is still open and changed the statement accordingly."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5095/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700290535293,
                "cdate": 1700290535293,
                "tmdate": 1700290535293,
                "mdate": 1700290535293,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "WQI7HyfIa5",
            "forum": "pB1FeRSQxh",
            "replyto": "pB1FeRSQxh",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission5095/Reviewer_aSjj"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission5095/Reviewer_aSjj"
            ],
            "content": {
                "summary": {
                    "value": "The paper presents an improved quantum algorithm for minimizing the maximal loss of $N$ convex functions, the key idea is quantum Gibbs sampling subroutine that improves the classical subroutine.\n\nThe paper studies the problem of minimizing the loss of $N$ convex functions, i.e., $\\min_{x} \\max_{i \\in [N]}f_{i}(x)$ for convex functions $f_{1}, \\ldots, f_{N}$ given gradient oracle. The best classical algorithm for finding $\\epsilon$-approximate solution is given by [Carmon et al. 2021] with $O(N\\epsilon^{-2/3} +\\epsilon^{-8/3})$ queries, which is known to be optimal in the low accuracy regime $\\epsilon \\geq 1/\\sqrt{N}$. The idea is to approximate the maximal loss with softmax function and use the improved ball optimization oracle [Carmon et al. 2020].\n\nThe paper studies quantum algorithms and the algorithm is equipped with zero-th order quantum oracle (it can be used to obtain gradient oracle) and improve the bound to $O(\\sqrt{N}\\epsilon^{-5/3} +\\epsilon^{-8/3})$. It also gives a lower bound saying $\\Omega(\\sqrt{N}\\epsilon^{-2/3})$ queries are necessary for finding $\\epsilon$-approximate solution.\n\nThe main idea of the algorithm is an improved estimation of the gradient, which in turns boils down to improved quantum Gibbs sampling procedure (note the gradient draws from a distribution, which requires $N$ queries, but quantum algorithm could take advantage and only needs $\\sqrt{N}$ queries)"
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "The paper gives improved quantum algorithm for a basic problem in convex optimization. The idea of using quantum Gibbs sampling for improve is interesting."
                },
                "weaknesses": {
                    "value": "The major unsatisfactory point is the unmatched upper and lower bound.\n\nThe presentation is fine in general, but it could be improved (e.g. I found the English a bit awkward some time). Some detailed comments:\n\n(1) Page 1.  \"Nesterov (2018) showed ...\"  I believe it is an old result, not shown recently. Probably change it to something like \"it is known that .... e.g., see Nesterov (2018) \".\n\n(2) Page 4. \"named ket\" I don't think you need to name it. For quantum people, they know what's the notation means; for non-quantum people, it is not informative and it does not appear twice in the paper.\n\n(3) Line 5 in Algorithm 1. The subscription is confusing.\n\n(4) Page 8 \" given in Ref.  Carmon et al. (2021)\". Remove Ref."
                },
                "questions": {
                    "value": "I tried to understand Algorithm 2 (quantum sampling algorithm), but due to some time constraints, I did not fully understand it and I believe some better explanation should make the paper better.\n\nI understand that you first find the $K$ largest elements of the distribution, and then you set the probability of rest element equals the probability of the $K$-th element -- this changes the distribution. Do you need some rejection sampling procedure afterwards?\n(Is the answer is in figure 1? Then it would be better to move figure to the main paper)."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission5095/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699246939681,
            "cdate": 1699246939681,
            "tmdate": 1699636500719,
            "mdate": 1699636500719,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "92Dkt6q1Is",
                "forum": "pB1FeRSQxh",
                "replyto": "WQI7HyfIa5",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5095/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5095/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "We appreciate your detailed comments!\n\nPlease refer to our general response for your comment on the unmatched upper and lower bound.\n\nRegarding your question about Algorithm 2,\nwe did not use any rejection sampling for the preparation of the states.\nThe unitary $\\mathcal{D}$ that is built in the step 3 of our Algorithm 2 is used only as a subroutine in the circuit that is shown in Figure 1.\nWith several additional gates, in Figure 1 we build a circuit that prepares a state that contains the desired and an ancillary garbage state.\nWe then apply the amplitude amplification algorithm to prepare the desired state, as shown in step 5 of Algorithm 2.\nThe reason we first only consider the first $K$ largest element is to guarantee that the amplitude amplification can extract the state we want efficiently: in Eq. (26) we lower bound the coefficient before the target state, guaranteeing a total cost of $\\tilde{O}(\\sqrt{NK})$ according to Proposition 3.\nWe have made updates correspondingly in the paper to improve the presentation of Algorithm 2.\n\nWe also thank you for detailed suggestions regarding presentation - they have been fixed in the revised version."
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5095/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700290406873,
                "cdate": 1700290406873,
                "tmdate": 1700290406873,
                "mdate": 1700290406873,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]