[
    {
        "title": "Efficient Multi-Fidelity NAS with Zero-Cost Proxy-Guided Local Search"
    },
    {
        "review": {
            "id": "Xcg7jNw8oc",
            "forum": "PKZJX0LSZ1",
            "replyto": "PKZJX0LSZ1",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission2448/Reviewer_K4zY"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission2448/Reviewer_K4zY"
            ],
            "content": {
                "summary": {
                    "value": "This paper exploits the capabilities of zero-cost proxies in NAS to identify good regions of the search space and later on employs a multi-fidelity method (SuccessiveHalving) in order to optimize in this region identified by local search using the ZCPs as objective function. The authors evaluate their algorithm on standard tabular NAS benchmarks such as NB101, NB201 and NB-ASR, achieving better performance compared to other blackbox NAS optimizers."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "- The paper provides some interesting insights on the performance of ZCPs on standard NAS tabular benchmarks. The visualization via MLON is interesting and backs up the reasoning behind using local search to identify promising regions in a multimodal landscape defined by the proxies' objective.\n\n- In general I like the idea to identify promising regions of large search spaces in order to exploit more there by allocating more resources. The idea of using SuccessiveHalving (SH) is simple and provides an effective way to find stress more exploitation in the end.\n\n- The results look promising in the benchmarks that the authors picked.\n\n- Easy to follow and the visualizations are clear and informative enough to quickly get the gist of the paper.\n\n- Available code."
                },
                "weaknesses": {
                    "value": "- **Novelty**: The proposed algorithm combines existing methods for NAS and multi-fidelity optimization, therefore I do not see much contributions in methodological novelty. Granted, the authors determine to use Local Search instead of Random Search for unimodal ZCP distributions, based on their loss landscape observations, however I am not sure how effective this is for ZCP on larger search spaces.\n\n- **More benchmarks**: The authors did evaluate their algorithm only on 3 tabular benchmarks, while there are many more available in NAS-Bench-Suite-Zero. Moreover, I think it is still important to benchmark the performance of MF-NAS in other standard benchmarks (at least even CIFAR-10, DARTS space).\n\n- **Comparison to one-shot NAS**: In the appendix the authors compare to one-shot NAS approaches, such as ShapleyNAS and DrNAS, which achieve the same performance in NB201 as their method. ShapleyNAS and DrNAS are already quite efficient algorithms, so this puzzles me a bit regarding the usefulness of MF-NAS."
                },
                "questions": {
                    "value": "- Is there any reason why the authors didn't evaluate their approach on all the benchmarks in NAS-Bench-Suite-Zero?\n\n- Can the authors say a few more words regarding the comparison to one-shot NAS methods, especially related to the search costs?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission2448/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698928783935,
            "cdate": 1698928783935,
            "tmdate": 1699636180769,
            "mdate": 1699636180769,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "hkjktU0bE6",
            "forum": "PKZJX0LSZ1",
            "replyto": "PKZJX0LSZ1",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission2448/Reviewer_eGD3"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission2448/Reviewer_eGD3"
            ],
            "content": {
                "summary": {
                    "value": "This paper raises a good question for NAS researchers: whether ZC metrics are essential and old-fashion training-based metrics may be better. The paper investigates the effectiveness of ZC proxies in NAS by taking a deeper look into their fitness landscapes rather than focusing only on rank correlation. Furthermore, the authors proposed a method combining ZC metrics and training-based metrics. The experiments show the good performance of the proposed approach."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. The studied problem is important. ZC metrics are widely utilized in automated machine learning for finding good architectures.\n2. The paper is written well.\n3. The idea of combining ZC metrics and training-based metrics makes sense."
                },
                "weaknesses": {
                    "value": "1. The experiments are weak. In experiments, the authors have missed those recent advances of utilizing ZC metrics in neural architecture search, some of which are listed as follows:\n\n- Proxybo: Accelerating neural architecture search via bayesian optimization with zero-cost proxies, AAAI 2022\n- RD-NAS: Enhancing One-shot Supernet Ranking Ability via Ranking Distillation from Zero-cost Proxies, ICASSP 2023.\n- Zero-cost operation scoring in differentiable architecture search, AAAI 2023\n- Extensible and Efficient Proxy for Neural Architecture Search, ICCV 2023.\n\nThat is, both the preliminary analysis and performance comparison lack of the study of the recent methods of this area.\n\n2. To claim the limitation of ZC metrics, more theoretical analysis is required."
                },
                "questions": {
                    "value": "My questions include two parts, corresponding to the Weaknesses.\n\n(1) Why don't you consider the recent advances in this area?\n(2) What about the theoretical basis?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission2448/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699123906946,
            "cdate": 1699123906946,
            "tmdate": 1699636180701,
            "mdate": 1699636180701,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "Wl6Q7gl93I",
            "forum": "PKZJX0LSZ1",
            "replyto": "PKZJX0LSZ1",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission2448/Reviewer_Kzxp"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission2448/Reviewer_Kzxp"
            ],
            "content": {
                "summary": {
                    "value": "This work constructs fitness landscapes for several ZC proxy-based local search through LON visualization tool. The authors conclude that a high correlation does not guarantee finding high-performance architecture, and ZC proxies with low correlation could still be better in certain situations. Therefore, the authors introduce a two-stage NAS method, named MF-NAS by first shrinking the search space through ZC proxy-based local search and then adopt successive halving strategy to search on the small space."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1.\tIt is quite interesting to construct fitness landscapes through LON visualization tool."
                },
                "weaknesses": {
                    "value": "1.\tI am afraid that the visualization results are not so convincing. On the one hand, the search space is quite small (NAS-Bench-201); On the other hand, only local search algorithm is explored, the results and conclusion may not suitable for EA or BO.\n\n2.\tThe novelty is limited. The local search and successive halving algorithm is widely used in NAS tasks."
                },
                "questions": {
                    "value": "Please see the weaknesses."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission2448/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699235231991,
            "cdate": 1699235231991,
            "tmdate": 1699636180615,
            "mdate": 1699636180615,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    }
]