[
    {
        "title": "Deep Geodesic Canonical Correlation Analysis for Covariance-Based Neuroimaging Data"
    },
    {
        "review": {
            "id": "gkFFp2WqEU",
            "forum": "PnR1MNen7u",
            "replyto": "PnR1MNen7u",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4904/Reviewer_2nXA"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4904/Reviewer_2nXA"
            ],
            "content": {
                "summary": {
                    "value": "While researchers began to utilize multi-model data for neuroimaging analysis with the hope to combine distinct information from multiple modalities, the challenge in learning a shared representation space has arisen. The authors pointed out that this is especially nontrivial when dealing with covariance-based data characterized by their geometric structure.\n\nTo that end, the authors proposed a metric termed “geodesic correlation” that expands traditional correlation consistency to covariance-based data on symmetric positive definite manifolds and measures the consistency of latent representations obtained from paired views/modalities. They further proposed a deep learning framework termed “DeepGeoCCA” for data on symmetric positive definite manifolds that optimizes the geodesic correlation of unlabeled paired data."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "1. The motivation to learn a joint latent space with coherence between two latent representations from different modalities is well grounded. \n\n2. Compared to existing methods like DeepCCA and VICReg, both of which learn the correlation relationship between two latent representations, the proposed DeepGeoCCA better retain the geometric relations as analyzed theoretically and empirically.\n\n3. Figures 3 and 4 are well designed."
                },
                "weaknesses": {
                    "value": "1. The authors proposed a metric and a learning framework for \"covariance-based data\" on symmetric positive definite manifolds, but they have not yet motivated why the EEG/fMRI data are “covariance-based data” and/or why they lie on symmetric positive definite manifolds. While this might be obvious to some people, it is a bit confusing to me.\n\n2. The experiments are a bit weak. While the proposed DeeGeoCCA managed to achieve a higher geodesic correlation, empirical evidence on how this may benefit the learned representation is not clear. Table 2 only showed marginal improvement on the downstream task on relatively small datasets."
                },
                "questions": {
                    "value": "1. Excuse my poor knowledge, but it seems to me that the term “covariance-based data” is not a standard or widely recognized term in the field of statistics or data analysis. Would it be better to define the term somewhere in the paper?\n\n2. On page 4 and 5, you have LaTeX failures (Appendix ??).\n\n3. Possible typo on page 6, “the activity of a latent, shared source, we generated paired views in $S_{++}^2$ $^2$”."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission4904/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4904/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4904/Reviewer_2nXA"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4904/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698509612769,
            "cdate": 1698509612769,
            "tmdate": 1700700575758,
            "mdate": 1700700575758,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "izdZ2drV84",
                "forum": "PnR1MNen7u",
                "replyto": "gkFFp2WqEU",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4904/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4904/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Weakness 1"
                    },
                    "comment": {
                        "value": "We appreciate the reviewers' effort to provide feedback and suggestions. Thank you also for expressing your concerns regarding weaknesses and posing additional questions. Please find our detailed responses below.\n\n> Weakness 1: The authors proposed a metric and a learning framework for \"covariance-based data\" on symmetric positive definite manifolds, but they have not yet motivated why the EEG/fMRI data are “covariance-based data” and/or why they lie on symmetric positive definite manifolds. While this might be obvious to some people, it is a bit confusing to me.\n \nOur response: Thank you for pointing us to this issue. Based on the feedback of this reviewer, we included a precise motivation for covariance-based data in Appendix A. Specifically, we added motivations for EEG spatial covariance matrices and fMRI functional connectivity matrices as elements on the SPD manifolds.\n\nFirstly, let us formally define covariance-based neuroimaging data as follows: \n\n**Definition (Covariance-Based Neuroimaging Data)**: the covariance matrix of a neuroimaging data segment, represented by $X \\in \\mathbb{R}^{n_C \\times n_T}$, is denoted as $S =  XX^{\\top} \\in \\mathcal{S}_{++}^{n_C}$, where $n_C$ is the number of spatial dimensions and $n_T$ is the signal timesteps. \n\nBy definition, covariance-based data is inherently symmetric and positive definite, existing on the Symmetric Positive Definite (SPD) manifolds. Even for degenerate cases (e.g., co-linear spatial dimension), the positive definiteness can be ensured via shrinkage regularization or dimensionality reduction.\n\nNext, let us briefly explain why we chose the second-order statistics of these neuroimaging data as our primary focus for investigation. In a nutshell, EEG spatial covariance matrices capture relevant aspects of neural activity within short to long-time scales. Riemannian geometry-aware methods operating with these covariance-based data are considered state-of-the-art in various EEG application domains, including clinical applications [1,2] and recent brain-computer interface competitions [3,4]. Concerning fMRI, covariance (or correlation) matrices between regions of interest reflect static and dynamic communication between brain networks and their alterations in tasks [5] and pathological conditions [6].\n\nReferences:\n\n[1] D. Sabbagh, P. Ablin, G. Varoquaux, A. Gramfort, and D. A. Engemann, “Predictive regression modeling with MEG/EEG: from source power to signals and cognitive states,” NeuroImage, vol. 222, p. 116893, Nov. 2020, doi: 10.1016/j.neuroimage.2020.116893.\n\n[2] L. A. W. Gemein et al., “Machine-learning-based diagnostics of EEG pathology,” NeuroImage, vol. 220, p. 117021, Oct. 2020, doi: 10.1016/j.neuroimage.2020.117021.\n\n[3] R. N. Roy et al., “Retrospective on the First Passive Brain-Computer Interface Competition on Cross-Session Workload Estimation,” Front. Neuroergonomics, vol. 3, p. 838342, Apr. 2022, doi: 10.3389/fnrgo.2022.838342.\n\n[4] X. Wei et al., “2021 BEETL Competition: Advancing Transfer Learning for Subject Independence and Heterogenous EEG Data Sets,” in Proceedings of the NeurIPS 2021 Competitions and Demonstrations Track, D. Kiela, M. Ciccone, and B. Caputo, Eds., in Proceedings of Machine Learning Research, vol. 176. PMLR, Dec. 2022, pp. 205–219.\n\n[5] H.-J. Park and K. Friston, “Structural and Functional Brain Networks: From Connections to Cognition,” Science, vol. 342, no. 6158, p. 1238411, Nov. 2013, doi: 10.1126/science.1238411.\n\n[6] A. Yamashita et al., “Generalizable brain network markers of major depressive disorder across multiple imaging sites,” PLOS Biology, vol. 18, no. 12, pp. 1–26, Dec. 2020, doi: 10.1371/journal.pbio.3000966."
                    }
                },
                "number": 9,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4904/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700131432188,
                "cdate": 1700131432188,
                "tmdate": 1700131432188,
                "mdate": 1700131432188,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "7nmqR6PrR2",
                "forum": "PnR1MNen7u",
                "replyto": "gkFFp2WqEU",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4904/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4904/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Weakness 2 (Part 2)"
                    },
                    "comment": {
                        "value": "Our response (**Part 2**): \n\n**Rebuttal Table 2**: Auxiliary multi-view EEG downstream results summarize the statistical results in Table 2 in the manuscript. We used permutation, paired t-tests to identify significant differences between the lower-bound (i.e., no pre-training) with DeepGeoCCA for three scenarios ($S_1$, $S_2$, $S_1 \\rightarrow S_2$; t-max adjustment for multiple comparisons) and the KU (df=53, 1e4 permutations) and BNCI datasets (df=11, exhaustive permutations).\n\n|                       | dataset         |         KU         |               |        BNCI        |               |\n|-----------------------|-----------------|:------------------:|:-------------:|:------------------:|:-------------:|\n|                       |                 | accuracymean (std) | t-val (p-val) | accuracymean (std) | t-val (p-val) |\n|              scenario | SSL pretraining |                    |               |                    |               |\n|                 $S_1$ |              no |      62.97 (12.46) | -6.1 (0.0001) |      74.12 (16.50) |  -3.1 (0.039) |\n|                       |      DeepGeoCCA |      65.90 (12.95) |             - |      77.58 (14.56) |             - |\n|  $S_2$                |              no |      65.85 (12.95) | -4.0 (0.0001) |      75.62 (14.58) |  -2.9 (0.047) |\n|                       |      DeepGeoCCA |      68.11 (13.64) |             - |      78.46 (13.95) |             - |\n| $S_1 \\rightarrow S_2$ |              no |      62.89 (12.29) | -4.4 (0.0001) |      75.00 (14.73) |  -2.6 (0.083) |\n|                       |      DeepGeoCCA |      65.43 (13.42) |             - |      77.83 (13.70) |             - |\n\n\nReferences:\n\n[1] S. H. Fairclough and F. Lotte, “Grand Challenges in Neurotechnology and System Neuroergonomics,” Front. Neuroergonomics, vol. 1, p. 602504, Nov. 2020, doi: 10.3389/fnrgo.2020.602504.\n\n[2] T. Warbrick, “Simultaneous EEG-fMRI: What Have We Learned and What Does the Future Hold?,” Sensors, vol. 22, no. 6, p. 2262, Mar. 2022, doi: 10.3390/s22062262.\n\n[3] M. G. Philiastides, T. Tu, and P. Sajda, “Inferring Macroscale Brain Dynamics via Fusion of Simultaneous EEG-fMRI,” Annu. Rev. Neurosci., vol. 44, no. 1, pp. 315–334, Jul. 2021, doi: 10.1146/annurev-neuro-100220-093239.\n\n[4] X. Liu, T. Tu, and P. Sajda, “Inferring latent neural sources via deep transcoding of simultaneously acquired EEG and fMRI.” arXiv, Nov. 2022. http://arxiv.org/abs/2212.02226"
                    }
                },
                "number": 11,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4904/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700131948399,
                "cdate": 1700131948399,
                "tmdate": 1700131974290,
                "mdate": 1700131974290,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "rUTkuDXwQz",
                "forum": "PnR1MNen7u",
                "replyto": "gkFFp2WqEU",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4904/Reviewer_2nXA"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4904/Reviewer_2nXA"
                ],
                "content": {
                    "title": {
                        "value": "Response to Rebuttal"
                    },
                    "comment": {
                        "value": "I would like to thank the authors for providing the highly detailed rebuttal. I have increased the rating from 6 to 8. Good job on the explanations and extra work."
                    }
                },
                "number": 14,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4904/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700700636454,
                "cdate": 1700700636454,
                "tmdate": 1700700636454,
                "mdate": 1700700636454,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "cjEEzyUPWj",
            "forum": "PnR1MNen7u",
            "replyto": "PnR1MNen7u",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4904/Reviewer_7bLk"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4904/Reviewer_7bLk"
            ],
            "content": {
                "summary": {
                    "value": "This paper introduces a novel measure called geodesic correlation and proposes an innovative geometric deep learning framework called DeepGeodesic Canonical Correlation Analysis (DeepGeoCCA) to enhance the consistency of latent representations obtained from paired views in covariance-based neuroimaging data. The authors demonstrate the effectiveness of DeepGeoCCA on both EEG-fMRI and fMRI-fMRI datasets, achieving state-of-the-art performance on several benchmark tasks. The paper's contributions include the introduction of geodesic correlation, the development of DeepGeoCCA, and the demonstration of its effectiveness on various neuroimaging datasets."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "The paper presents a novel measure called geodesic correlation and proposes an innovative geometric deep learning framework called DeepGeoCCA to enhance the consistency of latent representations obtained from paired views in covariance-based neuroimaging data. The paper is well-written and clearly explains the concepts and methods used in the study. \n\nOriginality: The introduction of geodesic correlation is a novel measure that expands traditional correlation consistency to covariance-based data on the symmetric positive definite (SPD) manifold. The proposed DeepGeoCCA framework is also highly original, as it is the first completely data-driven approach to learn latent representations from paired EEG-fMRI data. The effectiveness of DeepGeoCCA is demonstrated on both EEG-fMRI and fMRI-fMRI datasets, achieving state-of-the-art performance on several benchmark tasks.\n\nQuality: The paper is clearly presented and well-structured. With detailed descriptions of the datasets, experimental setups, and evaluation metrics used in the study, it is easy for other researchers to reproduce their results.\n\nClarity: The paper is well-written and the figures are clearly plotted to illustrate the concepts and methods used in the study. \n\nSignificance: The paper is highly significant, as it presents a novel measure and framework for enhancing the consistency of latent representations obtained from paired views in covariance-based neuroimaging data. The proposed DeepGeoCCA framework has the potential to improve our understanding of the dynamic relationships among brain networks and their alterations in pathology, which could lead to improved diagnosis and treatment of neurological disorders. The framework is also not limited to neuroimaging data and can be applied to other types of data with geometric structures, making it a valuable contribution to the field of deep learning."
                },
                "weaknesses": {
                    "value": "The clarity of presentation needs to be improved, with typos scattered throughout the paper:\nIn Section 2.1, I would suggest using the notation $S^n$ (instead of Sym_n) to denote the space of n × n real symmetric matrices, to be consistent with the the notation S^n_++ for the space of real n × n symmetric and positive definite matrices. \n\n\"For a more comprehensive proof, please consult Appendix ??.\"\n\"In addition, we have use(d) the relaxed\"\nSection 3.3, in the definition of $L_epsilon$ formula, there is a redundant right parenthesis \")\"."
                },
                "questions": {
                    "value": "The authors demonstrate the effectiveness of DeepGeoCCA on both EEG-fMRI and multiview EEG datasets, but it is not clear how the proposed framework would perform on other types of neuroimaging data, such as diffusion tensor imaging (DTI) or positron emission tomography (PET) data. Can the authors comment on the potential applicability of DeepGeoCCA to these types of data?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "1: You are unable to assess this paper and have alerted the ACs to seek an opinion from different reviewers."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4904/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698760764571,
            "cdate": 1698760764571,
            "tmdate": 1699636475312,
            "mdate": 1699636475312,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "ZuUtsOttFH",
                "forum": "PnR1MNen7u",
                "replyto": "cjEEzyUPWj",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4904/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4904/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Both Weakness and Question"
                    },
                    "comment": {
                        "value": "Let us start by thanking the reviewer for his/her effort to assess our submission and the provided feedback. We enjoyed reading the concise summary and strength statements, which accurately highlight all our paper’s contributions. Please find below our responses to your concerns about weaknesses and additional questions.\n\n\n> Weakness: The clarity of presentation needs to be improved, with typos scattered throughout the paper: In Section 2.1, I would suggest using the notation (instead of Sym_n) to denote the space of n × n real symmetric matrices, to be consistent with the the notation S^n_++ for the space of real n × n symmetric and positive definite matrices. \"For a more comprehensive proof, please consult Appendix ??.\" \"In addition, we have use(d) the relaxed\" Section 3.3, in the definition of \n formula, there is a redundant right parenthesis \").\"\n\nOur response:  We are really sorry for submitting a manuscript with many typos. At the time of submission, we had to realize that we did not reserve enough time for editing and proofreading our submission. \nThank you very much for reporting these typos back to us. In the meantime, we proofread extensively and improved spelling and grammar in the revised manuscript.\n\n\n> Question: The authors demonstrate the effectiveness of DeepGeoCCA on both EEG-fMRI and multiview EEG datasets, but it is not clear how the proposed framework would perform on other types of neuroimaging data, such as diffusion tensor imaging (DTI) or positron emission tomography (PET) data. Can the authors comment on the potential applicability of DeepGeoCCA to these types of data?\n\nOur response: Absolutely! The framework proposed in this study can be applied to any paired views where one or both are SPD matrices, and the goal is to maximize geodesic correlation among their latent representations.\n\nFor other modalities of neuroimaging data, such as diffusion tensor imaging (DTI) or positron emission tomography (PET) data, we find it a very interesting exploration. While we are not experts in DTI and PET ourselves, through a literature search, we have found that many related studies have attempted to leverage the covariance matrix of DTI, making it a highly relevant potential application for our framework. For example, a three-dimensional diffusion tensor represents the covariance of the Brownian motion of water within a voxel and is, therefore, mandated to be a symmetric, positive-definite matrix. Therefore, DTI has been formulated in the SPD manifold and explored using geometric statistics as early as 2007 by P. Thomas Fletcher and Sarang Joshi [1].\n\nIt is essential to note that the two modalities must be \"paired.” In our simultaneous EEG-fMRI task, the alignment is based on simultaneously collected timestamps, i.e., temporal dynamics. In our two-view EEG task, they are also aligned based on timestamps. For novel applications with DTI or PET data, it is necessary to identify tasks with paired views. In a clinical setting, the task could be disease diagnosis. Naturally, views associated with the same subject could be considered as paired. Consequently, the representations learned with our framework might even impact downstream, clinically relevant tasks in related domains.\n\nReference:\n\n[1]. Fletcher, P. Thomas, and Sarang Joshi. \"Riemannian geometry for the statistical analysis of diffusion tensor data.\" Signal Processing 87.2 (2007): 250-262."
                    }
                },
                "number": 8,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4904/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700131167518,
                "cdate": 1700131167518,
                "tmdate": 1700131167518,
                "mdate": 1700131167518,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "lTT9mjScRC",
            "forum": "PnR1MNen7u",
            "replyto": "PnR1MNen7u",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4904/Reviewer_Mrh1"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4904/Reviewer_Mrh1"
            ],
            "content": {
                "summary": {
                    "value": "The manuscript presents a CCA method, called DeepGeoCCA, that can be applied to SPD-valued data.  The target application is to relate the covariance matrices (encoding brain connectome) from multiple modalities of neuroimaging data. The method first maps the covariance matrices from two-domains (may be of different sizes, e.g., from EEG and fMRI) to a common SPD cone, where two geodesics are found such that the projections onto the geodesics achieve maximum correlation in the tangent space.\n\nThe method was evaluated on a synthetic dataset and on a real dataset of paired EEG-fMRI data. Results show that the method achieved the highest correlation in a cross-validation setting compared to similar non-linear CCA methods."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. CCA analysis on connectome data, brain connectivity matrices, has a great potential in advancing neuroimaging research. The target application can be very broad, e.g., to relate fMRI with structural connectome derived from Diffusion Tensor Imaging.\n\n2. The method can relate covariance matrices of different sizes, which increases the flexibility and can be applied to even broader scenarios, e.g., relating connectome data from different brain parcellations."
                },
                "weaknesses": {
                    "value": "1. The motivation of using the geodesic relaxation (section 3.2) in intuitive a CCA setting. Why do the data points have to lie near the geodesics? In normal CCA or even deep CCA, we never have such constraints to encourage data points to align with the components. Component analysis is about finding directions that explain the data, not the other way around.\n\n2. My biggest concern is the cross-validation setting. These are small datasets (8, 54, and 12 subjects in three datasets). How do you perform 10-fold CV on 8 subjects? I would then assume that the data split is not on the subject level, but on the matrix level (each subject has many covariance matrices generated by a sliding window). These matrices are derived from overlapping time series and have high dependency. Having subject-level split is essential to make the results clinically relevant, otherwise one would just need to find a method that can overfit to the training data."
                },
                "questions": {
                    "value": "1. Is $e$ the identify or the Frechet mean? The text suggests both.\n\n2. There are two \"Appendix ??\"\n\n3. What is the definition of \"double cone\"?\n\n4. How do we determine the $\\alpha$ weighting parameters?\n\n5. \"DeepGeoCCA shared the highest correlation score with Deep-CCA among the deep learning methods (left panel) at the cost of small R2 (right panel)\" I thought high correlation automatically means high R2?\n\n6. 10s sliding window is really short for a 2s TR. Are there references for this choice?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4904/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698777223682,
            "cdate": 1698777223682,
            "tmdate": 1699636475217,
            "mdate": 1699636475217,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "dI006F7fYF",
                "forum": "PnR1MNen7u",
                "replyto": "lTT9mjScRC",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4904/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4904/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Weakness 1 (Part 1)"
                    },
                    "comment": {
                        "value": "We thank the reviewer for taking the time to provide a detailed review of our contribution. We appreciate the on-point summary and the thorough feedback. Thank you also for your account of our contributions and strengths, introducing additional application domains we did not consider before. Please find our detailed responses to the weaknesses and questions below.\n\n\n> Weakness 1: The motivation of using the geodesic relaxation (section 3.2) in intuitive a CCA setting. Why do the data points have to lie near the geodesics? In normal CCA or even deep CCA, we never have such constraints to encourage data points to align with the components. Component analysis is about finding directions that explain the data, not the other way around.\n\n(Part 1): This is a fantastic concern. We apologize for failing to fully articulate some conceptual ideas behind our modeling approach in the submitted manuscript. In this response, we will clarify these thoughts, hoping they contribute to a better understanding of the overall conceptual framework of the paper. Moreover, as requested by this reviewer, we improved the clarity of the revised manuscript by emphasizing key concepts in section 3. Let us first provide some intuitions based on analogies with classical CCA in the next paragraph before we substantiate them in subsequent paragraphs. \n\nOur modeling objective was twofold. Our first objective was to identify non-linear transformations for paired-view data so that the latent SPD representations have maximal geodesic correlation (i.e., similar to the primary CCA objective in linear spaces). Our second objective was to impose additional structure beyond symmetry and positive definiteness, namely, distribution along geodesics, which we promote with the $\\varepsilon$-geodesic constraints. We think that the reviewer’s comment is primarily concerned about the second objective (i.e., why the latent representations should be near the geodesics). In our opinion, the second objective extends the linear projection constraint of standard CCA to our problem setting. Linear CCA typically obtains a closed-form solution by transforming the constrained optimization problem into an eigendecomposition problem. We propose a neural network solution to maximize geodesic correlation while using the $\\varepsilon$ geodesic constraints to encourage the latent SPD representations to be mostly distributed along the geodesics. \n\nIn this study, the introduced approach originates from a fundamental concept within the field of Geometric Statistics, referred to as the geodesic subspace, initially introduced in principal geodesic analysis (PGA) and related works [1-3]. In the context of Riemannian geometry, a geodesic is a curve that locally represents the shortest path between points, acting as a generalization of a straight line. Moreover, the geodesic subspace can be viewed as an expansion of linear spaces from Euclidean to Riemannian geometry. The concept of the geodesic subspace is pivotal in PGA as the projection on this subspace preserves the Riemannian distance, representing the manifold-valued data's variance. \n\nIn a formal sense, a submanifold $H$ of manifold $M$ is considered geodesic at the point $p \\in H$ if all geodesics of $N$ that pass through $p$ remain geodesic of $M$. A geodesic submanifold $H$ at the Fréchet mean $\\mu$ is represented as the exponential mapping of the linear span of $r$ tangent vectors {$w_i$}$\\_{i=1}^r$ $\\in$ $\\mathcal{T}_{\\mu} M$ \n\nas $N = \\exp_{\\mu}$ $\\big($span({$w_i$}$\\_{i=1}^r)$$\\big)$. \n\nIn PGA, tangent vectors {$w_i$}$\\_{i=1}^r$ are computed by sequentially maximizing the Riemannian distance between each data point and the Fréchet mean. This process captures the variance of the data at each step while progressively removing the influence of previously derived directional projections. This completes the manifold-value data's dimensionality reduction. In this context, $w_1$ can be analogous to the first principal component in principal component analysis (PCA). This work goes beyond finding the geodesic submanifold's tangent vectors {$w_i$}$\\_{i=1}^r$, obtaining a novel low-dimensional data representation is crucial. \n\nReferences:\n\n[1]. Fletcher, P. T., and Joshi, S. (2007). Riemannian geometry for the statistical analysis of diffusion tensor data. Signal Processing, 87(2), 250-262.\n\n[2]. Fletcher, P. Thomas, et al. \"Principal geodesic analysis for the study of nonlinear statistics of shape.\" IEEE transactions on medical imaging 23.8 (2004): 995-1005.\n\n[3]. Thomas Fletcher, P. \"Geodesic regression and the theory of least squares on Riemannian manifolds.\" International journal of computer vision 105 (2013): 171-185."
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4904/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700126586864,
                "cdate": 1700126586864,
                "tmdate": 1700126639532,
                "mdate": 1700126639532,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]