[
    {
        "title": "Categorical Features of entities in Recommendation Systems Using Graph Neural Networks"
    },
    {
        "review": {
            "id": "B1qvj3MCUg",
            "forum": "PuCno7nwgH",
            "replyto": "PuCno7nwgH",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission9246/Reviewer_FdC6"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission9246/Reviewer_FdC6"
            ],
            "content": {
                "summary": {
                    "value": "This paper focuses on how to efficiently model categorical attributes within user-item graph networks for recommender systems. The authors first compare existing methodologies based on 1) one-hot-encoding of binary features for the entities, 2) creation of nodes representing an attribute linked to entities possessing the attribute and 3) creation of hyperedge between any entities sharing the same attribute. Then, they proposed a new model where categorical attributes were handled as hyperedges."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "1 poor"
                },
                "strengths": {
                    "value": "Different ways of handling the categorical features in GNN are well described.  \nExperiments are made on 3 real-world datasets. \nThe hyperedge trick to handle categorical features seem to provide the best results according to Table 1 for the 3 tested datasets: Amazon Grocery, Amazon Tools and Yelp."
                },
                "weaknesses": {
                    "value": "This is clearly stated by the authors, the proposed approach is only for user-item recommender systems and not session-based ones and does account for item or user features independently only, not interaction categorical features. \n\nBy the way, I think the paper would benefit from a quick explanation on why extension of the concept of hyperedges for session-based recommender systems to user-item recommender systems is not straightforward, to justify the novelty of the approach here (which is unclear to me). \n\n“it is noteworthy that there is limited research dedicated to understanding how to incorporate categorical features best“. However, reading the related work, it seems rather clear the limitations of one-hot-encoding and attribute nodes: “some authors have pointed\nout the limitations of the binary-encoded category method“.  \n\n“For all baselines, we used the publicly available original implementations with their default parameters.” I don’t think this is the correct way to proceed. Each baseline needs to be optimized for the use case for fair comparison. \n\nSome comments:\n\n-In Equation (1), \\tilde{d}_j, \\tilde{d}_i  are not defined and I would also mention that N(v) stands for the neighborhood of node v. \n\n-z_u and z_i are not mathematically defined in p.5. \n\nMinor, typos:\n\np.3, “use-item-attribute graph”.\n\np.4. “Another way…” sentence needs to be rewritten.\n\np.7 “each datasets”"
                },
                "questions": {
                    "value": "Can you please explain why the extension of the concept of hyperedges for session-based recommender systems to user-item recommender systems is not straightforward, to justify the novelty of the approach here? \n\nHow are the experimental results after tuning the hyperparameters of each competing approach?\n\nDid you study the benefit of the approach with more categorical attributes and not only price level and brand category to describe the items? \n\nWhat is the effect of the number of different valuations for each categorical feature?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission9246/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698762396312,
            "cdate": 1698762396312,
            "tmdate": 1699637163958,
            "mdate": 1699637163958,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "Hki5UcAlgn",
            "forum": "PuCno7nwgH",
            "replyto": "PuCno7nwgH",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission9246/Reviewer_p2X9"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission9246/Reviewer_p2X9"
            ],
            "content": {
                "summary": {
                    "value": "The authors studied the problem of how to properly incorporate categorical features into graph neural models. The authors' contribution is mainly in two folds:\nThe authors compared with multiple commonly used baselines to estimate which way to incorporate categorical features worked better\nThe authors proposed a new model to represent categorical features as hyper edges in the graphs."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "1 poor"
                },
                "strengths": {
                    "value": "Strength\n- The paper is in general well written and easy to follow\n\n- The experiments are conducted on 3 public dataset which is easy to follow and repeat the experiment"
                },
                "weaknesses": {
                    "value": "Concerns\n- My major concern is the lack of technical contribution. As pointed out by the authors, using hyperedges in recommender engines is a very straightforward idea and is not novel. The authors' argument of  \"It is to be noted that our examination focuses on user-item recommender systems and does not extend to session-based recommender systems.\" Does not justify well for the novelty or technical contribution of this paper, which leads to my major concern.\n\n- The author only compared 2 commonly used ways of representing categorical features which is far from being comprehensive, which further decrease the contribution of the paper."
                },
                "questions": {
                    "value": "When building the hyper edges for the proposed model, the authors used secondary interaction between categorical features. What's the time and storage complexity for the proposed algorithm? Will it explode the system if there are a lot of categorical features available for the users and items?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission9246/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698988404230,
            "cdate": 1698988404230,
            "tmdate": 1699637163863,
            "mdate": 1699637163863,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "wCAUowwMPU",
            "forum": "PuCno7nwgH",
            "replyto": "PuCno7nwgH",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission9246/Reviewer_t3i6"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission9246/Reviewer_t3i6"
            ],
            "content": {
                "summary": {
                    "value": "This study investigates the integration of categorical features of items into collaborative filtering. Its main idea involves connecting nodes with same attributes through hyperedges and leveraging a hypergraph neural network for encoding. The proposed model is tested across three publicly available datasets, demonstrating a notable improvement over existing benchmarks."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "1 poor"
                },
                "strengths": {
                    "value": "1. The paper studies one important task, i.e., collaborative filtering with item attributes.\n2. Experiments are conducted on three public datasets.\n3. Experiments show that the proposed method outperforms several existing baselines."
                },
                "weaknesses": {
                    "value": "1. Limited novelty. The idea of connecting nodes that share the same attributes with hyperedge is not new and has been explored [1]. As a result, the whole paper seems to be a straightforward application of it on collaborative filtering task, limiting the novelty. Although the performance is promising, providing new insights for the community could be more important for an academic paper.\n2. The proposed method considers only two specific attributes, i.e., price and category, which makes the model less generalizable. It could be better if the proposed method describes how it will deal with general single attributes and multiple attributes (e.g., will it be better if we model some combinations of attributes?).\n3. Code is not available, making it difficult to reproduce the work in the reviewing phase.\n4. The paper lacks robustness in its experimental validation, as there is no evidence of repeated experiments or statistical tests such as paired t-tests, which are crucial for ensuring the reliability of the results.\n5. Presentation issue. Figure 2 is not a vector graph and is in low resolution.\n\n\n[1] Wu et al. Dual-view hypergraph neural networks for attributed graph learning. Knowledge-Based Systems 2021."
                },
                "questions": {
                    "value": "For the \"Pricae and Category\" setting in Table 2, do you use only $h_{cp}$ or use $h_{cp}$, $h_c$, and $h_p$?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission9246/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission9246/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission9246/Reviewer_t3i6"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission9246/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699003328047,
            "cdate": 1699003328047,
            "tmdate": 1699637163762,
            "mdate": 1699637163762,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "TT2ovzy2I9",
            "forum": "PuCno7nwgH",
            "replyto": "PuCno7nwgH",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission9246/Reviewer_ziNY"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission9246/Reviewer_ziNY"
            ],
            "content": {
                "summary": {
                    "value": "The paper proposes to leverage the categorical information of items for graph neural networks-based recommendation. Differently from previous similar approaches in the literature, the authors do not address the task of session recommendation, which is the main scenario where categorical information is usually injected in recommendation. Specifically, the paper introduces three possible variants of graph-based recommender systems exploiting the categorical information, namely: 1) one-hot encoding of the categorical information as items’ node features, 2) tripartite graphs where categories represent another type of nodes besides users and items, and 3) items’ categories regarded as hyperedges. The authors’ proposal involves the latter setting, where a neighborhood and hyperedge aggregation are performed through a GCN layer and a UniSAGE aggregation, respectively. Finally, the loss function is the common Bayesian personalized ranking one (i.e., BPR). The proposed approach is tested against three GCN architectures having: 1) no categorical information, 2) category information as extra nodes in the graph, and 3) category information as extension of the node features. The evaluation is run on three popular recommendation datasets which include two types of category accounting for either the products’ price or category or both. Results on all such settings demonstrate the efficacy of the hyperedge-based solution, whose trends are further confirmed by evaluating the proposed model against similar state-of-the-art recommendation approaches."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "+ The proposed approach is simple.\n+ The adoption of hyperedges in graph-based recommendation is quite recent in the literature.\n+ The authors outline the differences with respect to the existing literature in a sufficient manner.\n+ A wide range of evaluation settings are proposed."
                },
                "weaknesses": {
                    "value": "- While proposing a simple approach is not generally criticisable, it might need further discussions regarding the actual novelty of the solution.\n- No code is released at review time; this might have been helpful to further assess the efficacy and effectively of the proposed approach.\n- Some evaluation choices are not common in the literature and require further justifications.\n\n**After the rebuttal.** The answers provided by the authors addressed the outlined weaknesses quite sufficiently."
                },
                "questions": {
                    "value": "* Can the authors further elaborate on why the proposed approach should represent a novelty to the existing similar approaches? Indeed, it seems that the presented solution makes use of other graph neural networks layers without any specific new techniques introduced.\n* Is there any specific reason why the recommendation metrics are calculated with high cut-offs (i.e., at 50-100)? Did the authors try to evaluate the recommendation performance at 10-20? And if so, are the observed trends still confirmed?\n\n**After the rebuttal.** The answers provided by the authors answered my questions quite sufficiently."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission9246/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission9246/Reviewer_ziNY",
                        "ICLR.cc/2024/Conference/Submission9246/Senior_Area_Chairs"
                    ]
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission9246/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699259514893,
            "cdate": 1699259514893,
            "tmdate": 1700657597232,
            "mdate": 1700657597232,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "1KELry4AJZ",
                "forum": "PuCno7nwgH",
                "replyto": "0xuuy1ffYp",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission9246/Reviewer_ziNY"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission9246/Reviewer_ziNY"
                ],
                "content": {
                    "comment": {
                        "value": "Dear Authors,\n\nthank you for your careful answers to our reviews. I'll comment on your answers regarding my outlined weaknesses and questions.\n\n- **Novelty.** The points you outlined are now sufficient to justify the novelty of the proposed approach. Thank you.\n- **Top-k evaluation.** Despite it would have been useful to actually take a look at the top-10/20 results (maybe you might include them in the appendix) it is reasonable that you used top-50/100 evaluation to be coherent with one of the baselines.\n- **Code sharing.** Thank you for the clarification, but I'm still convinced the code would have been useful at review time to better assess the implementation of your model and check on the reproducibility. In case of acceptance, please make sure to include it in the final publication.\n\nIn the light of above, I'll raise the rating for the paper to a weak acceptance."
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission9246/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700657486714,
                "cdate": 1700657486714,
                "tmdate": 1700657486714,
                "mdate": 1700657486714,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]