[
    {
        "title": "ControlVideo: Conditional Control for Text-driven Video Editing and Beyond"
    },
    {
        "review": {
            "id": "wbi60iS9Qt",
            "forum": "RIK99GXapC",
            "replyto": "RIK99GXapC",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4458/Reviewer_qeRf"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4458/Reviewer_qeRf"
            ],
            "content": {
                "summary": {
                    "value": "This papers proposes video editing system referred to as ControlVideo to enhance the fidelity and temporal consistency via incorporating additional conditions."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. Exploration of adding visual conditions on video editing systems\n\n2. Enhanced quality of resulting video for editing."
                },
                "weaknesses": {
                    "value": "As this paper follows the framework of ControlNet that introduces the idea of providing a visual condition (e.g., edge map) to guide editing, merely adding a condition in the video editing system (This idea is already presented in the paper ControlNet) does not give much insight. I am sorry to think that there is no depth to the challenge that this paper is facing.\n\nThe current presented studies in this paper seem like applications of ControlNet in the video domain. if the proposed method is the first work that performs an application for video editing, then it must be published and shared in our societies, but this is not the case.\n\nAuthors may claim the contribution about proposed attention, but to the best of my knowledge, Prompt-to-Prompt proposes a more general form of attention blending, it seems like following that work. To be specific, The h = h_{u} + \\lambda h_{c} seems like one of the attention blending methods, where prompt-to-prompt has already presented these types of blending with a more generalized version. (attention replace, attention refine, attention re-weighting)\n\nUnfortunately, the further proposed long video editing is also not related to the focus of the proposed method. (I mean that is a good issue but not convincing for this paper. I am hoping to meet deeper studies on it as a single paper to tackle that issue.)\n\nWhat readers may want to read in this paper should be examples as given below:\n(1) What was challenging to adding visual condition in video diffusion model and how to solve\n(2) What is the proper condition for applying video editing system.\n(3) The correlation between visual condition and fidelity."
                },
                "questions": {
                    "value": "My all questions are based on the aforementioned weakness. please give me a rebuttal on that."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4458/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698231580392,
            "cdate": 1698231580392,
            "tmdate": 1699636421573,
            "mdate": 1699636421573,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "REG4bmWr4F",
            "forum": "RIK99GXapC",
            "replyto": "RIK99GXapC",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4458/Reviewer_R3D6"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4458/Reviewer_R3D6"
            ],
            "content": {
                "summary": {
                    "value": "The paper introduces ControlVideo, a tool for text-driven video editing which generates videos that align with given text while preserving the source video's structure. Leveraging a pre-trained text-to-image diffusion model, ControlVideo improves fidelity and temporal consistency by adding conditions like edge maps and fine-tuning key-frame and temporal attention. The method outperforms several baselines, providing high fidelity and temporal consistency in alignment with text. Further enhancements allow ControlVideo to align videos with reference images and extend to long video editing, maintaining consistency across hundreds of frames. Experimental results confirm its capability to produce visually realistic, lengthy videos."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. Generally speaking, the paper is well written, with all ideas being clearly formulated. Quantitative and qualitative analysis have been provided to support the others’ design choices.\n\n2. The application of the proposed framework to the problem of long video editing is appreciated since previous research attempts on this problem is not much. The provided example demonstrates the effectiveness of the proposed pipeline."
                },
                "weaknesses": {
                    "value": "1. I think the author should polish the Related Work section (e.g., “Diffusion Models for Text-driven Video Editing.”) and the experimental section. Although the authors mention Gen-1, one key emphasis of Gen-1 is utilizing additional controls, which is omitted in the section. Moreover, there are other works targeting similar goals like VideoComposer, which shares a lot of similar functionalities and should be compared with in the experiments. The authors are encouraged to enrich this part in order to objectively formulate their contributions.\n\n2. Concerning temporal attention and key-frame attention, the authors’ contributions are rather limited although many empirical studies have been conducted to finalize the best design choice.\n\n3. From my perspective, long video editing is a significant part of this part. However, in the experimental section, the authors did not provide much visualization and in-depth analysis for this. I suggest putting more emphasis on this part."
                },
                "questions": {
                    "value": "Please refer to the weaknesses."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission4458/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4458/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4458/Reviewer_R3D6"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4458/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698770872570,
            "cdate": 1698770872570,
            "tmdate": 1699636421481,
            "mdate": 1699636421481,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "BfdIui1RlP",
            "forum": "RIK99GXapC",
            "replyto": "RIK99GXapC",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4458/Reviewer_ibYi"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4458/Reviewer_ibYi"
            ],
            "content": {
                "summary": {
                    "value": "This paper introduces ControlVideo, a text-to-video editing model that utilizes ControlNet for enhanced fidelity and temporal consistency. Incorporating key frame and temporal attention, the model generates video aligned with textual inputs while preserving the original structure. An overlapping fusion strategy is introduced for long video editing. Both the qualitative and quantitative experiments are performed with the baselines."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. The integration of structure guidance through ControlNet is intuitive and interesting.\n2. Extensive ablation studies are conducted to explore the effectiveness of each component. \n3. The edited videos exhibit great consistency and fidelity to the provided text prompts."
                },
                "weaknesses": {
                    "value": "1. The novelty seems limited. The use of the first frame for key-frame attention has been previously applied in Text2Video-Zero[1], while Make-A-Video[2] has explored temporal attention. The integration of them is a little bit trivial. \n2. For long video editing, some existing methods should be compared, such as the hierarchical sampler in NÜWA-XL[3]. \n3. The results of Video-P2P in Figures 4 and 5 appear wired, especially for text alignment. How about the distribution of the test data, e.g., proportions of object editing, background editing, and style editing?\n\n[1] Khachatryan, Levon, et al. \"Text2video-zero: Text-to-image diffusion models are zero-shot video generators.\" arXiv preprint arXiv:2303.13439 (2023).  \n[2] Singer, Uriel, et al. \"Make-a-video: Text-to-video generation without text-video data.\" arXiv preprint arXiv:2209.14792 (2022).  \n[3] Yin, Shengming, et al. \"NUWA-XL: Diffusion over Diffusion for eXtremely Long Video Generation.\" arXiv preprint arXiv:2303.12346 (2023)."
                },
                "questions": {
                    "value": "1. The caption \"person -> panda\" is missing in Fig. 3(b)."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "details_of_ethics_concerns": {
                    "value": "N/A"
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission4458/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4458/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4458/Reviewer_ibYi"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4458/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698772710341,
            "cdate": 1698772710341,
            "tmdate": 1699636421386,
            "mdate": 1699636421386,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "IgpZvGShxv",
            "forum": "RIK99GXapC",
            "replyto": "RIK99GXapC",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4458/Reviewer_ZCzg"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4458/Reviewer_ZCzg"
            ],
            "content": {
                "summary": {
                    "value": "The paper proposes ControlVideo, a framework for using pre-trained text-to-video latent diffusion for video editing. The proposed method is mostly a mix of existing and well studied work such as ControlNet, LoRA, DINO and Align-your-Latents. The core idea is to start from DDIM noise and then condition the model on additional conditions such as edge maps which should help maintain the \"structure\" of the original video. Additionally, the authors proposed to use the first frame as the \"key-frame\" and condition on that as well to help with longer video editings which need overlapping windows to process. Finally, the paper uses temporal attention to improve temporal consistency of the generated video."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "1 poor"
                },
                "strengths": {
                    "value": "The paper is well-written and straightforward to comprehend.\nThe authors extensively drew from previously published work and open-source codebases, while being diligent in attributing credit to the original sources.\nThe authors conducted a human study to compare the proposed method against others, which is always advantageous in generative video papers, especially considering the lack of reliable qualitative metrics."
                },
                "weaknesses": {
                    "value": "- Limited novelty: The paper heavily relies on previous research for almost every key component of the entire editing pipeline. Building upon previous research is intrinsic to the nature of research, but the \"addition\" should be both clear and significant. Unfortunately, in this paper's case, I find the contributions to be marginal. The concepts of conditioning on previous signals, addressing inconsistencies in conditioning signals, and employing temporal attentions have all been previously explored, and this paper does not provide any substantial updates in these areas. Instead, it largely borrows these ideas from the domain of image generation and applies them to video, which is not a novel approach. For example, Blattmann et al., in \"Align your Latents: High-Resolution Video Synthesis with Latent Diffusion Models,\" employed a very similar approach (i.e. temporal attention) to enhance temporal consistency on top of Stable Diffusion.\n\n- Missing implementation details: The paper lacks essential implementation details, which could hinder its reproducibility and diminish its impact on future research. Important details, such as the size of additional parameters in LoRA, specifics of temporal attentions, fine-tuning procedures, including optimizers and data, are absent. This omission also raises concerns about the reliability of the comparisons in Figure 5, as the models may differ significantly in terms of size.\n\n- Lack of videos: Surprisingly, for a paper focusing on videos, there is a notable absence of video content. I strongly encourage the authors to present their results, along with comparisons to other models, on an anonymous website for the benefit of both reviewers and readers."
                },
                "questions": {
                    "value": "- Which dataset was used to fine-tune the model?\n- The paper proposes \"additional visual conditions such as edge maps\". But the exact list of controls seems to be missing. Is it only Canny edge maps and key frame and and pose control? did you test more conditions?\n- Consider creating an anonymous website with the videos inside. It's hard to judge the quality of improvements without more clear videos.\n- Please provide more details on the implementation details."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4458/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698800169906,
            "cdate": 1698800169906,
            "tmdate": 1699636421262,
            "mdate": 1699636421262,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    }
]