[
    {
        "title": "Curriculum reinforcement learning for quantum architecture search under hardware errors"
    },
    {
        "review": {
            "id": "kK0CCiWoNG",
            "forum": "rINBD8jPoP",
            "replyto": "rINBD8jPoP",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission8370/Reviewer_3EHX"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission8370/Reviewer_3EHX"
            ],
            "content": {
                "summary": {
                    "value": "This paper introduces a novel quantum architecture search (QAS) algorithm based on curriculum reinforcement learning (CRL) for designing parameterized quantum circuits (PQCs) under realistic noisy environments. The main contributions include a tensor-based binary encoding scheme, a mechanism of illegal actions to prune the search space and avoid redundant gates, and a random halting technique to encourage the agent to find shorter circuits. Additionally, it presents a variant of simultaneous perturbation stochastic approximation (SPSA) algorithm with adaptive momentum and variable sample budget for faster and robust optimization, and a fast GPU simulation framework using Pauli transfer matrix formalism to fuse gates with their noise models. The effectiveness of CRLQAS is demonstrated on quantum chemistry tasks of finding the ground state energy of various molecules, such as H2, LiH, and H2O, in both noiseless and noisy settings."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "- Novel QAS algorithm: The paper proposes a curriculum-based reinforcement learning QAS (CRLQAS) algorithm that can automatically construct parametrized quantum circuits for variational quantum algorithms in realistic noisy environments. The algorithm introduces several novel features, such as tensor-based binary circuit encoding, illegal actions, random halting, feedback-driven curriculum learning, and Adam-SPSA optimizer.\n- Experiments on real quantum devices: The paper demonstrates the efficiency and robustness of CRLQAS under different noise models inspired by real IBM quantum devices, and provides comprehensive descriptions of the experimental setup and the source code for reproducibility."
                },
                "weaknesses": {
                    "value": "1. (Major) The absence of the comparison of some key methods in terms of theory and experiments. This paper emphasizes the design for quantum hardware errors, but there is no mention or comparison of some methods of QNAS that are also designed for noise, such as QuantumNAS (a noise-adaptive quantum circuit search) [1]. In addition, as far as I know, QCAS (Du et al., 2022) is tested on depolarizing errors, and QuantumDARTS (Wu et al., 2023) is evaluated readout errors. However, these methods under noise are not compared in the experiments.\n\n[1] Wang, H., Ding, Y., Gu, J., Lin, Y., Pan, D. Z., Chong, F. T., & Han, S. QuantumNAS: Noise-adaptive search for robust quantum circuits. In 2022 IEEE International Symposium on High-Performance Computer Architecture (HPCA).\n\n\n2. (Minor) The representations of some tables are not clear enough. For example, if the best result is bolded, then ‘7.21*10^-8’ and ‘2.9*10^-4’ should be bolded in Table 1. In Table 4, CRLQAS (RH) has two rows of results but they're not marked what do they mean."
                },
                "questions": {
                    "value": "1. As mentioned in the Intro, current NISQ devices are characterized by limited qubit connectivity and susceptibility to noise, but how does the proposed approach deal with qubit connectivity?\n2. The proposed method is based on reinforcement learning, but only one related method is mentioned in this paper, and there are several QNSA works based on reinforcement learning that are not mentioned, such as [2,3,4]. Furthermore, compared with these methods, what is the innovation of CRLQAS, and whether it can reflect the advantage of the experiment? \n\n[2] Kuo, E. J., Fang, Y. L. L., & Chen, S. Y. C. Quantum architecture search via deep reinforcement learning. arXiv preprint arXiv:2104.07715, 2021.\n\n[3] Chen, S. Y. C. (2023, August). Quantum Reinforcement Learning for Quantum Architecture Search. In Proceedings of the International Workshop on Quantum Classical Cooperative (pp. 17-20), 2023.\n\n[4] Sun, Y., Ma, Y., & Tresp, V. Differentiable quantum architecture search for quantum reinforcement learning. arXiv preprint arXiv:2309.10392, 2023.\n\n3. In Table 4, why is CRLQAS(wo-RH) better than CRLQAS? What is the meaning of random halting (RH)? \n\n4. What are the advantages and disadvantages of the proposed method and the Predictor-based QAS methods [5,6]?\n\n[5] Zhimin He, Xuefen Zhang, Chuangtao Chen, Zhiming Huang, Yan Zhou, and Haozhen Situ. A gnn-based predictor for quantum architecture search. Quantum Information Processing, 22(2): 128, 2023b.\n\n[6] Shi-Xin Zhang, Chang-Yu Hsieh, Shengyu Zhang, and Hong Yao. Neural predictor based quantum architecture search. Machine Learning: Science and Technology, 2(4):045027, 2021"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "details_of_ethics_concerns": {
                    "value": "None"
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission8370/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission8370/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission8370/Reviewer_3EHX"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission8370/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1697975193437,
            "cdate": 1697975193437,
            "tmdate": 1699637041066,
            "mdate": 1699637041066,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "Jy6BkUsdWW",
                "forum": "rINBD8jPoP",
                "replyto": "kK0CCiWoNG",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8370/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8370/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response 1 to reviewer 3EHX"
                    },
                    "comment": {
                        "value": "We would like to thank the referee for the time spent reviewing this submission and recognizing the novelty of our CRLQAS algorithm and the introduced features within. \nWe're also grateful for the referee's note regarding our utilization of GPU-accelerated Pauli transfer matrix formalism and introduction of Adam-SPSA for faster convergence.\nDuring the rebuttal period, we performed additional ablation studies and improved the readability of the manuscript. In the general answer, we list down the introduced changes. We hope it is sufficient, please let us know if you have any more questions or comments.\n\n> Absence of the comparison of some key methods in terms of theory and experiments. Such as QuantumNAS (a noise-adaptive quantum circuit search) [1]. In addition, as far as I know, QCAS (Du et al., 2022) is tested on depolarizing errors, and quantumDARTS (Wu et al., 2023) is evaluated readout errors. However, these methods under noise are not compared in the experiments.\n\nIt's possible that due to the text structure, it was missed, but we did indeed consider these other works (or similar), and reported on it in the paper. \nFor instance, we did compare our CRLQAS algorithm to QCAS (Du et al., 2022) under hardware constraints (both noise and qubit-connectivity) in Table 2 of the revised manuscript (Table 4 in the old one).\nWe did not highlight it enough to the reader in the first version which is rectified now.\nWe do not compare to QuantumNAS (Wang et al., 2022) as it is quite similar to QCAS algorithm (both are one-shot super-circuit methods).\nWe refer the referee to our *Response 3 to reviewer WndL* for a more detailed reasoning.\n\nWe respectfully disagree with the assessment of the reviewer that quantumDARTS (Wu et al., 2023) is evaluated with readout errors for quantum chemistry tasks. \nIt only considers readout errors for the MNIST classification task which is not the focus of this work.\nConsequently, we only compared to quantumDARTS in the noiseless case and numerically demonstrate that our CRLQAS performs better.\nWe believe that our comparison to existing methods (like QCAS, qubit-ADAPT VQE, quantumDARTS) is fair, and covers most of the existing approaches for quantum chemistry problems in both noisy and noiseless cases.\n\n> The representations of some tables are not clear enough.\n\nWe appreciate the feedback on the inconsistencies within the Tables.\nWe have amended such mistakes, and hope that they improve the readability of the manuscript.\nWe note that the Table 4 from the older version is now Table 2 in the new version of the manuscript.\n\n> In Table 4, why is CRLQAS(wo-RH) better than CRLQAS? What is the meaning of random halting (RH)?\n\nRandom Halting is one of the new techniques that we proposed and described in sec. 3.3 of the manuscript. \nBy default, in CRLQAS, we utilize all three novel features namely illegal actions, tensor-based encoding and random halting.\nWe denote wo-RH and RH as experiment configurations where the random halting feature is turned off and on respectively during CRLQAS training.\nAs the *reviewer wt33* rightly pointed out the role of illegal actions might be pivotal within the CRLQAS algorithm.\nConsequently, we conducted an ablation study to assess the effectiveness of the new features introduced, both in noiseless and noisy scenarios. Detailed results are available in *Table 1 of Response 3 to reviewer wt33*. \nOur analysis reveals that incorporating illegal actions without random halting prompts the agent to achieve a positive signal (a successful episode) early on, albeit resulting in larger circuits.\nConversely, introducing random halting encourages the agent to discover shorter circuits, there is a trade-off as the agent receives the positive signal at a later stage.\nWe further clarify this in Table 2 in the revised manuscript (which was Table 4 in the old version of the manuscript).\n\n> As mentioned in the Intro, current NISQ devices are characterized by limited qubit connectivity and susceptibility to noise, but how does the proposed approach deal with qubit connectivity?\n\nIn CRLQAS, we deal with the quantum device's hardware topology by directly limiting the agent's action space to adhere to qubit-connectivity.\nIndeed, it is also conceivable to train the agent by designing the reward function that penalizes violations of connectivity constraints. \nIn our study, we opt for the former method, integrating the hardware topology of the now deprecated IBM Ourense device.\nWe kindly ask the referee to refer to Table $4$ in the manuscript, illustrating an experiment conducted for the $4$-qubit $H_2$ molecule, showcasing our superior performance compared to QCAS (Du et al., 2022).\n\n[1] Wang, H., Ding, Y., Gu, J., Lin, Y., Pan, D. Z., Chong, F. T., & Han, S. QuantumNAS: Noise-adaptive search for robust quantum circuits. In 2022 IEEE International Symposium on High-Performance Computer Architecture (HPCA)"
                    }
                },
                "number": 14,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8370/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700362419293,
                "cdate": 1700362419293,
                "tmdate": 1700362553845,
                "mdate": 1700362553845,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "ifh1HwU6s5",
                "forum": "rINBD8jPoP",
                "replyto": "Lx1B4hqwbb",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8370/Reviewer_3EHX"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8370/Reviewer_3EHX"
                ],
                "content": {
                    "comment": {
                        "value": "I appreciate the author's detailed response, which addresses most of my concerns. A potential issue: The \"first N+3\" and \"next three\" in sentence \"Each circuit moment is represented by a ((N + 3) × N) dimensional matrix, where the first N + 3 rows indicate the positions of control and target qubits for CNOT gates implemented within that moment. The next three rows represent the position of single-qubit rotation gates, RX, RY, RZ respectively\" seem to conflict with the total dimension. I think a toy example of the  3D grid encoding of a small circuit may help readers comprehend it more easily."
                    }
                },
                "number": 24,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8370/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700724729768,
                "cdate": 1700724729768,
                "tmdate": 1700724729768,
                "mdate": 1700724729768,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "mehW4IELbO",
            "forum": "rINBD8jPoP",
            "replyto": "rINBD8jPoP",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission8370/Reviewer_WndL"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission8370/Reviewer_WndL"
            ],
            "content": {
                "summary": {
                    "value": "In the era of noisy intermediate-scale quantum computing, selecting effective circuits in line with current device constraints is pivotal. This study accelerates quantum circuit simulations using the Pauli transfer matrix method and introduces a novel Curriculum-based Reinforcement Learning Quantum Architecture Search (CRLQAS) approach for optimal circuit structure determination."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. A detailed analysis of the error rate.\n2. Using the Pauli transfer matrix method to accelerate simulation and consider the noise in the training process."
                },
                "weaknesses": {
                    "value": "1. The paper does not specify the function used to fit the spin orbital of the molecule. If the 'sto-3g' function is used, the claim of achieving chemical accuracy might be an overstatement. While it's not impossible, further clarification is necessary.\n\n2. I'm concerned about the computational cost and efficiency of the reinforcement learning approach, especially when adding the noise injection method. Even with GPU acceleration, reinforcement learning is inherently expensive. Given that the noise model is derived from \"current\" calibration data and the gate-level noise model is only an approximation, there are concerns about its accuracy. For instance, although noise might seem stable over a short time frame, over a more extended period (e.g., a week), one can observe significant shifts. If the framework has a high computational cost, it may yield unreliable results if the calibration data changes rapidly during training.\n\n3. Some parts of the paper could be clearer. For example, Table 4 should specify which molecule task is being discussed. There are several sections in the paper with similar clarity issues, making it harder to understand.\n\n4. I observed that only one quantum architecture search work is considered in the comparative experiments. There are many other relevant works in the quantum architecture search for VQE, such as:\n\n[1] Wang, Hanrui, et al. \"Quantumnas: Noise-adaptive search for robust quantum circuits.\" 2022 IEEE International Symposium on High-Performance Computer Architecture (HPCA). IEEE, 2022.\n\n[2] Rattew, Arthur G., et al. \"A domain-agnostic, noise-resistant, hardware-efficient evolutionary variational quantum eigensolver.\" arXiv preprint arXiv:1910.09694 (2019).\n\n[3] Liu, Xiaoyuan, et al. \"Layer VQE: A variational approach for combinatorial optimization on noisy quantum computers.\" IEEE Transactions on Quantum Engineering 3 (2022): 1-20.\n\n[4] Cheng, Jinglei, et al. \"TopGen: Topology-Aware Bottom-Up Generator for Variational Quantum Circuits.\" arXiv preprint arXiv:2210.08190 (2022).\n\nWhile there is a brief comparison with previous reinforcement learning-based architecture search papers, the fact that they don't consider noise models means it's expected for your approach to perform better. However, the increased computational cost is also a concern.\n\n5.There's a notable absence of results on real quantum hardware. Testing only on a noisy simulator might not be entirely convincing, especially when using reinforcement learning, which is assumed to achieve the upper bound of performance. Given that you utilize a noise model from the current noisy environment and consider only one seed, real hardware testing is crucial."
                },
                "questions": {
                    "value": "1. What is the function you used to fit the spin orbital of the molecule?\n\n2. What is the computational cost for your framework? Say, based on the GPU acceleration, on what specific classical hardware, how long does it take? Please specify in detail.\n\n3. Have you tried to implement your final result on real hardware? - I believe it should be easy for you since you already get your optimal arch and parameters from noisy simulation. You can just run this circuit on real quantum hardware and obtain the result."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission8370/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission8370/Reviewer_WndL",
                        "ICLR.cc/2024/Conference/Submission8370/Senior_Area_Chairs"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission8370/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698557109077,
            "cdate": 1698557109077,
            "tmdate": 1700683765673,
            "mdate": 1700683765673,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "azIJyrww6J",
                "forum": "rINBD8jPoP",
                "replyto": "mehW4IELbO",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8370/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8370/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response 1 to reviewer WndL"
                    },
                    "comment": {
                        "value": "We thank to the reviewer for appreciating the uniqueness of this work: Pauli transfer matrix noisy simulations and a curriculum-based reinforcement learning to build quantum circuits.\nIn particular, performing noisy simulation is a computationally heavy task even at a small number of qubits, thus building the framework that allows users to run such simulations is key to further improve the algorithms for noisy hardware.\nIn our work, we take state-of-the-art error rates from publicly available devices such that our results are as close as one can expect if they were performed on real hardware. During the rebuttal period, we performed additional ablation studies and improved the readability of the manuscript. In the general answer, we list down the introduced changes. We hope it is sufficient, please let us know if you have any more questions or comments.\n\n> The paper does not specify the function used to fit the spin-orbital of the molecule. What is the function you used to fit the spin orbital of the molecule?\n\nWe are not 100\\% certain we know what the reviewer means by the following sentence:\n`the function used to fit the spin-orbital'.\nIn our experiments, we construct the molecular electronic structure Hamiltonians by standard methods using *OpenFermion* and *Psi4* packages.\nIn short, from the geometrical description of the molecule, and using the Born-Oppenheimer approximation, we fix a finite basis set, in our case STO-3G, to discretize the system.\nBased on the subsequent remarks of the reviewer , it is likely they refer to the basis set used to discretize the system.\nWe have added a more elaborated description of the molecules, and the basis set used to compute their Hamiltonians at the beginning of Section 4 Experiments in the revised manuscript.\n\n> If the 'STO-3G' function is used, the claim of achieving chemical accuracy might be an overstatement. While it's not impossible, further clarification is necessary.\n\nWhile we think we understand the referee's point, we respectfully disagree that talking about chemical accuracy is not appropriate, but do agree that a clarification helps, and one is added in the revision.\nIn computational chemistry, chemical accuracy (CA) takes an exact value,\n\\begin{equation}\n    \\text{CA} = 1 \\frac{\\text{kcal}}{\\text{mol}} = 0.0016 \\text{Hartree},\n\\end{equation}\nand it defines the precision such that a computational chemistry method is capable of making realistic predictions.\nOur system thus achieves chemical accuracy with respect to the Hamiltonian that defines our cost function, and this is how the term is used in literature on quantum algorithms for chemistry.\nOf course, the Hamiltonian we use is not the exact molecular second-quantized Hamiltonian, as it has been derived through numerous approximations, including the use of the STO-3G basis to describe a molecular system.\nHowever, this concern is about computational chemistry methods, which is far beyond the scope of this manuscript.\n\n> Some parts of the paper could be clearer. For example, Table 4 should specify which molecule task is being discussed. There are several sections in the paper with similar clarity issues, making it harder to understand.\n\nWe agree with the reviewer regards to Table 4 needing more clarity. We fixed the clarity issues, and added comparisons in the revised text. Additionally, we note that the Table 4 in the older version of the manuscript is now Table 2 in the new version of the manuscript.\n\n> While there is a brief comparison with previous reinforcement learning-based architecture search papers, the fact that they don't consider noise models means it's expected for your approach to perform better. However, the increased computational cost is also a concern.\n\nWe thank the reviewer for remarking that CRLQAS is stronger than previous methods, even under noisy conditions.\nIt is likely that any method that aims at handling hardware noise will also suffer a significant increase in computational cost. Despite the increasing computational cost with the addition of noise, training-free approaches remain feasible. However, heretofore training-free methods suffer a huge performance drawback. As discussed above, we believe that studying systems smaller in qubit size using various noise models and without any constraints on the training (i.e., training-based) is necessary to leapfrog into developing approaches (e.g., training-free, transfer learning, etc.) where computational cost is not increasing exponentially with the qubit size."
                    }
                },
                "number": 8,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8370/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700357329339,
                "cdate": 1700357329339,
                "tmdate": 1700357407944,
                "mdate": 1700357407944,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "vQyN28PAiI",
                "forum": "rINBD8jPoP",
                "replyto": "mehW4IELbO",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8370/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8370/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response 3 to reviewer WndL"
                    },
                    "comment": {
                        "value": "> I observed that only one quantum architecture search work is considered in the comparative experiments. There are many other relevant works in the quantum architecture search for VQE, such as: \\\n[1] Wang, Hanrui, et al. \"Quantumnas: ...\" 2022 IEEE HPCA. IEEE, 2022. \\\n[2] Rattew, Arthur G., et al. \"A domain-agnostic, ....\" arXiv:1910.09694 (2019). \\\n[3] Liu, Xiaoyuan, et al. \"Layer VQE: ....\" IEEE Transactions on Quantum Engineering 3 (2022). \\\n[4] Cheng, Jinglei, et al. \"TopGen....\" arXiv:2210.08190 (2022).\n\nWe respectfully disagree with the reviewer's statement the we only compare to one QAS method. \nWe compare to qubit-ADAPT VQE (Tang et al., 2021) and quantumDARTS (Wu et al., 2023) for all the noiseless experiments and QCAS (Du et al., 2022) for noisy experiments (also with qubit-connectivity constraints).\nAlthough there exists a significant amount of literature about quantum architecture search (QAS), \nthe purpose of this work was to establish the limits of RL methods in combination with noisy intermediate-scale quantum hardware. \nHowever, in view that other reviewers have pointed out similar works to compare, we are give explanations for each of the references, providing qualitative comparison wherever possible.\n\nRegarding ref. [1], our understanding of the paper suggests that QuantumNAS (Wang et al., 2022) and QCAS (Du et al., 2022) fall within the family of one-shot super-circuit methods.\nWe investigated QuantumNAS manuscript in an attempt to facilitate either a fully-fledged quantitative or qualitative comparison.\nUnfortunately, the work lacks essential information for such an analysis. Specifically, details about the molecular geometries and quantum circuits are absent, preventing us from conducting any type of comparison. \nConsequently, this would require us to run their algorithm from scratch for the molecules considered in this study.\nHence, due to the fact that we already compared to an algorithm (QCAS) which is akin to QuantumNAS and the reasons mentioned above, we did not consider this work in the comparative experiments.\nHowever, a qualitative comparison is possible on the $H_2$ molecule for the 2-qubit system.\nBy looking at fig. 17 in ref. [1] we observe that the best ever result achieve in those experiments have an energy error 0.1 Hartree.\nOur $H_2$ simulations achieve the mean noisy energy error over three independent seeds of $1.116 \\times 10^{-3} \\pm 3.41 \\times 10^{-4}$ (for IBM Mumbai median), which is three orders of magnitude better than their results.\nMoreover, we still beat them for IBM Mumbai max and 10max noise levels with the mean noisy energy error of $0.907 \\pm 0.008$ and $0.0912 \\pm 0.004$ respectively.\n\nSimilarly, we can conduct a quantitative comparison in noiseless scenario, while limiting our assessment to a qualitative comparison for noisy case of $LiH$ molecule in reference to [2].\nFor the noiseless case, on closer inspection of fig. 3 in ref [2], best observed depth and CNOT gate is $35$ and $40$ approximately (these exact numbers are not explicitly stated anywhere in the paper but are rough estimations). \nDuring the training of EVQE [2], it achieves error which is slightly less than $1 \\times 10^{−3}$ (again, no exact number in the paper). \nConversely, in the noisy case (where noise profiles were simulated using the Qiskit Aer QASM simulator), referencing fig. 7 in ref. [2], we observe that the averaged noisy energy error, depth, and number of CNOT gates over five seeds are approximately \\(0.036\\) Ha, \\(8\\), and \\(6\\) respectively for the $4$-qubit $LiH$. Once again, these are estimated values derived from the figure. In our scenario, we achieve a slightly improved noisy error of \\(0.0356\\) Ha with an average of \\(1.33\\) CNOT gates and a depth of \\(10\\) across three seeds. Although the mean noisy errors and depth are comparable, our algorithm produces a quantum circuit with fewer CNOT gates.\n\nIn regards to ref. [3], after studying the work, we have realized that the method is inspired by ADAPT-VQE (Tang et al., 2021) which we have covered with noiseless simulation.\nAdditionally, the method is designed to build circuits for combinatorial optimization problems as a target, which is not in the same spirit of our work.\n\nRef. [4] explores a random selection of quantum gates, aligning with device constraints such as device topology.\nUnfortunately, comparison with ref. [4] isn't feasible since it doesn't involve any molecular problems. \nWe anticipate that integrating topological constraints into the reward function of CRLQAS method, penalizing violations of connectivity constraints, could enhance transferability across quantum devices compared to ref. [4].\nThe reason behind this is the fact the ref. [4] picks available gates at random, while an RL learns to generalize better, at the cost of much larger training."
                    }
                },
                "number": 10,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8370/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700359007980,
                "cdate": 1700359007980,
                "tmdate": 1700359043919,
                "mdate": 1700359043919,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "vw4nbGHtGP",
                "forum": "rINBD8jPoP",
                "replyto": "mehW4IELbO",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8370/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8370/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response 4 to reviewer WndL"
                    },
                    "comment": {
                        "value": "> Given that the noise model is derived from \"current\" calibration data and the gate-level noise model is only an approximation, there are concerns about its accuracy. For instance, although noise might seem stable over a short time frame, over a more extended period (e.g., a week), one can observe significant shifts. If the framework has a high computational cost, it may yield unreliable results if the calibration data changes rapidly during training.\n\nWe agree with the reviewer that our noise simulations do not model the dynamical shift of noise parameters due to drift, nor the unmodeled noisy phenomena such that our findings are not absolute. We highlight this fact in our manuscript. Recent literature suggests the simulated and actual hardware outcomes demonstrate comparable behaviour when confronted with low levels of hardware noise for quantum machine learning tasks [1]. In the said work, given the low levels of noise, the authors observed the difference between the real hardware and the pure simulations was statistically insignificant despite the device drift, with a notable exception of occasional sudden spikes. To this end, we will provide a comparative experiment on the real hardware and the noisy simulators in the revised manuscript in coming days. Using a single set of parameters and $20,000$ shots, we evaluated the VQE cost function of the four qubit $H_2$ problem with the circuit constructed by the CRLQAS agent on IBM-Lagos device and its noise models based on the calibration data of November $16$, 2023. \n\n\n> Notable absence of results on real quantum hardware. Testing only on a noisy simulator might not be entirely convincing, especially when using reinforcement learning, which is assumed to achieve the upper bound of performance.\n\nWe agree that there may be added value of testing RL based QAS methods, and any other small experiment, on real quantum devices to fully assess the algorithm performance.\nHowever, as we elaborate, we do not see it as crucial as the referee suggests, atop of being often impossible in practice for most groups, as we explain next.\nBut before going into these explanations, we point out that we did not quite understand what the referee means by reinforcement learning being an 'upper bound of performance'.\nOne expects that a well-trained reinforcement learning agent is capable of finding much better results than any other method (i.e. ADAPT-VQE or UCCSD) by being able to explore a much larger combinations of gates, even those that one might not consider useful by a human.\nRegarding further testing on real quantum hardware, we would like to emphasize that this is a non-trivial task.\nIn our view, doing so makes sense only in two cases,\n1. when the differences between simulation and the real system make a systematic important impact on the conclusions we draw about our method.\n2. when one wants to understand the performance of the quantum device itself.\n\nWe are not concerned about the topic 2. Regarding topic 1, the likely main issues in learning have to do with inconsistent evaluations of the energy, which simulations capture well. \nSince this is the first paper to systematically evaluate RL in noisy simulations of this type, we believe that considering this source of differential behaviour is sufficient to highlight the potential and limitations of our methods.\nFurther, as mentioned earlier, our parallel yet unpublished studies along with other works such as [1] suggest that indeed the ML systems do not have a significant differential performance in real vs. simulated noise.\n\nThere is however another important issue we see with the suggestion of the referee that incorporating tests on real quantum devices is *crucial*, meaning for the results of the paper, and thus consequently for the potential of papers to be accepted to top conferences like ICLR.\n\nThe issue is that real devices are exclusively proprietary, and free use does not give anywhere near enough access to do experiments of type we want. For instance, IBM has a *monthly limit of $10$ minutes for a free account*). And we believe the reviewer will agree that demanding that a necessary criterion for acceptance of a paper to top conferences is that they have funds to pay for extensive real QC runs would not be fair, and put smaller groups at a significant disadvantage, especially in the scenario where it is not even clear that these real runs reveal anything systematic about the method, and not just the specific *temperament* of a **particular** quantum computer.\n\n\n\n\n\n[1] Rehm, Florian et al., \"Precise image generation on current noisy quantum computing devices.\" Quantum Science and Technology 9, no. 1 (2023): 015009."
                    }
                },
                "number": 11,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8370/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700359810833,
                "cdate": 1700359810833,
                "tmdate": 1700360598441,
                "mdate": 1700360598441,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "7yqThAeBSi",
                "forum": "rINBD8jPoP",
                "replyto": "mehW4IELbO",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8370/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8370/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response 5 to reviewer WndL"
                    },
                    "comment": {
                        "value": "> Given that you utilize a noise model from the current noisy environment and consider only one seed, real hardware testing is crucial.\n\nGoing back to the potential use of free access, a typical VQE function evaluation (query) on IBM Lagos device with $20,000$ shots takes roughly $0.3$ seconds and training even a single circuit needs more than a thousand evaluations.\nHaving said this, we can only barely manage to train just one episode of our method with the free access.\nOn the other hand, one could potentially look for an experimental group interested on running such methods.\nHowever, in the vast majority of cases, experimental labs have dedicated hardware and software to run experiments which is really difficult to integrate for RL.\nNonetheless, the goal of running noisy classical simulations with realistic noise models is to bring evidence to experimental groups that RL can be used in real hardware.\nWe hope that our work motivates simultaneously theorists and experimentalists to run RL methods on real hardware for quantum architecture search.\n\n\n> Have you tried to implement your final result on real hardware? - I believe it should be easy for you since you already get your optimal arch and parameters from noisy simulation. You can just run this circuit on real quantum hardware and obtain the result.\n\nThe first part of the question has been addressed in the *Response 4 to reviewer WndL*.\nWe have not attempted to run any of the experiments (training CRLQAS agent) in real hardware due to time and access limitations, even for the minimal examples of running the optimal circuits for all the molecular systems considered in this study.\nWhile this experiment is interesting in its own right, it will not make the results more or less interesting: either the results are close, and our noise model is accurate, or the results are significantly different and we must adjust our noise model.\nThe really interesting experiment is to run the full CRLQAS pipeline such that one can study the behaviour of the RL agent, assess the actual computational cost, and study the differences with respect to noiseless and noisy classical simulations.\nUnfortunately, to perform such an experiment we need access to a dedicated machine with no time limits.\nMoreover, public access to IBM Quantum devices is limited to 10 minutes per month, as of November 2023, with exceedingly high waiting times in the queues. A typical VQE function evaluation (query) on these devices with $20,000$ shots takes roughly $0.3$ seconds and training even a single circuit needs more than a thousand evaluations.\n\nHowever, we do perform a small comparative experiment on the real hardware and the noisy simulators (exactly modelled as in our work) for $H_2$ molecule with a circuit produced by a trained CRLQAS agent.\nWe will update the manuscript in the coming days with the results of this experiment.\nIn future, we hope to engage with experimental labs interested in attempting such a challenging computation."
                    }
                },
                "number": 12,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8370/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700360664712,
                "cdate": 1700360664712,
                "tmdate": 1700362884567,
                "mdate": 1700362884567,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "3gFM61mr3c",
                "forum": "rINBD8jPoP",
                "replyto": "7yqThAeBSi",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8370/Reviewer_WndL"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8370/Reviewer_WndL"
                ],
                "content": {
                    "comment": {
                        "value": "I really appreciate the author's efforts to address my questions. However, I still have two last concerns:\n1. The scalability of the CRLQAS. I understand the authors provide the data for the small qubit circuits, but what if we want to implement CRLQAS for the 1000 qubit-scale task? I think the noisy simulation could have an exponential cost with the increase in the number of qubits.\n\n2. Based on my understanding, the noise model is an approximate graph of the real condition since the noise is time-dependent, which means this is actually a dynamics model. And I used to track the dynamics of the noise model directly on IBM devices. I observed that there was almost a sharp change in the noise model per week; it is not a serious problem for the QML tasks that the authors mentioned since such tasks can be finished in one day. However, for the CRLQAS, what I think is that if we implement maybe 100 qubits, it could take a couple days to process, which introduces a probability: the noise model input to the CRLQAS could be away from the current condition on the real machine. \n\nI understand the limited access to the cloud machines; then, I have personal suggestions for authors:\n1. Theoretically prove how you speed up your framework to avoid such a scalability problem.\n2. May come up with some interesting reward functions that can capture the dynamics of the noise."
                    }
                },
                "number": 17,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8370/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700582188797,
                "cdate": 1700582188797,
                "tmdate": 1700582188797,
                "mdate": 1700582188797,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "q3Dk2lItR1",
                "forum": "rINBD8jPoP",
                "replyto": "mehW4IELbO",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8370/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8370/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Concerns of Official Comment 2 by reviewer WndL"
                    },
                    "comment": {
                        "value": "> I really appreciate the author's efforts to address my questions. However, I still have two last concerns:\n\nWe thank the reviewer for the comments on our submission, we believe that by addressing them we have substantially improved our manuscript.\n\n> The scalability of the CRLQAS. I understand the authors provide the data for the small qubit circuits, but what if we want to implement CRLQAS for the 1000 qubit-scale task? I think the noisy simulation could have an exponential cost with the increase in the number of qubits.\n\nThe reviewer is correct when stating that our noisy simulator has an exponential cost in the number of qubits. In fact, no faithful noisy simulator can avoid an exponential cost (as it has to be able to evaluate noiseless circuits as well), unless the whole of quantum computing can be efficiently simulated. However, we would like to reiterate that the noisy simulation was *only* needed to showcase the effectiveness of the learning process of our CRLQAS method (the core contribution of our paper). That being said, the cost of the framework simulating noise becomes  less relevant but its development was *only* necessary due to the lack of unrestricted access to a real device. Ultimately, even with a moderate number of qubits (e.g.,~30) the experiments will need to be performed on quantum hardware, and no simulator will be able to fully capture the complexity of these experiments.\n\n> Based on my understanding, the noise model is an approximate graph of the real condition since the noise is time-dependent, which means this is actually a dynamics model.\nAnd I used to track the dynamics of the noise model directly on IBM devices.\nI observed that there was almost a sharp change in the noise model per week; it is not a serious problem for the QML tasks that the authors mentioned since such tasks can be finished in one day.\nHowever, for the CRLQAS, what I think is that if we implement maybe 100 qubits, it could take a couple days to process, which introduces a probability: the noise model input to the CRLQAS could be away from the current condition on the real machine.\n\nAssuming the referee meant that the noise model is not a fully accurate simulation of a real device, they are correct when stating that the noise of a quantum device changes with time.\nFor instance, superconducting qubit systems of IBM and Google have a drift time-scale of approximately a day.\nOf course it is not possible for us to study exact noise processes, and observing what happens in this *time-independent* noise model is a natural starting point. Claims for the noise model we have is the only claim we can make rigorously.\nHowever, we briefly discuss the likely outcomes of the use of our algorithm in other scenarios, namely the time drift aspect.\nEven though the system drifts, the quantum circuits generated by CRLQAS are still valid because after tuning the device, the noise in the system will have not changed massively. For example, superconducting qubits are dominated by T1 and T2 errors. These errors might vary within a day, yet they stay within the same order of magnitude even after re-calibration. The changes in these parameters remain within $\\mu$ seconds for superconducting qubits [1].\nIn a simulation, one could take the best and worst noise profiles of a quantum chip, creating a lower and an upper bound on what one could expect in a real experiment.\nHaving a lower and an upper bound on the performance of the device one considers using before the start of an experiment is incredibly insightful because one can explore to what extent the quantum hardware can be used.\n\n&ensp;\n\n[1] Baheri, Betis, et al. \"Quantum Noise in the Flow of Time: A Temporal Study of the Noise in Quantum Computers.\" In 2022 IEEE 28th International Symposium on On-Line Testing and Robust System Design (IOLTS), pp. 1-5. IEEE, 2022."
                    }
                },
                "number": 18,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8370/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700680801971,
                "cdate": 1700680801971,
                "tmdate": 1700682199634,
                "mdate": 1700682199634,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "XAdbeJERnQ",
                "forum": "rINBD8jPoP",
                "replyto": "mehW4IELbO",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8370/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8370/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Suggestions of Official Comment 2 by reviewer WndL"
                    },
                    "comment": {
                        "value": ">I have personal suggestions for authors:\n>\n> 1. Theoretically prove how you speed up your framework to avoid such a scalability problem.\n> 2. May come up with some interesting reward functions that can capture the dynamics of the noise.\n\nWe thank the reviewer for the suggestions and find them interesting; but as we will explain they are not really feasible in reasonable time frames, and we do not believe they should be a deciding factor in whether our work fits ICLR.  \n\n1. **Scalability of CRLQAS method:** Note that our method is *inherently heuristic since it employs deep RL methods*. By definition, it is thus not possible to provide analytic proofs, nor have any proofs of a similar kind ever been successfully provided in any related setting to our knowledge. Even beyond heuristics, predicting and reliably extrapolating the performance of quantum systems would be a clear holy grail of the field. However, also likely completely impossible, as the differential performance between quantum and classical systems itself must be intractable for a classical computer. It is not difficult to construct cases where getting information on the deviation between a classical and quantum model also allows us to approximate the outcome of the quantum model. \\\n\\\n**Scalability of classical noisy simulation of real device:** Any quantum simulation under noise takes exponential classical memory as the system size increases. The largest noisy simulations with a density-matrix simulation are of the order of 20 qubits [1, 2]. Therefore, we can not prove that we have a simulation method that scales up the noisy simulation for the speeds we need. Furthermore, if such a method were to exist, there would be no need for quantum computers at all.\n\n&ensp;\n\n2. We would like to reiterate that capturing the drift aspect of the real device is not a key focus of our work, and that it would also not allow us to capture all the relevant noise anyways, as we explain next. Understanding and tracking down the actual drift processes (needed to make a simulator that reliably captures drift) is an active field of research in quantum computing, quantum control and even condensed matter physics. There has been some progress in predicting the drift of superconducting qubits (via Floquet dynamics [3, 4]). Nevertheless, theoretically, it only works on short time scales, on the order of hours after the drift. Drift, stemming from non-Markovian $1/f$ noise in quantum computers, remains challenging to accurately model for individual qubits within open quantum systems, let alone complex hardware [5]. First-principle approaches like the Nakajima-Zwanzing master equation are generally unsolvable or numerically complex, especially for the system sizes of present-day devices [6].  Even analogues like the Time-Convolutionless master equation rely on a perturbation expansion that might not fully capture the underlying physics of these devices [7]. Developing an RL method that learns to capture the dynamics of an open quantum system particularly with drifts is far from the scope of this work. Therefore, we can not fulfil this suggestion as it poses a scientific question that might not have an answer.\n\n\\\n\\\n\\\n\\\n[1] O’Brien, Thomas E., et al. \"Density-matrix simulation of small surface codes under current and projected experimental noise.\" npj Quantum Information 3.1 (2017): 39 \n\n[2] Jones, Tyson, et al. \"QuEST and high performance simulation of quantum computers.\" Scientific reports 9.1 (2019): 10736.\n\n[3] Arute, Frank, et al. \"Observation of separated dynamics of charge and spin in the fermi-hubbard model.\" arXiv preprint arXiv:2010.07965 (2020).\n\n[4] Google Quantum AI. (2023, May 18). Calibration FAQ. Retrieved November 22, 2023, from https://quantumai.google/cirq/noise/calibration_faq\n\n[5] Rol, Michiel Adriaan. \"Control for programmable superconducting quantum systems.\" (2020).\n\n[6] Zwanzig, Robert. \"Ensemble method in the theory of irreversibility.\" The Journal of Chemical Physics 33, no. 5 (1960): 1338-1341. \n\n[7] Vacchini, Bassano, and Heinz-Peter Breuer. \"Exact master equations for the non-Markovian decay of a qubit.\" Physical Review A 81, no. 4 (2010): 042103."
                    }
                },
                "number": 19,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8370/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700681930654,
                "cdate": 1700681930654,
                "tmdate": 1700682183236,
                "mdate": 1700682183236,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "A27PewPOhO",
            "forum": "rINBD8jPoP",
            "replyto": "rINBD8jPoP",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission8370/Reviewer_wt33"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission8370/Reviewer_wt33"
            ],
            "content": {
                "summary": {
                    "value": "The paper presents a new combined RL algorithm tailored for the domain of quantum architecture search (QAS). AN empirical study shows benefits over state-of-the-art approaches in this very early field of research."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "The paper does a reasonable job introducing the issue of quantum architecture search and, from the presented difficulties of the domain, manages to derive its adaptations to standard RL employed to tackle this domain. The adaptations presented are sound and straight-forward. The results give a nice guideline for future research in that direction."
                },
                "weaknesses": {
                    "value": "As with most approaches in the field of quantum computing, the evaluation is rather weak does not allow to draw too strong a conclusion (which, luckily, the authors did not draw). The presentation of the sequence of experiments is rather convoluted (and not helped by putting the plots very late in the document). More clear-cut scenario descriptions would be helpful.\n\nThe discussion lacks an explanation how adaptations which were largely motivated by the accommodation of noise models then manage to outperform the state-of-the-art in the noiseless case.\n\nAlso, I would have liked a singled-out study on the impact of the \"illegal actions\" adaptations. It appears that it might do a lot of the heavy lifting, which would then change the overall story of the paper.\n\nMany discussions are left to the Appendix and several forward-references point to it. The structure should be improved here to make a clearer distinction between important and less important points.\n\nThe writing still has several problems including:\n- p1, second paragraph, last sentence: no verb\n- p2, fig1, caption: \"(i)\" without \"(ii)\"\n- p3: \"Methods like this\" should read \"Methods like these\"\n- p4, eq2: parameters/variables are not sufficiently explained in the text, at least not in a concise manner\n- p4, last paragraph before 3.1, first sentence: It is unclear how the \"environment\" is deterministic/stochastic. Refer to transition function, reward function etc.\n- p5, section3.3, throughout: Typo \"T_{s^e}\" instead of \"T _s^e\"?\n- p4, section3.4: do not put comma after \"where\"\n- p6, section3.6: Use \"it is\", not \"it's\"\n- p6, section3.6: \"the Appendix\" randomly appears in a sentence"
                },
                "questions": {
                    "value": "see above...\n\nWhat is the distinct impact of the \"illegal actions\" adaptation?\n\nWhy is the result even better upon \"closer inspection\"? (p7, very bottom)"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission8370/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698834279692,
            "cdate": 1698834279692,
            "tmdate": 1699637040817,
            "mdate": 1699637040817,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "qrDO7dXAMq",
                "forum": "rINBD8jPoP",
                "replyto": "A27PewPOhO",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8370/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8370/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response 1 to reviewer wt33"
                    },
                    "comment": {
                        "value": "Thank you for your thoughtful and constructive feedback on our paper, especially on the remark of performing a *singled-out study on illegal actions*. \nWe appreciate your acknowledgement of the introduced adaptations to standard RL and the insights provided on the domain's challenges.\nDuring the rebuttal period, we performed additional ablation studies and improved the readability of the manuscript. In the general answer, we list down the introduced changes. We hope it is sufficient, please let us know if you have any more questions or comments.\n\n\n> As with most approaches in the field of quantum computing, the evaluation is rather weak and does not allow to draw too strong a conclusion (which, luckily, the authors did not draw)\n\nThe reviewer is of course correct that it is difficult to draw strong conclusions form the volume and scale of simulations and especially real QC runs which are broadly possible today, but as the rest of the community, we put in maximal efforts to push the boundary.\nIn our case, nearly a year's worth of work was invested in transitioning our simulation methods. We experimented with various off-the-shelf SDKs, such as Tensorflow Quantum, Qulacs, Qibo, and TorchQuantum, before settling on the relatively faster JAX framework.\n\nAs a result of this transition, we've developed an in-house JAX package specifically tailored to reinforcement based QAS.\nThis transition enabled us to perform slightly bigger simulations with more types of noise.\n\n> The presentation of the sequence of experiments is rather convoluted (and not helped by putting the plots very late in the document). More clear-cut scenario descriptions would be helpful.\n\nWe are sorry to hear that the ordering as presented affected the readability for the reviewer.\nOur approach followed the convention of our research group, focusing on presenting important contributions upfront, followed by results and detailed descriptions in the appendix. \nDue to page limitations, we moved some descriptions to the appendix.\nTo further enhance readability, we tried to improve on those and to ensure clarity, we have added more details in the appendix wherever applicable. \nIf the reviewer has further suggestions for improving readability, we are more than happy to try to implement them in our work.\n\n> Many discussions are left to the Appendix and several forward-references point to it. The structure should be improved here to make a clearer distinction between important and less important points.\n\nWe are thankful to the reviewer for pointing out the problems and typos in the text. In the revised version of the manuscript, we incorporated the changes and typing mistakes.\n\nBy \"environment\" is deterministic/stochastic we meant that the reward function can be stochastic because it depends on the cost function evaluation. \nThe nature of the CRLQAS reward function depends on the cost function evaluation. \nThe cost function evaluation can be deterministic or stochastic based on both the classical optimizer and quantum noise. \nStochastic optimizers, like SPSA, tend to converge toward different parameters, resulting in different function values across multiple trials, even when initialized identically. \nMoreover, the quantum noise may also lead to different function values even with the same parameters.\nWe have clarified this aspect in the text by including this description in the revised manuscript."
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8370/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700352446992,
                "cdate": 1700352446992,
                "tmdate": 1700352446992,
                "mdate": 1700352446992,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "hxBQJf3CDY",
                "forum": "rINBD8jPoP",
                "replyto": "A27PewPOhO",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8370/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8370/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response 2 to reviewer wt33"
                    },
                    "comment": {
                        "value": "> The discussion lacks an explanation how adaptations which were largely motivated by the accommodation of noise models then manage to outperform the state-of-the-art in the noiseless case. Also, I would have liked a singled-out study on the impact of the \"illegal actions\" adaptations. It appears that it might do a lot of the heavy lifting, which would then change the overall story of the paper.\n\nWe agree that additional ablation studies would strengthen the paper.\nTo this end, we ran simulations to conduct a detailed study to find out which of the newly proposed features stands out.\nThese simulations implement a controlled study of each feature by training a different CRLQAS agent for a given problem with and without each feature.\nOur analysis reveals that incorporating illegal actions without random halting prompts the agent to achieve a positive signal (a successful episode) early on, albeit resulting in larger circuits.\nConversely, introducing random halting encourages the agent to discover shorter circuits, but there is a trade-off as the agent receives the positive signal at a later stage.\nWe provide a table (see *Table 1*) of these studies. \nWe will update the manuscript and visualize the data from the *Table1* more tactfully in the coming days.\n\n\n> What is the distinct impact of the \"illegal actions\" adaptation?\n\nAs previously noted, to answer this question, we initiated a new set of ablation studies.  \nThese studies not only center on assessing the impact of \"illegal actions\" but also delve into the effects of implementing \"random halting\".\nOur analysis reveals that incorporating illegal actions without random halting prompts the agent to achieve a positive signal (a successful episode) early on, albeit resulting in larger circuits.\nPlease refer to  *Table 1 in Response 3 to reviewer wt33* where we provide the statistics of experiments.\n\n\n\nIn more detail, the distinct impact of \"illegal actions\" adaptation is the constraining of the combinatorially large search space of the possible gate combinations such that a more efficient search can be conducted.\nWe see this trend in our ablation studies via the early observation of circuits that can achieve good energy estimates, such as estimates within chemical accuracy (please refer to the revised manuscript). \nThe simple rule of not allowing the addition of two similar gates subsequently on the same qubits (i.e., not allowing two CNOTs on the same control \\& target qubits in a row, or not allowing two single qubit rotation in the same direction on the same qubit in a row) led the agent to get a good signal at the random exploration stage early on such that it could further learn new patterns leading to even better circuits. \nIn the absence of illegal actions, the agent is deprived of such a signal during the random exploration stage (i.e., when the randomness of the actions parametrized by $\\epsilon$-greedy agent for higher values of $\\epsilon$ ) so that it can never or can barely learn to construct good circuits. \nThis trend is quite apparent in the case of the 4-qubit $H_2$ molecule solved with limited qubit connectivity, and IBM Ourense device noise model - a problem we derived from the QCAS (Du et al., 2022). \nHere, with illegal actions and without random halting, CRLQAS agents that are trained for 3 random seeds were able to achieve chemical accuracy in roughly $1200$ (median of seeds) out of $15000$ episodes. \nSimilarly, with illegal actions but with random halting, they achieve chemical accuracy (CA) in roughly $300$ (also median) out of $15000$ episodes. \nIn contrast, without illegal actions and without random halting, the agents achieve CA in only $10$ (median) out of $15000$ episodes. \nLastly, without illegal actions and with random halting, the agents achieve CA in only $6$ (median) out of $15000$ episodes. \nTraining with and without illegal actions leads up to a three-order-of-magnitude difference in the number of successful episodes for this scenario. \nWe refer the reviewer to the *Table1 in Response 3 to reviewer wt33* where we provide in-depth statistics of our ablation study in both noisy and noiseless scenarios. \nWe will update the manuscript and visualize the data from the *Table 1 in Response 3 to reviewer wt33* more tactfully in the coming days."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8370/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700354530723,
                "cdate": 1700354530723,
                "tmdate": 1700415944443,
                "mdate": 1700415944443,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "3W3ECnUUXJ",
                "forum": "rINBD8jPoP",
                "replyto": "A27PewPOhO",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8370/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8370/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response 3 to reviewer wt33"
                    },
                    "comment": {
                        "value": "> Ablation studies on different adaptations of CRLQAS method\n\n\n### Table 1\nWe performed a detailed study to find out which of the newly proposed features of CRLQAS method stands out in both noisy (for 4-qubit $LiH$ and $H_2$) and noiseless (for 6-qubit $LiH$) settings. Below we first find an episode with the best noiseless error and acquire circuit statistics (i.e., depth, gates, etc.) as well as the noisy error of that episode. The last two columns quantifies the learning performance of the CRLQAS method. We describe the median statistics over three and five random seeds for noisy and noiseless experiments, respectively. We emboldened the noiseless errors which pass the chemical accuracy. Below, $\\text{wo-X}$ denotes switching off the feature $\\text{X}$ where $\\text{X}$ $\\in$ {$\\text{IA}, \\text{RH}$}. \n\n| Molecule                                               |   Environment & Agent |   Noisy Error |   Noiseless Error |   Depth |   No. of Gates |   Parameters |   Actions to First Successful Episode |   No. of Successful Episodes |\n|:---------------------------------------------------------:|:-------------------------------:|-------------------------:|-------------------:|--------:|------------:|-----------:|------------------------:|----------------:|\n| $LiH-4$ |     (wo-IA, wo-RH, IBM Mumbai Median)     |              0.0581266   |        0.00257938  |      24 |          40 |         33 |                       N.A. |               N.A. |\n| $LiH-4$   |           (IA, wo-RH, IBM Mumbai Median) |              0.081803    |        **0.00150412**  |      23 |          40 |         30 |                   66221 |               1 |\n| $LiH-4$   |           (wo-IA, RH, IBM Mumbai Median) |              0.0535075   |        0.00288408  |      15 |          29 |         21 |                       N.A. |               N.A. |\n| $LiH-4$     |           (IA, RH, IBM Mumbai Median) |              0.0669863   |        0.00242298  |      15 |          29 |         23 |                       N.A. |               N.A. |\n| $LiH-4$               |           (IA, RH, IBM Mumbai Median & shot noise) |              0.073456    |        0.00376099  |      17 |          28 |         18 |                       N.A. |               N.A. |\n| $H_2-4$                         |           (IA, wo-RH, IBM Ourense) |              0.238207    |        **0.000115746** |      26 |          40 |         14 |                   59311 |            1209 |\n| $H_2-4$                       |           (wo-IA, wo-RH, IBM Ourense) |              0.311764    |        **0.000422948** |      29 |          40 |         23 |                   58157 |              10 |\n| $H_2-4$                          |           (IA, RH, IBM Ourense) |              0.137199    |        **0.000222438** |      27 |          32 |          5 |                   42331 |             217 |\n| $H_2-4$                         |           (wo-IA, RH, IBM Ourense) |              0.152238    |        **0.000308149** |      19 |          27 |         22 |                   35593 |               6 |\n| $LiH-6$                               |           (Ostaszewski et al. 2021, noiseless) |              N.A.  |        0.00242028  |      24 |          55 |         29 |                       N.A. |               N.A. |\n| $LiH-6$                               |           (IA, wo-RH, noiseless) |              N.A. |        **0.000832465** |      27 |          56 |         26 |                  356604 |              30 |\n| $LiH-6$                                 |           (IA, RH, noiseless) |              N.A.  |        **0.00121936**  |      30 |          59 |         37 |                  641593 |               3 |\n| $LiH-6$                               |           (wo-IA, RH, noiseless) |              N.A.  |        0.00372759  |      23 |          45 |         25 |                       N.A. |               N.A. |\n| $LiH-6$                             |           (wo-IA, wo-RH, noiseless) |              N.A. |        0.00163461  |      31 |          62 |         31 |                       N.A. |               N.A."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8370/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700354805140,
                "cdate": 1700354805140,
                "tmdate": 1700363211139,
                "mdate": 1700363211139,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "yAVvyzOHWd",
            "forum": "rINBD8jPoP",
            "replyto": "rINBD8jPoP",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission8370/Reviewer_sjih"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission8370/Reviewer_sjih"
            ],
            "content": {
                "summary": {
                    "value": "This paper tackles the challenge of identifying optimal quantum circuits within the constraints of noisy intermediate-scale quantum (NISQ) devices. It introduces a novel curriculum-based reinforcement learning algorithm for quantum architecture search (CRLQAS), which innovatively employs a 3-D architecture encoding, an episode halting mechanism, and an enhanced simultaneous perturbation stochastic approximation optimizer for more efficient exploration and convergence. By incorporating Pauli transfer matrix formalism to improve simulation times, the proposed CRLQAS demonstrates superior performance in automating the design of quantum circuit architectures, outstripping existing methods in both noiseless and noisy conditions, specifically for quantum chemistry applications."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "The paper excels in its strategic approach to quantum computing in the NISQ era by giving paramount importance to the role of quantum noise and its effect on circuit architecture. It introduces a pioneering curriculum-based reinforcement learning (RL) algorithm, CRLQAS, which specifically addresses the challenges posed by noise in quantum systems. The use of the Pauli transfer matrix formalism in this algorithm marks a substantial improvement in the simulation of noisy quantum circuits, significantly reducing computational time and increasing simulation fidelity. \n\nIn addition to the quantum-specific advancements, the paper contributes to the field of RL by implementing a 3-D architecture encoding and an episode halting mechanism within its curriculum-based framework, enhancing the RL agent's ability to discover shorter and more hardware-efficient circuit architectures rapidly. The introduction of a novel optimization technique further refines the learning process, facilitating faster convergence and potentially leading to more robust quantum computing solutions. These combined strengths showcase the paper's dual focus on developing an efficient simulation that carefully accounts for quantum noise and on refining RL techniques to ensure that the architecture search yields practical, hardware-efficient designs."
                },
                "weaknesses": {
                    "value": "One area for improvement in the paper is the absence of the promised source code, which limits the ability of others to replicate and build upon the work. It is essential for the authors to provide the source code to enhance the transparency and applicability of their research. Therefore, it is recommended that the authors include a link to the open-sourced code or an appendix containing the code in any subsequent revision of the paper. This addition would be a valuable resource for the community and would greatly facilitate further research and validation of the proposed methods.\n\nThe paper could be enhanced by broadening the scope of its comparative analysis with existing methodologies. While the current work focuses on a specific approach to quantum circuit optimization, there are alternative methods worth considering, such as those based on SMT (Satisfiability Modulo Theories) solvers. For instance, the technique presented by B. Tan and J. Cong in \"Optimal layout synthesis for quantum computing,\" (ICCAD, 2020) could serve as a valuable benchmark. It would be beneficial for the authors to include a comparison with these kinds of potentially optimal circuit compilers to contextualize the effectiveness of their proposed method when applied to analogous problems.\n\nFurthermore, the terminology used in the paper, specifically the term \"architecture,\" may lead to ambiguity within the broader scientific community. In the realm of computer architecture, \"architecture\" typically refers to the low-level hardware design, as discussed in sources like the one available on IEEE Xplore. Since this work is centered around the optimization of parameterized quantum circuits, and not the hardware itself, clarity could be improved by selecting a term that more accurately describes the subject of optimization. A term like \"circuit design\" or \"circuit configuration\" may better capture the essence of the research without the potential for misinterpretation."
                },
                "questions": {
                    "value": "1. Can the authors provide the source code that was mentioned as a part of the paper's contributions to facilitate replication and further research by peers?\n\n2. Would it be possible to expand the comparative analysis section of the paper to include methodologies based on SMT solvers, such as the approach detailed by B. Tan and J. Cong in ICCAD 2020, to provide a broader context and demonstrate the relative effectiveness of the proposed algorithm?\n\n3. Considering the potential for confusion within the interdisciplinary community, could the authors consider using a more precise term than \"architecture\" to describe the optimization of parameterized quantum circuits, thereby avoiding conflation with low-level hardware design?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission8370/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission8370/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission8370/Reviewer_sjih"
                    ]
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission8370/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699221489157,
            "cdate": 1699221489157,
            "tmdate": 1699637040698,
            "mdate": 1699637040698,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "BpcRSUrJV8",
                "forum": "rINBD8jPoP",
                "replyto": "yAVvyzOHWd",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8370/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8370/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to reviewer sjih"
                    },
                    "comment": {
                        "value": "We would like to thank the referee for the time spent reviewing this submission and for its appreciation of the timeliness and importance of this work to accelerate the current state of quantum computation with near-term quantum hardware. During the rebuttal period, we performed additional ablation studies and improved the readability of the manuscript. In the general answer, we list down the introduced changes. We hope it is sufficient, please let us know if you have any more questions or comments.\n\n> Can the authors provide the source code that was mentioned as a part of the paper's contributions to facilitate replication and further research by peers?\n\nWe thank the reviewer for bringing this issue to our notice. Currently, we are in the process of refining and polishing the codebase.\nAn anonymous version of the code will be made available before November 22, 2023. Thank you for your understanding and patience.\n\n\n> Would it be possible to expand the comparative analysis section of the paper to include methodologies based on SMT solvers, such as the approach detailed by B. Tan and J. Cong in ICCAD 2020, to provide a broader context and demonstrate the relative effectiveness of the proposed algorithm?\n\nWe appreciate the comment of the reviewer. However, there are subtleties in what the objectives of what these other papers achieve compared to our own which makes it hard drawing conclusion from such comparisons, and consequently we opted not to do them.\n\nIn particular, (Tan et al., 2020) deals with the quantum compilation or transpilation problem. This problem involves decomposing a given static unitary (a quantum program) in terms of subsequent native gates (unitaries) of certain quantum hardware. This compilation process may account for hardware constraints such as noise, or the timing \\& queues of pulse sequences implementing these gates. \nIn fact our introduction of illegal actions scheme was inspired from quantum compilation and transpilation techniques.\nAnd the effectiveness of this simple scheme is highlighted by the ablation studies we performed (see *Table 1 from Response 3 to reviewer wt33*).\n\nThe quantum architecture search (QAS) problem we are dealing with is more general. First of all, QAS problem does not deal with finding decompositions of a static circuit unitary but deals with finding families of circuit unitaries that solves certain type of problems such as state preparation, machine learning (classification, regression, etc.), or quantum chemistry (VQE). Second, our RL-based QAS method builds circuits out of primitive gate sets while being constrained by the noise of such gate sets. In that regard, the reviewer is right to suggest that we can embed the quantum compilation or transpilation problem for certain hardware within our QAS method. \nIncorporating CRLQAS with analogous problems, as suggested, holds potential interest, but it's a direction we intend to explore in future endeavors rather than within the context of this particular paper.\n\n\n> Considering the potential for confusion within the interdisciplinary community, could the authors consider using a more precise term than \"architecture\" to describe the optimization of parameterized quantum circuits, thereby avoiding conflation with low-level hardware design?\n\nWe understand the reviewers concern about the use of 'architecture' to describe a quantum circuit, as this concept exists with broad meanings depending on the field.\nUnfortunately, the term 'quantum architecture search' has been used in the quantum computing community since its introduction in 2020 by (Du et al. npj Quantum Inf 8, 62, 2022) and (Zhang et al. Quantum Science and Technology 7 045023, 2022).\nThe concept is an extension to that of neural architecture search (NAS) in classical machine learning.\nWe agree with the reviewer that there exist alternative ways of describing the process of building a quantum circuit, but it would require a community effort to get rid of the 'quantum architecture search' concept.\nFurthermore, the 'architecture' is integral to the title of our paper, and per conference guidelines, we are unable to modify it.\nWe apologize for any confusion this concept might cause, and hope that the reviewer understands our position."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8370/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700354890498,
                "cdate": 1700354890498,
                "tmdate": 1700354973197,
                "mdate": 1700354973197,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "gsMdWNXcu6",
            "forum": "rINBD8jPoP",
            "replyto": "rINBD8jPoP",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission8370/Reviewer_K92h"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission8370/Reviewer_K92h"
            ],
            "content": {
                "summary": {
                    "value": "Variational quantum algorithms (VQAs) stand for a promising candidate of practical quantum algorithms in the NISQ era. Nevertheless, the performance of VQA is significantly influenced by the choice of ansatz and noise effects. \n\nIn this paper, the authors adopt curriculum reinforcement learning for quantum architecture search (QAS), aiming to select ansatz with good performance under hardware errors. Specifically, they devise a CRLQAS algorithm with tensor-based 3-D encoding of quantum circuits, a random halting scheme to reduce the circuit length, and an variant of Adam-SPSA for better convergence. In addition, this work accecelerate simulation of noisy quantum circuits by employing pauli transfer matrix formalism. \n\nNumerical experiments on quantum chemistry tasks demonstrate the performance of the proposed method under noiseless and noisy circumstances."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "1 poor"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "- Originality: As far as I know, this is the first work to consider noise models from real quantum machines in RL-based QAS. Previous work focus on noiseless scenarios or only touch on simple noisy configurations. The setting of this work is closer to real applications in NISQ era, hence making it an advance over the previous state-of-the-art.\n- Quality: The paper proposes several techniques which are effective and easy to realize. The tensor-based binary encoding is straightforward but efficient and compact. Pruning of illegal actions successfully narrow the search space. Random Halting is introduced to reduce the training episodes, which is a major drawback of previous work. The offline computation with Pauli-transfer matrices and JAX achieves considerable acceleration for noise simulation.\n- Clarity: The main ideas and techniques in the paper are mostly clear, but many issues remain (see Weaknesses & Questions). \n- Significance: This paper seeks to tackle an important problem by considering noise of current devices in QAS for VQA, which is well-motivated. Literature discussing the negative impacts of noise on VQA has been thoroughly cited. The numerical demonstration of achieving chemical accuracy and outperforming previous methods is impressive."
                },
                "weaknesses": {
                    "value": "- The writing is poor, full of mistakes in grammar and notation. For example, the first sentence in the second paragraph of Section 3.6 is incomplete. There are erroneous notations such as  $T_{s}^{e}$ v.s $T_{s^{e}}$ in Section 3.3, wrong format of citation like (Wang et al., 2021) in introduction, inconsistent proper nouns such as \"ansatz\" v.s. \"ans{\\\"a}tze\", and numerous syntax errors. These issues impair the quality of the paper. \n- Originality: This paper extends the ideas from previous work (Ostaszewski et al., 2021). Some techniques such as feedback driven curriculum learning and Adam-SPSA seem to be the direct adaptation of existing methods.\n- Although several techniques are proposed, the paper may lack insights into which component principally improves the results, especially under noisy circumstances. It is unclear to me which technique is specialized for facilitating noise adaptations, rather than general improvement over existing methods.\n- Related to the previous question, in the noisy simulation section, the paper conducts no comparison with other RL-based QAS methods. Therefore it is unclear what is the improvement of this algorithm over previous methods in noisy environments. Moreover, for molecules such as LiH-4, the experiments only consider shot and 1-qubit depolarizing noise, which is far from real noise models. This undermines the persuasiveness of this work. \n- Important related work not discussed. Despite little consideration of noise in previous reinforcement learning methods for QAS, there have been many attempts in traditional architecture field. The paper may need more comparison with other QAS algorithms under hardware erors, especially those targeting noise-aware search, for example Wang et al. QuantumNAS 2022."
                },
                "questions": {
                    "value": "- Please proofread the manuscript and correct the numerous mistakes in grammar and notation. Also there is a repetition in the reference section, where \"Abhinav Kandala, Antonio Mezzacapo, Kristan Temme, Maika Takita, Markus Brink, Jerry M Chow, and Jay M Gambetta. Hardware-efficient variational quantum eigensolver for small molecules and quantum magnets. nature, 549(7671):242–246, 2017\" is listed twice.\n- Some descriptions are unclear to me. In Section 3.3, what does \"$n_s$ is the number of successes\" mean? Details in Section 3.4 could also be better stated. Moreover, from a reader's point of view, the organization of Section 3 is scattered and lacks emphasis on major contributions. \n- Does the model need retraining for different noise models to deliver competitive results? I am curious about the efficiency for adaptation to new noise models. Also I believe experiments on real quantum machines comparing the proposed method with other algorithms would make the work more solid.\n- Although the authors claim to tackle the general employment of VQAs, numerical experiments on applications are actually limited to VQE for quantum chemistry tasks. The authors should avoid overstatement, or apply the method to general VQA settings and tasks.\n- There is almost no discussion of limitations. What is the weakness of this method and what are the potential future directions?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission8370/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission8370/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission8370/Reviewer_K92h"
                    ]
                }
            },
            "number": 5,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission8370/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699427767183,
            "cdate": 1699427767183,
            "tmdate": 1699637040588,
            "mdate": 1699637040588,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "d4t3EhxZuE",
                "forum": "rINBD8jPoP",
                "replyto": "gsMdWNXcu6",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8370/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8370/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response 1 to reviewer K92h"
                    },
                    "comment": {
                        "value": "We thank the referee for the time spent in this review, and for remarking the significance of this work in order to assess the viability of reinforcement learning strategies in combination with noisy quantum hardware.\nAdditionally, we appreciate the referee's comment about our implementation of Pauli transfer matrix formalism accelerated with GPU.\nDuring the rebuttal period, we performed additional ablation studies and improved the readability of the manuscript. In the general answer, we list down the introduced changes. We hope it is sufficient, please let us know if you have any more questions or comments.\n\n> This paper extends the ideas from previous work (Ostaszewski et al., 2021). Some techniques such as feedback driven curriculum learning and Adam-SPSA seem to be the direct adaptation of existing methods.\n\nWe agree with the reviewer that the paper treats (Ostaszewski et al., 2021) as a baseline to improve upon. On the other hand, we respectfully disagree with the reviewer in regard to the comment that this work is a mere adaptation of existing methods. \nIn particular, we numerically demonstrate that the newly developed tensor-based binary encoding, the illegal actions, and random halting all improve the previous work *quantitatively* by orders of magnitude in metrics such as the first successful episode number, the total number of successful episodes, circuit depth, etc. Similarly, a version of Adam-SPSA we developed in this paper helps the RL agent tackle finite-sampling noise in a query way.  Moreover, we improved the existing works *qualitatively* by making such training, and their simulation, possible under a realistic noise model.\nWithout the curation, creation and adaptation of such elements \\& methods training a CRLQAS agent would simply be not possible under realistic noise.\nOur goal was to demonstrate that further improvements can be taken to combine reinforcement learning methods with near-term quantum hardware. And, such studies are contingent on the techniques developed in this paper.\n\n> Although several techniques are proposed, the paper may lack insights into which component principally improves the results, especially under noisy circumstances. It is unclear to me which technique is specialized for facilitating noise adaptations, rather than general improvement over existing methods.\n\nWe agree with the reviewer on the lack of ablation studies on which component improves the result in noiseless and noisy instances with the highest impact. Such a study is valuable to the scientific community who will build upon our results. We are providing a detailed ablation study, which involves numerical experiments that are not included in the manuscript, and its visualization in the revised manuscript.\nFor now, we please bear with us and refer to the *Table 1 of Response 2 and Response 3 to reviewer wt33* to the reviewer on the question about the same.\n\n> Moreover, for molecules such as LiH-4, the experiments only consider shot and 1-qubit depolarizing noise, which is far from real noise models. This undermines the persuasiveness of this work.\n\nWe respectfully disagree with the reviewer as we provided results in that matter, but we agree that we should have highlighted them more. \nWe would like to point to the reviewer that in section 4.2 we studied two more noise models for LiH-4, even though they did not achieve chemical accuracy. \nNamely, a model where 1-qubit depolarizing noise of strength $0.001$ is combined with 2-qubit depolarizing noise of strength $0.005$, and the median noise profile of IBM Mumbai device as described in the paper. \nWe conducted further experiments since the submission of the manuscript. \nWe will elaborate more about these results in the revised version in the coming days. \nFor now, please refer to *Table 1 of Response 3 to reviewer wt33*.\n\n\n> Although the authors claim to tackle the general employment of VQAs, numerical experiments on applications are actually limited to VQE for quantum chemistry tasks. The authors should avoid overstatement, or apply the method to general VQA settings and tasks.\n\nWe agree with the reviewer that within the scope of this paper, we are only dealing with a particular variant of VQAs, namely the VQEs in the quantum chemistry context. We will make the corrections in the revised manuscript. On the other hand, we kindly disagree with the statement that our method is limited to VQEs. No component of our method imposes such a restriction or is limited to quantum chemistry tasks. \n\n> There is almost no discussion of limitations. What is the weakness of this method and what are the potential future directions?\n\nThank you for pointing this out. We have added a new section in the Appendix A of the revised manuscript on the topics of computational demands, evolution of RL methods, validation on real hardware, scalability challenges and transfer learning exploration."
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8370/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700355782653,
                "cdate": 1700355782653,
                "tmdate": 1700355911956,
                "mdate": 1700355911956,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "VMK9wfF0dF",
                "forum": "rINBD8jPoP",
                "replyto": "gsMdWNXcu6",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8370/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8370/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response 2 to reviewer K92h"
                    },
                    "comment": {
                        "value": "> In the noisy simulation section, the paper conducts no comparison with other RL-based QAS methods. Therefore it is unclear what is the improvement of this algorithm over previous methods in noisy environments. \n\nWe respectfully disagree with the reviewer. To our knowledge, this work is the first study of classical RL-based quantum architecture search for quantum chemistry problems in the presence of quantum hardware noise. \nAdditionally, ref. [1] concentrate on addressing the state preparation problem specifically for $2$- and $3$-qubit GHZ states under hardware noise whereas our focus lies in addressing the fundamentally different challenge of ground state energy estimation for quantum chemistry tasks.\nIt is important to note that in the state preparation problem, the algorithm receives the target state as an input.\nIn contrast, for ground state energy estimation problem, the algorithm does not have any prior information about the ground state, inherently rendering the it a notably challenging problem.\n\n> Important related work not discussed. Despite little consideration of noise in previous reinforcement learning methods for QAS, there have been many attempts in the traditional architecture field. The paper may need more comparison with other QAS algorithms under hardware errors, especially those targeting noise-aware search, for example, Wang et al. QuantumNAS 2022.\n\nWe kindly disagree with the reviewer. \nIt may be the case it was missed due to the text structure, but we in fact did consider these other works (or similar), and reported on it in the paper. \nWe have referred to QAS algorithms employing search strategies such as sampling-based, evolutionary algorithms (EA) and RL in sec. 2 of our manuscript.\nFurthermore, our study includes a comparison with QCAS (Du et al., 2022), a one-shot super-circuit method, under both hardware noise and qubit-connectivity constraints for the $4$-qubit $H_2$ molecule.\n\nOur understanding of the paper suggests that QuantumNAS (Wang et al., 2022) falls within the family of one-shot super-circuit methods.\nThis technique involves sharing gate parameters among sub-circuits after one shot training to accelerate circuit evaluation. \nHowever, optimizing the super-circuit poses a challenge, and furthermore, there is a weak correlation in performances between sub-circuits with inherited parameters and those with optimal parameters from individual training.\n\nWe investigated QuantumNAS manuscript in an attempt to facilitate either a fully-fledged quantitative or qualitative comparison.\nUnfortunately, the work lacks essential information for such an analysis. Specifically, details about the molecular geometries and quantum circuits are absent, preventing us from conducting a quantitative experiment for comparison. \nConsequently, this would require us to run their algorithm from scratch for the molecules considered in this study.\nHence, due to the fact that we already compared to an algorithm (QCAS) which is akin to QuantumNAS and the reasons mentioned above, we believe that our comparison to existing methods (like QCAS, qubit-ADAPT VQE, quantumDARTS) is fair, and covers most of the existing approaches for quantum chemistry problems.\n\nNevertheless, a qualitative comparison is only feasible in the case of 2-qubit $H_2$ molecule. \nExamining fig. 17 in ref. [2], we note that the best result achieved in those experiments exhibits an energy error of $0.1$ Hartree. In contrast, our $H_2$ simulations, conducted over three independent seeds (for median of IBM Mumbai device), yield a mean noisy energy error of $1.116 \\times 10^{-3} \\pm 3.41 \\times 10^{-4}$—a performance three orders of magnitude superior to their outcomes. Furthermore, we outperform their results for IBM Mumbai at max and 10max noise levels, with mean noisy energy errors of $0.907 \\pm 0.008$ and $0.0912 \\pm 0.004$, respectively. \nRegrettably, there is no available information regarding the number of gates, depth, or parameters achieved by the method presented in ref. [2].\n\n[1] Kuo, En-Jui, Yao-Lung L. Fang, and Samuel Yen-Chi Chen. \"Quantum architecture search via deep reinforcement learning.\" arXiv preprint arXiv:2104.07715 (2021).\n\n[2] Wang, Hanrui, Yongshan Ding, Jiaqi Gu, Yujun Lin, David Z. Pan, Frederic T. Chong, and Song Han. \"Quantumnas: Noise-adaptive search for robust quantum circuits.\" In 2022 IEEE International Symposium on High-Performance Computer Architecture (HPCA), pp. 692-708. IEEE, 2022."
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8370/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700356207209,
                "cdate": 1700356207209,
                "tmdate": 1700415963015,
                "mdate": 1700415963015,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "hld3NTdXd4",
                "forum": "rINBD8jPoP",
                "replyto": "gsMdWNXcu6",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8370/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8370/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response 3 to reviewer K92h"
                    },
                    "comment": {
                        "value": "> Please proofread the manuscript and correct the numerous mistakes in grammar and notation. Also there is a repetition in the reference section, where \"Abhinav Kandala, Antonio Mezzacapo, Kristan Temme, Maika Takita, Markus Brink, Jerry M Chow, and Jay M Gambetta. Hardware-efficient variational quantum eigensolver for small molecules and quantum magnets. nature, 549(7671):242–246, 2017\" is listed twice.\n\nOur sincerest apologies for any inconvenience caused by grammatical mistakes and notation. \nAgain, we would like to thank the reviewer for spotting typos and notation errors. \nIn response, we have rectified those highlighted by the reviewer and have also addressed additional errors discovered internally in the updated manuscript. These modifications have significantly enhanced the readability and overall consistency of the text.\n\n> Some descriptions are unclear to me. In Section 3.3, what does \"is the number of successes\" mean? Details in Section 3.4 could also be better stated. Moreover, from a reader's point of view, the organization of Section 3 is scattered and lacks emphasis on major contributions.\n\nWe agree with the reviewer regarding the inconsistencies within the text. We conducted a thorough proofreading and introduced several revisions in the updated manuscript. \nFor instance, as highlighted by the reviewer, we restructured the text. Instead of the 'number of successes' of the negative binomial distribution we refer to 'number of failed Bernoulli trials' of this distribution in the text. \nAdditionally, we've refined the method descriptions in sec. 3, focusing solely on the presentation of new methods. The detailed explanation of the modified Feedback-driven curriculum, initially included in sec. 3, has been relocated to Appendix B.1.\n\n> Does the model need retraining for different noise models to deliver competitive results? I am curious about the efficiency for adaptation to new noise models. \n\nThe reviewer raises a fascinating point that we are also deeply interested in; i.e., the matters of transfer \\& active learning in the context of different noise models are indeed relevant questions both for practical concerns (e.g., leveraging training time by pre-training one and using it on the other), and for the fundamental understanding of the RL methods. \nBut, this is not the core of our question in this work.\nNonetheless, to lay the foundations for such a study, we trained different CRLQAS agents in different noisy environments for different Hamiltonians of the same system size. Also, we conducted two naive experiments where the neural network weights \\& the training memory buffer of a CRLQAS agent were transferred to different problems without any alterations. In the first one, we transferred agents trained in noiseless environments for the chemistry problem of different bond dimensions of the same molecule. Here we observed an agent trained within the scope of a higher bond-dimension problem (more difficult) to perform well in an easier problem, but not the other way around. In the second one, we transferred agents trained in the noiseless environment of the same molecule to a noisy environment. Here we also found that the agent was able to react to the new environment by synthesizing circuits that achieve chemical accuracy. On the other hand, we found that after a few thousand episodes the agents were not able to perform their task as adequately anymore due to catastrophic forgetting. We deemed a more systematic, elaborate future study is needed for this task. We believe such a study is *contingent* on the results \\& techniques developed in our study. \n\n> Also I believe experiments on real quantum machines comparing the proposed method with other algorithms would make the work more solid.\n\nWe kindly disagree with the reviewer on the necessity of real hardware experiments, especially at this stage. \nSince similar question was brought up by reviewer WndL, we have addressed this concern in our response to them. Please refer the answer there in *Response 4 and Response 5 to reviewer WndL*."
                    }
                },
                "number": 13,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8370/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700360729883,
                "cdate": 1700360729883,
                "tmdate": 1700388189264,
                "mdate": 1700388189264,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "E4ikwTtHgu",
                "forum": "rINBD8jPoP",
                "replyto": "hld3NTdXd4",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8370/Reviewer_K92h"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8370/Reviewer_K92h"
                ],
                "content": {
                    "comment": {
                        "value": "I would like to thank the authors for the detailed response and clarification. I really appreciate your efforts for addressing the concerns and the improvement over the rebuttal period. I have no further questions."
                    }
                },
                "number": 23,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8370/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700723435623,
                "cdate": 1700723435623,
                "tmdate": 1700723435623,
                "mdate": 1700723435623,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]