[
    {
        "title": "Personas as a way to Model Truthfulness in Language Models"
    },
    {
        "review": {
            "id": "URZGOBLsNV",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission5147/Reviewer_oRbY"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission5147/Reviewer_oRbY"
            ],
            "forum": "rKMQhP6iAv",
            "replyto": "rKMQhP6iAv",
            "content": {
                "summary": {
                    "value": "Following Andreas et al., this submission proposes the so-called “persona hypothesis”. And use probing and finetuning experiments to show support for such hypothesis."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "1 poor"
                },
                "strengths": {
                    "value": "I personally believe in the hypothesis the authors are proposing. The experiments are generally informative."
                },
                "weaknesses": {
                    "value": "1.\tI’m confused by some terms used in the paper. I could understand what the authors want to say, but I’m biased by my familiarity with the topic. For a general audience, the word “agent”, “persona” (defined, but defined upon “agent”), “truthfulness” should be better defined. It’s even better if such definitions are highlighted. \n2.\tI like Figure 2 (b) that you are comparing the 65% F1 with other time steps. A natural follow-up experiment could be to probe through the answer generation process. I bet the F1 should be higher than 65%. It will tell us that the persona the model puts on is also formed during the decoding process stochastically.\n3.\tThe fine-tuning experiments aren’t informative/surprising. We have known this from inference-time intervention (Li et al. 2023) How does your finetuning performance compare to their TruthfulQA results? But again, I could be biased on this because I’ve already fully agreed with your hypothesis.\n4.\tMost importantly, I’m afraid this submission lacks novelty. Specifically, given Andreas 2022 proposing a wider hypothesis, Burns et al. 2022 show truthfulness could be probed from internal activations, Li et al. 2023 show there is a simple trick to boost the truthfulness of LLM. Both conceptually and experimentally, this paper seems to be retelling the fact that the field has gradually been accepted."
                },
                "questions": {
                    "value": "1.\tOn the probing experiment. Technically speaking, if your data split is 50/50 yet the F1 is only 65%, isn’t it unconvincing that we could decode persona before the answers being generated? Could you provide other metrics, like accuracy, which is more widely adopted in probing literature?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "details_of_ethics_concerns": {
                    "value": "N/A"
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission5147/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1697296159906,
            "cdate": 1697296159906,
            "tmdate": 1699636508751,
            "mdate": 1699636508751,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "RNbwYTmodf",
                "forum": "rKMQhP6iAv",
                "replyto": "URZGOBLsNV",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5147/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5147/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer oRbY"
                    },
                    "comment": {
                        "value": "Thank you for your time and the constructive feedback! \n\n> I’m confused by the use of “agent”, “persona”, and “truthfulness” in the paper.\n\nPlease, see “terminology” in our general response, we have clarified the choice of the terms in the paper. We wanted to make the distinction between an agent (as defined in Andreas 2022) and a persona. We’ll make sure to highlight and more clearly state the definitions in our revised version of the paper.\n\n> Probe through the answer generation process. It will tell us that the persona the model puts on is also formed during the decoding process stochastically.\n\nThanks for the suggestion, this is definitely an interesting experiment worth adding to the final version! We ran the experiment and found that the F1 score indeed increases to 70% when the entire answer is sampled. We have updated the PDF with the new figure in Appendix B (figure 9).\n\n> The fine-tuning experiments aren’t informative/surprising. We have known this from inference-time intervention (Li et al. 2023).\n\nFirstly, we note two important distinctions from the experiments in Li et al. ---\n\n1. We test the model’s OOD performance by holding out certain categories of questions during finetuning. A generalization to unseen categories is stronger evidence supporting our hypothesis.\n\n2. Just evaluating on truthfulQA leaves up on the possibility of model picking on artifacts on truthfulQA (e.g. the dataset has a lot of false presupposition and `no’ is often the correct answer). We showed that the finetuning also generalizes to a separately created dataset from BigBench. We also want to emphasize that our goal with the finetuning experiment was to demonstrate how it could be explained by our hypothesis (hence the held-out experiments) rather than demonstrating a new method to improve truthfulness.\n\n\n> Most importantly, I’m afraid this submission lacks novelty. Specifically, given Andreas 2022 proposing a wider hypothesis, Burns et al. 2022 show truthfulness could be probed from internal activations, Li et al. 2023 show there is a simple trick to boost the truthfulness of LLM.\n\nThanks for bringing this up! We meant this work to be a bridge between Andreas and {Li et al., Burns et al.} where we show how the findings from the first can help explain the observations in the latter. We wanted to note a few points regarding novelty:\n1. Prior work demonstrates that models have learnt some concept of truthfulness but none of these works gives even potential mechanisms of models learning truthfulness. We present the “persona” hypothesis, and show evidence for how LLMs can model truthfulness via modeling personas.\n2. The fact that LLMs learn truthfulness is surprising and begs the question of where the capability comes from. It’s not consistent with the classic view of LMs (which many people in the community may hold), which suggests that the model should generate true/false answers according to their frequency in the data but not necessarily encode truthfulness and falsehood (which has no explicit label in the data). It is also surprising from the supervised learning perspective that models generalize truthfulness from one topic to another without knowledge transfer. This work fills the gap by providing an explanation.\n3. Even though the connection might seem obvious to some people, we still think there is value in more concretely demonstrating it. Particularly, our synthetic experiments allow us to create a counterfactual scenario (what if there was no truthful persona in the data) where we demonstrate that we do not see the probing and finetuning observations as on real LLMs — a stronger evidence for the persona hypothesis.\n\t\n> Could you provide other metrics, like accuracy, which is more widely adopted in probing literature?\n\nThe training data is balanced 50/50 but the test set is imbalanced — it has a lot more examples where the model is untruthful than it is truthful (this is just generally true for LLaMa which only gets about 35-40% truthful on truthfulQA). This is why we reported the F1 score weighted by class size. The random guessing baseline is not 50% F1 score but < 50% F1 (~46% F1 score) in this case. Based on your suggestion, we also compute accuracy which we find to be very similar to F1 because of the balanced training data. We included this figure in Appendix B (figure 8)."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5147/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700263978271,
                "cdate": 1700263978271,
                "tmdate": 1700263978271,
                "mdate": 1700263978271,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "ZecS7S7kn7",
            "forum": "rKMQhP6iAv",
            "replyto": "rKMQhP6iAv",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission5147/Reviewer_8UZU"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission5147/Reviewer_8UZU"
            ],
            "content": {
                "summary": {
                    "value": "This paper explores how large language models (LLMs) can distinguish\ntruth from falsehood despite noisy data. It introduces the Persona\nHypothesis, suggesting that LLMs can cluster agents into personas with\ndifferent truthfulness levels. By modeling a truthful persona, LLMs\ncan generate truthful text. The paper presents evidence, such as the\nability to predict truthfulness from question embeddings and the\nimpact of fine-tuning on unrelated topics. It also shows a connection\nbetween personas and model truthfulness through a synthetic arithmetic\nenvironment. In summary, the study highlights the role of personas in\nLLMs' ability to separate truth from falsehood and generalize truthful\nbehavior."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "1 poor"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "One notable strength of this paper is its exploration of the \"persona\nhypothesis\" in understanding how Large Language Models (LLMs)\ndistinguish truth from falsehood. By proposing and providing evidence\nfor the concept of personas within LLMs, the paper sheds light on the\nmodels' ability to learn and generalize truthfulness in a data-driven\ncontext. The experiments demonstrate that LLMs can infer truthful\npersonas from context and use them to improve truthfulness in their\nresponses, even on unrelated topics. This persona-based approach\noffers a novel perspective on how LLMs navigate the complex landscape\nof information, contributing to our understanding of their mechanisms\nfor separating true and false statements."
                },
                "weaknesses": {
                    "value": "Weaknesses of this paper include:\n\n- Reliance on appendices for crucial information, making it\n  challenging for readers to fully understand the content without\n  referring to these additional sections.\n\n- Lack of a clear explanation for the trustworthiness of experiments\n  using synthetic data. The reliance on appendices may create doubts\n  about the robustness of the synthetic data experiments.\n\n- Insufficient comparison with other methods and a lack of an ablation\n  study. The paper primarily evaluates the proposed method without\n  exploring how different elements affect its effectiveness. This\n  limits the generalizability of the findings and misses potential\n  fields where trustworthiness measurement could apply.\n\n- The paper is hypothesis-driven and lacks concrete results. To\n  strengthen its arguments, it should conduct comparative experiments\n  with relevant existing methods, accumulating results and insights.\n\n- Poor readability, with terms like \"control answer\" left undefined,\n  making it challenging for readers to grasp key concepts.\n\n- Lack of Data Generalization: The paper's experimental results lack\n  discussions on how applicable the proposed method is to general\n  datasets or tasks. Insights into the generalization capabilities of\n  the proposed method are needed."
                },
                "questions": {
                    "value": "Given the lack of comparison with other methods and the absence of an\nablation study, could the authors explain the rationale behind this\nchoice? How might conducting such comparisons enhance the paper's\ncontributions and generalizability?\n\nSince the paper is hypothesis-driven and lacks concrete results, are\nthere plans to conduct comparative experiments with existing methods\nto accumulate results and provide stronger evidence for the proposed\nhypothesis?\n\nCould the authors provide definitions or explanations for terms like\n\"control answer\" to improve the paper's readability and help readers\nunderstand key concepts?\n\nThe description of the results in Table 1 is somewhat unclear,\nparticularly regarding the intersection of TruthfulQA and TriviaQA, or\nTruthfulQA and MS MARCO. It is not explicitly stated whether\nfine-tuning on TriviaQA or MS MARCO after FT on TruthfulQA did not\nresult in improved accuracy. The reason for this lack of improvement\nseems to be that TriviaQA and MS MARCO are not datasets directly\nrelated to truthfulness. However, the text does not clearly convey\nthis point."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission5147/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission5147/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission5147/Reviewer_8UZU"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission5147/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698541953782,
            "cdate": 1698541953782,
            "tmdate": 1699636508634,
            "mdate": 1699636508634,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "S9cPRwOqic",
                "forum": "rKMQhP6iAv",
                "replyto": "ZecS7S7kn7",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5147/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5147/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer 8UZU"
                    },
                    "comment": {
                        "value": "Thank you for your time and the constructive feedback! We address some of the concerns here and some general comments in the ‘general response’:\n\n> Reliance on appendices for crucial information\n\nFor the LLM experiments (section 2), we give all the essential information such as experimental setup and evaluation criteria in the main paper — we only included the exact prompts and the hyperparameter details in the appendix. For the synthetic experiments, we did not include the exact definition of the operators in the main paper (Appendix D.1 and D.2) since the important part we wanted to convey here was the _behavior_ of the agents, e.g. when they are truthful. Let us know if something among these was crucial and you find it helpful to include in the main paper instead of appendix! We are happy to address it.\n\n> Reliance on appendices may create doubts about the robustness of the synthetic data experiments.\n\nAs mentioned before, we only included the exact definition of the operators in the appendix, we believe our main findings do not depend on these. Additionally, for all experiments here (sec 3.1 and sec 3.2) we show the variance of results across different semantics of the operators — this further reduces the reliance on what the exact definition of each operator is. Please, let us know which details could be included in the main text to improve the trustworthiness of the results.\n\n> Insufficient comparison with other methods and a lack of an ablation study.\n\nFirstly, we want to clarify that we did not propose any new method but rather proposed a new hypothesis to explain how LLMs could model truthfulness. All our experiments are to show evidence for this hypothesis. We also did ablations for probing to understand how performance varies across layers and across different prompt tokens (Appendix B), and the synthetic setup (setting with no truthful persona in Figure 4 and Figure 5). If there is some other ablation you would like to see, we are happy to include it!\n\n> The paper is hypothesis-driven and lacks comparative experiments with existing methods.\n\nIndeed the paper is hypothesis driven! Our goal here is to better understand how LLMs can learn abstract concepts like truthfulness rather than to propose new methods. As such, we are not sure which relevant existing methods it would be useful to compare to, since we do not propose a new method but rather a hypothesis of how LLMs can model truthfulness. But again we are happy to include if you had something specific in mind!\n\n> Lack of generalization experiments\n\nWe do show for some experiments that our findings generalize to an unseen dataset (BigBench misconceptions). We also conducted experiments to make sure that the model is not relying on specific TruthfulQA artifacts (e.g. by having held-out categories). We use all data sources available, to the best of our knowledge, and ablate them for  generalization experiments.\n\n> Better explain the the intersection of TruthfulQA and TriviaQA, or TruthfulQA and MS MARCO.\n\nThanks for raising this point. We already include these comparisons in the current paper, but we will clarify in our revised version. We use TriviaQA and MS Marco to make sure that the results we obtain by finetuning on truthfulQA are not due to the model simply getting better at question-answering. We chose these datasets since the model can still learn general question-answering abilities from them, but these questions do not have common untruthful answers in the (pretraining) data (i.e. they will not provide training signal for truthfulness). Thus, the model could improve its QA abilities but not update its representations of personas. Ablating this shows that finetuning on truthfulQA is successful by eliciting the truthful persona rather than learning general QA abilities."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5147/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700263572100,
                "cdate": 1700263572100,
                "tmdate": 1700263572100,
                "mdate": 1700263572100,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "KUFnC1YUcf",
            "forum": "rKMQhP6iAv",
            "replyto": "rKMQhP6iAv",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission5147/Reviewer_7HFY"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission5147/Reviewer_7HFY"
            ],
            "content": {
                "summary": {
                    "value": "To verify whether LLM is able to distinguish truth from falsehood in the training data, this paper proposed a personas hypothesis to analyze the model capability. They conducted plenty of experiments to demonstrate that LLM can make full use of truthfulness data source to generalize truthfulness. Meanwhile, finetuning operation on truthfulness data will improve the model performance and model generalizations to unseen topics and domains. Finally, this paper conducted a detailed analysis about their observations and the limitations of their work."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1.\tThis paper proposed a novel personas hypothesis to verify the LLM capability of distinguish truth and falsehood from contradicting training data, which is very interesting. \n2.\tThis paper conducted various experiments to prove the reasonableness of the proposed hypothesis. \n3.\tThis paper provided a detailed analysis about their work and corresponding limitations."
                },
                "weaknesses": {
                    "value": "1.\tThe motivation of this paper should be further clarified. The truth and the falsehood in training data of LLMs should be given formal and clear definitions. Is it only those ideas or theories that conform to human intuition or are in the minority that can be called truths? Unclear definitions of truth make this paper not so convincing. \n2.\tThe authors only leveraged additional model to classify the results generated by LLMs to prove whether LLM learns the truth or not. This strategy is not so convincing. More evaluation strategies should be considered, such as causal inference."
                },
                "questions": {
                    "value": "Please refer to the weakness. I am looking forward to the responses from authors. If the responses can convince me, I will change my score."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission5147/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698716277008,
            "cdate": 1698716277008,
            "tmdate": 1699636508528,
            "mdate": 1699636508528,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "pQLglwJqs8",
                "forum": "rKMQhP6iAv",
                "replyto": "KUFnC1YUcf",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5147/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5147/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer 7HFY"
                    },
                    "comment": {
                        "value": "Thank you for your time to review our paper and to give constructive feedback. We also suggest you go through our general response first since it clarifies our terminology and addresses general issues different reviewers mention.\n\n> The truth and the falsehood in training data of LLMs should be given formal and clear definitions. \n\nThanks for bringing this up. We have clarified in the general response what we mean by truthful and untruthful text. Specifically, truthful text contains factually correct information —- our focus is on factual questions where there is a widely agreed upon answer (e.g. experts would agree). Untruthful text contains incorrect (i.e. not grounded in evidence) but plausible answers — these are answers which are supported by misinformation in the pretraining data. As an example (from the updated Figure 1), \"covid vaccines are ... extremely safe\" is truthful text, whereas the text “...millions die from covid injections” is untruthful since it is incorrect but is probably seen in the pretraining data since it is a misconception generated by a source (\"Before It's News\" in this case). \n\n> The authors only leveraged additional model to classify the results, more evaluation strategies should be considered.\n\nWe interpreted this comment in two ways:\n\n(a) ‘additional model’ refers to the probe used to classify true vs false statements; We use probing to predict if the generation will be truthful only from the representation of the question. This means that we can linearly separate truthful and untruthful text generated from different agents — evidence which is consistent with our hypothesis. Probing is an established empirical method to evaluate the presence of representations in the latent space of a model. \n\n(b) ‘additional model’ refers to using GPT-judge as the evaluator of truthfulness. We want to note here that in addition to using GPT-judge (model to evaluate truthfulness), we also do human evaluation for both the datasets (truthfulQA and BigBench-misconceptions) in Sec 2.2. Additionally, we note that there is a strong correlation between both forms of evaluation (model based and human) — both as observed in our work and as reported in previous work (e.g. Lin et al 2021)."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5147/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700263308392,
                "cdate": 1700263308392,
                "tmdate": 1700514759436,
                "mdate": 1700514759436,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "vuIPULFaC6",
            "forum": "rKMQhP6iAv",
            "replyto": "rKMQhP6iAv",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission5147/Reviewer_CCLc"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission5147/Reviewer_CCLc"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes a hypothesis to explain why it is possible for LLMs to generate truthful answers given very little training data and how training on truthful examples can help generalize truthful behaviors on unrelated topics.\n\nThe hypothesis itself unfortunately is still slightly vague, and one of the main experiments (Section 3) does not represent the reality. If the authors can very clearly explain what their hypothesis is, what a persona is, and discuss how their empirical finding can improve training LLMs to be more truthful, my decision can be changed."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "This is a very interesting empirical paper that's well organized. \n- Important topic -- trying to understand why LLMs are truthful or untruthful has strong societal implications.\n- The hypotheses are clearly proposed, and evidence is laid out.\n- Well-written and well-organized"
                },
                "weaknesses": {
                    "value": "The paper has a few confusing aspects to me.\n\n1. First of all, the terminology \"persona\" -- my thinking around persona has been mostly influenced by Social Simulacra [1], using constructed persona profiles as prompts for LLMs and controlling what the LLMs generate. At first, I thought the paper was discussing persona in the same way, but from the experiment and even from Figure 1, it is hard to tell what is the \"truthful\" or \"untruthful\" persona the paper is referring to. Can the authors explain by persona, do they mean a concrete part of the LLM (i.e., a prompt or an embedding at a particular token position?) To alleviate confusion, maybe choose a slightly different wording?\n\n2. The paper cited Jacob Andrea's LLMs as Agent Models. The hypothesis says, \"There exists a group of agents who are more truthful than others,\" and suggests that \"By modeling this truthful persona, language models can.\" Does this suggest that LLMs model persona and each persona is an agent? The hypothesis does not make enough sense to me. Where is this group of agents? Is it implicitly defined by LLMs' weights? Is it defined by the prompt (hypothesis seems to suggest \"Wikipedia and Science\" to be personas/agents)? The paper would be hugely improved if authors could clearly define what they mean by agent and by persona. \n\n3. Section 3, the two setups -- the most significant difference is the first setup, two agents are FULLY truthful, and two agents are FULLY dishonest. The other setup is partially truthful. I don't think this setup proves the hypothesis -- A lot of untruthful information, or if we think about conspiracy stories, often have a shroud of truth in the story and then mix them with lies. This truthful persona setup (that supports your hypothesis) is not close to reality -- but please feel free to showcase why you think it's closer to the actual training data of LLMs. \n\n4. Would it be more interesting if the authors could extract these personas and visualize them? Or show how fine-tuning or ICL can actually force LLMs always to adopt a truthful persona. I guess this requires the authors to define what a persona is, but it's very unclear what they mean from this paper.\n\n[1] Park, Joon Sung, et al. \"Social simulacra: Creating populated prototypes for social computing systems.\" Proceedings of the 35th Annual ACM Symposium on User Interface Software and Technology. 2022."
                },
                "questions": {
                    "value": "See weakness section"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission5147/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698828092150,
            "cdate": 1698828092150,
            "tmdate": 1699636508427,
            "mdate": 1699636508427,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "HoUcWwitLU",
                "forum": "rKMQhP6iAv",
                "replyto": "vuIPULFaC6",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5147/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5147/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer CCLc"
                    },
                    "comment": {
                        "value": "Thank you for your time to review our paper and constructive feedback! We suggest you go through our general response first since it clarifies our terminology and addresses general issues different reviewers mentioned.\n\n> First of all, the terminology \"persona\" -- my thinking around persona has been mostly influenced by Social Simulacra [1], using constructed persona profiles as prompts for LLMs and controlling what the LLMs generate. \n\nIn our general response, we have motivated the choice of the terms in the paper. We chose the terms ‘agent’ to be consistent with the work we build on (Andreas et al), and ‘personas’ as a natural extension of the term.\n\n> from Figure 1, it is hard to tell what is the \"truthful\" or \"untruthful\" persona the paper is referring to.\n\nWe have updated Figure 1 to reflect what is a \"truthful\" or \"untruthful\" persona --- it refers to a latent variable corresponding to a cluster of agents (left part of figure), which the model can use at inference time to generalize truthfully or untruthfully (right side of the figure).\n\nAnother way to understand “persona” is that truthful text shares some common features — we didn’t want to call it `features’ because it can imply that these common properties are local (e.g. using specific words), whereas they could be more abstract properties. More generally, our hypothesis is that agents which are truthful (e.g. Wikipedia, Science journal etc.) tend to form a cluster due to common properties like consistency, providing evidence etc. — we refer to this cluster of truthful agents as the truthful persona.  \n\n> The paper would be hugely improved if authors could clearly define what they mean by agent and by persona. \n\nWe have addressed this in our general response and will clarify in a revised version of the paper.\n\n> LLMs model persona and each persona is an agent?\n\nWe elaborate on this in our general response. The short answer is that each persona is not an agent; a persona is a group of agents that share common properties like truthfulness. Both agent and persona are used to explain the data generating process.\n\n> Where are the personas defined in the models?\n\nIt is important to highlight that agents and personas are constructs to model the data generating process (i.e. latent variables), and they do not necessarily correspond to physical entities. However, we find evidence that these constructs are useful to explain model behavior. We use our probing results to show that we can decode a “truthful persona” from the latent activations of the model, which suggests the model encodes this information in its hidden states.\n\n> The synthetic setup is not close to reality \n\nWe want to clarify a potential misunderstanding in the Sec 3.1 setting. In the first setup, when the two agents (C and D) are fully dishonest, we mean that the probability that the agents are truthful on each operator is small (< 0.2 — sec 3 dataset generation & appendix D.1). Therefore the agents are not always untruthful but they do have a small probability of being truthful. Similarly agents A and B are not fully truthful, but have a small probability of generating an untruthful answer. We think this is a realistic setup, where there is no one source which is 100% truthful or 100% untruthful —- but some sources are much more likely to be truthful and trustworthy (e.g. Wikipedia would have a high probability of being truthful ; Similarly an author who believes in a conspiracy would mostly write untruthful statements to support the conspiracy but that will be mixed in with some amount of truthful information).\n\n> Would it be more interesting if the authors could extract these personas or show how fine-tuning or ICL can actually force LLMs to always adopt a truthful persona\n\nIn our experiments (sec 2.1) we extract these personas by training linear probes to distinguish between true and false statements based on hidden states from the model. This is evidence consistent with our hypothesis that LLMs infer persona from context and represent it in the hidden states, which the probe can rely on, i.e. the probe is extracting the persona. However, we do not have interpretable features that represent the persona.\nAlso, we show that both finetuning and ICL steer the model to adopt the truthful persona (sec 2.2)."
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5147/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700263168202,
                "cdate": 1700263168202,
                "tmdate": 1700514464149,
                "mdate": 1700514464149,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]