[
    {
        "title": "Feature Normalization Prevents Collapse of Non-contrastive Learning Dynamics"
    },
    {
        "review": {
            "id": "S6eHBBvPnh",
            "forum": "RlfD5cE1ep",
            "replyto": "RlfD5cE1ep",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission3290/Reviewer_JjF9"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission3290/Reviewer_JjF9"
            ],
            "content": {
                "summary": {
                    "value": "This paper represents an extension of prior work in the field of Self-Supervised Learning (SSL) theory, with a specific emphasis on elucidating how non-contrastive SSL methods prevent the issue of feature collapse. The paper's primary focus centers on the examination of the final feature normalization step and its role in the underlying dynamics. The authors furnish compelling evidence concerning the dynamics of the underlying eigenmodes, and the theory finds support through numerical simulations."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "1. This paper addresses an important and relatively underexplored issue regarding the role of feature normalization in non-contrastive Self-Supervised Learning (SSL). The authors demonstrate that the normalization step introduces sixth-order dynamics, resulting in the dynamic emergence of a stable equilibrium, even when dealing with initially collapsed solutions.\n\n2. The authors present compelling evidence, and their underlying assumptions appear to be quite reasonable.\n\n3. Numerical simulations validate the predictions made by the theory."
                },
                "weaknesses": {
                    "value": "I would anticipate the theoretical framework to align with the behavior observed in real datasets. However, the paper does not investigate the dynamics in more complex scenarios."
                },
                "questions": {
                    "value": "The authors mentioend BarlowTwins and VICReg. They effectively are still contrastive. How do you think their 'feature normalization' behavior is related?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission3290/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698527185182,
            "cdate": 1698527185182,
            "tmdate": 1699636277922,
            "mdate": 1699636277922,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "lKCL4dpy95",
                "forum": "RlfD5cE1ep",
                "replyto": "S6eHBBvPnh",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3290/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3290/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response"
                    },
                    "comment": {
                        "value": "We are glad to see the reviewer acknowledges our contributions positively. Our responses to your concerns and questions are as follows:\n\n**More complex scenarios:** Thank you for the suggestion. In the newly added Appendix D.2, we provide the similar experiments to the synthetic case with the ResNet-18 encoder. Overall, we can see a similar trend, and moreover, the regime transition can be observed as well (with properly chosen parameters).\n\n**Barlow Twins and VICReg:** Compared to the conventional contrastive learning pushing anchors away from negative examples, Barlow Twins and VICReg are still different because their variance regularizer is to regularize the _dimension-wise_ variance, not _sample-wise_. Thus, their underlying mechanism to avoid the collapse is still an interesting problem to study, particularly under the presence of feature normalization, which has not been dealt with."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3290/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700395475852,
                "cdate": 1700395475852,
                "tmdate": 1700395475852,
                "mdate": 1700395475852,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "PPYkDUknaW",
            "forum": "RlfD5cE1ep",
            "replyto": "RlfD5cE1ep",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission3290/Reviewer_HYk4"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission3290/Reviewer_HYk4"
            ],
            "content": {
                "summary": {
                    "value": "This paper follows the previous setting in Tian et al. (2021) which explores simplified modeling for non-contrastive learning. It posits the representation model as an identity function, with both the projection layer and prediction layer streamlined into linear components. What distinguishes this study from its predecessors is the exploration of the commonly used cosine loss in practical applications. By applying these simplifications and introducing additional assumptions, the authors demonstrate that the norms tend to concentrate around some constants, which helps to simplify the learning dynamics with feature normalization. With further assumptions, the paper disentangles the learning dynamics into the sixth-order eigenmode dynamics in which a stable equilibrium emerges even if there is no stable equilibrium with the initial parametrization and regularization strength."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "- The paper is well-written and easy to follow.\n- This work proves that the feature norm concentrates around a constant with proper parameter initialization."
                },
                "weaknesses": {
                    "value": "1. Some of the assumptions are quite stringent, especially since this paper is not pioneering work, and they may not provide much reference value for practical non-contrastive learning with negative pairs. \n2. Assumptions 2 and 3 in section 4 are rather strict. Assumption 2 requires that the input data follow an isotropic Gaussian distribution, which is hard to accept in practical situations. Perhaps a mixture of isotropic Gaussians could be considered. Assumption 3 pertains to the width-infinite limit.\n3. In section 5, the authors consider the norms of these linear layers as constants (Assumption 5). This assumption, however, is still far from providing a real dynamic analysis for the cosine loss. Since feature normalization may not guarantee convexity, smoothness, and Lipschitzness, its dynamic analysis should focus on proving the convergence rather than simplifying its complexity to obtain closed-formed dynamics. The existing conclusions do not provide much contribution and insight to understanding non-contrastive learning dynamics.\n4. The relevant numerical results still do not fully validate the reasonableness of these assumptions, such as the increasing error between $W$ and $W^\\top$, and the decrease in $N_{\\phi}$ and $N_{\\psi}$. Therefore, while I appreciate the authors for using Hanson-Wright inequality to demonstrate that some norms concentrate, it is still not particularly remarkable."
                },
                "questions": {
                    "value": "Please see weakness"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission3290/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698545627406,
            "cdate": 1698545627406,
            "tmdate": 1699636277852,
            "mdate": 1699636277852,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "ZDEsg0kN7S",
                "forum": "RlfD5cE1ep",
                "replyto": "PPYkDUknaW",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3290/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3290/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response"
                    },
                    "comment": {
                        "value": "Thank you for carefully reviewing our manuscript. Let us discuss your concerns about the assumptions. We hope the discussion sounds reasonable and supports our contribution further.\n\n**Assumption of the width-infinite limit:** This assumption is relevant to the norm concentration, which is essentially the central limit theorem. Numerically, the concentration can be established with the order of 100 dimensions; this is not unrealistic limit, unlike some generalization analysis of neural nets requiring exponentially more dimensions than samples.\n\n**Assumption on the norm constancy:** This assumption is only relevant to disentangle the matrix dynamics (4) into the eigenmode dynamics (6). We do not need the norm constancy globally (for all time $t$) if we are concerned about this disentanglement at each fixed time. Globally, the norm values may of course change; however, the shapes of dynamics at each time shown in Figures 2 and 3 remain qualitatively the same.\n\n**General:** Dynamics analysis generally requires strong assumptions such as (isotropic) Gaussian distributions and linear-algebraic assumptions—they are often stronger than practical scenarios. However, this does not mean that these analyses are pointless; as long as they can serve as proxies to some real scenarios. How about our analysis? Isotropic Gaussian—yes, it is quite strong, yet we can establish the regime transition and go beyond the L2-loss analysis (that fails with excessively strong regularization) at least in this specific scenario. The symmetry assumption of $W$ as well: as our simulation actually observes the eigenmodes converge to the stable interval, this can be seen as corroborating evidence that our model behaves as a reasonable proxy. Everyone anticipates the extension to general setups, but not all assumptions can be lifted all at once—our scientific journey is a continuous step to build a better model little by little. To this end, our work contribute to taking feature normalization into account and relating it to complete collapse in a synthetic setup first."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3290/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700395453244,
                "cdate": 1700395453244,
                "tmdate": 1700395453244,
                "mdate": 1700395453244,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "spYBTlRAhR",
                "forum": "RlfD5cE1ep",
                "replyto": "ZDEsg0kN7S",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3290/Reviewer_HYk4"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3290/Reviewer_HYk4"
                ],
                "content": {
                    "comment": {
                        "value": "I appreciate the authors for responding. However, the provided responses did not sufficiently address my concerns, specifically, the mentioned assumptions do not effectively support the core of the paper, \"Feature Normalization Prevents Collapse of Non-contrastive Learning Dynamics.\" Consequently, I will maintain my original score."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3290/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700723696373,
                "cdate": 1700723696373,
                "tmdate": 1700723696373,
                "mdate": 1700723696373,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "6SiFd9j2RW",
                "forum": "RlfD5cE1ep",
                "replyto": "nHUIzfjQWD",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3290/Reviewer_HYk4"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3290/Reviewer_HYk4"
                ],
                "content": {
                    "title": {
                        "value": "Thank you!"
                    },
                    "comment": {
                        "value": "I do not harbor doubts regarding the step-by-step lifting of assumptions in the paper. However, my concern lies in the oversimplified nature of the assumptions used, particularly assumption 5. This particular assumption appears to disconnect the entire paper from the practicalities of feature normalization."
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3290/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700728836799,
                "cdate": 1700728836799,
                "tmdate": 1700728836799,
                "mdate": 1700728836799,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "H47Qh9SzZJ",
            "forum": "RlfD5cE1ep",
            "replyto": "RlfD5cE1ep",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission3290/Reviewer_sECc"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission3290/Reviewer_sECc"
            ],
            "content": {
                "summary": {
                    "value": "This article proposes an extension of the theory of non-contrastive learning (BYOL, SimSiam) to consider the cosine loss rather than the L2 loss, showing how feature normalization changes from third-order dynamics to sixth-order. \nThey show that three regimes exist depending on the norms of the layers, which results in a shift between the three regimes as the norms decrease until the stable regime, where the eigenmodes converge."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "This article presents an improvement other than the theoretical framework of non-contrastive learning using solely the Euclidian loss.\nThe paper is well-written and easy to follow. The assumptions taken are relatively well justified and allow for an interesting analysis."
                },
                "weaknesses": {
                    "value": "**Previous literature** There have been recent contributions to the literature of non-contrastive learning which do take into account the cosine loss, and which are not referenced in this article. In particular, Halvagal et al., Implicit variance regularization in non-contrastive SSL, 2023. The eigenmode dynamics seem extremely similar (after some changes in the notation) and it seems extremely important to me that the authors compare themselves to this article. The authors also do not seem to have a similar conclusion on the implicit variance regularization that Halvagal et al. focus on.\n\n**Regimes** The three regimes found in Section 5.2. seem to have been found solely by categorizing the regimes experimentally shown in Figure 2 while reading, which seems like a weak justification for those regimes. A clearer analysis of the equilibrium points at least in the Appendix seems necessary. \n\nThe authors claim that as the norms decrease, the regimes fall to the stable one. However, in the stable regime, the norms will increase as the eigenmodes increase to the saddle point $p^+$. Is there a risk of the acute and stable regimes alternating between each other? \n\n**Experiments** Numerical experiments on the SimSiam model remain on linear networks in Section 5.4. A similar Figure to Figure 6 for a real network such as ResNet (maybe only focusing on the linear projection head) would help confirm the theoretical findings in the linear case. Otherwise, the link with a real SimSiam network remains relatively limited, except for the weight decay argument.\n\n**Figure 6c** I also find Figure 6.c. hard to read. Are the intervals the theoretical intervals using the values of the norms? In this case, what is the theoretical value of the saddle point? Having the values of a single eigenmode gives very little information on the values of the spectrum of $W$. Do all the values stay relatively constant like here?"
                },
                "questions": {
                    "value": "The notion of Thermodynamic limit is novel to me in optimization and needs to be further explained. How is it different from the Neural Tangent Kernel regime, is it the constant ratio $\\alpha$?\n\nDo the authors have more intuition on the role of the exponential moving average in BYOL with their new findings?\n\nSmall remarks:\n* Intro: \"Folklore says\" is a somewhat strange way to quote an article.\n* Sec 4. Assumption 2. $Σ = I $ seems superfluous to add after $D = N(0, I)$.\n* After Lemma 3: $\\Phi x'$ is not defined. \n* Equation (5): $\\hat H$ is not defined.\n* After Equation (9): \"unite learning rate\""
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission3290/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission3290/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission3290/Reviewer_sECc"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission3290/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698685812354,
            "cdate": 1698685812354,
            "tmdate": 1700737509597,
            "mdate": 1700737509597,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "n45afWVKxE",
                "forum": "RlfD5cE1ep",
                "replyto": "H47Qh9SzZJ",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3290/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3290/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response"
                    },
                    "comment": {
                        "value": "We are grateful for carefully reviewing our manuscript and providing extremely insightful comments. Please see our response below. Typos have been addressed already.\n\n**Previous literature:** A good catch! It’s a shame that we had been aware of Halvagal et al. (2023) only one week after the submission… They have successfully established the mechanism of the implicit variance regularization of the eigenvalues, which would not be elicitable from our analysis because we assume the standard normal input, regrettably. By contrast, their implicit regularization holds _only for non-collapsed eigenvalues ($\\\\lambda_k > 0$)_, as seen in their Eq. (11). Thus, they do not explain how the complete collapse ($\\\\lambda_k = 0$ for all $k=0$) is avoided; our work contributes to this end. The clarification has been added in the updated draft.\n\n**Regimes:** Based on your suggestion, we attempted to give a slightly more formal derivation of the regimes in newly added Appendix C, though $p\\_j$-dynamics is sixth-order and cannot be solved analytically in general.\n\nRegarding the Acute and Stable regimes, we will not have alternation of them numerically because the Stable regime is conceptual and cannot be attained exactly; the unstable interval (gray in Figure 3) could be arbitrarily small as the norms decrease, but will not completely disappear.\n\n**Experiments:**  Thank you for the suggestion. In the newly added Appendix D.2, we provide the similar experiments to the synthetic case with the ResNet-18 encoder. Overall, we can see a similar trend, and moreover, the regime transition can be observed as well (with properly chosen parameters).\n\n**Figure 6c:** We improved the visualization by adding smoothing along the time axis and added a description to explain how the regime intervals are calculated: they are calculated theoretically by using the $p\\_j$-dynamics (8), but solving the sixth-order equation by numerical root finding. In addition, we expanded the analysis in newly added Appendix D.1 to see not only the largest but also the other eigenvalues. Those eigenvalues converging to non-zero values tend to be in the stable (blue) interval, and all the other converges to zero. More discussion can be found there.\n\n**Thermodynamic limit:** It is relevant to the NTK regime, but the proportional limit with ratio $\\\\alpha$ is important. Such a proportional limit has been often used to study the generalization error under the double descent (for controlling random matrices). For example, Pennington & Worah (2017) “Nonlinear random matrix theory for deep learning” leverages it.\n\n**Findings about EMA:** The most general analysis of non-contrastive learning with the exponential moving average is challenging, so Tian et al. (2021) chose to approximate it by the _proportional EMA_ (their Assumption 1): representing the target representation net by $\\\\Phi_a(t) = \\tau(t) \\\\Phi(t)$. While we can do the same analysis with our setup, the proportional ratio $\\\\tau$ is eventually cancelled out due to the feature normalization."
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3290/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700395433055,
                "cdate": 1700395433055,
                "tmdate": 1700395433055,
                "mdate": 1700395433055,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "z8Fe7Penr6",
                "forum": "RlfD5cE1ep",
                "replyto": "H47Qh9SzZJ",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3290/Reviewer_sECc"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3290/Reviewer_sECc"
                ],
                "content": {
                    "comment": {
                        "value": "We thank the authors for their detailed response.\n\n**Previous literature** Indeed, the complete collapse seems possible in their work, which this submission tackles. I may be mistaken but I do not see why the implicit variance regularization is not applicable to this work, since it is due to the $\\lambda_m$ term in Eq. 9 of in Halvagal et al., which seems to correspond to the $p_j^2$ term in Eq. 9 in the authors' work, and is not particularly related to the assumption on the input? This may be a misunderstanding of the two works on my part. In any case, I mainly think that the comparison should be discussed in the final version.\n\n**Regimes** Thank you for the clarifications. These points should be made clearer in the final version.\n\n**Experiments / Fig 6c** The description added improves the readability of the Figure. The experiments on the ResNet-18 help ground the results in a more realistic setting. However, the claim that the norms remain stable becomes hard to maintain. Similarly, the curve of asymmetry of $W$ is quite surprising, but is less important for the results. (Small mistake: 'W becomes relatively asymmetry\")\n\n**Thermodynamic limit** Thank you for the clarification. The term in itself was a novelty for me, and should maybe be cited from a source using it similarly, such as Pacelli et al., A statistical mechanics framework for Bayesian deep neural networks beyond the infinite-width limit.\n\nThe authors have answered some of my concerns and improved their article with some additional experiments and clarifications. Thus, I'm increasing my rating from a 6 to a 8."
                    }
                },
                "number": 8,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3290/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700735987583,
                "cdate": 1700735987583,
                "tmdate": 1700737542594,
                "mdate": 1700737542594,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "E4RTwnpHrB",
            "forum": "RlfD5cE1ep",
            "replyto": "RlfD5cE1ep",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission3290/Reviewer_ZH8r"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission3290/Reviewer_ZH8r"
            ],
            "content": {
                "summary": {
                    "value": "This paper studies the dynamics of non-contrastive self-supervised learning (e.g. BYOL, SimSiam etc.) and shows how feature normalization can play a role in preventing the collapse of all representations to a single point. By studying this in the infinite dimensional limit, the paper shows, that with the cosine loss, the training dynamics are different from that with L2 loss."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. The technical analysis appears rigorous and reasonably clear to follow."
                },
                "weaknesses": {
                    "value": "1. Considering the majority of the analysis assumes norms of all features are nearly same, due to the high dimensional limit, I do not see how this analysis can show the effects of feature normalization on non-contrastive learning. \n\n2. Moreover, the notions of \"6-th order dynamics\"and \"3rd order dynamics\" are not sufficiently explained in the paper. \n\n3. Most importantly, I'm not convinced this an interesting problem to study in the context of prior work providing key understanding regarding how non-contrastive SSL training dynamics work."
                },
                "questions": {
                    "value": "1. Considering the majority of the analysis assumes norms of all features are nearly same, due to the high dimensional limit, I do not see how this analysis can show the effects of feature normalization on non-contrastive learning. Can the authors explain why they believe this analysis is showing anything meaningful about feature normalization. \n\n2. Practically, are there any differences in the conclusions of the training dynamics of the cosine loss and the L2 loss? (while they may be of \"different orders\")."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission3290/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698818723337,
            "cdate": 1698818723337,
            "tmdate": 1699636277658,
            "mdate": 1699636277658,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "pMc3fH2efo",
                "forum": "RlfD5cE1ep",
                "replyto": "E4RTwnpHrB",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3290/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3290/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response"
                    },
                    "comment": {
                        "value": "Thank you for raising important questions to our work! We address them subsequently. We appreciate it if you could rethink the evaluation of our work based on the updates.\n\n**Assumption on the norm constancy:** This assumption is only relevant to disentangle the matrix dynamics (4) into the eigenmode dynamics (6). We do not need the norm constancy globally (for all time $t$) if we are concerned about this disentanglement at each fixed time. Globally, the norm values may of course change; however, the shapes of dynamics at each time shown in Figures 2 and 3 remain qualitatively the same.\n\n**Importance of the problem studied here:** Many recent studies have started to theoretically investigate non-contrastive learning and its implicit bias from the perspective of the L2 loss, which may represent different behaviors from the cosine loss as we show in this work. To elicit more useful insights in the future, we believe that our work can definitely contribute to driving the community into focusing on the cosine loss and providing a cornerstone for the analysis.\n\n**6th order vs. 3rd order dynamics:** As can be seen in the dynamics (8) and (9), they are 6th- and 3rd-order formula in $p\\_j$, respectively, which are called the dynamics with respective orders. One of the practical differences is admissible hyperparameter ranges; for example, while regularization (weight decay) cannot be too large for the L2 loss, it is possible for the cosine loss, as confirmed in our pilot study (Figure 1)."
                    }
                },
                "number": 1,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3290/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700395402433,
                "cdate": 1700395402433,
                "tmdate": 1700395402433,
                "mdate": 1700395402433,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]