[
    {
        "title": "COMPARATOR: Reference-free machine translation evaluation by inter-system comparison"
    },
    {
        "review": {
            "id": "xKPhoTUwFs",
            "forum": "Rry1SeSOQL",
            "replyto": "Rry1SeSOQL",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission8378/Reviewer_2G4a"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission8378/Reviewer_2G4a"
            ],
            "content": {
                "summary": {
                    "value": "This work proposes Comparator, a reference-free MT evaluator that treats the evaluation as a inter-system comparison problem. The model consists of a pre-trained encoder that accepts the concatenation of the source sequence and a pair of translations to compare and a comparator head that pools the output embeddings and produces a binary decision on which translation is better. The model is trained in three stages: XNLI pre-training (preferring entailment over non-entailment), human/machine translation discriminating (preferring human translation over machine translations) and weakly-supervised tuning (pairs of translations judged by BertScore and synthetic data by perturbation). The proposed model is evaluated on various MT eval datasets and the results show its effectiveness and benefits even over supervised baselines."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "- The proposed method is straight-forward and shows good performance over a range of datasets.\n- Some of the indirect and weakly supervised training method is interesting and might be inspiring for future study of MT evaluation."
                },
                "weaknesses": {
                    "value": "- I’m wondering if the comparison is fare for other systems since the proposed model is trained with multiple external resources such as XNLI and especially some data with parallel sentences, and is based on large base pre-trained encoders. I think it would be more convincing if there can be ways to directly compare different evaluation systems (ref-free vs ref-included, score-based vs comparison-based) with the same training resources and base models. (But surely, it would be indeed a benefit if the proposed system can better utilize extra resources.)\n- There should be more analysis on the proposed methods (such as those in Section 5). For example, more ablation studies on the training stages and especially the usage of different resources, and more detailed analysis on the metric and perturbation methods in Stage 3. Some of the result and setting sections may be shorten or moved to the appendix.\n# --\n- (Updates): Most of these concerns are addressed by the authors' responses, and the authors should provide those details in later versions."
                },
                "questions": {
                    "value": "- What pre-trained model did the baseline systems use? Did they use up to XXL models? (Same or similar base models should be utilized for fair comparisons.)\n- Are there any ways to convert the relative comparisons to absolute scores? Sometimes, we might still need the scores (for example as rewards for RL).\n- In Stage 2 and the first part of Stage 3, references are required for the training purpose. If those two parts are ablated, how would it influence the results?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission8378/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission8378/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission8378/Reviewer_2G4a"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission8378/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698288116439,
            "cdate": 1698288116439,
            "tmdate": 1700640234330,
            "mdate": 1700640234330,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "IJalXPpS7k",
                "forum": "Rry1SeSOQL",
                "replyto": "xKPhoTUwFs",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8378/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8378/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer 2G4a"
                    },
                    "comment": {
                        "value": "We thank the reviewer for their valuable feedback. The reviewer appreciated the simplicity and superior performance of our approach. The reviewer also acknowledged the interestingness of our weakly supervised training method.\n\n**Response to the weakness mentioned by the reviewer:**\n\n**I’m wondering if the comparison is fare for other systems…:**\n1. **Concern about using the external data such as XNLI and MT-Prism:**\nOne of our baseline T5Score uses the same machine translation dataset MT-Prism to train their model. Other than SentBLEU all our baselines are based on pretrained-encoders. *It is fair to compare our systems against these systems since our system does not require costly human annotations of machine translation quality scores from humans.* Regarding comparing reference-included and reference-free systems, it is better to have a reference-free systems since in practice references are not always available. The fact that our system does not require the references during inference is a strength of our system.\n2. **Concern about using the same amount of data as the baselines:**\nRegarding comparing score-based vs comparison-based systems on same training resources, we have argued in our paper that it is much easier to gather synthetic data for comparison based approach, which means comparison based approach has the advantage of having larger synthetic training data. Since it is the advantage of our approach, constraining our approach to have the same amount of training data would be unfair to our systems.\n3. **Concern about using different pretrained model from baselines:**\nThe reviewer also mentioned having the same base model as our baselines. Our best performing baseline T5-Score uses the mT5 model which is the same model we have used. Our second-best performing baseline used the XLM-Roberta-Large model to train their systems. To make sure our performance is not just due to using mT5 model, we have now trained a XLM-Roberta-Large based model using our method. The performance for this model which we call Comparator-XLMR on the DA20 benchmark is shown below. Comparator-XLMR achieves superior performance compared to baselines and similar performance to our Comparator-Large and Comparator-XXL models.\n\n| Model           | cs-en | de-en | ja-en | pl-en | ru-en | ta-en | zh-en | Avg  |\n|-----------------|-------|-------|-------|-------|-------|-------|-------|------|\n| Comparator-XLMR | 9.6   | 47.3  | 26.9  | 10.1  | 16.2  | 23.6  | 14.6  | 21.2 |\n\n| Model           | en-cs | en-de | en-ja | en-pl | en-ru | en-ta | en-zh | Avg  |\n|-----------------|-------|-------|-------|-------|-------|-------|-------|------|\n| Comparator-XLMR | 69.3  | 41.9  | 58.9  | 44.4  | 31.0  | 69.5  | 51.2  | 52.3 |\n\n\n\n**There should be more analysis on the proposed methods…:**\n\nWe have performed further ablation studies of our different training stages. We trained ablated versions of our Comparator-Large model by removing different training stages. We show the performance of our ablated models on the DA20 dataset in the following table. Here sub-stage 3.1 refers to using the BERTScore based weak supervision and sub-stage 3.2 refers to the perturbation based weak supervision in our stage 3. The results show the specific contribution of metric and perturbation methods in Stage 3. The BERTScore based weak supervision has more contribution to the final performance. However, all the stages contribute positively to our final performance.\n| All Stages | w/o 1 | w/o 2 | w/o 3 | w/o 3.1 | w/o 3.2 | w/o 1,2 | w/o 2,3 |\n|------------|-------|-------|-------|---------|---------|---------|---------|\n| 36.5       | 35.9  | 35.6  | 28.9  | 28.5    | 35.9    | 35.5    | 9.9     |"
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8378/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700550049195,
                "cdate": 1700550049195,
                "tmdate": 1700550049195,
                "mdate": 1700550049195,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "uI28EXQElL",
            "forum": "Rry1SeSOQL",
            "replyto": "Rry1SeSOQL",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission8378/Reviewer_GQxu"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission8378/Reviewer_GQxu"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes a comparative MT evaluation metric: instead of comparing machine translations to references, it compares multiple machine translations. The model is built on a bidirectional LLM, that encodes pairs of translations, and a pooling and logistic regression layer on top. It is trained with data from crosslingual NLI, pairs of human and machine translations, and synthetically rated or corrupted pairs of translations. Evaluation is done on a set on the WMT20 metrics task, several MQM datasets and ACES, a challenge dataset. The proposed model is compared to previous state-of-the-art reference-free metrics and largely outperforms them across languages, as well as supervised baselines."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "- Idea and method are simple and well explained. Given that it requires much less costly data than the competing methods, it poses an attractive solution for MT evaluation.\n- The reported results are strong, given that they do not require references or direct supervision. The proposed model outperforms both supervised and unsupervised baselines.\n- The ablations give an insight into the importance of the different stages and generalization to unseen languages, which allows one to get a more thorough understanding of the method and its benefits."
                },
                "weaknesses": {
                    "value": "The novelty seems limited / overemphasized. In Quality Estimation (QE) reference-free ranking approaches have been used for MT quality estimates before it was re-invented in the context of MT metrics competitions. For example, in the very first QE task in 2012 (https://www.statmt.org/wmt12/quality-estimation-task.html) ranking based evaluations (without references) were already designed, and as a result, ranking based methods have been developed as well (e.g. Avramidis, Eleftherios. \"Sentence-level ranking with quality estimation.\" Machine translation 27.3-4 (2013): 239-256.; Eleftherios Avramidis. 2012. Comparative Quality Estimation: Automatic Sentence-Level Ranking of Multiple Machine Translation Outputs. In Proceedings of COLING 2012, pages 115–132, Mumbai, India.)"
                },
                "questions": {
                    "value": "- Can you explain what the sentence “relative ranking annotation from direct assessment with a large enough threshold has been used with as few as one annotation” (Intro) means? Where does the threshold come into play and what does it mean to have one annotation only (I assume one per input, but not only one input)?\n- Figure 1 is not adding much, its content is clear from the text. The space could be used to elaborate the connections to QE (see above) and report more empirical results on newer datasets.\n- Is there any train/test overlap of the training data of mT5 and the benchmarks’ test data? \n- What if references were removed from the fine-tuning sets in Stages 2 and 3? This would be a useful ablation to make the models truly free from references.\n- Which of the evaluation differences are significant? \n- What if Stages 1&2 are dropped and only Stage 3 is performed? This would further illustrate the importance of that stage and make it clear for future use where most time investment should go."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission8378/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698783590884,
            "cdate": 1698783590884,
            "tmdate": 1699637042528,
            "mdate": 1699637042528,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "oJqP2nDmjr",
                "forum": "Rry1SeSOQL",
                "replyto": "uI28EXQElL",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8378/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8378/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to reviewer GQxu"
                    },
                    "comment": {
                        "value": "We thank the reviewer for their valuable feedback. The reviewer appreciated the simplicity and superior performance of our approach as well as the fact that our system requires much less costly data. The reviewer also appreciated the analyses we performed on our system.\n\n**Response to the weakness mentioned by the reviewer:**\n\nWe thank the reviewer for bringing to our attention the related works that we missed. We note the following differences between our approach and the previous literature.\n1. The previous systems rely on feature engineering and on external parser to generate some of the features. In contrast our approach does not rely on feature engineering and can work directly on the source sentence and the translation pair.\n2. Our models show generalization to unseen language pairs during inference. In contrast, the previous systems only work on a single language pair.\n3. Our system does not rely on costly human-annotated quality scores of machine translations and achieves superior performance with weakly supervised data. The previous systems mentioned by the reviewer were trained on human annotations of quality judgments.\n\n**Response to reviewer’s questions:**\n1. Direct assessment quality scores of machine translations collected from human evaluation is very noisy. It requires at least 15 annotations per machine translation to get reproducible scores. Since it is costly to get so many annotations per translation especially for low resource languages, in practice much less annotations may be available, sometimes as few as one. However, in this scenario suppose translation A gets one annotation of direct Assessment score 80 and translation B gets one annotation of Direct Assessment score 30, the difference in score being 50, we can still conclude that translation A is better than translation B. In previous literature a threshold of 25 score difference has been used to make similar conclusions.\n2. We think it is important to have the figure since our approach is different from the usual MT evaluation. It is important to convey the difference clearly to readers.\n3. mT5 was pretrained on the mC4 corpus. The latest data in mC4 corpus is from Common Crawl dump 2020-34 which includes web scrapes upto August 15th 2020. The WMT20 dataset was released on August 23rd 2020. Other benchmark datasets we used were released much later. Thus we are confident that the mT5 models have not seen the benchmark test data.\n4. The references are required in stage 2 and 3 to generate the synthetic data. If we ablate the references completely from our system then we are left with only stage 1. The ablation results in our paper and in the table later in this response shows that without stage 2 and 3 the performance of the system is very poor. Thus access to the reference translations is required for training of our system. *Our focus in this work is two-fold, i) to remove the requirement of having references during inference and ii) to remove the reliance on costly human annotations of translation quality scores for training machine translation evaluation models.* Collecting these annotations are much costlier than collecting reference translations which can even be performed automatically by bi-text mining. Thus we believe reliance on reference translations during training is not a drawback of our system.\n5. We performed the PERM-BOTH test following previous literature.[1] The results show that our Comparator-Large and Comparator-XXL model significantly outperforms all baselines on the DA20 benchmark dataset with a p-value < 0.05. On the MQM20 and MQM22 benchmark dataset our Comparator-XXL model significantly outperforms all baselines on en-de and zh-en language pairs with p-value <0.5. Even though our system does not significantly outperform other baselines in other settings, our system does not use any supervised data during training  in contrast to the baselines.\n6. We have performed further ablation experiments. We show the results in the following table. The results of our ablation show the performance of the system drops by one point to 35.5 when we remove stage 1 and 2 and just perform stage 3.\n\n| All Stages | w/o 1 | w/o 2 | w/o 3 | w/o 3.1 | w/o 3.2 | w/o 1,2 | w/o 2,3 |\n|------------|-------|-------|-------|---------|---------|---------|---------|\n| 36.5       | 35.9  | 35.6  | 28.9  | 28.5    | 35.9    | 35.5    | 9.9     |\n\n\n[1] [A Statistical Analysis of Summarization Evaluation Metrics Using Resampling Methods](https://aclanthology.org/2021.tacl-1.67) (Deutsch et al., TACL 2021)"
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8378/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700551098071,
                "cdate": 1700551098071,
                "tmdate": 1700589101506,
                "mdate": 1700589101506,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "KmPxtRYLiS",
                "forum": "Rry1SeSOQL",
                "replyto": "oJqP2nDmjr",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8378/Reviewer_GQxu"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8378/Reviewer_GQxu"
                ],
                "content": {
                    "title": {
                        "value": "Response"
                    },
                    "comment": {
                        "value": "Thank you for the clarifications of my questions and the additional ablation, very helpful.\nI recommend highlighting the distinction of references during training vs inference as well, and discussing the listed nuances of the novelty over previous methods (and at the same time acknowledging these previous methods more)."
                    }
                },
                "number": 10,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8378/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700686655072,
                "cdate": 1700686655072,
                "tmdate": 1700686655072,
                "mdate": 1700686655072,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "46k6erTsS9",
            "forum": "Rry1SeSOQL",
            "replyto": "Rry1SeSOQL",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission8378/Reviewer_Qwxh"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission8378/Reviewer_Qwxh"
            ],
            "content": {
                "summary": {
                    "value": "In this paper, the authors propose a method to learn pairwise reference-less evaluation of MT. This scenario corresponds to a common, real use where reference translations are mostly unavailable and the interest is mostly in comparing systems, rather than absolute scores. The pairwise ranking is a good framework since it is easier to collect synthetic data with pairwise judgments, as opposed to assigning quality scores to synthetic examples. Pairwise rankings also achieve higher inter-annotator agreement than human judgments. The method proposes a 3-stage pipeline for finetuning with various kinds of synthetic data. \n\nThe results show that the approach can achieve state-of-the-art performance comparable or better than supervised approaches. The analysis also shows that adding supervised data can further improve performance modestly. Interpreted in another way, it also means that the synthetic data generated is sufficient to capture most of the attributes of supervised data for pairwise ranking of systems."
                },
                "soundness": {
                    "value": "4 excellent"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "4 excellent"
                },
                "strengths": {
                    "value": "* The paper is well-written and explains the motivation for the work well. \n* The experiments are extensive and establish that reference-less evaluation is very competitive with reference-based metrics. \n* The use of synthetic data for pairwise ranking is a very clean way of using synthetic data and helps train high-quality reference-less metrics."
                },
                "weaknesses": {
                    "value": "While pairwise evaluations of systems are useful, a more practical utility would be to rank multiple models. Score-based systems enable that easily. With pairwise ranking-based systems, multiple comparisons have to be run. Every time a new system has to be ranked, it has to be compared with multiple existing systems."
                },
                "questions": {
                    "value": "* Equation 11 should be y=0?\n* 3 languages from the WMT-20 Metrics tasks have not been included in the evaluation. It would be good to include those results as well for getting a complete view of the WMT-20 Metrics task."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission8378/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699167193970,
            "cdate": 1699167193970,
            "tmdate": 1699637042406,
            "mdate": 1699637042406,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "e2ErB9jW4V",
                "forum": "Rry1SeSOQL",
                "replyto": "46k6erTsS9",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8378/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8378/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to reviewer Qwxh"
                    },
                    "comment": {
                        "value": "We thank the reviewer for their valuable feedback. The reviewer appreciated that our paper is well written and explains our motivation well. The reviewer also appreciated the extensive experiment results reported in our paper and the use of synthetic data to achieve good performance.\n\n**Response to weaknesses mentioned by the reviewer:**\n1. In practice we do not have that many systems to compare. Usually it is less than a dozen. In this scenario, our system does not add much overhead. Given the simplicity of our system, not relying on human annotations during training, not requiring access to references and generalization to unseen languages, it is an attractive alternative to existing score-based approach.\n2. We can provide our models with more than two translations. On the pooling layer we can construct the pooled embedding for all pairs simultaneously. This can be done in parallel with full matrix operations. These pooled embeddings can be sent to classifier head in parallel to get rankings for all the translations. We are currently pursuing this approach to create a more efficient system.\n\n\n**Response to reviewer’s questions:**\n\n1. The reviewer is correct. We will fix the issue in our revised paper.\n2. We report the results for the three languages of DA20 in the following table.\n\n| Model            | km-en | ps-en | iu-en | en-iu |\n| ---------------- | ----- | ----- | ----- | ----- |\n| Openkiwi-XLMR    | 24.4  | 10.6  | 5.6   | 6.0   |\n| Comet            | 14.9  | 9.2   | 3.2   | \\-6.3 |\n| T5Score-XL       | 22.5  | 10.6  | 2.6   | \\-2.6 |\n| Comparator-Base  | 30.3  | 19.0  | 1.6   | 20.3  |\n| Comparator-Large | 33.4  | 20.1  | 5.2   | 14.7  |\n| Comparator-XXL   | 33.1  | 19.7  | 6.6   | 18.0  |\n\nOur systems strongly beat the baseline systems on these languages even though our systems were not trained on human annotations. We unintentionally filtered out these languages in our evaluation. Additionally, for the iu-en and en-iu language pairs we noticed that we filtered out these language pairs also from our training. The strong performance on these two pairs also show the generalizability of our system to unseen language pairs during training."
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8378/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700551295903,
                "cdate": 1700551295903,
                "tmdate": 1700590132505,
                "mdate": 1700590132505,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "rqVI05WrXW",
            "forum": "Rry1SeSOQL",
            "replyto": "Rry1SeSOQL",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission8378/Reviewer_DxQx"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission8378/Reviewer_DxQx"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes a novel reference-free machine translation evaluation method which directly compares the two hypotheses from two systems by pre-trained language models, e.g., mT5."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "The manuscript is commendably clear in its presentation, providing a lucid explanation of the method's underpinnings and its design rationale. The method itself is logically structured and appears to be grounded in a sound understanding of the underlying technical principles."
                },
                "weaknesses": {
                    "value": "(Main) 1. **Experimental Settings**: Upon meticulous examination, I observe that the experimental setup deviates from the conventional practices of evaluating numerous systems simultaneously. The study opts to assess a custom set of 'Better-worse judgments' between pairs of system outputs. This focus narrows the scope of the evaluation and raises concerns about the validity of the correlation results. The paper's method shows a strong correlation with these judgments but fails to conclusively demonstrate the superiority of one system over another. The more critical challenge lies in integrating these pairwise comparisons into a comprehensive evaluation framework that can handle multiple systems. The current approach's limitations in addressing this challenge may undermine its utility and applicability.\n\n2. **Scope and Generalization**: The narrow focus of the study may limit its applicability beyond its stated domain. The paper could benefit from an expanded discussion on how the proposed method might adapt or extend to other evaluation contexts, such as the assessment of large language models (LLMs). While ICLR might be receptive to specialized domain contributions, the paper's current emphasis suggests that it might find a more fitting audience at a dedicated NLP conference.\n\n**Suggestions**\n1. **Contextualizing with Recent Advances**: Recent developments in MT evaluation metrics, such as xCOMET (https://arxiv.org/abs/2310.10482) and SLIDE (https://arxiv.org/pdf/2309.08832.pdf), emphasize the importance of error span evaluations. While it is not mandatory to compare against the latest publications, incorporating insights from these advancements could significantly enhance the robustness and relevance of the proposed method. \n\n2. **Related Work**: I recommend that the authors consider the insights from \"DABERTScore\" (https://aclanthology.org/2021.acl-short.5.pdf). There are conceptual overlaps between this work and the manuscript under review, which merit a thorough comparison and discussion within the paper to enrich the context and underscore the novel contributions of the proposed method."
                },
                "questions": {
                    "value": "1. How should the paper address the ranking of two MT systems? Is there a more robust method than simply tallying the number of better translations?\n2. When scaling up the evaluation to multiple systems, how might one resolve apparent ranking contradictions, such as the scenario where System A outperforms System B, System B outperforms System C, but System C outperforms System A?\n\nThese questions are pivotal in addressing the practical implications of the proposed method and its capacity to function in a more complex, real-world evaluation environment. A more thorough exploration of these aspects could substantially strengthen the paper’s contribution to the field."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission8378/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission8378/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission8378/Reviewer_DxQx"
                    ]
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission8378/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699174706690,
            "cdate": 1699174706690,
            "tmdate": 1700999490063,
            "mdate": 1700999490063,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "4opS3Phxku",
                "forum": "Rry1SeSOQL",
                "replyto": "rqVI05WrXW",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8378/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8378/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to reviewer DxQx"
                    },
                    "comment": {
                        "value": "We thank the reviewer for their valuable feedback. The reviewer acknowledged the soundness of our approach and the clear presentation of our paper.\n\n**Response to the weakness mentioned by the reviewer:**\n\n1. A straightforward approach to applying our system to perform system-level evaluation is to compare all machine translation pairs of pairs of MT systems. Since our model predicts a probability of which translation is better we can aggregate these probabilities across all the MT pairs to give a probability score for which MT system is better for each pair of. Then for each MT system we can average these probability scores to get a score for the system. These scores indicate how likely a system is to beat another system. For example, suppose we have three systems A, B and C under consideration. We apply our system to each pair and get the following scores. Each cell indicates the probability that the system on the row beats the system on the column. Thus, system A beats system B with a probability of 0.7. We take the average across rows to get the score for each system. Based on the scores we can conclude the ordering C>A>B.\n\n|   | A   | B   | C   | Avg  |\n| - | --- | --- | --- | ---- |\n| A |     | 0.7 | 0.3 | 0.5  |\n| B | 0.3 |     | 0.4 | 0.35 |\n| C | 0.7 | 0.6 |     | 0.65 |\n\nWe apply this approach to system-level evaluation on the DA20 dataset and achieve competitive results with baseline models. In the following table we show the results. The reported values are Pearson correlation with the system level gold human evaluation scores.\n\n\n| Model            | en-cs | en-de | en-ja | en-pl | en-ru | en-ta | en-zh  | Avg EN-X |\n| ---------------- | ----- | ----- | ----- | ----- | ----- | ----- | ------ | -------- |\n| OpenKiwi-XLMR    | 0.972 | 0.968 | 0.992 | 0.957 | 0.875 | 0.91  | \\-0.01 | 0.809    |\n| COMET-QE         | 0.989 | 0.903 | 0.953 | 0.969 | 0.807 | 0.887 | 0.375  | 0.840    |\n| T5-Score-XL-SUP         | 0.985 | 0.963 | 0.964 | 0.968 | 0.887 | 0.952 | 0.960  | 0.954    |\n| Comparator-Base  | 0.99  | 0.94  | 0.98  | 0.97  | 0.63  | 0.93  | 0.47   | 0.844    |\n| Comparator-Large | 0.99  | 0.95  | 0.99  | 0.98  | 0.76  | 0.94  | 0.55   | 0.880    |\n| Comparator-XXL   | 0.99  | 0.95  | 0.99  | 0.98  | 0.75  | 0.94  | 0.57   | 0.881    |\n\n| Model            | cs-en | de-en | ja-en | pl-en | ru-en | ta-en | zh-en | Avg X-EN | Avg All     |\n| ---------------- | ----- | ----- | ----- | ----- | ----- | ----- | ----- | -------- | ----------- |\n| OpenKiwi-XLMR    | 0.76  | 0.995 | 0.931 | 0.442 | 0.859 | 0.792 | 0.905 | 0.915    | 0.862       |\n| COMET-QE         | 0.755 | 0.939 | 0.892 | 0.447 | 0.883 | 0.795 | 0.847 | 0.915    | 0.878       |\n| T5-Score-XL-SUP         | 0.73 | 0.995 | 0.959 | 0.513 | 0.94 | 0.92 | 0.879  | 0.915 | 0.935   |\n| Comparator-Base  | 0.8   | 1     | 0.94  | 0.52  | 0.91  | 0.92  | 0.88  | 0.853    | 0.849\n| Comparator-Large | 0.8   | 0.99  | 0.94  | 0.6   | 0.92  | 0.93  | 0.89  | 0.867    | 0.874       |\n| Comparator-XXL   | 0.8   | 0.99  | 0.94  | 0.58  | 0.9   | 0.92  | 0.88  | 0.859    | 0.870       |\n\n2. Machine translation evaluation is an important field in natural language processing. We have proposed a new framework for MT evaluation that beats state-of-art supervised baselines without using any human-annotated comparison data. Given the simplicity of our approach and the large reduction in human annotation cost, we believe our work is a significant contribution that should be of interest to the wider machine learning community.  We also note that in previous ICLR conferences papers on Dialogue system evaluation has been publishe[1]That being said, we are currently exploring using our approach to other NLG evaluation tasks as future work.\n\n3. We note that the xCOMET paper was released after we submitted our paper to ICLR and the SLIDE paper was released only 12 days before our submission. We agree that fine-grained error span evaluations are an important direction for MT evaluation systems. We plan to explore this direction in our future work.\n\n4. DABertScore proposes a modification to the BertScore algorithm based on token-level difficulty weighting. Like BertScore, it is a reference-based metric. We have not found any conceptual overlap between DABertScore and our approach. Our system is a reference-free pairwise MT evaluation method that has been trained on synthetic data without using any human annotated translation quality scores. If the reviewer could clarify the conceptual overlap between our method and DABertScore we would be happy to include those comparisons in our paper.\n\n\n[1] Amplayo, R.K., Liu, P.J., Zhao, Y., & Narayan, S. (2022). [SMART: Sentences as Basic Units for Text Evaluation.](https://openreview.net/forum?id=OIe3kpwl40D) ArXiv, abs/2208.01030."
                    }
                },
                "number": 8,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8378/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700591017555,
                "cdate": 1700591017555,
                "tmdate": 1700740799015,
                "mdate": 1700740799015,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "3cLwTInIMg",
                "forum": "Rry1SeSOQL",
                "replyto": "4opS3Phxku",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8378/Reviewer_DxQx"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8378/Reviewer_DxQx"
                ],
                "content": {
                    "title": {
                        "value": "Further Comments."
                    },
                    "comment": {
                        "value": "Thank you for your response. To further clarify, I have the following specific requests and suggestions:\n\n1.  In your tables, you've mentioned COMET-QE, but it's not clear which variant (base, large, or XXL) is used. Could you specify this and provide the scores for the remaining variants?\n2.  Please include the results of T5SCORE-XLSUP in the two referenced tables for a comprehensive comparison.\n3.  The paper should be revised to address the main weaknesses (system ranking) identified by myself and Reviewer Qwxh.\n4.  I believe that COMET-QE, as a reference-free baseline, is already simple and effective. Your proposed method appears to require excessive effort for implementation without showing significant advancements. Please further discuss it.\n5.  Since your training and testing are based on the wmt20-da dataset, could you also provide the testing results for the wmt22-da datasets for a more current evaluation?\n6.  As mentioned in my first review, while it's not mandatory, including insights from recent publications could greatly enhance the robustness and relevance of your method.\n7.  Like your title, both DABertscore and the proposed method improve MT evaluation by **inter-system comparison**.  A detailed discussion on this aspect would be beneficial for readers to gain deeper insights into this line of research.\n8.  I have updated my original review to make the identified weaknesses and suggestions clearer."
                    }
                },
                "number": 11,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8378/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700726044245,
                "cdate": 1700726044245,
                "tmdate": 1700726044245,
                "mdate": 1700726044245,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "6zuH7nPF2C",
                "forum": "Rry1SeSOQL",
                "replyto": "rqVI05WrXW",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8378/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8378/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to reviewer DxQx's further comments"
                    },
                    "comment": {
                        "value": "Thank you for your further questions.\n\n1. We chose the WMT20-COMET-QE-DA model for evaluation on DA20 and MQM20 datasets. We chose WMT21-COMET-QE-MQM for evaluation on MQM21 and MQM22 datasets.\nBoth of these models are available from the [COMET library](https://unbabel.github.io/COMET/html/models.html). Models of different scales (ie base,large,XXL) are not available for COMET-QE.\n2. We have updated the tables.\n3. We will revise our paper to include discussion of system-level evaluation.\n4. COMET-QE is supervised, It was trained on human annotations of machine translation quality scores (ie Direct Assessment and MQM scores). In contrast our models were trained on weakly supervised synthetic dataset. Our pairwise-comparison based approach enables us to create this large synthetic dataset. Thus, even though system-level evaluation with our comparison-based approach is more complicated than with score-based approach (ie COMET-QE), we believe the fact that our approach does not require costly human annotations for training makes up for it.\n5. In the following table we show the system-level Pearson correlation of our system and the baselines on the MQM22 dataset.\n\n|                  | en-de | zh-en | en-ru | avg   |\n| ---------------- | ----- | ----- | ----- | ----- |\n| COMET-QE         | 0.48  | 0.544 | 0.468 | 0.497 |\n| COMET-Kiwi       | 0.592 | 0.795 | 0.763 | 0.717 |\n| Unite            | 0.509 | 0.791 | 0.779 | 0.693 |\n| Comparator-Base  | 0.79  | 0.74  | 0.79  | 0.773 |\n| Comparator-Large | 0.87  | 0.84  | 0.92  | 0.877 |\n| Comparator-XXL   | 0.92  | 0.85  | 0.95  | 0.907 |\n\n6. We again note that the xCOMET paper was released after we submitted our paper to ICLR and the SLIDE paper was released only 12 days before our submission. Thus including insights from these two publications is not relevant to our current submission to ICLR.\n7. We are still confused as we do not find any **inter-system comparison** that is similar to our approach in the DABertscore paper. Similar to Bertscore, DABertscore is a reference based approach, where machine translations are compared with the reference sentence to generate token similarity scores. Machine translations from two systems are not compared by DABertScore.\n8. Thanks a lot for your valuable feedback."
                    }
                },
                "number": 12,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8378/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700741035077,
                "cdate": 1700741035077,
                "tmdate": 1700741084313,
                "mdate": 1700741084313,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]