[
    {
        "title": "HiCBridge: Resolution Enhancement of Hi-C Data Using Direct Diffusion Bridge"
    },
    {
        "review": {
            "id": "PBRUDWXQBL",
            "forum": "RUvzlotXY0",
            "replyto": "RUvzlotXY0",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission3128/Reviewer_eQMG"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission3128/Reviewer_eQMG"
            ],
            "content": {
                "summary": {
                    "value": "The paper introduces HiCBridge, a new method for improving the resolution of Hi-C genomic data. HiCBridge utilizes a direct diffusion process to overcome the limitations of previous techniques, yielding higher quality data. It outperforms existing models in accuracy and reliability, offering a robust tool for genomic research."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "The paper introduces an original technique leveraging a direct diffusion bridge to enhance Hi-C data resolution, showcasing creativity in addressing the limitations of existing deep learning methods. The quality of research is evident through rigorous evaluation against standard metrics and the demonstration of reproducibility, indicative of robust experimental design. Clarity is a strength of the paper, with concise explanations of complex methodologies and clear communication of results. The significance of the work is considerable, offering a tool with potential for broad applications in genomic research, with implications for understanding genomic architecture and influencing disease research. Overall, the paper represents a meaningful advance in bioinformatics, combining originality and quality with clear presentation and significant potential impact."
                },
                "weaknesses": {
                    "value": "The methodology underpinning HiCBridge, while innovative, could be more transparent, particularly in how it fits within broader Hi-C analysis workflows and its robustness to data biases and hyperparameter variations. A thorough comparative analysis against a wider array of both deep learning and traditional approaches could better contextualize its performance claims. The validation of HiCBridge could also be strengthened by testing across diverse Hi-C datasets to ensure its generalizability. Furthermore, elucidating the biological significance of the resolution enhancement through detailed case studies would demonstrate the practical impact of the method. The paper would benefit from a discussion on computational efficiency, an essential consideration for large-scale genomic data analysis. Lastly, an in-depth consideration of the method's limitations, such as the effects of sequencing depth and data noise, would provide a more balanced view and inform future enhancements. Addressing these areas could significantly solidify the paper's contributions and utility in the field."
                },
                "questions": {
                    "value": "What are the potential limitations of HiCBridge, particularly concerning sequencing depth, input data resolution, and noise in Hi-C datasets?\nHow might these limitations affect the application of HiCBridge in different research scenarios?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "details_of_ethics_concerns": {
                    "value": "none"
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission3128/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699065822584,
            "cdate": 1699065822584,
            "tmdate": 1699636259805,
            "mdate": 1699636259805,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "teXBHQDrki",
                "forum": "RUvzlotXY0",
                "replyto": "PBRUDWXQBL",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3128/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3128/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Reply to Reviewer eQMG"
                    },
                    "comment": {
                        "value": "We thank the reviewer for the constructive and valuable comments. Please see the detailed response below.\n\n> Weaknesses 1. Show its robustness to data biases and hyperparameter variations.\n\nPlease see **General Comments 3. Robustness to data biases**. We compared the ratio of data augmentation, as a hyperparameter, to verified the robustness of HiCBridge$^+$. While augmented data is beneficial for the generalization of HiCBridge, a high proportion of augmented data can pose challenges, contingent on data biases.\n\n\n> Weaknesses 2. A thorough comparative analysis against a wider array of both deep learning and traditional approaches. And by testing across diverse Hi-C datasets to ensure its generalizability.\n\nWe obtained enhanced Hi-C contact matices by Gaussian smoothing as a traditional method. We employed 2D Gaussian distribution with kernel size $n = 17$ and $\\sigma_x = \\sigma_y = 3$. The table below reveals that, although the traditional method demonstrates competitive results, our approach consistently outperforms all matrices. These findings underscore the superiority of our method.\n\n|Method|PCC|SPC|PSNR|SSIM|MSE|SNR|HiCRep|Insulation score|\n|---|---|---|---|---|---|---|:---:|:---:|\n|Low resolution|0.758|0.630|13.24|0.234|0.04848|297.2|0.917|7.967|\n|Gaussian smoothing|0.948|0.875|18.31|0.348|0.01498|531.2|0.977|7.639|\n|HiCBridge$^+$|0.959|0.891|21.86|0.458|0.00678|805.6|0.984|3.365|\n\n> Weaknesses 3. Elucidating the biological significance of the resolution enhancement through detailed case studies.\n\nPlease see **General Comments, 4. Biological Significance**. We compared our model with traditional MSE and GAN methods, and found that our model preserves structural information without introducing artifacts that can be misleading.\n\n> Weaknesses 4. Computational efficiency, an essential consideration for large-scale genomic data analysis.\n\nPlease see **General Comments, 2. Computational Efficiency**. About 250 million lengths of chromosome 1 can be represented by about 430 $\\times$ 256 $\\times$ 256 Hi-C contact maps, which our model takes about 70 seconds to process.\n\n> Weaknesses 5. An in-depth consideration of the method's limitations, such as the effects of sequencing depth and data noise.\n\nIt is important to note that our model is exclusively trained on inter-chromosomal connections, so a different method is needed to handle contact maps between chromosomes. Additionally, our models are limited to resolution enhancement for a bin size of 10kb. Lastly, biased data augmentation can potentially degrade the generalization of the model, as discussed in **Weakness 1**, where the results of our model are shown to be influenced by data bias. We have added these as our limitation in **Appendix C** of the revised paper. \n\nFinally, the reviewer is kindly reminded that the data noise is mostly originated from shallow sequence depth and one of the main goals of our study is to enhancement data quality from relatively shallow sequencing depth using direct diffusion bridge. The low-resolution Hi-C data we trained corresponds to a sequence depth of about 1/16 of the high-resolution data. In this paper, our model has shown robust performance for different resolutions (1/16, 1/50 and 1/100) and different cell types; K562 (about 1/14), IMR90 (about 1/10)."
                    }
                },
                "number": 9,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3128/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700327581279,
                "cdate": 1700327581279,
                "tmdate": 1700379379725,
                "mdate": 1700379379725,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "m7br2eNWTc",
            "forum": "RUvzlotXY0",
            "replyto": "RUvzlotXY0",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission3128/Reviewer_iBuE"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission3128/Reviewer_iBuE"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes an Hi-C enhancement using Direct Diffusion Bridge (HiCBridge) model. The proposed method learns the mapping from low-resolution to high-resolution Hi-C data without experiencing mode collapsing issues commonly observed in Generative Adversarial Networks (GANs) or texture blurring that can occur in standard supervised deep learning approaches. The proposed model demonstrates good performance on standard vision metrics, various biological metrics, and downstream tasks across diverse cell types and resolutions."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "+ As to the overall paper structure, I think it is clear and easy to follow.\n\n+ The method used in the paper is reasonable. In simpler terms, the direct diffusion bridge allows us to calculate the likelihood of a diffusion process reaching a particular state at a specific time, without needing to consider the entire path the process took. \n\n+ The experimental results underscore the versatility and reliability of HiCBridge+ across various resolutions and human cell types. These findings may have the potential to be a valuable tool for advancing chromatin research."
                },
                "weaknesses": {
                    "value": "- The authors seem to have only used existing DDPM model to generate new low-resolution Hi-C data corresponding to the high-resolution ones. The authors have primarily relied on existing methods to generate the data, which, in itself, does not constitute a significant contribution. It is crucial for the authors to clearly explain the problem they aim to address and the challenges associated with it.\n\n- The authors claim that the conventional regression models, which are based on the Mean Squared Error (MSE) loss, cause the model to regress to the mean in the target domain. This regression leads to blurring and loss of details. However, the author do not provide visual results to demonstrate this issue. The authors should elaborate on the challenges posed by the problem. Describing the difficulties and complexities associated with addressing the problem will highlight its importance and demonstrate the need for the proposed solutions.\n\n-----------------------After Rebuttal---------------------------\n\nThank you for your feedback. The rebuttal addressed my concerns well. Considering other reviews, I have decided to increase my score."
                },
                "questions": {
                    "value": "Please refer to the weakness part."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission3128/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission3128/Reviewer_iBuE",
                        "ICLR.cc/2024/Conference/Submission3128/Senior_Area_Chairs"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission3128/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699086341997,
            "cdate": 1699086341997,
            "tmdate": 1700746679880,
            "mdate": 1700746679880,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "kSWFHxcDRV",
                "forum": "RUvzlotXY0",
                "replyto": "m7br2eNWTc",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3128/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3128/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Reply to Reviewer iBuE"
                    },
                    "comment": {
                        "value": "We thank the reviewer for your time and efforts in reviewing our paper, and your constructive comments. Please see the detailed response below.\n\n> Weaknesses 1. The authors seem to have only used existing DDPM model to generate new low-resolution Hi-C data corresponding to the high-resolution ones. The authors have primarily relied on existing methods to generate the data, which, in itself, does not constitute a significant contribution. It is crucial for the authors to clearly explain the problem they aim to address and the challenges associated with it.\n\nPlease see **General Comments, 1. Difference from original methods**. We explored the best approach to leverage both the regression and generation capabilities of DDB and diffusion model. Various metrics show that our framework outperforms other models at Hi-C enhancement task. Additionally, our model has advantages not only in performance but also in the efficiency of Hi-C enhancement.\n\n> Weaknesses 2. The authors claim that the conventional regression models, which are based on the Mean Squared Error (MSE) loss, cause the model to regress to the mean in the target domain. This regression leads to blurring and loss of details. However, the author do not provide visual results to demonstrate this issue. The authors should elaborate on the challenges posed by the problem. Describing the difficulties and complexities associated with addressing the problem will highlight its importance and demonstrate the need for the proposed solutions.\n\nPlease see **General Comments, 4. Biological Significance**. We highlight the limitations of models trained with traditional MSE and GAN approaches. Our model showcases conservative reconstruction, preserving structural information without introducing artifacts that could potentially lead to misinterpretation of the reconstructed Hi-C data.\n\nAn MSE-based model tends to yield blurry output as it represents the average of all plausible reconstructions. In contrast, our approach breaks down the mapping into multiple timesteps, preventing regression to the mean. While GAN-based models excel at generating photo-realistic images by training generator and discriminator, a high level of similarity in the image domain does not necessarily ensure excellent biological reconstruction. Previous methods have incorporated various additional losses to involve biological meaning, but these approaches reduce the interpretability of the model and lead inadvertent results. Our method avoids using additional losses like perception loss or insulation loss."
                    }
                },
                "number": 8,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3128/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700327032342,
                "cdate": 1700327032342,
                "tmdate": 1700327032342,
                "mdate": 1700327032342,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "5YX7D4iZoM",
            "forum": "RUvzlotXY0",
            "replyto": "RUvzlotXY0",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission3128/Reviewer_CoBE"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission3128/Reviewer_CoBE"
            ],
            "content": {
                "summary": {
                    "value": "The paper propose to use Direct Diffusion Bridge to enhance the resolution of HI-C data. To promote the generalization in real-world situations, the authors introduce diffusion models to generate training data with more variation. Rich experimental results support excellent performance as well as its application to Hi-C analysis of human cells."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "-\tThe paper proposes a diffusion based method to enhance resolution of HI-C data, which avoids over-smooth of standard supervised learning or training instability of GANs. The performance seems more competitive compared with previous methods.\n-\tThe authors provide rich figures and tables to vividly and rigorously support their claims.\n-\tThe paper is well-organized and easy to follow."
                },
                "weaknesses": {
                    "value": "-\tAlthough the application of diffusion-based methods to Hi-C is meaningful, the method seems lack of novelty. The authors should explain carefully the difference between the core method and previous Direct Diffusion Bridge. \n-\tI suggest the authors add comparison about memory and time consumption to help readers get a full picture of their method."
                },
                "questions": {
                    "value": "-\tCan you provide visualization of generated training data?\n-\tDuring the process of enhancing resolution, new content will sprout. I am concerned whether the method will generate inrelevant or even harmful content, which may incur severe results."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission3128/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699090189655,
            "cdate": 1699090189655,
            "tmdate": 1699636259639,
            "mdate": 1699636259639,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "BUI87MSPi9",
                "forum": "RUvzlotXY0",
                "replyto": "5YX7D4iZoM",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3128/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3128/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Reply to Reviewer CoBE"
                    },
                    "comment": {
                        "value": "Thanks for the valuable and constructive comment. For point-to-point response, see below.\n\t\n> Weaknesses 1. Although the application of diffusion-based methods to Hi-C is meaningful, the method seems lack of novelty. The authors should explain carefully the difference between the core method and previous Direct Diffusion Bridge.\n\nPlease see **General Comments, 1. Difference from original methods.** We propose the best framework for the Hi-C enhancement task through a combination of DDB and diffusion. Considering the regression performance of the DDB and the generative performance of the diffusion model at the same time, our model showed superior results on various metrics. \n\n> Weaknesses 2. I suggest the authors add comparison about memory and time consumption to help readers get a full picture of their method.\n\nPlease see **General Comments, 2. Computation efficiency.** Our model takes 0.16 seconds to process a single 256 $\\times$ 256 Hi-C contact map and has a competitive memory requirement.\n\n\n> Question 1. Can you provide visualization of generated training data?\n\nWe visualized generated Hi-C data of GM12878 chromosome 13 using diffusion augmentation model in **Fig. 8 in Appendix F** of the revised paper. We used the generated data in order to train HiCBridge$^+$.\n\n\n> Question 2. During the process of enhancing resolution, new content will sprout. I am concerned whether the method will generate inrelevant or even harmful content, which may incur severe results.\n\nPlease see **General Comments, 4. Biological significance.** We verified HiCBridge recovers structural information without misleading contents."
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3128/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700326902573,
                "cdate": 1700326902573,
                "tmdate": 1700378648632,
                "mdate": 1700378648632,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "zvx8UIspOQ",
                "forum": "RUvzlotXY0",
                "replyto": "BUI87MSPi9",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3128/Reviewer_CoBE"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3128/Reviewer_CoBE"
                ],
                "content": {
                    "comment": {
                        "value": "All my concerns have been addressed in the rebuttal. I have no further comment."
                    }
                },
                "number": 11,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3128/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700669327490,
                "cdate": 1700669327490,
                "tmdate": 1700669327490,
                "mdate": 1700669327490,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "8HIR1vwe86",
            "forum": "RUvzlotXY0",
            "replyto": "RUvzlotXY0",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission3128/Reviewer_jkUa"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission3128/Reviewer_jkUa"
            ],
            "content": {
                "summary": {
                    "value": "This paper addresses the resolution limitations inherent in Hi-C analysis—a genomic technique that elucidates the three-dimensional architecture of chromosomes. Hi-C's utility in revealing critical genomic structures such as A/B compartments and chromatin loops is constrained by the resolution of the data, which refers to the granularity of the contact matrix generated from sequencing reads. The resolution challenge is compounded by the quadratic increase in sequencing efforts required for finer resolution, thus escalating the costs. Previous attempts to enhance the resolution of Hi-C data have leveraged deep learning approaches like HiCPlus and HiCNN; however, these methods are often limited by the computational demands and the quantity of high-resolution data needed for training.\n\nIn this context, the authors propose HiCBridge, a novel method that employs a Direct Diffusion Bridge (DDB) to learn the transformation from low to high-resolution Hi-C data. This method is designed to circumvent the shortcomings of conventional deep learning techniques that may result in overly smooth textures or mode collapse. HiCBridge integrates diffusion model-based data augmentation to handle a wider array of real-world data variations, thereby enhancing the model's applicability and robustness. The model's potential to bolster downstream genomic analyses—such as 3D structure matching and loop position reconstruction—positions it as a significant advancement in genomic research, offering a path to high-resolution Hi-C data without the prohibitive costs of extensive sequencing."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "Originality\nThe submission presents a novel approach to enhancing the resolution of Hi-C data through the Direct Diffusion Bridge (DDB), distinguishing itself from prior work that primarily relies on conventional deep learning methods. The originality of the paper lies not just in the application of diffusion models—a relatively recent trend in machine learning—but in the specific formulation of using such models to bridge low-resolution and high-resolution Hi-C data. This creative combination of diffusion processes with genomic data analysis is novel, as it deviates from the usual convolutional neural network (CNN) approaches that dominate the field. \n\nQuality\nThe paper conducts experiments on multiple standard datasets, and presents a good ablation analysis.\n\nClarity\nThe paper is well written. I find it easy to read, the figures along with the captions are appropriate and aid understanding of the paper."
                },
                "weaknesses": {
                    "value": "1. The robustness of the model against various datasets and its performance under different conditions (such as varying levels of input resolution) would need thorough examination.\n2. The paper would benefit from a more detailed comparison with state-of-the-art models. This includes not only performance metrics but also computational efficiency, scalability, and the amount of training data required. \n3. The model's generalizability to different types of Hi-C data, such as those from various species or cells in different states, should be assessed. If the model has only been tested on a narrow range of data, its practical applicability could be limited.\n4. The paper should address the interpretability of the HiCBridge model. Understanding how the model makes its predictions is crucial, particularly in genomic studies where the biological implications of the findings are as important as the findings themselves."
                },
                "questions": {
                    "value": "see weaknesses"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "details_of_ethics_concerns": {
                    "value": "none"
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission3128/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699142494871,
            "cdate": 1699142494871,
            "tmdate": 1699636259538,
            "mdate": 1699636259538,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "2wKymFnHZn",
                "forum": "RUvzlotXY0",
                "replyto": "8HIR1vwe86",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3128/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3128/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Reply to Reviewer jkUa"
                    },
                    "comment": {
                        "value": "Thank you for your detailed feedback and the encouraging comments. Please see the detailed response below.\n\n> Weaknesses 1. The robustness of the model against various datasets and its performance under different conditions (such as varying levels of input resolution) would need thorough examination.\n\nWe conducted a series of experiments to elucidate the generalization abilities of our models. We evaluated standard visual metrics, HiCRep and TAD Insulation score on different resolution (GM12878 from GSM1551551), different cell type (HMEC from GSE63525 and GSM1551610) and another species (CH12-LX from GSE63525 and GSM1551640). In the **Table 12 in Appendix E** of the revised paper, our models also reconstructed visual information and TAD boundaries on all Hi-C datasets. HMEC, with a resolution of about 1/20, poses a noisier dataset than our training data, and CH12-LX, being a mouse lymphoma cell, introduces a cross-species challenge. We supposed that these data shifts might contribute to the variation in SSIM or HiCRep performance in our models. \n\n\n|Method|PCC|SPC|PSNR|SSIM|MSE|SNR|HiCRep|Insulation score|\n|---|---|---|---|---|---|---|:---:|:---:|\n|GM12878$_{GSM1551551}$||||||||||\n|Low resolution|0.807|0.680|14.40|0.292|0.03750|339.3|0.981|4.731|\n|HiCBridge$^+$|0.962|0.897|22.33|0.480|0.00606|846.6|0.980|2.578|\n|HMEC||||||||||\n|Low resolution|0.476|0.397|9.62|0.123|0.10968|172.3|0.850|16.253|\n|HiCBridge$^+$|0.791|0.690|13.16|0.114|0.04894|259.5|0.801|11.344|\n|CH12_LX||||||||||\n|Low resolution|0.690|0.585|13.09|0.324|0.05035|207.8|0.953|10.417|\n|HiCBridge$^+$|0.858|0.709|17.12|0.281|0.02070|336.7|0.852|6.933|\n\n> Weaknesses 2. The paper would benefi from a more detailed comparison with state-of-the-art models. This includes not only performance metrics but also computational efficiency, scalability, and the amount of training data required.\n\nPlease see **General Comments, 2. Computation efficiency**. \n\n> Weaknesses 3. The model's generalizability to different types of Hi-C data, such as those from various species or cells in different states, should be assessed. If the model has only been tested on a narrow range of data, its practical applicability could be limited.\n\nAs explained in the response to In **Weakness 1**, we verified our model’s generalizability at different cell type (HMEC; Human Mammary Epithelial Cells) and different species (CH12-LX; Mouse Lymphoma Cells).\n\n> Weaknesses 4. The paper should address the interpretability of the HiCBridge model. Understanding how the model makes its predictions is crucial, particularly in genomic studies where the biological implications of the findings are as important as the findings themselves.\n\nTo understand how the model handles a given input, we analyzed the attention map of the self-attention module in the first layer of HiCBridge$^+$. As depicted in **Fig.7 in Appendix D** of the revised paper, we observed that each head emphasized a distinct region: head 0 allocates more attention to diagonal bins, head 1 highlights regions slightly off the diagonals, head 2 is dedicated to a 0.5Mb range of bins, and head 3 focuses on bins in more distant regions. Accordingly, our network can understand semantic structure of the contact map, a desired property for Hi-C data processing."
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3128/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700326765204,
                "cdate": 1700326765204,
                "tmdate": 1700378532209,
                "mdate": 1700378532209,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "YMH0dbgaWp",
            "forum": "RUvzlotXY0",
            "replyto": "RUvzlotXY0",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission3128/Reviewer_LnZX"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission3128/Reviewer_LnZX"
            ],
            "content": {
                "summary": {
                    "value": "This paper borrows idea from the Direct Diffusion Bridge that establishing the diffusion process between the clean and corruption for Hi-C data super-resolution. And a diffusion-based data augmentation method is proposed for adapting to the real-world situations. Extensive experiments demonstrate the effectiveness of the proposed method."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. This paper introduces a diffusion-based data augmentation method to alleviate the real-world variation.\n2. Extensive experiments on Hi-C data analysis demonstrate the effectiveness of the proposed method."
                },
                "weaknesses": {
                    "value": "1. The contribution of this paper is limited. The proposed HiCBridge directly borrows idea from the Direct Diffusion Bridge without any improvement. While the proposed diffusion-based data augmentation (Algorithm 1 and 2) is also trivial. It seems like the paper tends to apply the existing method to the new task, but lack of novelty.\n2. It is not clear how the Algorithm 1 can be used to generate the low-resolution data as your target distribution is based on x0 (high-resolution Hi-C data). Please check whether the x0 in Algorithm 1 should be x1.\n3. It seems like the diffusion augmentation is unusable in higher resolution cases for inferior performance, according to the Table 4."
                },
                "questions": {
                    "value": "lease refer to the paper weaknesses."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 5,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission3128/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699172090390,
            "cdate": 1699172090390,
            "tmdate": 1699636259465,
            "mdate": 1699636259465,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "B8usNelHaB",
                "forum": "RUvzlotXY0",
                "replyto": "YMH0dbgaWp",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3128/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3128/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Reply to Reviewer LnZX"
                    },
                    "comment": {
                        "value": "We would like to thank the reviewer for the constructive comments and the thorough feedback. For point-to-point response, see below.\n\n> Weaknesses 1. The contribution of this paper is limited. The proposed HiCBridge directly borrows idea from the Direct Diffusion Bridge without any improvement. While the proposed diffusion-based data augmentation (Algorithm 1 and 2) is also trivial. It seems like the paper tends to apply the existing method to the new task, but lack of novelty.\n\nPlease see **General Comments, 1. Difference from original methods** along with the revised paper. We highlight that we found the optimal combination of DDB and diffusion for Hi-C enhancement task, which cannot be regarded as trivial given the importance of the Hi-C data processing.\n\n> Weaknesses 2. It is not clear how the Algorithm 1 can be used to generate the low-resolution data as your target distribution is based on x0 (high-resolution Hi-C data). Please check whether the x0 in Algorithm 1 should be x1.\n\nThanks for pointing out the typo. We have fixed our Algorithm 1 accordingly. \n\n> Weaknesses 3. It seems like the diffusion augmentation is unusable in higher resolution cases for inferior performance, according to the Table 4.\n\nIf our interpretation of the reviewer's comment is accurate, the aim is to clarify the subpar performance of HiCBridge$^+$ at extremely low resolutions (1/50 and 1/100). As highlighted in the **General Comments, 3. Robustness to data biases**, our analysis suggests that biased data augmentation holds the potential to compromise the model's generalization. While the incorporation of generated low-resolution data contributes to the overall generalization of HiCBridge, an excessive bias with such data may lead to a deterioration in HiCBridge$^+$'s performance across diverse Hi-C datasets. It is crucial to note that the data compared in Table 4 of our paper consists of downsampled data rather than real low-resolution data, presenting a distribution distinct from the one the model was trained on [1]. This finding offers a plausible explanation for the observed reduction in the generalizability of HiCBridge$^+$ compared to HiCBridge, especially at extremely low-resolution settings.\n\n[1] A comprehensive evaluation of generalizability of deep-learning based Hi-C resolution improvement methods, Murtaza et al., Biorxiv, 2022"
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3128/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700326541094,
                "cdate": 1700326541094,
                "tmdate": 1700378212942,
                "mdate": 1700378212942,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "Z0z6KtOCIH",
                "forum": "RUvzlotXY0",
                "replyto": "YMH0dbgaWp",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3128/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3128/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Dear Reviewer LnZX"
                    },
                    "comment": {
                        "value": "As the deadline for the Reviewer-Author discussion phase is fast approaching (there is only a day left), we respectfully ask whether we have addressed your questions and concerns adequately."
                    }
                },
                "number": 10,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3128/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700555042430,
                "cdate": 1700555042430,
                "tmdate": 1700555042430,
                "mdate": 1700555042430,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "8uW9SU9I91",
                "forum": "RUvzlotXY0",
                "replyto": "YMH0dbgaWp",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3128/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3128/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Dear Reviewer LnZX"
                    },
                    "comment": {
                        "value": "Dear reviewer LnZX,\n\nThis is a kind reminder as the deadline is imminent.  We believe that we have addressed the concerns that you have raised. Specifically,\n\n1. We have distinguished our work from previous papers by finding a proper combination of diffusion model and direct diffusion bridge for Hi-C enhancement to establish an effective and efficient framework.\n\n2. We have corrected Algorithm 1, which was incorrectly stated.\n\n3. We have explained that HiCBridge$^+$ underperforms at extremely low resolutions. An experiment in **Table 11 in Appendix B** showed that diffusion augmentation can suffer performance degradation due to shifts in the data distribution.\n\nWe would like to gently remind you that the end of the discussion period is imminent. We would appreciate it if you could let us know whether our comments addressed your concerns.\n\nBest regards, Authors"
                    }
                },
                "number": 12,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3128/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700706119874,
                "cdate": 1700706119874,
                "tmdate": 1700717819098,
                "mdate": 1700717819098,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]