[
    {
        "title": "CSI: Enhancing the Robustness of 3D Point Cloud Recognition against Corruption"
    },
    {
        "review": {
            "id": "J3EjZ1qIB0",
            "forum": "S1qSHSFOew",
            "replyto": "S1qSHSFOew",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission1942/Reviewer_Jv1W"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission1942/Reviewer_Jv1W"
            ],
            "content": {
                "summary": {
                    "value": "This paper introduce the CSI, which incorporates DAS and SEM to find the essential subset of the point cloud for representation learning. This improves the model's robustness against data corruption."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "- The focused topic is crucial for real-world applications of point clouds.\n- The introduced SEM demonstrates its effectiveness."
                },
                "weaknesses": {
                    "value": "- The novelty of the proposed density-aware sampling may be limited as similar ideas have already been explored by previous methods [1,2], but the authors do not provide any comparisons with them.\n- The writing is hard to read and follow. For example,\n    - Too many sentences that are too long.\n    > Similarly, in medical imaging, where point cloud data aids in 3D reconstructions from MRI or CT scans, the presence of artifacts, noise, and incomplete data — arising from limited resolution, patient movement, or implants — poses substantial challenges.\n    > \n    > By studying the robustness among various 3D architectures including PointNet (Charles et al., 2017), PointNet++ (Qi et al., 2017), DGCNN (Wang et al., 2019), etc., they revealed that Transformers, specifically PCT (Guo et al., 2021), can significantly enhance the robustness of point cloud recognition.\n    - Inconsistent usage of section references. For instance, Section 3.2 (SELF -ENTROPY MINIMIZATION) uses different references like $\\S 3.1$, $\\S 1$, and *Section 2*; $d_a$ and $d_e$ in equation 4.\n- The performance is not satisfactory. It over claims to \"significantly outperform state-of-the-art methods by 5.2% and 4.2% on the respective benchmarks.\" This also weakens the motivation, as the authors believe that the data augmentation is inadequate in countering data corruption, leading to the proposal of CSI. However, it turns out that CSI performs worse than certain data augmentation techniques.\n    - In Table 1, `PCT+CSI` achieves an ER of 18.4 in ModelNet40-C, which is clearly inferior to `PCT+PointCutMix-R` (16.3) and `PCT+PointCutMix-K` (16.5). These two configurations are from the method [3] that originally introduces the ModelNet40-C dataset. I observe that the authors perform the experiment with `PCT+PointCutMix-R+CSI` in Table 2, but the comparison is unfair because it involves comparing `A+B+C` against `A+B`, and the overall improvement is minimal (0.4%).\n    - Similar observations can be found in Table 2 of the Appendix, where `PCT+PointCutMix-R+CSI` fails to outperform `PCT+WOLFMix`.\n\n---\nReferences:\n\n[1]: Pointwise Rotation-Invariant Network with Adaptive Sampling and 3D Spherical Voxel Convolution. AAAI 2020.\n\n[2]: Density-adaptive Sampling for Heterogeneous Point Cloud Object Segmentation in Autonomous Vehicle Applications. CVPRW 2019.\n\n[3]: Benchmarking Robustness of 3D Point Cloud Recognition Against Common Corruptions."
                },
                "questions": {
                    "value": "1. Did the authors try using `PCT+DAS` in Table 1? It would be more illustrative to include this result.\n2. I am still confused about how SEM works. The authors mention that \"Applying SEM to the row-wise embeddings in S amplifies the importance of the most crucial point-level feature corresponding to feature row i.\" Can the authors provide visualizations of attention maps to show which areas of the point cloud are salient?\n3. Why did the authors suddenly switch to using mOA as a metric in Table 2 of the Appendix instead of ER?\n4. Have the authors tried using the mCE metric from PointCloud-C [4] to directly compare the results of this paper with those in [4]?\n\n---\nReferences:\n\n[4]: Benchmarking and Analyzing Point Cloud Classification under Corruptions."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission1942/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission1942/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission1942/Reviewer_Jv1W"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission1942/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1697686264872,
            "cdate": 1697686264872,
            "tmdate": 1699636125515,
            "mdate": 1699636125515,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "8Kn7TQDfFZ",
                "forum": "S1qSHSFOew",
                "replyto": "J3EjZ1qIB0",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1942/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1942/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "We are glad that the reviewer found our topic crucial for real-world applications of point clouds and our method effective. We appreciate the opportunity to address the points you have raised.\n\n>The novelty of the proposed density-aware sampling may be limited as similar ideas have already been explored by previous methods [1,2], but the authors do not provide any comparisons with them.\n\nWe appreciate the reviewer’s concerns regarding the novelty of our proposed Density-Aware Adaptive Sampling (DAS) and the challenges in directly comparing it with methods presented in references [1] and [2]. The method in [1] fundamentally differs from ours in terms of output format and integration with subsequent processing layers. Specifically, our DAS outputs a format of (S, S, H) and is intricately linked with spherical voxel convolution layers, making it incompatible as a direct replacement for FPS or DAS in PCT architectures. Therefore, a direct comparison is not feasible due to these structural and functional differences.\n\nRegarding the method in [2], we faced the challenge of no open-sourced code being available. Despite this, we endeavored to reproduce their method to the best of our ability. Due to time constraints, we implemented a version of Grid Density Sampling (GDS) with a grid size of 8, as larger grid sizes would have necessitated significantly longer training times. The results of this implementation are presented:\n\n|ModelNet40-C | mER| Occlusion | Lidar | Density Inc. | Density Dec. | Cutout | Uniform\tGaussian |\tImpulse\tUpsampling\t| Background |\tRotation |\tShear |\tFFD |\tRBF |\tInv. RBF|\n|-| ---| --------- | ----- | ------------ | ------------| ------ | ---------------- | -------------------   | ------------ | --------- | -------| --- | ------| -----| \nPCT+CSI (GDS)| 21.96| 54.54 |\t59.85 |\t11.46 |\t14.4 |\t13.1 |\t11.65 |\t11.3 |\t22.43 |\t13.48 |\t45.28 |\t19.04 |\t14.6 |\t13.32 |\t12.58 |\t12.46 |\nPCT+CSI (DAS) | 18.38 | 56.23 |\t60.2 |\t12.37 |\t12.73 |\t11.97 | 10.83 |\t10.73 |\t12.3 |\t11.63 |\t11.19 |\t17.41 |\t11.98 |\t12.05 |\t12.41 |\t11.65 |\n\n|PointCloud-C |mCE| Scale | Jitter | Drop-G | Drop-L | Add-G | Add-L | Rotate |\n|-| --| ----- | ------ | ------ | ------ | ----- | -----| ------ |\nPCT+CSI (GDS) | 0.996 | 1.17 |\t0.528 |\t0.815 |\t1.043 |\t1.166 |\t1.244 |\t1.009 |\n|PCT+CSI| 0.757| 1.128 | 0.472 | 0.56 | 0.889 |0.329 | 0.924 | 0.995 |\n\nWhile it is true that the underlying motivation of our DAS may share similarities with these previous works, the implementation and the operational context significantly differ. A key distinction of our DAS is that it is not a grid-based approach, unlike GDS. We believe that grid-based operations can potentially disrupt the inherent structure of point clouds. Our ablation studies on ModelNet40-C and PointCloud-C demonstrate that our non-grid-based approach is more effective, supporting the unique contribution and novelty of our DAS methodology in preserving the integrity of point cloud structures while enhancing sampling efficiency.\n\n>The writing is hard to read and follow. For example, too many sentences that are too long, inconsistent usage of section references.\n\nWe greatly appreciate your feedback regarding the readability of our manuscript. We recognize that clear and accessible writing is crucial for effective communication of our research. To address your concerns, we will undertake a comprehensive review of the manuscript to simplify and shorten complex sentences, ensuring they are more reader-friendly. Additionally, we will systematically revise the usage of section references to maintain consistency throughout the text. Our goal for the final version is to enhance overall clarity and ease of reading, making our research more accessible to a broader audience. We are committed to improving these aspects to ensure our work is communicated as clearly and effectively as possible."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1942/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700538033773,
                "cdate": 1700538033773,
                "tmdate": 1700538033773,
                "mdate": 1700538033773,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "C2IbHUEGmL",
                "forum": "S1qSHSFOew",
                "replyto": "4bD6VJOahO",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1942/Reviewer_Jv1W"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1942/Reviewer_Jv1W"
                ],
                "content": {
                    "comment": {
                        "value": "I appreciate the authors' rebuttal. Here is my response.\n\n> The novelty of the proposed density-aware sampling may be limited as similar ideas have already been explored by previous methods [1,2], but the authors do not provide any comparisons with them.\n\nAlthough the usage or architecture differs between [1] and this paper, the authors may provide comparisons on the motivation or working mechanism in theory. Additionally, I would like to appreciate the discussions provided on the method in [2].\n\n> The performance is not satisfactory. \n\nThis paper (`PCT+CSI`) is clearly inferior to `PCT+data_aug` in both ModelNet40-C and PointCloud-C, which hinders its contribution.\n\n| ModelNet40-C | ER |\n| -- | -- |\n|PCT | 25.5 |\n|PCT+CSI | 18.4 |\n|PCT+RSMix | 17.3 |\n|PCT+PointCutMix-K | 16.5 |\n|PCT+PointCutMix-R | 16.3 |\n\n| PointCloud-C  | mCE   | Scale | Jitter | Drop-G | Drop-L | Add-G | Add-L | Rotate|\n| ------------- | ----- | ----- | ------ | ------ | ------ | ----- | ----- | ------|\n| PCT           | 0.925 | 0.872 | 0.870  | 0.528  | 1.000  | 0.780 | 1.385 | 1.042 |\n| PCT+CSI       | 0.757 | 1.128 | 0.472  | 0.56   | 0.889  | 0.329 | 0.924 | 0.995 |\n| PCT+WOLFMix   | 0.574 | 1.000 | 0.854  | 0.379  | 0.493  | 0.298 | 0.505 | 0.488 |\n\nIn addition, the authors claim that the major limitation of data augmentation is that different data augmentation techniques have varying degrees of effectiveness against distinct types of corruption. However, according to table 2, we observe that `PCT+WOLFMix` consistently enhances the original `PCT` across all types of corruption except for Scale. On the other hand, `PCT+CSI` fails to improve performance in both Scale and Drop-G. This finding further weakens the authors' motivation."
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1942/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700649680311,
                "cdate": 1700649680311,
                "tmdate": 1700649680311,
                "mdate": 1700649680311,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "W68tD749Eb",
            "forum": "S1qSHSFOew",
            "replyto": "S1qSHSFOew",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission1942/Reviewer_sAPs"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission1942/Reviewer_sAPs"
            ],
            "content": {
                "summary": {
                    "value": "The paper presents an important contribution addressing the challenge of robustness in 3D point cloud recognition. The proposed CSI method shows promising results and demonstrates improvements over existing methods. The authors propose a novel critical subset identification (CSI) method that utilizes the set property of point cloud data to enhance recognition robustness. The CSI framework consists of two components: density-aware sampling (DAS) and self-entropy minimization (SEM), which cater to static and dynamic CSI, respectively. Experimental results show that the CSI approach outperforms state-of-the-art methods on corruption robustness benchmarks."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "(1). The paper introduces a novel method, CSI, to enhance the robustness of 3D point cloud recognition against data corruption. This is an innovative and practical contribution that addresses an important challenge in the field.\n\n\n(2). The CSI framework incorporates two components, DAS and SEM, which provide a comprehensive approach to critical subset identification. The combination of these two techniques allows for both static and dynamic CSI, improving the robustness of recognition models in different scenarios.\n\n\n(3). The paper presents thorough evaluations of the proposed CSI method on two corruption robustness benchmarks. The experimental results demonstrate significant improvements over state-of-the-art methods, validating the effectiveness of the approach."
                },
                "weaknesses": {
                    "value": "(1). The paper could improve the clarity of exposition. Some parts of the paper, particularly in the methodology section, are not explained in a clear and concise manner, which may impede the reader's understanding.\n\n(2). The paper could benefit from more detailed evaluation and ablation studies. While the experimental results show the superiority of the CSI method, it would be valuable to have a more in-depth analysis of its performance and a comparison with widely-known baselines in the field."
                },
                "questions": {
                    "value": "I think the method proposed in ModelNet40-C and PointCloud-C should also be compared and analyzed."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "details_of_ethics_concerns": {
                    "value": "/NA"
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission1942/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission1942/Reviewer_sAPs",
                        "ICLR.cc/2024/Conference/Submission1942/Senior_Area_Chairs"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission1942/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698276012925,
            "cdate": 1698276012925,
            "tmdate": 1700717960273,
            "mdate": 1700717960273,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "ygZFzD1YJT",
                "forum": "S1qSHSFOew",
                "replyto": "W68tD749Eb",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1942/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1942/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "We are glad that the reviewer found our method has demonstrated improvements. We appreciate the opportunity to address the points you have raised.\n\n>The paper could improve the clarity of exposition. Some parts of the paper, particularly in the methodology section, are not explained in a clear and concise manner, which may impede the reader's understanding.\n\nWe appreciate the feedback on the clarity of our exposition, especially in the methodology section. We understand that clear and concise communication is crucial for the reader's comprehension. To address this, we will undertake a thorough revision of our manuscript, with a specific focus on enhancing the clarity and conciseness of the methodology section. We aim to ensure that our final version presents our methods and findings in a more accessible and understandable manner. This revision will include refining complex explanations, simplifying technical jargon where possible, and providing additional context or examples to facilitate better understanding.\n\n>The paper could benefit from more detailed evaluation and ablation studies. While the experimental results show the superiority of the CSI method, it would be valuable to have a more in-depth analysis of its performance and a comparison with widely-known baselines in the field.\n\nThank you for the constructive feedback. We acknowledge the importance of in-depth analysis and comprehensive comparisons in our research. Although our experimental section already evaluates numerous baselines within this domain, we understand the need for deeper insights into the performance of the CSI method. In light of your suggestions, we will expand our analysis to include more detailed evaluations and additional ablation studies. These enhancements will focus on a finer comparison with well-established baselines in the field, and on dissecting the individual contributions and impacts of the various components of the CSI method. Our aim is to provide a clearer, more comprehensive understanding of why and how CSI demonstrates superiority over these baselines, thereby enriching the overall value and contribution of our work to the field.\n\n\n>I think the method proposed in ModelNet40-C and PointCloud-C should also be compared and analyzed.\n\nThank you for emphasizing the importance of comparative analysis with ModelNet40-C and PointCloud-C. We have indeed conducted such comparisons and included them in our manuscript. Specifically, Table 1 in the main text and Tables 1 and 2 in the appendix present a comprehensive comparison of our method against others mentioned in the original papers of ModelNet40-C and PointCloud-C. These tables detail the performance metrics and demonstrate how our method stacks up against existing methods under similar conditions. We believe this thorough comparison effectively illustrates the strengths and limitations of our proposed approach in the context of these well-established datasets."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1942/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700537938316,
                "cdate": 1700537938316,
                "tmdate": 1700537938316,
                "mdate": 1700537938316,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "hJuNbpo1Ky",
                "forum": "S1qSHSFOew",
                "replyto": "ygZFzD1YJT",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1942/Reviewer_sAPs"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1942/Reviewer_sAPs"
                ],
                "content": {
                    "comment": {
                        "value": "I have reviewed all the feedback from the reviewers, and I believe that the newly added results currently provide sufficient support for the author's claim. As a result, I am upgrading my rating."
                    }
                },
                "number": 11,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1942/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700717934755,
                "cdate": 1700717934755,
                "tmdate": 1700717934755,
                "mdate": 1700717934755,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "kjKIe16PfT",
            "forum": "S1qSHSFOew",
            "replyto": "S1qSHSFOew",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission1942/Reviewer_xKH7"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission1942/Reviewer_xKH7"
            ],
            "content": {
                "summary": {
                    "value": "This article proposes a critical subset identification (CSI) method for bolstering recognition robustness in the face of data corruption, which consists of two parts: density-aware sampling (DAS) and self-entropy minimization (SEM). DAS uses local density weighting to better sample point cloud data. During the training process, SEM introduces an optimization strategy of entropy minimization to the significance value calculated by self-attention, which improves the model's attention to points with higher significance values . The authors subsequently conducted experiments on two corruption benchmarks: ModelNet40-c and PointCloud-c, proving that their method can effectively improve the robustness of the point cloud transformer (PCT) model while ensuring performance on clean data sets."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "- This paper is well-written, especially Section 3 providing clear and easily understandable explanations of the CSI framework.\n- The idea of introducing Entropy minimization in Self-Attention Modules is simple and effective, and it integrates the significance values of different points into the model training process.\n- The experiments are extensive in terms of implemented models. Especially the exploration of the impact of hyperparameters in the ablation study demonstrates the key parameters that affect the method."
                },
                "weaknesses": {
                    "value": "- The proposed method is somehow ad-hoc, with the authors needing to specify that DAS is only suitable for models including sampling&aggregation module. Also the justification for the proposed method is not well established, with the motivations being weak.\n- The experiments on CSI are not persuasive enough, from the method comparison to the diversity of datasets. The authors should consider comparing with other train-time point cloud robust methods. The selected datasets are all derived from ModelNet40, indicating a lack of experimental diversity."
                },
                "questions": {
                    "value": "1. Please explain the statement “local density of a point positively correlated with its significance”? Previous work has indicated that significant points are usually outward points in the point cloud, which are generally sparse[1]. Also, traditional sampling methods like FPS tend to find points with low density as representations.\n2. The authors should compare with other SOTA train-time methods under the same settings in the main experiment, such as data augmentation or modules addition to the model.\n3. The authors present the SEM method for Global Feature in Table 5. Given that the authors are making a critical point selection, what is the purpose of this?\n4. The experiments should consider including datasets not based on ModelNet40.\n5. Tables 1 and 2 in Supplementary show that CSI cannot effectively handle point dropping (e.g., occlusion) and transformations (e.g., rotation), and may even be harmful. Does this indicate the limitations of CSI in terms of generalizability? Therefore, the reviewer points out that the results derived from the ModelNet40-C can be misleading.\n\n[1] Zheng, Tianhang, et al. \"Pointcloud saliency maps.\" Proceedings of the IEEE/CVF International Conference on Computer Vision. 2019."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission1942/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698660961911,
            "cdate": 1698660961911,
            "tmdate": 1699636125372,
            "mdate": 1699636125372,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "szjETrRZao",
                "forum": "S1qSHSFOew",
                "replyto": "kjKIe16PfT",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1942/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1942/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "We are glad that the reviewer found our study valuable to this field and that our method was simple yet effective. We appreciate the opportunity to address the points you have raised.\n>Please explain the statement “local density of a point positively correlated with its significance”? Previous work has indicated that significant points are usually outward points in the point cloud, which are generally sparse[1]. Also, traditional sampling methods like FPS tend to find points with low density as representations.\n\nThe observation that significant points are predominantly located at the outer regions of the point cloud does not hold true in scenarios involving data corruption, as demonstrated in Figure 3. In such cases, Farthest Point Sampling (FPS) tends to retain an excessive number of noisy data points. This limitation of FPS is a key motivator for our proposal of the Density-Aware Sampling (DAS) method. DAS is specifically designed to mitigate the adverse effects caused by FPS, particularly its tendency to sample a higher number of noisy points in the presence of various forms of corruption, such as background noise and global noise.\n>The authors should compare with other SOTA train-time methods under the same settings in the main experiment, such as data augmentation or modules addition to the model.\n\nWe acknowledge the suggestion to benchmark our approach against other state-of-the-art (SOTA) train-time methods under equivalent experimental conditions, including factors like data augmentation and module additions. In response, we direct attention to Table 2 in the main manuscript, which provides a comprehensive comparison where all evaluated methods, including ours, are integrated with the data augmentation technique PointCutMix-R. Additionally, for a more extensive comparison, Table 2 in the supplementary material, ranging from the entry 'DGCNN+OcCo' to 'PCT+CSI+PointCutMix-R', offers a detailed analysis of various other train-time methods. This inclusion ensures a thorough and fair evaluation of our method against current SOTA techniques under consistent experimental settings.\n>The authors present the SEM method for Global Feature in Table 5. Given that the authors are making a critical point selection, what is the purpose of this?\n\nThe incorporation of the SEM method for the global feature, as detailed in Table 5, is intended as an additional ablation study. Similar to the critical point selection process, the application of SEM is designed to enhance the distinctiveness of global features. The experiments presented in Table 5 investigate the individual and combined effects of critical point selection and SEM application. Our findings indicate that while applying SEM to both local and global features yields performance improvements, the point-level selection demonstrates a more significant benefit. This comparison underscores the unique contribution of each technique to the overall model performance.\n>The experiments should consider including datasets not based on ModelNet40.\n\nIn addressing the recommendation to include datasets beyond ModelNet40 in our experiments, we emphasize our focus on point cloud recognition within this work. ModelNet40, along with its two corrupted variants, ModelNet40-C and PointCloud-C, are extensively recognized and employed in related research. These datasets are particularly relevant and suitable for the objectives of our study. Our decision to utilize these datasets is grounded in their widespread acceptance in the field, ensuring that our findings are comparable and relevant to current standards in point cloud recognition research.\n>Tables 1 and 2 in Supplementary show that CSI cannot effectively handle point dropping (e.g., occlusion) and transformations (e.g., rotation), and may even be harmful.\n\nWe appreciate the reviewer's observation regarding the performance of CSI under conditions of point dropping and transformations, as shown in Tables 1 and 2 of the supplementary material. We acknowledge that these results may highlight a limitation in the generalizability of the CSI approach, particularly in handling occlusions and rotations. This limitation is indeed an area that warrants further investigation and improvement in future iterations of our work. Regarding the use of ModelNet40-C, we understand the concern that the results derived from this dataset might present a skewed perspective. We will consider this point critically in our analysis and discussion, ensuring that we clearly communicate the potential limitations of our findings in the context of different datasets and conditions. However, we argue that it is hard for a method to cure all corruption types. This feedback is invaluable for guiding our ongoing research efforts to refine and enhance the robustness and applicability of our approach."
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1942/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700537890114,
                "cdate": 1700537890114,
                "tmdate": 1700537890114,
                "mdate": 1700537890114,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "l18tbWvK8J",
                "forum": "S1qSHSFOew",
                "replyto": "kjKIe16PfT",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1942/Reviewer_xKH7"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1942/Reviewer_xKH7"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you to the authors for providing new experimental results and additional interpretations. However, some concerns remain unaddressed.\n\n> These datasets are particularly relevant and suitable for the objectives of our study.\n\nModelNet40-C and Point Cloud-C might be insufficient due to significant overlaps in these datasets, such as the \"add global\" in Point Cloud-C and the \"background\" in ModelNet40-C. The authors might consider incorporating a wider variety of noise datasets to strengthen the argument.\n\n>  Table 2 in the supplementary material, ranging from the entry 'DGCNN+OcCo' to 'PCT+CSI+PointCutMix-R', offers a detailed analysis of various other train-time methods...\n\nThe additional data provided by the authors are greatly appreciated. However, these data suggest that the pure CSI method does not outperform methods with data augmentation (PCT+CSI v.s. PCT+WOLFMix), and even the enhanced version (PCT+ CSI +PointCutMix-R) fails to achieve the best results.\n\nFinally, I understand and agree with the authors' statement that it is challenging for a method to address all types of corruption. The suggestion is for the authors to focus on specific types of corruption to further explore and demonstrate the unique capabilities of CSI."
                    }
                },
                "number": 8,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1942/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700669525669,
                "cdate": 1700669525669,
                "tmdate": 1700669547954,
                "mdate": 1700669547954,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "9xzN5orlG5",
            "forum": "S1qSHSFOew",
            "replyto": "S1qSHSFOew",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission1942/Reviewer_WsBz"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission1942/Reviewer_WsBz"
            ],
            "content": {
                "summary": {
                    "value": "The paper proposes a \"critical subset identification (CSI)\" framework for robust point cloud perception, which comprises 1) a new point sampling strategy \"density-aware sampling (DAS)\" that locates high-density point areas for anchors, and 2) a new optimization objective \"self-entropy minimization (SEM)\" that encourage high-confidence predictions."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "1. The two proposed techniques are clear and reasonable to me and design choices are backed up by concrete examples. Figure 3. shows a concrete example where Farthest Point Sampling and Random Sampling fail and the new Density-Aware sampling succeeds. Both techniques should be easy to implement in practice.\n\n2. The ablation studies are thorough in the paper. It helps to understand the effect of the neighbor number k in DAS and the layer position of the SEM loss. \n\n3. A significant all-around robustness improvement is achieved. As shown in the supplementary table, the model gains better robustness to not only global noise injection but also various other types of corruption."
                },
                "weaknesses": {
                    "value": "1. SEM is mostly based on previous knowledge that entropy minimization helps classification robustness, which slightly undermines the significance of the proposed techniques. Nonetheless, the paper provides a detailed discussion of how entropy minimization should be applied to transformer-based point classifiers in both attention layers and the classification head, accompanied by sufficient ablation studies.\n\n2. It is not clear how general DAS is and how it affects the classifier's robustness to more types of corruptions other than global noise addition shown in Figure 3. Table 1 and Table 2 in the supplementary material ablate CSI as a whole so they can not show the effect of DAS. It would be better if DAS could be individually studied on different types of corruption.\n\n---\n\nminor suggestion\n\nThe title could be more informative in my opinion. It might be better to use \"critical subset identification\" in replace of \"CSI\"."
                },
                "questions": {
                    "value": "Please address the questions in the weakness section."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission1942/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698745464351,
            "cdate": 1698745464351,
            "tmdate": 1699636125296,
            "mdate": 1699636125296,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "K5saNv4kJD",
                "forum": "S1qSHSFOew",
                "replyto": "9xzN5orlG5",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission1942/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission1942/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "We are glad that the reviewer found our method effective. We appreciate the opportunity to address the points you have raised.\n>SEM is mostly based on previous knowledge that entropy minimization helps classification robustness, which slightly undermines the significance of the proposed techniques. Nonetheless, the paper provides a detailed discussion of how entropy minimization should be applied to transformer-based point classifiers in both attention layers and the classification head, accompanied by sufficient ablation studies.\n\nAlthough previous work has investigated how entropy minimization helps classification robustness, in their works, they merely investigated how to minimize entropy during inference. For example, tent [1] minimizes Shannon Entropy on classification logits through several iterations. The biggest difference is that we give a thorough analysis of how to apply entropy minimization during training and which features contribute most by conducting ablation studies not only on transformer self-attention maps but also on intermediate features.\n\n[1] Wang, Dequan, et al. \"Tent: Fully test-time adaptation by entropy minimization.\" arXiv preprint arXiv:2006.10726 (2020).\n\n>It is not clear how general DAS is and how it affects the classifier's robustness to more types of corruptions other than global noise addition shown in Figure 3. Table 1 and Table 2 in the supplementary material ablate CSI as a whole so they can not show the effect of DAS. It would be better if DAS could be individually studied on different types of corruption.\n\nMore visualization results are available in the appendix of our revised manuscript. One can observe the effectiveness of DAS compared with FPS (Farthest Point Sampling) and RS (Random Sampling). Besides, our quantitative experimental results have also validated that DAS has outperformed other baseline methods in improving corruption robustness."
                    }
                },
                "number": 1,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission1942/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700537720615,
                "cdate": 1700537720615,
                "tmdate": 1700537720615,
                "mdate": 1700537720615,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]