[
    {
        "title": "The Convergence of Variance Exploding Diffusion Models under the Manifold Hypothesis"
    },
    {
        "review": {
            "id": "uThbhj8FAu",
            "forum": "tD4NOxYTfg",
            "replyto": "tD4NOxYTfg",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission5363/Reviewer_A2uB"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission5363/Reviewer_A2uB"
            ],
            "content": {
                "summary": {
                    "value": "The paper proposes and studies the convergence of a variance-exploding diffusion model by introducing a small drift term and manifold hypothesis, and proves a faster exponential rate. The paper is mainly theoretical, and also includes numerical experiments to corroborate the theory."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "The paper proposes a new variance exploding diffusion model, and proves under the manifold hypothesis that the underlying algorithm converges faster. The paper is mostly well written, and I enjoyed reading it. I have also checked part of the proofs, and they seem to be correct."
                },
                "weaknesses": {
                    "value": "There are several weaknesses of this paper:\n\n(1) It was claimed in the introduction that the underlying algorithm converges at rate $\\exp(-T)$. However, upon looking at Theorem 2, there is a term which is linear in $T$ (under the Wasserstein distance). The authors may comment and explain this \"discrepancy\" -- otherwise it seems to be that the abstract is exaggerated. \n\n(2) As the authors pointed out themselves, the analysis is similar to De Bortoli (2022). I understand that the technicality comes from analyzing the \"tangent\" process to avoid $\\exp(T)$ term. The authors may highlight/summary the novelty earlier in the introduction. \n\n(3) In most theorems/corollaries, the authors distinguish \"aggressive\" $\\beta_t = t^2$, and \"conservative\" $\\beta_t$'s (e.g. $\\beta_t = t$). I wonder if there is some \"phase transition\" at exponent $2$ (i.e. $\\beta_t = t^\\alpha$ with $\\alpha < 2$ and $\\alpha = 2$). The authors may comment on this point. \n\n(4) Now all the experiments are deferred to appendix. I feel that the authors may lift some of experiments to the main text. (and put some proof techniques to appendix.)"
                },
                "questions": {
                    "value": "See the weaknesses."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "details_of_ethics_concerns": {
                    "value": "NA"
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission5363/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission5363/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission5363/Reviewer_A2uB"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission5363/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698713673003,
            "cdate": 1698713673003,
            "tmdate": 1700603539057,
            "mdate": 1700603539057,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "tgijleu0PI",
                "forum": "tD4NOxYTfg",
                "replyto": "uThbhj8FAu",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5363/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5363/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for your valuable comments and suggestions. We provide our response to each question below.\n\n**Weakness 1. The discussion on the faster forward convergence $\\exp{(-T)}$ and $\\operatorname{Poly}(T)\\\\bar{\\gamma}_K$ term.** \n\nWhen discussing the faster convergence rate of our new forward process, we focus on the reverse beginning error term, which corresponds to the forward process, instead of the discretization error term. As shown in Section 5, a faster forward convergence guarantee is important to balance different error sources and achieve great sample complexity.\n\nFor the $\\operatorname{Poly}(T)\\bar{\\gamma}_K$ term, which corresponds to the discretization scheme and smallest stepsize $\\bar{\\gamma}_K$, we can choose small enough stepsize to eliminate the influence of $\\operatorname{Poly}(T)$. Furthermore, $\\operatorname{Poly}(T)\\bar{\\gamma}_K$ term for the discretization terms is widely appeared in the literature (Theorem 1 of [1] under the  Wasserstein distance; Theorem 2 of [2] under the TV distance). We note that under the choice of $T$ and $\\bar{\\gamma}_K$ in Corollary 2 of [1], the first discretization term of Theorem 1 in [1] depends on $T^2 \\sqrt{\\bar{\\gamma}_K}$.\n\nWe have now made the definition of the faster convergence rate clearer in the abstract in the revision of our paper (highlighted in green).\n\n**Weakness 2. The technique novelty.** \n\nThanks for your helpful comments. We have now summarized the technique novelty for controlling the tangent process to avoid the $\\exp(T)$ term by using the exploding variance property of VESDE at the end of Section 1  in the revision of our paper (highlighted in green).\n\n**Weakness 3. Transition situation $\\beta_t = t^{\\alpha_1}, \\alpha_1\\in [1,2]$ between conservative $t$ and the most aggressive $t^2$.** \n\nWe use $\\tau  = T^2$ as an example and discuss the influence of different $\\beta_t =t^{\\alpha_1}, \\alpha_1\\in [1,2]$ for the forward and reverse process. For the forward process, the \"phase transition\" appears at $1+\\ln(T-\\ln(T))/\\ln(T)$. When $\\alpha_1 \\geq 1+\\ln(T-\\ln(T))/\\ln(T)$ is aggressive, the forward convergence rate is faster than $\\exp(-T)$, which means the influence of $T$ is logarithmic factors and achieve great balance in reverse SDE (Section 5). For the analysis of the unified tangent-based framework, as discussed in section 6, whether $\\alpha_1$ can be aggressive depends on the form of the reverse process.\n\nWe have now added more details and discussion about the different phases of $\\alpha_1$ in Section 4 in the revision of our paper (highlighted in green).\n\n**Weakness 4: The additional synthetic experiments..** \n\nThanks for your helpful comments. We use pure VESDE as a baseline and add more synthetic experiments in the main text to show the advantage of our new forward process with aggressive and conservative drift terms. More specifically, For aggressive drift VESDE, we show that the new process balances the different error sources. For conservative drift VESDE, we further consider the approximated score function and show that the conservative drift VESDE can improve the quality of generated distribution without training. More specifically, the conservative drift VESDE directly uses the models training by pure VESDE and reduces the influence of the large data mean and variance to obtain better images. We verify this phenomenon in different sampling methods (Euler-Maruyama method for reverse SDE and RK45 for PFODE), different $T$, and different synthetic datasets. We also calculate the KL divergence between the generated distribution and the original distribution to support our augmentation.\n\nWe have now added more experiment results and discussion about the advantages of our new process in Section 7 and Appendix F in the revision of our paper (highlighted in green).\n\n\n\n[1] Valentin De Bortoli. Convergence of denoising diffusion models under the manifold hypothesis. Trans. Mach. Learn. Res., 2022, 2022. URL https://openreview.net/forum?id=MhK5aXo3gB.\n\n[2] Sitan Chen, Sinho Chewi, Jerry Li, Yuanzhi Li, Adil Salim, and Anru Zhang. Sampling is as easy as learning the score: theory for diffusion models with minimal data assumptions. In The Eleventh International Conference on Learning Representations, ICLR 2023, Kigali, Rwanda, May 1-5, 2023. OpenReview.net, 2023d. URL https://openreview.net/pdf?id=zyLVMgsZ0U_."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5363/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700238912300,
                "cdate": 1700238912300,
                "tmdate": 1700238912300,
                "mdate": 1700238912300,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "g5tQKIyWSz",
                "forum": "tD4NOxYTfg",
                "replyto": "uThbhj8FAu",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5363/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5363/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Dear Reviewer A2uB:\n\nWe thank you once again for your careful reading of our paper and your constructive comments and suggestions. We will appreciate it very much if you could let us know whether all your concerns are addressed. We are also more than happy to answer any further questions in the remaining discussion period.\n\nBest, Authors."
                    }
                },
                "number": 8,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5363/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700463418926,
                "cdate": 1700463418926,
                "tmdate": 1700463418926,
                "mdate": 1700463418926,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "Xr1fZhGzrq",
                "forum": "tD4NOxYTfg",
                "replyto": "g5tQKIyWSz",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5363/Reviewer_A2uB"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5363/Reviewer_A2uB"
                ],
                "content": {
                    "comment": {
                        "value": "I thank the authors for the detailed response. The score is increased to 6."
                    }
                },
                "number": 9,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5363/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700603525325,
                "cdate": 1700603525325,
                "tmdate": 1700603525325,
                "mdate": 1700603525325,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "HhH5TZ2HaH",
            "forum": "tD4NOxYTfg",
            "replyto": "tD4NOxYTfg",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission5363/Reviewer_HKJt"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission5363/Reviewer_HKJt"
            ],
            "content": {
                "summary": {
                    "value": "The forward process, which has been the state-of-the-art in many tasks, is Variance Exploding based diffusion models. However, unlike VPSDE, it had the drawback of a slow convergence rate. Consequently, this paper introduces a new VESDE that exhibits a faster convergence rate. Additionally, it demonstrated the first polynomial sample complexity based on the realistic manifold hypothesis. Experimentally, it showed quantitative convergence guarantees for the state-of-the-art under such settings."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "1. The introduction of a new forward VESDE process with an unbounded diffusion coefficient and a small drift term, allowing for faster convergence, is a valuable contribution.\n\n2. The paper leverages the manifold hypothesis to achieve a polynomial sample complexity, providing practical insights for real-world applications.\n\n3. The proposal of a unified tangent-based framework for analyzing VE-based models with probability flow ODE is a novel approach to address the convergence guarantee."
                },
                "weaknesses": {
                    "value": "1. While the paper introduces new concepts and theoretical results, it would have been beneficial to have more specific experiments on datasets.\n\n2. While it's understood that the introduced VESDE exhibits a faster convergence rate than VPSDE, there's no guarantee that it offers better fidelity.\n\n3. I find it puzzling whether the variance-exploding property has any utility beyond qualitative convergence guarantees."
                },
                "questions": {
                    "value": "Please refer to Weaknesses"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission5363/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission5363/Reviewer_HKJt",
                        "ICLR.cc/2024/Conference/Submission5363/Senior_Area_Chairs"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission5363/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698761872764,
            "cdate": 1698761872764,
            "tmdate": 1700624281408,
            "mdate": 1700624281408,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "iupTgfNQ6l",
                "forum": "tD4NOxYTfg",
                "replyto": "HhH5TZ2HaH",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5363/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5363/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for your valuable comments and suggestions. We provide our response to each question below.\n\n**Weakness 1: The additional synthetic experiments.** \n\nWe use pure VESDE as a baseline and add more synthetic experiments in the main text to show the advantage of our new forward process with aggressive and conservative drift terms. More specifically, For aggressive drift VESDE, we show that the new process balances the different error sources. For conservative drift VESDE, we further consider the approximated score function and show that the conservative drift VESDE can improve the quality of generated distribution without training. More specifically, the conservative drift VESDE directly uses the models training by pure VESDE and reduces the influence of the large data mean and variance to obtain better images. We verify this phenomenon in different sampling methods (Euler-Maruyama method for reverse SDE and RK45 for PFODE), different $T$, and different synthetic datasets. We also calculate the KL divergence between the generated distribution and the original distribution to support our augmentation.\n\nWe have now added more experiment results and discussion about the advantages of our new process in Section 7 and Appendix F in the revision of our paper (highlighted in green).\n\n**Weakness 2: The utility of the variance-exploding property.** \n\nAs shown in Figure 3 of [1], the VESDE (Eq (3) in our paper) with $\\sigma_t^2 = t^2$ has great PFODE curvature compared to VPSDE and VESDE with $\\sigma_t^2 = t$, which relies have on the large variance term $\\sigma_t^2 =t^2$ and $q_T = \\mathcal{N}(0, T^2 \\mathbf{I})$. Based on this PFODE curvature, VESDE with $\\sigma_t^2 = t^2$ performs well in multi-step [2] and one-step [3] image generation. Furthermore, for our new drift VESDE, we show that it performs better than pure $\\sigma_t^2=t^2$ or  $\\sigma_t^2=t$ on the synthetic experiments since it can balance different error sources.\n\n**Weakness 3: The better fidelity with drift VESDE.** \n\nThe above discussion shows that drift VESDE generated distributions closer to the original distribution in KL divergence on the synthetic experiments. Then, we explain why drift VESDE has better fidelity than pure VESDE from the theoretical perspective.\n\nBefore comparing drift VESDE and previous pure VESDE, we update Corollary 1 by more careful calculation on the time discretization error (Lemma 17) and the early stopping parameter (Lemma 23). With this result, we show that the faster forward convergence rate allows balance in three error sources and finally leads to better sample complexity compared to the previous guarantee for pure VESDE [4]. The results show that the drift VESDE can use smaller steps to achieve the same accuracy, which means this model can use the same steps to achieve better fidelity compared to pure VESDE.\n\nWe have now added a detailed comparison and discussion on the sample complexity of pure VESDE in Remark 1 in the revision of our paper (highlighted in green).\n\n\n\n[1] Tero Karras, Miika Aittala, Timo Aila, and Samuli Laine. Elucidating the design space of diffusion-based generative models. Advances in Neural Information Processing Systems, 35:26565–26577, 2022.\n\n[2] Kim, D., Kim, Y., Kang, W., & Moon, I. C. (2022). Refining generative process with discriminator guidance in score-based diffusion models. *arXiv preprint arXiv:2211.17091*.\n\n[3] Yang Song, Prafulla Dhariwal, Mark Chen, and Ilya Sutskever. Consistency models. ICML 2023,\n\n[4] Holden Lee, Jianfeng Lu, and Yixin Tan. Convergence for score-based generative modeling with polynomial complexity. Advances in Neural Information Processing Systems, 35:22870–22882, 2022."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5363/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700238821996,
                "cdate": 1700238821996,
                "tmdate": 1700238821996,
                "mdate": 1700238821996,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "IexroEAou0",
                "forum": "tD4NOxYTfg",
                "replyto": "HhH5TZ2HaH",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5363/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5363/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Dear Reviewer HKJt:\n\nWe thank you once again for your careful reading of our paper and your constructive comments and suggestions. We will appreciate it very much if you could let us know whether all your concerns are addressed. We are also more than happy to answer any further questions in the remaining discussion period.\n\nBest, Authors."
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5363/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700463386461,
                "cdate": 1700463386461,
                "tmdate": 1700463386461,
                "mdate": 1700463386461,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "eDzzZgigGD",
                "forum": "tD4NOxYTfg",
                "replyto": "HhH5TZ2HaH",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5363/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5363/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Dear Reviewer HKJt,\n\nWe thank you again for your tremendously valuable review of our paper. As the discussion stage is coming to an end, please let us know if you have any questions about our responses or any further concerns.\n\nWe would be grateful to answer any further questions in the remaining discussion period.\n\nBest, Authors."
                    }
                },
                "number": 12,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5363/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700622439711,
                "cdate": 1700622439711,
                "tmdate": 1700622501300,
                "mdate": 1700622501300,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "PCT02dpU37",
                "forum": "tD4NOxYTfg",
                "replyto": "eDzzZgigGD",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5363/Reviewer_HKJt"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5363/Reviewer_HKJt"
                ],
                "content": {
                    "comment": {
                        "value": "The authors had addressed my questions, so I raised my initial rating."
                    }
                },
                "number": 15,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5363/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700624428104,
                "cdate": 1700624428104,
                "tmdate": 1700624428104,
                "mdate": 1700624428104,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "JTz3DpPT2l",
            "forum": "tD4NOxYTfg",
            "replyto": "tD4NOxYTfg",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission5363/Reviewer_U2Hx"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission5363/Reviewer_U2Hx"
            ],
            "content": {
                "summary": {
                    "value": "Score-based diffusion models have gained wide attention in recent years. Two common SDEs used are variance exploding SDE (VESDE) and variance preserving SDE. This paper proposes a new forward VESDE. Unlike the previous theoretical works that assuming constant diffusion coefficient, the paper allows unbounded coefficient that grows in time, which is closer to SOTA VE-based models. The new forward process allows a faster exponential convergence rate. The polynomial sample complexity is obtained for VE-based models with reverse SDE under the manifold hypothesis. The paper then proposes the unified tangent-based analysis framework for VE-based models, and the first quantitative guarantee for SOTA VE-based models with reverse PFODE is obtained."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "The paper is relatively well written. The model, and the contributions are well stated. With the new VESDE forward process, the polynomial sample complexity is obtained for VE-based models with reverse SDE under the manifold hypothesis. Moreover, the first quantitative guarantee for SOTA VE-based models with reverse PFODE is obtained."
                },
                "weaknesses": {
                    "value": "The forward process the paper proposes, to me, is just a small modification of variance preserving SDE with a parameter $\\tau$. When $\\tau=1$, it is exactly the well-studied variance preserving SDE in the literature. Because of that, it is not clear to me the advantage of proposing this new VESDE given that it seems to be quite similar to the VPSDE. \n\nMoreover, since it is a small extension of the VPSDE, the paper should be more transparent about the technical contributions. What is the technical novelty and difficulty to extend the existing theoretical works in this field to allow this added parameter $\\tau$. For example, Lemma 13, Lemma 14, Lemma 15 all come from De Bortolli (2022). The authors should make it more clear what is the novelty that arises from this new VESDE.\n\nIt is not clear the advantage of this new VESDE compared to VPSDE or other diffusion models. It would be helpful if the authors can compare the complexity with the existing literature to demonstrate theoretically that this new VESDE can indeed outperform or at least comparable to the existing models. What is more important is the paper lacks convincing numerical experiments. There is only a very small numerical section in the appendix about a 2-dimensional Gaussian distribution, which is not enough to suggest this new VESDE model is promising. Given that this VESDE is just VPSDE with an added parameter $\\tau$, would it be possible for the authors to utilize the publicly available codes from the previous literature to see if it works well? Also, in terms of practice, it seems that it is quite often in the literature people simply take $T=1$. If that is the case, then you get $\\tau=1$ which corresponds exactly to the VPSDE. The point is that without numerical experiments, it is not clear to me why this new VESDE is a good idea, and what advantage it can bring compared to VPSDE."
                },
                "questions": {
                    "value": "In the abstract, please mention what T stands for so the readers who are not familiar with this field can understand it better.\n\nOn page 1, in the last paragraph, “the these models” is a typo.\n\nOn page 1, the description that “The VESDE corresponds to a Brownian motion” is not one hundred percent accurate in the sense that my understanding is that VESDE has a deterministic and non-trivial diffusion term in front of the Brownian motion. As a result, more rigorously speaking, VESDE is a Brownian motion with a (deterministic) time change.\n\nOn page 2, “We propose a new forward VESDE with the unbounded coefficient $\\beta_{t}$ and a small drift term.” It is not clear to me whether this description is accurate. Maybe it is better to say “and a drift term that is typically small”? The reason is that in your model, you can choose $\\beta_{t}=t^{2}$ and $\\tau=T$. Under this choice, when $t$ is of the order $T$, the drift term can be large?\n\nOn page 6, it would be better if you can add some more detail about Assumption 3. Currently, you are saying “similar to (Chen et al. 2022; Benton et al. 2023)”, is your Assumption 3 exactly the same as in (Chen et al. 2022; Benton et al. 2023)? If yes, you can simply make it more transparent. If not, please comment on the difference.\n\nOn page 7, “We note that Theorem 2 has exponential on $R$ and $\\delta$” did you mean “exponential dependence”?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission5363/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission5363/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission5363/Reviewer_U2Hx"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission5363/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698793485651,
            "cdate": 1698793485651,
            "tmdate": 1700686757808,
            "mdate": 1700686757808,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "TN3T40wbkM",
                "forum": "tD4NOxYTfg",
                "replyto": "JTz3DpPT2l",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5363/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5363/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for your valuable comments and suggestions. We provide our response to each question below.\n\n**Weakness 1: The advantage of the new drift VESDE in the application.** \n\nWe note that pure VESDE (eq (3) in our paper) achieves SOTA performance in multi-step [1] and one-step image generation [2]. Hence, we use pure VESDE as a baseline and add more synthetic experiments in the main text to show the advantage of our new forward process with aggressive and conservative drift terms. More specifically, For aggressive drift VESDE, we show that the new process balances the different error sources. For conservative drift VESDE, we further consider the approximated score function and show that the conservative drift VESDE can improve the quality of generated distribution without training. More specifically, the conservative drift VESDE directly uses the models training by pure VESDE and reduces the influence of the large data mean and variance to obtain better images. We verify this phenomenon in different sampling methods (Euler-Maruyama method for reverse SDE and RK45 for PFODE), different $T$, and different synthetic datasets. We also calculate the KL divergence between the generated distribution and the original distribution to support our augmentation.\n\nWe have now added more experiment results and discussion about the advantages of our new process in Section 7 and Appendix F in the revision of our paper (highlighted in green).\n\n**Weakness 2: The advantage of the new drift VESDE in the theory.** \n\nWe note [3] achieve the polynomial sample complexity for pure VESDE with $\\sigma_t^2 =t$ and reverse SDE under strong LSI and unrealistic score assumptions. By more careful calculation on the time discretization error (Lemma 17) and the early stopping parameter (Lemma 23), we update Corollary 1, which has a better dependence on $\\epsilon_{W_2}$. With this result, we show that the drift VESDE with reverse SDE has a better sample complexity compared to the current sample complexity for pure VESDE under the realistic assumption. This result is also supported by our synthetic experiments (Figure 1).\n\nWe have added a detailed comparison and discussion on the sample complexity of pure VESDE in Remark 1 in the revision of our paper (highlighted in green).\n\n**Weakness 3: The technique novelty.** \n\nThe key step of our unified tangent-based framework is the tangent process lemma (Lemma 2). We note that when considering reverse PFODE, the original tangent process lemma in [3] even introduces an additional $\\exp(T)$ in the discretization error when considering VPSDE. For VESDE with PFODE, we need to carefully control the tangent process by using the exploding variance of VESDE to avoid $\\exp(T)$ in the discretization error.\n\nWe have summarized the technique novelty at the end of Section 1 in the revision paper (highlighted in green).\n\n**Weakness 4: The choice of $T$ in the VESDE setting.** \n\nWe note that for the VESDE setting, previous works usually choose large $T$ to obtain large variance $\\mathcal{N}(0, \\sigma_T^2)$ and achieve good performance. For example, [1] choose $T=80$ for pure VESDE. Furthermore, we also show that with larger $T$, our drift VESDE performs better on the synthetic experiments (Figure 3 and Table 1 in Appendix F). \n\nThanks for pointing out the typos in the question part. We have corrected them in the revision paper (highlighted in green).\n\n[1] Kim, D., Kim, Y., Kang, W., & Moon, I. C. (2022). Refining generative process with discriminator guidance in score-based diffusion models. *arXiv preprint arXiv:2211.17091*.\n\n[2] Yang Song, Prafulla Dhariwal, Mark Chen, and Ilya Sutskever. Consistency models. ICML 2023,\n\n[3] Valentin De Bortoli. Convergence of denoising diffusion models under the manifold hypothesis. Trans. Mach. Learn. Res., 2022, 2022. URL https://openreview.net/forum?id=MhK5aXo3gB."
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5363/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700238732071,
                "cdate": 1700238732071,
                "tmdate": 1700238732071,
                "mdate": 1700238732071,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "ZUIwHuaT7J",
                "forum": "tD4NOxYTfg",
                "replyto": "JTz3DpPT2l",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5363/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5363/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Dear Reviewer U2Hx:\n\nWe thank you once again for your careful reading of our paper and your constructive comments and suggestions. We will appreciate it very much if you could let us know whether all your concerns are addressed. We are also more than happy to answer any further questions in the remaining discussion period.\n\nBest, Authors."
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5363/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700463353217,
                "cdate": 1700463353217,
                "tmdate": 1700463353217,
                "mdate": 1700463353217,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "FUQRK45lUU",
                "forum": "tD4NOxYTfg",
                "replyto": "JTz3DpPT2l",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5363/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5363/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Dear Reviewer U2Hx,\n\nWe thank you again for your tremendously valuable review of our paper. As the discussion stage is coming to an end, please let us know if you have any questions about our responses or any further concerns.\n\nWe would be grateful to answer any further questions in the remaining discussion period.\n\nBest, Authors."
                    }
                },
                "number": 11,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5363/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700622401396,
                "cdate": 1700622401396,
                "tmdate": 1700622401396,
                "mdate": 1700622401396,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "OvDxrkYmIN",
                "forum": "tD4NOxYTfg",
                "replyto": "TN3T40wbkM",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5363/Reviewer_U2Hx"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5363/Reviewer_U2Hx"
                ],
                "content": {
                    "comment": {
                        "value": "Thanks for carefully addressing all the issues raised in the previous round. I have raised the score."
                    }
                },
                "number": 17,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5363/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700686739487,
                "cdate": 1700686739487,
                "tmdate": 1700686739487,
                "mdate": 1700686739487,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "lRNrPOBOsz",
            "forum": "tD4NOxYTfg",
            "replyto": "tD4NOxYTfg",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission5363/Reviewer_byF9"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission5363/Reviewer_byF9"
            ],
            "content": {
                "summary": {
                    "value": "This paper introduces a new forward Variance-Exploding stochastic differential equation (VESDE) process by including a drift term whose coefficient can be unbounded. The resulting VPSDE process that enjoys the faster $\\exp(-T)$ convergence rate and the authors establish the first polynomial sample complexity result under a manifold hypothesis. The authors also propose a unified framework for VE-based models and obtain the first quantitative convergence results for VE models with probability flow ODE."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "The paper introduces a drift term to balance out the beginning, discretization and score function errors, which allows the authors to establish faster forward convergence rate and a polynomial sample complexity for the reversed process. The newly proposed VESDE process could be of practical relevance as demonstrated on a toy 2-D example."
                },
                "weaknesses": {
                    "value": "I'm wondering how important the manifold assumption is. Some discussion on this may be helpful."
                },
                "questions": {
                    "value": "Is there a reason for using different metrics in Sections 5 (total variation) and 6 (Wasserstein)?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission5363/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission5363/Reviewer_byF9",
                        "ICLR.cc/2024/Conference/Submission5363/Senior_Area_Chairs"
                    ]
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission5363/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698809689795,
            "cdate": 1698809689795,
            "tmdate": 1700622856782,
            "mdate": 1700622856782,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "ayE7rr4rmH",
                "forum": "tD4NOxYTfg",
                "replyto": "lRNrPOBOsz",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5363/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5363/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for your valuable comments and suggestions. We provide our response to each question below.\n\n**Weakness 1: The importance of the Manifold Hypothesis.** \n\nWe discuss the manifold hypothesis from the empirical and theoretical perspectives. From the empirical perspective, this assumption is supported by much empirical evidence [1] and is naturally satisfied by the image datasets. From the theoretical perspective, this assumption is more realistic compared to the Lipschitz score assumption since it allows the expansion phenomenon of the score in the application. Hence, many current theoretical works analyzing the VPSDE setting also consider the manifold hypothesis \\[2\\]\\[3\\].\n\nWe have now added more discussion on the manifold hypothesis in Section 4 in the revision of our paper (highlighted in green).\n\n**Question 1. The discussion on the TV+Wasserstein and pure Wasserstein guarantee.** \n\nAs discussed in Section 3.1 of [4], since the manifold hypothesis encompasses distributions that admit a continuous density on a lower dimensional manifold, which will lower bound the TV or KL divergence by a constant, studying TV distance or KL divergence bound will vacuous results. \n\nHence, there are two types of guarantee for VESDE with reverse SDE. The first one is the TV+Wasserstein guarantee, which is used by VPSDE \\[2\\]\\[3\\]. This guarantee relies on the early stopping technique and divides the guarantee into two phases. In the first phase $t\\in [0, T-\\delta]$, the score function is well-defined, and we use Girsanov's Theorem to obtain the TV guarantee in this phase. For the second phase $t\\in [T-\\delta, T]$, we choose the appropriate early stopping parameter $\\delta$ to obtain a $W_2$ close guarantee instead of using the exploding score, which is not well defined when $t=T$. The second one is the pure Wasserstein guarantee, which is used by VPSDE with tangent-based analysis [4].\n\nFor reverse PFODE, since the reverse process lacks randomness, we can not use Girsanov's theorem (the above first guarantee). Hence, we provide a pure Wasserstein guarantee for reverse PFODE. Recently, some works \\[5\\]\\[6\\]\\[7\\] achieve TV + Wasserstein guarantee for VPSDE with reverse PFODE. However, they add additional corrector components [5] or have additional assumptions on the discretization process \\[6\\]\\[7\\]. We leave the TV+Wasserstein guarantee for VESDE with reverse PFODE as an interesting future work.\n\n\n\n[1] Phillip Pope, Chen Zhu, Ahmed Abdelkader, Micah Goldblum, and Tom Goldstein. The intrinsic dimension of images and its impact on learning. arXiv preprint arXiv:2104.08894, 2021.\n\n[2] Sitan Chen, Sinho Chewi, Jerry Li, Yuanzhi Li, Adil Salim, and Anru Zhang. Sampling is as easy as learning the score: theory for diffusion models with minimal data assumptions. ICLR 2023. OpenReview.net, 2023d. URL https://openreview.net/pdf?id=zyLVMgsZ0U_.\n\n[3] Holden Lee, Jianfeng Lu, and Yixin Tan. Convergence of score-based generative modeling for general data distributions. In International Conference on Algorithmic Learning Theory, pages 946–985. PMLR, 2023.\n\n[4] Valentin De Bortoli. Convergence of denoising diffusion models under the manifold hypothesis. Trans. Mach. Learn. Res., 2022, 2022. URL https://openreview.net/forum?id=MhK5aXo3gB.\n\n[5] Sitan Chen, Sinho Chewi, Holden Lee, Yuanzhi Li, Jianfeng Lu, and Adil Salim. The probability flow ode is\nprovably fast. arXiv preprint arXiv:2305.11798, 2023c\n\n[6] Sitan Chen, Giannis Daras, and Alex Dimakis. Restoration-degradation beyond linear diffusions: A non-\nasymptotic analysis for ddim-type samplers. ICML 2023.\n\n[7] Li, G., Wei, Y., Chen, Y., & Chi, Y. (2023). Towards Faster Non-Asymptotic Convergence for Diffusion-Based Generative Models. *arXiv preprint arXiv:2306.09251*."
                    }
                },
                "number": 1,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5363/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700238682704,
                "cdate": 1700238682704,
                "tmdate": 1700238682704,
                "mdate": 1700238682704,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "2uYi1lXv8K",
                "forum": "tD4NOxYTfg",
                "replyto": "lRNrPOBOsz",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5363/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5363/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Dear Reviewer byF9:\n\nWe thank you once again for your careful reading of our paper and your constructive comments and suggestions. We will appreciate it very much if you could let us know whether all your concerns are addressed. We are also more than happy to answer any further questions in the remaining discussion period.\n\nBest, Authors."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5363/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700463320040,
                "cdate": 1700463320040,
                "tmdate": 1700463320040,
                "mdate": 1700463320040,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "iAimFozabv",
                "forum": "tD4NOxYTfg",
                "replyto": "ayE7rr4rmH",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5363/Reviewer_byF9"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5363/Reviewer_byF9"
                ],
                "content": {
                    "comment": {
                        "value": "I thank the authors for the detailed response which have addressed my questions. I have increased the score to 8."
                    }
                },
                "number": 13,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5363/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700622918540,
                "cdate": 1700622918540,
                "tmdate": 1700622918540,
                "mdate": 1700622918540,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]