[
    {
        "title": "Interpreting Age Predictions from Brain Maps via Deep Neural Activations and Tensor Decomposition"
    },
    {
        "review": {
            "id": "hXR1coX3N1",
            "forum": "TS8DP0x1Vd",
            "replyto": "TS8DP0x1Vd",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6590/Reviewer_vyRz"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6590/Reviewer_vyRz"
            ],
            "content": {
                "summary": {
                    "value": "This paper introduces a new technique for interpreting activation maps from 3D convolutional neural networks (3D-CNNs) using tensor based factorization as an alternative to other methods used for image classification (eg Class Activation Maps- CAM, gradient based class activation maps Grad-CAM). This method is applied to a 3D CNN model trained to predict chronological age from brain maps of volume and stiffness computed from magnetic resonance imaging (MRI) and T1-weighted magnetic resonance elastography (MRE) scans, respectively."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "Although not novel in itself, the idea of utilizing tensor decompositions to examine intermediate activation maps is interesting and principled. The paper is well written and presented, and the main idea is straightforward to implement and test for new use cases. The main idea could be a viable alternative to CNN interpretability for different applications"
                },
                "weaknesses": {
                    "value": "The evaluation aspect of the paper is rather weak for the following reasons:\n\n(a) No comparison to baseline methods is presented\n(b) The validity of interpretability maps is mainly based on consensus with existing literature and is more on the qualitative side \n(c) No cross-comparisons are performed by verifying with experts in the field\n(d) No bootstrapped comparisons are performed to evaluate the robustness and variability in the inferred maps\n(e) It is unclear whether the learned maps are consistent across different age groups in the cohort"
                },
                "questions": {
                    "value": "1. Could the authors please elaborate on why they introduced the non-negativity constraint in the factorization? What is the biological significance of this assumption and why is it appropriate from the CNN architectural standpoint (does the assumption change when non-ReLU activation functions are used?)\n\n2. Are the solutions obtained by the decomposition unique? If not- how does this affect the interpretability of the factors?\n\n3. Can such methods be extended to non-convolutional architectures and non-spatially contiguous input data, for example graph neural networks"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "details_of_ethics_concerns": {
                    "value": "N/A"
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission6590/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6590/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6590/Reviewer_vyRz"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6590/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699225029980,
            "cdate": 1699225029980,
            "tmdate": 1699636749146,
            "mdate": 1699636749146,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "ktzSnsHXqC",
            "forum": "TS8DP0x1Vd",
            "replyto": "TS8DP0x1Vd",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6590/Reviewer_KNBM"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6590/Reviewer_KNBM"
            ],
            "content": {
                "summary": {
                    "value": "The article discusses the use of existing machine learning methods such as tensor decomposition, 3D ResNet, and more to analyze a downloaded dataset. However, the application of these methods is to estimate the so-called \"brain age\" from brain imaging, which has already been debunked. As a result, the article has little novelty or practical use and serves more as a machine learning toy example."
                },
                "soundness": {
                    "value": "1 poor"
                },
                "presentation": {
                    "value": "1 poor"
                },
                "contribution": {
                    "value": "1 poor"
                },
                "strengths": {
                    "value": "The manuscript lacks originality as the authors have only reused pre-existing concepts, and no significant strengths are identified. The authors should read a recent publication that debunks the \"brain age\" concept.\n\nVidal-Pineiro D, Wang Y, Krogsrud SK, Amlien IK, Baaré WF, Bartres-Faz D, Bertram L, Brandmaier AM, Drevon CA, Düzel S, Ebmeier K. Individual variations in ‘brain age’relate to early-life factors more than to longitudinal brain change. elife. 2021 Nov 10;10:e69995."
                },
                "weaknesses": {
                    "value": "Lack of originality and toy \"brain age\" validation, which has been debunked already, as mentioned in the above comments."
                },
                "questions": {
                    "value": "Why focus on \"brain age\" when more valid diagnostic labels exist?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "1: strong reject"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6590/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699519204216,
            "cdate": 1699519204216,
            "tmdate": 1699636749009,
            "mdate": 1699636749009,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "MNb65oXQRF",
            "forum": "TS8DP0x1Vd",
            "replyto": "TS8DP0x1Vd",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6590/Reviewer_Gsu3"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6590/Reviewer_Gsu3"
            ],
            "content": {
                "summary": {
                    "value": "The paper tries to find the latent embeddings for the last layer of a 3D CNN and relate the embeddings to specific features in brain ROIs."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "1 poor"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "I am not personally convinced by the idea."
                },
                "weaknesses": {
                    "value": "1. The paper describes an algorithm without properly describing the intuitions behind each algorithmic step clearly. There is no theoretical analysis of the approach they propose. In the absence of proper theoretical guarantees, a thorough study on simulation data may benefit the paper.\n\n2. The main contributions in the introduction section do not contain anything that makes the paper's contribution stand out from traditional approaches of finding the embeddings. I would carefully flesh out the novelties of the proposed approach.\n\n3. Plots are not clear: why there is a spread of error in Figure 4 (d)."
                },
                "questions": {
                    "value": "1. The pseudocodes are not clear to me. How do you estimate $\\mathbf{U}^{(3)}_{val}$ in Algorithm 1? The algorithm seems to switch a lot between estimates from training and validation sets for different embeddings? Why do you need that?\n\n2. What is MAE in Algorithm 2?\n\n3. The paper needs a complete rewriting to explain the intuition coherently and intuitively."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "details_of_ethics_concerns": {
                    "value": "None."
                },
                "rating": {
                    "value": "1: strong reject"
                },
                "confidence": {
                    "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission6590/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6590/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6590/Reviewer_Gsu3"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6590/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699632814576,
            "cdate": 1699632814576,
            "tmdate": 1699636748892,
            "mdate": 1699636748892,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    }
]