[
    {
        "title": "Text-to-3D Generation with Bidirectional Diffusion using both 3D and 2D priors"
    },
    {
        "review": {
            "id": "DSIZjXSkfc",
            "forum": "V8PhVhb4pp",
            "replyto": "V8PhVhb4pp",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission3240/Reviewer_Ymwx"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission3240/Reviewer_Ymwx"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes a method for a 2D diffusion and a 3D diffusion model to exchange information during inference so that they can complement each other. It adds additional conditioning branches to two pretrained 2D and 3D diffusion models, and allow them to condition on each other at every step of the diffusion inference process. The model can generate 3D results more faithful to text than simply using a standalone 3D diffusion model, and enables disentangled control of geometry and texture."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. The idea of allowing 2D and 3D diffusion models to condition on each other's outputs at every inference step is novel. This method can be used with strong independently pre-trained 3D and 2D diffusion backbones, and so has the potential to incorporate the rich prior in both models into one.\n\n2. The intrinsic capability of independently controlling texture and geometry is new compared to previous text-to-3D works as far as I know."
                },
                "weaknesses": {
                    "value": "The main weaknesses of this paper are the lack of enough qualitative results and the ambiguity of explanation.\n\n1. In the ablation study of 4.3, only one particular qualitative example is shown to demonstrate the effectiveness of different components. This is far from being convincing. The authors should have included more than 10 results of different prompts in the appendix for that.\n\n2. In the \"bidirectional guidance\" part of section 4.3 Ablation Studies, the results shown at the top row of figure 6 seem to be totally different shapes. I understand this can happen for the 2D diffusion model. However the text also says \"... and the 3D diffusion model manifests anomalies in both texture and geometric constructs.\". But where are the 3D diffusion results? From my understanding the results from the 3D diffusion model should always look like the same shape and yield consistent multi-view renderings. I did not find these results in figure 6.\n\n3. Figure 4 shows the main qualitative results of the proposed feed-forward method. However there is no comparison to previous methods. I think at least the comparison to Shap-E should be included.\n\n4. The results of Zero-1-to-3 shown in figure 5 are weird. Why all the others methods shown are the final 3D results with mesh visualization, but the Zero-1-to-3 only has multi-view generation results? My understanding is to generation the 3D results at the left lower corner of Figure 5, we still need to use the SDS loss. If this is true, then a directly competitor should be using Zero-1-to-3 with SDS loss.\n\n5. More details about the decoupled geometry and texture control in page 8 are needed. What does it mean to fix the 3D prior? Do you mean fixing the initial noise of the 3D diffusion? When fixing the textual prompt if the 2D diffusion, do you also fix the initial noise?"
                },
                "questions": {
                    "value": "1. In the \"Results after optimization\" section of the website the authors show results of combining the proposed method and SDS optimization. Why the multi view images generated on the left are low quality and lack details, while the 3D results on the right suddenly have much richer texture and geometry?\n\n2. During training, since we do not have the results of the intermediate denoised results for any particular timestep t, the original GT 3D shape and multi-view images are used as the conditioning signals. I feel this domain gap seems to be a serious problem. Do the authors have any thoughts on eliminating this gap?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission3240/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698526343417,
            "cdate": 1698526343417,
            "tmdate": 1699636272393,
            "mdate": 1699636272393,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "oklQv7VfcD",
                "forum": "V8PhVhb4pp",
                "replyto": "DSIZjXSkfc",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3240/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3240/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Reply to Reviewer Ymwx"
                    },
                    "comment": {
                        "value": "We sincerely thank the reviewer for providing thoughtful review and positive feedback, and will update the paper accordingly. Below are our responses to the main questions by the reviewer.\n\n**1. Problem of separation of shape and texture control.**\n\nPlease refer to Question 1 in interpretation of common questions.\n\n**2. Problem of results in websit.**\n\nSorry for any confusion caused by our video. The results on the left are from the bidirectional diffusion feed-forward sampling, while those on the right are after applying SDS optimization to these results. Please refer to Question 1 in common questions about the gap between the optimized results and the results before optimization.\n\n**3. The domain gap of conditioning signals.**\n\nDuring training, the conditioning signals for the 3D network are noisy multi-view images, not the clean ground-truth ones. At inference time, these conditioning signals are also noisy images, resulting from the previous 2D diffusion step. Therefore, there is no training and inference gap. The conditioning signals for the 2D network are the multi-view images rendered by the 3D network, which are also consistent with inference. \n\nMoreover, using noisy multi-view images does not lead to significant problems. In the early stages of sampling, when noise is relatively high, the 3D network's denoising relies more on the 3D prior, and at this time, the noise-induced uncertainty in 3D structure is acceptable. In the later stages of sampling, the smaller noise hardly affects the generation of 3D structure. Therefore, throughout the entire sampling process, the 2D and 3D representations are denoised synchronously, with bidirectional adjustment at each step to ensure consistency between 2D and 3D.\n\n**4. More results and comparisons.**\n\nWe supplemented more results in revision main paper and supplementary material."
                    }
                },
                "number": 9,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3240/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700098243011,
                "cdate": 1700098243011,
                "tmdate": 1700098243011,
                "mdate": 1700098243011,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "TdTG8n6ePB",
            "forum": "V8PhVhb4pp",
            "replyto": "V8PhVhb4pp",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission3240/Reviewer_ZH4m"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission3240/Reviewer_ZH4m"
            ],
            "content": {
                "summary": {
                    "value": "This paper presents a new 3D generation method by combining a 3D diffusion model and a 2D diffusion model via bidirectional guidance. The 3D diffusion model is based on the NeuS representation and incorperates geometric priors from the large scale Shap-E model. The 2D diffusion model is finetuned from DeepFloyd-IF for multi-view image generation. During each diffusion step, the 3D diffusion model takes image features from the prediction of 2D diffusion model, and the 2D diffusion model is further conditioned on the multi-view renderings from the prediction of 3D diffusion model. In this manner, the two models are \"synchonized\" to achieve corherent 3D generation. Compared to previous optimization-based methods, the proposed approach has a lower generation time and the outputs suffer from less multi-face Janus problem."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "Bridging 3D and 2D diffusion models seems novel. There are mainly two types of 3D generation methods in recent years, one that learns a 3D generator directly from 3D datasets (e.g., Shape-E) and the other that distill a 3D object from 2D generative models (e.g., DreamFusion). The former usually generates 3D shapes with good geometry but often doesn't generalize well due to the limited 3D dataset. The later leverages the genealization ability of large scale 2D image model but often suffer from inaccurate geometry (e.g., Janus problem).\n\nThis work takes a step forward by combining the advantage of both --- prior from 3D dataset helps with the geometry and prior from 2D images improves the texture quality.\n\nThe results on the webpage look quite decent."
                },
                "weaknesses": {
                    "value": "- The paper claims to be \"the first 3D generative model that can separately control texture and geometry generation\". I think this is a bit over-claiming. There are many prior works that can separately control the generation of texture and geometry. For example, TM-Net[1] and GET3D[2]. I would suggest removing such a claim.\n- Results with or without post optimization should be labeled more clearly. The video results on the webpage look quite good, but figure 2 results seem to be of lower quality and resolution. I'm a bit confused by the results. I suppose the difference is whether to use post optimization. If so, such difference should be illustrated more clearly, so that we know how much the proposed diffusion model really contribute.\n- The paper seems to be rushed, and there are many typos, including\n  - page 3, \"As result, ...\" -> \"As a result, ...\", and on the same line, \"..., they frequently produce ...\" -> \"..., but they frequently produce ...\"\n  - page 3, \"... which ensures ensures ...\" -> \"... which ensures ...\"\n  - page 5, \"Fig.[].\" not linked\n  - page 5, \"the straightforward way to separately ...\" -> \"the straightforward way is to separately...\"\n\n[1] TM-NET: Deep Generative Networks for Textured Meshes, SIGGRAPH 2021\n[2] GET3D: A Generative Model of High Quality 3D Textured Shapes Learned from Images, NeurIPS 2022"
                },
                "questions": {
                    "value": "Some necessary details are missing. \n\n- As described in Sec. 3.3., the 2D diffusion model jointly denoise multi-view images. How does it work exactly? Are these multi-view images just stacked along the channel dimension? If so, what's the ordering?\n- How does post-optimization work? For example, what is the optimization objactive and guidance weight? It looks like the post-optimization improves the final quality a lot, so I think it's necessary to include all the details."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission3240/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698604380245,
            "cdate": 1698604380245,
            "tmdate": 1699636272315,
            "mdate": 1699636272315,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "9dVcBviKm8",
                "forum": "V8PhVhb4pp",
                "replyto": "TdTG8n6ePB",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3240/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3240/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Reply to Reviewer ZH4m"
                    },
                    "comment": {
                        "value": "We sincerely thank the reviewer for providing thoughtful review and positive feedback, and will update the paper accordingly. Below are our responses to the main questions by the reviewer.\n\n**1. How does 2D diffusion model jointly denoise multi-view images?**\n\nMulti-view images just stacked along the batch dimension and are fed into a ControlNet based model. Section A2.2 of new supplementary material gives more details of 2D denoising network.\n\n**2. How does post-optimization work?**\n\nThe post-optimization is mainly based on SDS loss. We have supplemented more details of optimization phase in Section 3.5 of the revision paper."
                    }
                },
                "number": 8,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3240/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700098174906,
                "cdate": 1700098174906,
                "tmdate": 1700098789464,
                "mdate": 1700098789464,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "WxHWzYw2Jj",
            "forum": "V8PhVhb4pp",
            "replyto": "V8PhVhb4pp",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission3240/Reviewer_hKcU"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission3240/Reviewer_hKcU"
            ],
            "content": {
                "summary": {
                    "value": "The study introduces a diffusion model that simultaneously incorporates 2D and 3D object priors through a method termed \"Bidirectional Diffusion.\" To enhance the synergy between the produced 2D multiview images and the 3D geometry, each denoising phase begins by consolidating the multiview images into a cost volume. These are then incorporated as conditions into the 3D diffusion segment, alongside the reference shape produced by ShapE. Conversely, the refined 3D geometry can be rendered back into images to steer the 2D multiview branch. By implementing this approach, the researchers illustrate the model's capability to efficiently produce 2D-3D congruent shapes in several diffusion steps, all within a minute. Tests conducted on the ShapeNet and Objaverse datasets reveal that the introduced method strikes an optimal balance between quality (as indicated by the CLIP score) and generation speed."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "- The technique introduces a unique approach to integrating 2D image priors with 3D priors through a bidirectional diffusion model. Unlike conventional methods that primarily focus on distilling scores from image models, this technique actively harnesses the 3D prior, guiding it in tandem with the 2D diffusion process. This innovative approach sets it apart from other methods.\n\n- This method adeptly draws upon priors from established foundational models, reducing the need for long-time additional training. Notably, the insights gained from ShapE and stable diffusion are seamlessly and effectively combined.\n\n- Demonstrating speed and efficiency, the method can produce a commendable 3D shape based on textual guidance in just a matter of minutes."
                },
                "weaknesses": {
                    "value": "- The paper's presentation lacks a clear focus, with undue emphasis on certain aspects that distract from its main contributions:\n  1. While the authors highlight that their framework allows for the separation of shape and texture control, dedicating an entire page to this feature, it's evident that this separation isn't a core attribute of the proposed model. Instead, it's achieved through modifications in the text prompt and Shap-E guidance, diluting the impact of the claim.\n  2. The authors showcase numerous impressive results achieved via 'optimization-based methods'. However, these results don't stem directly from their proposed pipeline but rather from the optimization methods. There's an insufficient description of these methods in the main content, and they fail to retain the fundamental shape or texture resulting from the bidirectional diffusion model.\n  \n- The strategy for enhancing priors is fundamentally a guidance system that doesn't rely on classifiers. This should be clarified by the authors.\n\n- The quality of the generated results leaves room for improvement. The images appear blurry, making it challenging to discern the specific identity of the produced shape without cross-referencing the associated text prompt, as seen in the iKun example :) Additionally, the generated geometry exhibits numerous striped artifacts. This lack of clarity might stem from inadequate training and diminished resolution in the 3D domain. Employing a different foundational 3D representation might address these issues.\n\n- The paper's writing quality needs enhancement. It contains several typographical errors, grammatical mistakes, and omitted cross-references. For instance, on Page 5, Fig. [] is missing, and on Page 6, the reference to \"$N$ views\" should be corrected to \"$M$ views.\""
                },
                "questions": {
                    "value": "- How is consistency between ShapE and the final outcomes (generated 3D shape) ensured?\n- What's the rationale behind using SparseConvolution for the 3D diffusion branch? At the onset of diffusion, do you initiate with a dense 3D volume or a sparse one? If it's the latter, how is it initialized? Additionally, why in Eq.(5) is SparseConv applied to the function $\\mathcal{G}$?\n- On page 5, why does $\\mathcal{V}$ have a prime superscript? In the context of bidirectional diffusion, what is the significance of the prime notation?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "details_of_ethics_concerns": {
                    "value": "Not applicable."
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission3240/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission3240/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission3240/Reviewer_hKcU"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission3240/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698625910787,
            "cdate": 1698625910787,
            "tmdate": 1699636272235,
            "mdate": 1699636272235,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "JLm5IiWkoI",
                "forum": "V8PhVhb4pp",
                "replyto": "WxHWzYw2Jj",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3240/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3240/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Reply to Reviewer hKcU"
                    },
                    "comment": {
                        "value": "We sincerely thank the reviewer for providing thoughtful review and positive feedback, and will update the paper accordingly. Below are our responses to the main questions by the reviewer.\n\n**1. Problem of separation of shape and texture control.**\n\nPlease refer to Question 1 in interpretation of common questions.\n\n**2. Impressive results don't stem directly from their proposed pipeline.**\n\nPlease refer to Question 3 in interpretation of common questions.\n\n**3. How is consistency between ShapE and the final outcomes (generated 3D shape) ensured?**\n\nPlease refer to Question 2 in interpretation of common questions.\n\n**4. What's the rationale behind using SparseConvolution for the 3D diffusion?**\n\nThe use of SparseConv follows SparseNeus. For a 3D cubic grid feature volume, some grid points may not project onto any rendering images. In addition, to reduce computation, some grid points corresponding to edge rays are selectively disabled. Therefore, using SparseConv in our 3D model is more flexible and efficient. The 3D diffusion process begins from sparse volume (grid points). Its initialization method is same as normal diffusion. We can regard the sparse volume as one-dimensional data. $\\mathcal{G}\\_{t\\_0}$ represents a radiance field converted from the Shap-E latent code, specifically expressed as a 3D feature volume of size $s \\times s \\times s$, hence it can use SparseConv for feature mapping or further extraction.\n\n**5. Symbols.**\n\n$\\mathcal{G}\\_{t\\_0}$ represents a radiance field converted from the Shap-E latent representations. It is expressed as a feature of a 3D grid of size $s \\times s \\times s$, hence it can use SparseConv for feature mapping or further extraction. $\\mathcal{V}$ prime represents the sampling result of the network during the denoising process. We want to distinguish it from the ground truth represented by $\\mathcal{V}$ without prime. Prime represents the result output by the network."
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3240/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700098093841,
                "cdate": 1700098093841,
                "tmdate": 1700098093841,
                "mdate": 1700098093841,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "VjnChc5806",
            "forum": "V8PhVhb4pp",
            "replyto": "V8PhVhb4pp",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission3240/Reviewer_7ENe"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission3240/Reviewer_7ENe"
            ],
            "content": {
                "summary": {
                    "value": "This method proposes a method that couples a 3D diffusion model and 2D diffusion model by cross-conditioning. The multi-view 2D diffusion model is conditioned on multi-view renderings from a denoised NeRF,  while the 3D diffusion model is conditioned on denoised multi-views from the 2D diffusion model. Through this coupling, the authors show that they can exploit the priors from both pretrained 3D diffusion models and 2D diffusion models."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "1 poor"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "1. Overall, the idea of coupling a 3D diffusion and a 2D diffusion model seems interesting and novel, as they can help each other. This is in contrast to the idea of render-diffusion work where a image-to-3D reconstructor is used as a denoiser.\n2. It’s also interesting to see the use of pretrained 3D diffusion models (like Shap-E) and 2D diffusion models (like DeepFloyd) to exploit their priors.\n3. Separate control of shape and texture generation seems very cool!"
                },
                "weaknesses": {
                    "value": "1. The paper seems to be done in a rush with many typos.\n     - “To conquer the challenges…” paragraph of the introduction, duplicate “ensures”\n     - Top of page 5: figure is not referenced correctly\n     - Sentence after Eq. 1, noise scale should be monotonically increasing?\n     - Top of page 6, N is abused for denoting both grid resolution and number of views. In Eq. 6, M is used to denote # views.\n     - Beginning of section 3.3: “To 2D-3D consistency” —> “To encourage 2D-3D consistency”?\n  \n 2. Many details are missing\n    - Model architecture for the 3D denoiser? Whole model is trained for how long with what learning rate? Batch size?\n    - How is Objaverse 40k subset selected out of the total 780k objects? What are the data curation criteria?\n    - In Eq. (5), G_{t_0} seems to be an MLP according to G(p)=MLP(\\lambda(p); \\theta=C). How is Sparse3DConv applied to a MLP? In addition, what is the t_0 set to?\n    - The ablation talks about fixing 3D prior or 2D prior. How is this fixing done? Does it mean that non-stochastic DDIM inference is used and the initial noise is fixed?  \n    - Section 4.2 talks about 50 prompts for evaluation. How are these 50 prompts designed?\n    - The training requires paired (captions, multi-view renderings) data? If so, how are the captions generated?\n    - How is the Shap-E latent obtained during training? By feeding one image to Shap-E or the text prompt to Shap-E? If it’s the latter one, how to address the inconsistency between Shap-E generated shapes and the multi-view images?"
                },
                "questions": {
                    "value": "Please see my comments in the weakness section."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission3240/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698901716348,
            "cdate": 1698901716348,
            "tmdate": 1699636272153,
            "mdate": 1699636272153,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "YL175TJLcL",
                "forum": "V8PhVhb4pp",
                "replyto": "VjnChc5806",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission3240/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission3240/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Reply to Reviewer 7ENe"
                    },
                    "comment": {
                        "value": "We sincerely thank the reviewer for providing thoughtful review and positive feedback, and will update the paper accordingly. Below are our responses to the main questions by the reviewer.\n\n**1. How is this fixing done?**\n\nPlease refer to Question 1 in interpretation of common questions.\n\n**2. How is the Shap-E latent obtained during training?**\n\nPlease refer to Question 2 in interpretation of common questions.\n\n**3. Issue of Eq. (5).**\n\nIn Eq. (5), $ \\mathcal{G}\\_{t\\_{0}} $ represents a radiance field converted from the Shap-E latent code with $t\\_0$ step noise. To avoid confusion, we have clarified definition of $\\mathcal{G}$ to: We design a feature volume $\\mathcal{G}$ to represent a radiance field converted from the latent code $\\mathcal{C}$. And Section 3.2 of main paper explains the meaning of $t\\_0$: To generate 3D objects beyond Shap-E model, we add Gaussian noise at level $t_0$ to the clean latent code, resulting in the noisy latent representation $\\mathcal{C}\\_{t\\_0}$, where $t\\_0$ represents a predefined constant timestep. Subsequently, the noisy radiance field $\\mathcal{G}\\_{t\\_0}$ is decoded by substituting $\\mathcal{C}$ with $\\mathcal{C}\\_{t\\_0}$. This design establishes a coarse-to-fine relationship between the 3D prior and the ground truth, prompting the 3D diffusion process to leverage the 3D prior without becoming excessively dependent on it."
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission3240/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700097804971,
                "cdate": 1700097804971,
                "tmdate": 1700097962228,
                "mdate": 1700097962228,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]