[
    {
        "title": "MetroGNN: Metro Network Expansion with Deep Reinforcement Learning"
    },
    {
        "review": {
            "id": "OMHVHAdOzw",
            "forum": "VeFmnRmoaW",
            "replyto": "VeFmnRmoaW",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7259/Reviewer_m3ip"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7259/Reviewer_m3ip"
            ],
            "content": {
                "summary": {
                    "value": "In this paper, the authors investigate the problem of metro network expansion, which they formulate as an MDP. The action is selecting a region and adding it to the metro network, and the reward is the increment of satisfied OD flow. They utilize a RL framework to solve the MDP. They use a GNN network to inject spatial contiguity and OD flow into region representations. The action mask and attentive policy network are used to ensure the feasibility of the result and to reduce search space. Authors apply the method to real-world urban data and witness significant performance improvements."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "S1. The notion of region is particularly interesting, as it overcomes the limitation of fixed-size grids and captures both spatial proximity and traffic flow patterns.\nS2. The work addresses numerous traditional and RL-based methods as baselines, with detailed comparisons and experiments. This justifies the use of RL methods in the practical aspect. The case study of complicated scenarios also give convincing explanations.\nS3. The ablation study is thorough, and strengthens the design choices of the algorithm framework."
                },
                "weaknesses": {
                    "value": "W1. In the \"Overall Framework\" section, the MDP and RL framework do not have a formalized definition, and the description and implementation details of the overall RL framework is rather unclear.\nW2. Some of the notations in the equations are not sufficiently clarified. For example, in equation (6), it is better to explicitly state that alpha_{i, j} is the relevance measure, and pinpoint the meaning of i and j."
                },
                "questions": {
                    "value": "1. What is the precise definition of OD trips? How is it obtained from your dataset?\n2. How do you determine whether a selected region should be an extension of an existing metro line (and which?) or the start of a new line? Is it determined in the agent's action, or by some other means?\n3. In equation (5), which metro line do n_{+-1} and n_{+-2} refer to?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission7259/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission7259/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission7259/Reviewer_m3ip"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7259/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698654248813,
            "cdate": 1698654248813,
            "tmdate": 1699636865722,
            "mdate": 1699636865722,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "fccLHifmFW",
                "forum": "VeFmnRmoaW",
                "replyto": "OMHVHAdOzw",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7259/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7259/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you very much for your positive feedback. We have added a formalized definition to both the **MDP** and the **RL framework**, and clarified some notations in the equations. All the additions are highlighted in red in the revised version, and we hope the following responses can adress your concerns.\n\n**Q1.a. What is the precise definition of OD trips?**\n\n**Response:** Specifically, if an individual starts a journey at region A, reaches region B and remians in B for at least 15 minutes, this travel event contributes a count of 1 to the OD trips from A to B. Furthermore, if the individual subsequently travels to region C, the entire movement will be considered as two separate trips: one from A to B and another from B to C. We have added this definition in Section A.2.\n\n\n**Q1.b. How is the OD trips obtained from our dataset?**\n\n**Response:** We get the spatio-temporal data from a large number of user movement trajectories from Tencent Map, a Map Service Providers in China, and the OD flow matrix in this paper is generated in the way mentioned in Q1.a. We have added the corresponding information in Experiment section.\n\n**Q2. How to determine whether a selected region should be an extension of an existing metro line (and which?) or the start of a new line?**\n\n**Response:** If the selected region **satistfies the distance and angle constraints with existing lines**, it will be considered as an extension. Specifically, if the seleted region are avaliable for multiple lines, **the station will be assigned to the closest metro line**. On the other hand, if the selected region **only satisfies the distance constraints**, it will be considered as the start of a new line. We apologize for any confusion this may have caused, and **we have updated the formulas as well as the description in Section A.1** for further clarification.\n\n**Q3. In equation (5), which metro line do $n_{\\pm 1}$ and $n_{\\pm 2}$ refer to?**\n\n**Response:** The **$n_{\\pm 1}$ represents all the terminal stations** within the metro network, including both the originating and terminating stations of each metro line.\nThe **$n_{\\pm 2}$ represents all the subterminal stations** directly connected to the $n_{\\pm 1}$.\nSorry for any confusion caused by the unclear expression, and we have added the appropriate explanation in Method section. To avoid possible ambiguity, the original expression of $n_{\\pm 1}$ and $n_{\\pm 2}$ has been changed to $n_j \\in \\mathcal V_{\\pm 1}$ and $n_k\\in\\mathcal V_{\\pm 2}$  in Section A.1 of the revised manuscript.\n\nThank you again for your constructive comments and valuable feedback, and we hope the above response can address your concerns."
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7259/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700415035827,
                "cdate": 1700415035827,
                "tmdate": 1700657519821,
                "mdate": 1700657519821,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "Cx17ytR5y6",
            "forum": "VeFmnRmoaW",
            "replyto": "VeFmnRmoaW",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7259/Reviewer_WxNe"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7259/Reviewer_WxNe"
            ],
            "content": {
                "summary": {
                    "value": "This work addresses the metro network expansion problem, in which the goal is to decide which edges to add to a metro graph such as to optimize the total satisfied flow between origin-destination pairs in the network, subject to a budget constraint. The authors approach this problem by formulating it as a Markov Decision Process and proposing a reinforcement learning method that uses graph neural networks for encoding state information. More specifically, the authors consider two types of features in the GNN design: spatial features and flows, which are concatenated. The authors compare the proposed method with a variety of classic optimization algorithms and a recent RL approach, showing gains in optimality over these methods."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "Originality: the work applies a method based on RL and GNNs to a new problem.  This intersection, by now, has a growing body of literature and is a fairly common \"recipe\".  It is moderately original in the design of its approach. \n\nQuality: the quality of the paper is reasonable, but I have substantial concerns about the soundness of the evaluation as well as its lack of clarity in places.\n\nClarity: the organization of the paper is clear. The writing is of reasonable quality. The main issue in terms of clarity is the lack of precision in the description of the problem / solution method.\n\nSignificance: the work is of interest to the ICLR community, and belongs to the growing machine learning for combinatorial optimization literature."
                },
                "weaknesses": {
                    "value": "**W1**. A major weakness is the fact that the authors do not report aggregated results across several runs together with statistical confidence measures (e.g. error bars). These should be presented for all figures and tables in order to account for the stochasticity of model training. Otherwise, a possible alternative explanation for the observed results is that one of the \"lucky\" seeds was used, which yields better performance than what we might see in the average case. It is not possible, in my opinion, to draw reliable conclusions from the presented results. In case multiple runs were indeed carried out, these details should be reported.\n\n**W2**. Lack of (mathematical) precision in the description of the problem and solution method. The authors should aim for a level of clarity that would enable someone to reproduce the results starting from the descriptions only. This is currently not the case. Some examples where this is apparent:\n\n- Most importantly, the MDP components (currently in Appendix A) should be formalised mathematically and not described only in plain English. \n- Equation 1: presumably $i \\neq j$, given self-loops are not allowed?\n- Equation 3: $\\mathcal{N}$ was already used to denote the entire set of nodes, whereas in this equation it is used to denote the neighbourhood. They are not the same, unless the graph is fully connected.\n- The set of input features to the GNN should be fully described in the Method section and not only when discussing the ablation results (4.4).\n\t\n**W3**. Potential limited scalability: the authors consider networks with up to 60 nodes, whereas the real Beijing network has approximately ~500 nodes. Hence, the problem as considered is a simplification, and this should be acknowledged. I expect that the observed performance improvement does not come \"for free\", and that the method suffers in scalability and has substantially longer running times than the classic methods. Studying the scalability of the method (around what number of nodes does it fail to find satisfactory solutions compared to the baseline) and adding representative runtimes for the methods would improve the manuscript."
                },
                "questions": {
                    "value": "**C1**. The writing contains some important inaccuracies that should be fixed:\n\n- \"To achieve efficient search of the NP-hard problem\" -> the solution space, not the problem itself, is being searched\n- \"The proposed model [...] successfully reduces the large solution space\"; \"the attentive policy network reduces the solution space drastically\": as far as I can tell, the model itself does not reduce the solution space; rather, it may indeed be more efficient in how this search space is navigated.\n\t\n**C2**. Typos: consider running a spellcheck. Some I have spotted: generic -> genetic (p2), maksed -> masked (p4), donate -> denote (p5)\n\n**C3**. The analysis in 4.5 is tenuous, especially given the lack of multiple runs. For example, if we were to stop the process at step 60, we could draw a different conclusion from the one presented in this paragraph. Does this finding repeat across 10+ runs? \n\n**C4**. The following recent paper considers metro network planning as a case study and also uses a reinforcement learning approach. In my opinion, while not directly comparable, it should be cited:\n\n> Darvariu, V. A., Hailes, S., & Musolesi, M. (2023). Planning spatial networks with Monte Carlo tree search. Proceedings of the Royal Society A, 479(2269), 20220383."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission7259/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission7259/Reviewer_WxNe",
                        "ICLR.cc/2024/Conference/Submission7259/Senior_Area_Chairs"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7259/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698684204341,
            "cdate": 1698684204341,
            "tmdate": 1700740108081,
            "mdate": 1700740108081,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "Ni7annpmp9",
                "forum": "VeFmnRmoaW",
                "replyto": "Cx17ytR5y6",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7259/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7259/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for your valuable feedback. We have added complete mathematical description of the MDP and RL framework in the Method section and Appendix A.5. More importantly, we provide experimental results across several runs with p-values and error bars. We sincerely hope the following responses can address your concerns.\n\n**Q1. The authors do not report aggregated results across several runs together with statistical confidence measures (e.g. error bars).**\n\n**Response:** Thank you for your suggestions regarding the reliability of our method. In the previous version, we run multiple experiments with different seeds, and only report the best results in the original manuscript. According to your valuable suggestion, in the revised version, **we have integrated the results of multiple (10) runs of the experiment in the Experiment section**, please refer to the Table 2, Figure 3 and Figure 6 in the revised manuscript.\n\n**Q2.a. The model simplifise the Beijing network with only 50 nodes.**\n\n**Response:** We are sorry for making you confused of the graph size. Actually, the graphs for Beijing and Changsha contain a total of **1,166 and 469 nodes**, respectively. It is possible that \"B=50\" in original Table 1 (Table 2 in revised version) caused this misunderstanding, which represents the expansion budget of $50 billion. We apologize for the ambiguity and have added detailed descriptions of the dataset in Table 1 and provided more precise descriptions.\n\n\n\n| City    | Beijing | Changsha |\n| ------- | ------- | -------- |\n|   Nodes      |   1166      |     469     |\n|   Edges      |   4656      |     1642     |\n|   Latitude       |  [39.5410,40.2319]       |    [27.9295,28.4276]      |\n| Longitude  |    [116.0385,116.8612]     |   [112.7357,113.2599]    |\n\n\n\n\n**Q2.b.  The model has substantially longer running time than classic methods.**\n\n**Response:** Thank you very much for pointing out this important issue. We would like to provide more explanations in this response.\nFirstly, **classic methods do not have a significant runtime advantage over our method**. For example, the evolutionary algorithms take an average of **2 hours**, while the mathematical programming methods take **over 3 hours and need additional manual adjustments** for the metro expansion of Beijing network. \nSecondly, those classic methods **can not generate quality and stable solution** for metro network expansion, and **must regenerated from scratch for different metro networks**.\nIn contrast, though MetroGNN requires 8 hours of training, **it constantly generate optimal and stable solutions**. Moreover, the complementary experiments show that **it takes only 20 seconds** for the well-trained agent to generate better metro expansion solutions for different metro networks compared with DRL-CNN.\nAccording to your valuable comment, we have added the above discussion to Appendix A.5, and please check the revised manuscript for details.\n\n**Q3. The model does not reduce the solution space but enhance the efficiency of search.**\n\n**Response:** Thank you very much for the correction, we have changed the corresponding statement in the revised manuscript.\n\n**Q4. The analysis in 4.5 is tenuous, especially given the lack of multiple runs.**\n\n**Response:** Thank you for your valuable advice. We have added the results with multiple runs to the Figure 6 in the revised manuscript. The results show that the disadvantage of the attentive policy network is just a coincidence. In particular, the model with attentive policy network consistently generates better expansion solutions than the mlp-only policy network in the case of a complete 100 iterations.\n\n\n**Q5. Recent paper [2] that considers metro network planning with reinforcement learning approach should be cited.**\n\n**Response:** Thank you for your reference to this paper. We have carefully gone through the works mentioned in your comment and searched for more related literature. Despite the paper you mentioned, we also found the following two related papers [3,4] and have added proper references in Introduction and Related section:\n\n[3] Yolcu, E., & Póczos, B. (2019). Learning local search heuristics for boolean satisfiability. Advances in Neural Information Processing Systems, 32.\n\n[4] Wang, Q., & Tang, C. (2021). Deep reinforcement learning for transportation network combinatorial optimization: A survey. Knowledge-Based Systems, 233, 107526.\n\nThank you again for your constructive comments and valuable feedback, and we hope the above response can address your concerns."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7259/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700414023330,
                "cdate": 1700414023330,
                "tmdate": 1700417338453,
                "mdate": 1700417338453,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "JaRQCtCHsF",
                "forum": "VeFmnRmoaW",
                "replyto": "Ni7annpmp9",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7259/Reviewer_WxNe"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7259/Reviewer_WxNe"
                ],
                "content": {
                    "title": {
                        "value": "Post-rebuttal response to authors"
                    },
                    "comment": {
                        "value": "Thanks for engaging with my points! Some further comments / replies:\n\n**W2**. I think the presentational issues and the overall lack of mathematical clarity are still outstanding (it seems the authors focused more on additional experiments). Some issues: the MDP definition is still imprecise. The GNN embeddings are definitely not part of the state itself, but are a representation based on the topology. The state is independent of how you choose to represent it for RL. The action space should be defined by specifying the constraints, and not when discussing the masking of the neural net outputs (which itself is a fairly trivial technique).  I'd suggest discussing the MDP definition in the main text before giving the details of the embedding technique.\n\n**Q1**. Regarding the statistical test: which test is carried out needs to be specified (e.g., t-test, Mann-Whitney U, etc.), and the authors should make sure the assumptions are satisfied. What are the significance values showing -- the results are comparing MetroGNN *and what else*? I still think 95% confidence intervals should be shown for every method (e.g., using the plusminus sign). Furthermore, Figure 5 should also include error bars.\n\n**Q2**. My main concern about limited scalability has been addressed well. On this point, I think the min / max lat / lon rows in Table 1 do not add anything and should be removed. If you want to keep this as a table, consider adding other informative metrics (e.g. mean degree, average / maximum path length). Otherwise, you might delete entirely and inline the description of the number of nodes and edges.\n\nGiven the presentational and evaluation issues, in my opinion the paper is not ready for publication in its current form. Given the lack of precision in the presentation I also have a certain level of skepticism regarding the reliability of the method and the presented results. I do think that the results are promising and I would encourage the authors to resubmit to another venue after taking the time address these comments thoroughly."
                    }
                },
                "number": 11,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7259/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700576562124,
                "cdate": 1700576562124,
                "tmdate": 1700576562124,
                "mdate": 1700576562124,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "tdzSm65iGS",
                "forum": "VeFmnRmoaW",
                "replyto": "2h6nbuaGwV",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7259/Reviewer_WxNe"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7259/Reviewer_WxNe"
                ],
                "content": {
                    "title": {
                        "value": "Further response to authors"
                    },
                    "comment": {
                        "value": "Thanks for the further engagement -- given the improved evidence that the evaluation is robust, I am raising my score to a 5. My assessment is that the clarity of the presentation needs improving (to an extent that is not really solvable within the space of a rebuttal window), but a basic \"weight of experimental evidence\" bar has now been cleared in my opinion."
                    }
                },
                "number": 17,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7259/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700740086935,
                "cdate": 1700740086935,
                "tmdate": 1700740086935,
                "mdate": 1700740086935,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "1fn4zgVnMV",
            "forum": "VeFmnRmoaW",
            "replyto": "VeFmnRmoaW",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7259/Reviewer_6Gv3"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7259/Reviewer_6Gv3"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes a graph-based Reinforcement Learning (RL) framework to solve the metro network expansion task (a geometrical combinatorial optimization problem) for maximizing overall OD flow satisfaction with several constraints, e.g., total budget, spacing between stations, and line straightness. The proposed framework, MetroGNN, incorporates Graph Neural Networks (GNN) and an attentive policy network with an action mask to learn representations for urban regions and select new metro stations. The experiments conducted on real-world urban data of Beijing and Changsha demonstrate that the proposed MetroGNN can improve OD flow satisfaction by over 30% against the state-of-the-art RL-based approach."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. This paper proposes to solve a complex metro network expansion problem by using a graph-based reinforcement learning framework. The problem is significant, and the solution makes sense to me. \n2. The proposed approach is evaluated on two real-world urban datasets collected from two Chinese metropolises, Beijing and Changsha, which demonstrates its effectiveness in improving the overall OD flow satisfaction.\n3. This paper is overall well-written and easy to follow. The illustrations are clear and helpful to understand this paper."
                },
                "weaknesses": {
                    "value": "1. The technical contributions of this work are limited. While the metro network expansion task is essentially a transportation network combinatorial optimization problem, there have been many existing works [1] studying how to apply RL combined with GNN or attention to address it. It seems the authors only introduce some of the same or similar methods to a specific combinatorial optimization problem. However, there are no substantial technical innovations.\n2. While this work investigates a realistic metro network expansion problem, it only aims to optimize the total satisfied OD flow. However, many other factors need to be considered and optimized to construct a realistic metro network, e.g., social equity or fairness, environmental impact, and revenues. It’s hard to evaluate whether the proposed method is applicable in real scenarios.\n3. Some important experimental setups are not mentioned or clearly described. For example, the statistics and analysis of datasets. The implementation and hyper-parameter details of baselines. Such information is very significant for the evaluation of experimental reliability. \n\n[1] Wang Q, Tang C. Deep reinforcement learning for transportation network combinatorial optimization: A survey[J]. Knowledge-Based Systems, 2021, 233: 107526."
                },
                "questions": {
                    "value": "1. The collected real OD flow data are based on the realistic transportation network. If the metro networks have be changed, how can the authors obtain the corresponding OD flow?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7259/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698718226811,
            "cdate": 1698718226811,
            "tmdate": 1699636865496,
            "mdate": 1699636865496,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "ds5zzmi8fs",
                "forum": "VeFmnRmoaW",
                "replyto": "1fn4zgVnMV",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7259/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7259/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for recognizing our work. We sincerely hope the following responses can address your remaining concerns.\n\n**Q1. The authors only introduce some of the same or similar methods to a specific combinatorial optimization problem without substantial technical innovations.**\n\n**Response:** Thank you for your comment. We would like to summarize the innovations of our work as follows:\n\n- **We propose a specifically designed GNN model for heterogeneous multi-graphs.** This model enables effective capturing of intricate patterns in OD trips which is overlooked by traditional methods.\n- **We scale up the metro network more than tenfold compared to existing studies.** The attentive policy network and carefully designed action mask enhances the agent's efficiency in exploring the solution space, enabling our proposed RL model to handle urban region graphs of more than one thousand nodes.\n- **Our proposed model exhibits remarkable transferability.** The trained model demonstrates its ability to quickly generate high-quality expansion solutions when faced with different metro networks or varying OD trips. Please refer the response to Q2 of reviewer zGme for more details. This adaptability distinguishes our approach and enhances its applicability across diverse scenarios.\n\n\n**Q2. Many other factors need to be considered and optimized to construct a realistic metro network, e.g., social equity or fairness, environmental impact, and revenues.**\n\n**Response:** We genuinely appreciate your comment on the problem formulation and completely agree that metro network expansion requires careful consideration of multiple factors. On the one hand, the primary objective of the metro network is to effectively address the travel needs of citizens, thus we believe that the OD flow is a decisive factor in the planning of the metro network. On the other hand, we add additional experiments that incorporate the **social equity** consideration. Specifically, we quantify the inequity as the **population-weighted variance of the shortest distance from regions to the metro network**, and use the decline in inequality for evaluation. We also introduce $\\alpha$ and $\\beta$ for the adjustment of the weighting between OD flows and equity, respectively. As shown in the following table (higher is better), **our proposed MetroGNN consistently outperforms DRL-CNN under different weightings, achieving better expansion targets with lower variance** (\\* denotes to p-value < 0.1, and \\*\\* denotes to p-value < 0.05).\n\n\n|       Method        | $\\alpha=1.0,\\beta=0.0$ |                 |                     | $\\alpha=0.5,\\beta=0.5$ |                 |                     | $\\alpha=0.0,\\beta=1.0$ |                 |                    |\n|:-------------------:| ---------------------- | --------------- | ------------------- | ---------------------- | --------------- | ------------------- | ---------------------- | --------------- | ------------------ |\n|                     | OD                     | equity          | weighted            | OD                     | equity          | weighted            | OD                     | equity          | weighted           |\n|       DRL-CNN       | 15.78$\\pm$ 1.33        | 12.32$\\pm$ 1.46 | 15.78$\\pm$ 1.33     | 13.20$\\pm$ 1.72        | 20.72$\\pm$ 1.94 | 16.96$\\pm$ 1.80     | 11.86$\\pm$ 2.32        | 26.70$\\pm$ 2.16| 26.70$\\pm$ 2.16|\n|MetroGNN| 18.93$\\pm$ 0.87  ** |   11.58$\\pm$ 0.26     | 18.93$\\pm$ 0.87  ** |      16.50$\\pm$ 1.14 **                 |   23.90$\\pm$ 1.28     | 20.20$\\pm$ 1.21  ** |                 10.49$\\pm$ 1.85       |  28.42$\\pm$ 1.49  *      | 28.42$\\pm$ 1.49  * |\n| impr% v.s.  DRL-CNN |            19.96            |   -6.01     | 19.96               |           25.00             |    15.35    | 19.10               |             -11.55           |    6.44    | 6.44               |\n\n\nAbove results have been added in Section A.7."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7259/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700413765935,
                "cdate": 1700413765935,
                "tmdate": 1700413765935,
                "mdate": 1700413765935,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "4VujhT9cy4",
                "forum": "VeFmnRmoaW",
                "replyto": "1fn4zgVnMV",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7259/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7259/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "**Q3. Some important experimental setups are not mentioned or clearly described. For example, the statistics and analysis of datasets and implementation details of baselines.**\n\n**Response:** Thank you for bringing this to our attention. We have added the details of the dataset at Experiment section, and the implementation of baselines are added at Appendix A.3.\n\n**Q4. The collected real OD flow data are based on the realistic transportation network. If the metro networks have been changed, how can the authors obtain the corresponding OD flow?**\n\n**Response:** Thank you for this valuable comment. Though there are actually no methods that can predict the OD flow after expansion, research [1] provides an idea for evaluating the feasibility of a metro network to cope with changing OD flows. Following [1], we assume that OD flows do not change drastically after the expansion of the metro network, and add a 5% random noise to all OD trips. As shown in the follow table, **MetroGNN outperforms the DRL-CNN with p-value < 0.003** and allows small variations in OD flow (experiments are repeated for 10 times with different random seeds).\n\n\n\n| Method              | 1         | 2         | 3         | 4         | 5         | 6         | 7         | 8         | 9         | 10        |\n| ------------------- | --------- | --------- | --------- | --------- | --------- | --------- | --------- | --------- | --------- | --------- |\n| MPG                 | 12.71     | 12.49     | 11.87     | 9.18      | 13.54     | 15.77     | 14.53     | 18.80     | 13.61     | 14.86     |\n| DRL-CNN             | 15.93     | 14.31     | 15.86     | 15.10     | **16.76** | 15.71     | 16.57     | 17.29     | 16.57     | **17.98** |\n| MetroGNN**          | **18.63** | **16.93** | **17.91** | **16.58** | 16.69     | **19.44** | **18.83** | **20.17** | **17.79** | 17.48     |\n| impr% v.s.  DRL-CNN | 16.95     | 18.31     | 12.93     | 9.80      | -0.42     | 23.74     | 13.64     | 16.66     | 7.36      | -2.78     |\n\n\n[1] Wang, L., Jin, J. G., Sibul, G., & Wei, Y. (2023). Designing Metro Network Expansion: Deterministic and Robust Optimization Models. Networks and Spatial Economics, 23(1), 317-347.\n\nThe above results are shown in Section A.5 of the revised manuscript.\n\nThank you again for your constructive comments and valuable feedback, and we hope the above response can address your concerns."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7259/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700413808299,
                "cdate": 1700413808299,
                "tmdate": 1700413808299,
                "mdate": 1700413808299,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "VbteORXkkW",
                "forum": "VeFmnRmoaW",
                "replyto": "1fn4zgVnMV",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7259/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7259/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Willing to further clarify your remaining concerns"
                    },
                    "comment": {
                        "value": "Dear reviewer 6Gv3,\n\nWe greatly appreciate your thorough review and positive feedback. In response to your comments, we have clarified the contributions of our work and conducted additional experiments, including the incorporation of societal equity metrics and robustness testing under varying OD trips. We would be grateful if you could confirm whether our responses have effectively addressed your concerns. We are more than willing to provide further clarification on any remaining points.\n\nThank you for your time and consideration!"
                    }
                },
                "number": 10,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7259/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700573874865,
                "cdate": 1700573874865,
                "tmdate": 1700573874865,
                "mdate": 1700573874865,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "QfhhgXyTHh",
                "forum": "VeFmnRmoaW",
                "replyto": "VbteORXkkW",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7259/Reviewer_6Gv3"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7259/Reviewer_6Gv3"
                ],
                "content": {
                    "comment": {
                        "value": "I thank the authors for their detailed responses to my comments. However, I still have concerns regarding W1. Despite this is an application paper, the GNN encoder is a straightforward adaption. Regarding scalability and transferability, if those are the key innovations of this paper, the authors are suggested to elaborate more about the design insight of the framework about which part the scalability and transferability come from and why they outperform existing baselines."
                    }
                },
                "number": 14,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7259/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700656422768,
                "cdate": 1700656422768,
                "tmdate": 1700656422768,
                "mdate": 1700656422768,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "cL5vP2bqyX",
            "forum": "VeFmnRmoaW",
            "replyto": "VeFmnRmoaW",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7259/Reviewer_zGme"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7259/Reviewer_zGme"
            ],
            "content": {
                "summary": {
                    "value": "Selecting urban regions for traffic route construction to maximize origin-destination flow is a hard optimization problem because the solution space grows exponentially on the number of nodes. This paper models this problem as a MDP and applies reinforcement learning (RL) algorithms to search for a good solution.  This paper uses a graph neural network to learn the state representation and use action masks to rule out unavailable actions. The empirical results show this method increases the total origin-destination flow by 30% compared with state-of-the-art methods."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "1 poor"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. This paper builds an end-to-end reinforcement learning algorithm to find a good solution in a combinatorial optimization problem - traffic routes construction. To learn this solution efficiently, this paper builds a graph neural network to learn the state representation.\n\n2. Its empirical results show this method increases the total origin-destination flow by 30% compared with state-of-the-art methods."
                },
                "weaknesses": {
                    "value": "1. My major concern is that this paper does not have enough novelty to be published in a top machine learning venue. Indeed, selecting urban regions for traffic route construction to maximize origin-destination flow is a hard optimization problem because the solution space grows exponentially on the number of nodes. However, reinforcement learning (RL) has been known to be a useful tool for searching solutions in a large solution space since 1996 [1].\n\n2. Moreover, using graph neural networks to learn state representation is also not a novel technique. The network proposed in this paper is not well-justified to have sufficient novelty.\n\n3. Using action masks to eliminate infeasible regions is also a common approach in RL applications.\n\n4. Other than insufficient novelty in the algorithm, the model built by this paper is also preliminary. For example, it is natural to consider that more regions could emerge as the city is expanding. The model in this paper is obviously not a high-fidelity model that could be used in real construction.\n\n5. This paper is not well-written. The details of the model and algorithms are not defined in a clear and mathematical way. The presentation and coherence of this paper could be greatly improved by deleting excessive words and sentences.\n\n[1] Bertsekas, D. P. and Tsitsiklis, J. N. (1996). Neuro-Dynamic Programming. Athena Scientific Belmont, MA."
                },
                "questions": {
                    "value": "N/A"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission7259/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission7259/Reviewer_zGme",
                        "ICLR.cc/2024/Conference/Submission7259/Senior_Area_Chairs"
                    ]
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7259/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698811658041,
            "cdate": 1698811658041,
            "tmdate": 1700952294477,
            "mdate": 1700952294477,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "6wNBy3V3in",
                "forum": "VeFmnRmoaW",
                "replyto": "cL5vP2bqyX",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7259/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7259/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for your valuable comments and we sincerely hope the following responses can address your concerns.\n\n**Q1. This paper does not have enough novelty to be published in a top machine learning venue. The reinforcement learning, GNNs and action masks are already widely used.**\n\n**Response:** Thank you for your concern on the innovation of our work. We would like to summarize the three major technical innovations of our work as follows:\n- **We propose a novel GNN model specially designed for heterogeneous multi-graphs.** It allows us to effectively capture the intricate patterns of OD trips, while traditional methods merely focus on the spatial information of regions. \n- **We scale up the problem to more than ten times larger than those considered in previous studies.** With the attentive policy network and the meticulously designed action mask, the agent can search the solution space much more efficiently, enabling our proposed RL model to handle urban region graphs of more than one thousand nodes. \n- **Our proposed model exhibits excellent transferability.** The trained model demonstrates the ability to swiftly generate high-quality expansion solutions when confronted with different metro networks or varying OD trips. Please refer the response to Q2 for more details. This adaptability sets our approach apart and enhances its utility across diverse scenarios.\n\n\n\n**Q2. The model built by this paper is also preliminary, not considering cities' expansion.**\n\n**Response:** Thank you for your constructive comment on the expansion of cities, and we have added a series of experiments to showcase how our model handle the growing urban regions. Firstly, **we remove 20% of the fringe regions of the city to train our model and then applied the trained model to the original complete urban regions**. The following table illustrate the strong transferability of MetroGNN. When directly applied to a larger city, MetroGNN can quickly (within 20 seconds) generate solutions which are comparable to DRL-CNN. **Notably, the fine-tuned model shows an improvement of more than 10.2% over the DRL-CNN** (\\* denotes to p-value < 0.1, and \\*\\* denotes to p-value < 0.05).\n| from scratch**  | directly transfer | fine-tune*      | DRL-CNN         |\n| --------------- | ------------------ | --------------- | --------------- |\n| 18.93 $\\pm$ 0.87 | 15.64 $\\pm$ 1.25 |  17.39 $\\pm$ 1.04   | 15.78 $\\pm$ 1.33 |\n\nSecondly, **we introduce 5% noise to OD trips data with 10 different seeds to simulate the changes with urban development**. The following table demonstrates that **MetroGNN can allow variations in OD flow and still outperforms existing approaches**.\n\n| Method              | 1         | 2         | 3         | 4         | 5         | 6         | 7         | 8         | 9         | 10        |\n| ------------------- | --------- | --------- | --------- | --------- | --------- | --------- | --------- | --------- | --------- | --------- |\n| MPG                 | 12.71     | 12.49     | 11.87     | 9.18      | 13.54     | 15.77     | 14.53     | 18.80     | 13.61     | 14.86     |\n| DRL-CNN             | 15.93     | 14.31     | 15.86     | 15.10     | **16.76** | 15.71     | 16.57     | 17.29     | 16.57     | **17.98** |\n| MetroGNN**          | **18.63** | **16.93** | **17.91** | **16.58** | 16.69     | **19.44** | **18.83** | **20.17** | **17.79** | 17.48     |\n| impr% v.s.  DRL-CNN | 14.49     | 15.48     | 11.45     | 8.93      | -0.42     | 19.19     | 12.00     | 14.28     | 6.86      | -2.86     |"
                    },
                    "title": {
                        "value": "Response to reviewer zGme Part1"
                    }
                },
                "number": 1,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7259/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700413334144,
                "cdate": 1700413334144,
                "tmdate": 1700656718173,
                "mdate": 1700656718173,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "ir0sjdozAt",
                "forum": "VeFmnRmoaW",
                "replyto": "cL5vP2bqyX",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7259/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7259/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to reviewer zGme Part2"
                    },
                    "comment": {
                        "value": "**Q3.  The details of the model and algorithms are not defined in a clear and mathematical way, and this paper could be greatly improved by deleting excessive words and sentences.**\n\n**Response:** Thank you for your valuable comments on the presentation. We have added clear mathematical description of the MDP and the RL framework in Method section and Appendix A.1. We have also removed unnecessary expressions to make the article more concise. We provide critical descriptions of MDP as follows:\n\n- **State:** The state $S_t$ is a three-tuple $(\\mathcal{M}_t, b_t, l_t)$ containing the current metro network $\\mathcal{M}_t=(\\mathcal{V}_t,\\mathcal{E}_t)$, the remaining budget $b_t$, and the number of new metro lines that can be built $l_t$.\n- **Action:** The action $A_t$ corresponds to the selection of a single node in $\\mathcal{N}$. Considering that the metro network expansion includes the extension of existing lines and the construction of new lines and needs to satisfy corresponding constraints, available actions are defined as:\n  $A(S_t=(\\mathcal{M}_t, b_t))=\\{n \\in \\mathcal{N} | n \\in (\\mathcal{X}^e(\\mathcal{M}_t,b_t) \\cup \\mathcal{X}^c(\\mathcal{M}_t,b_t,l_t)) \\},$\nwhere $\\mathcal{X}^e(\\mathcal{M}_t,b_t)$ and $\\mathcal{X}^c(\\mathcal{M}_t,b_t,l_t)$ represent the set of regions that are available for extension and construction based on specific constraints, respectively. The details of diverse constraints are in Section A.1.\n- **Reward:** Referring to the definition of total satisfied OD flow in Equation 1, the intermediate reward $R_t$ for action $A_t$ is defined as ${C_{od}(\\mathcal M_t)-C_{od}(\\mathcal{M}_{t-1})}$."
                    }
                },
                "number": 15,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7259/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700656897349,
                "cdate": 1700656897349,
                "tmdate": 1700656897349,
                "mdate": 1700656897349,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "Nsz7AE2GKw",
                "forum": "VeFmnRmoaW",
                "replyto": "cL5vP2bqyX",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7259/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7259/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Looking forward to further discussion"
                    },
                    "comment": {
                        "value": "Dear reviewer zGme,\n\nIn our response, we have provided clear illustrations of our contributions, enhanced the mathematical description of our model, and conducted supplementary experiments according to your constructive suggestions. We would greatly appreciate it if you could take a moment to confirm whether our responses have effectively addressed your concerns. We are looking forward to any additional feedback you may have.\n\nThank you for your time and consideration!"
                    }
                },
                "number": 16,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7259/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700737610339,
                "cdate": 1700737610339,
                "tmdate": 1700737610339,
                "mdate": 1700737610339,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]