[
    {
        "title": "Provably Efficient Iterated CVaR Reinforcement Learning with Function Approximation and Human Feedback"
    },
    {
        "review": {
            "id": "BvjRm3yWuR",
            "forum": "vW1SkPl4kp",
            "replyto": "vW1SkPl4kp",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6915/Reviewer_DGv8"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6915/Reviewer_DGv8"
            ],
            "content": {
                "summary": {
                    "value": "This paper studies the iterated CVaR objective RL under both linear and general function approximations. Additionally, the authors have incorporated human feedback into the framework. The paper offers theoretical guarantees for all the proposed algorithms in various settings."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "This paper is well-written and well-organized. It effectively conveys the high-level intuition behind the algorithm. The paper provides a comprehensive discussion of the theoretical results for iterated CVaR RL in various settings, including linear function approximation, general function approximation, and the incorporation of human feedback. Notably, the paper introduces a novel approximation operator for the true CVaR operator in the linear approximation setting, which could be of independent interest."
                },
                "weaknesses": {
                    "value": "The technical aspects of the algorithms appear somewhat limited and are relatively standard in the literature. Additionally, the algorithms are not efficient, and obtaining a solution for the approximate CVaR operator is not easy."
                },
                "questions": {
                    "value": "Some typos:\n\nOn page 2, in the first bullet, $\\sqrt{\\alpha^{-H}}$ → $\\sqrt{\\alpha^{-2}}$\n\nOn page 8, it should be $\\sigma(x)$ in regularity.\n\nWhat is $\\tilde{\\sigma}$ in equation (14)?\n\nCompared with the tabular setting, why the linear case has a bad dependence on H?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6915/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698464363533,
            "cdate": 1698464363533,
            "tmdate": 1699636804546,
            "mdate": 1699636804546,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "EvsB122Qem",
                "forum": "vW1SkPl4kp",
                "replyto": "BvjRm3yWuR",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6915/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6915/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Reply to the review by Reviewer DGv8"
                    },
                    "comment": {
                        "value": "### Weakness\n\n> The technical aspects of the algorithms appear somewhat limited and are relatively standard in the literature. Additionally, the algorithms are not efficient, and obtaining a solution for the approximate CVaR operator is not easy.\n\nWe appreciate your comments on the technical aspects and efficiency of our algorithms. In our paper, we propose several novel techniques in designing and analyzing sample-efficient algorithms for ICVaR-RL with function approximation and human feedback. We would like to emphasize several novel contributions that enhance the technical depth and uniqueness of our work. \n\n1. **Efficient Approximation of CVaR Operator (Section 4.1):** In this paper, we introduce a pioneering method for approximating the CVaR operator with provably bounded error and polynomial computational complexity. Our theoretical analysis demonstrates that the maximum difference between the approximate and true operators is small. Further details on this contribution are provided in Section 4.1.\n2. **Novel transition estimation and concentration (Section 4.1):** We present novel least-square estimation and ridge regression techniques with innovative regression features. These advancements provide the first efficient approximation of the transitions in ICVaR-RL with linear function approximation.\n3. **Novel elliptical potential lemma (Section 4.2):** We introduce a novel elliptical potential lemma (the elliptical potential lemma is an important technical tool in studying RL with function approxiamtion) that achieves a sharper order $O(\\log K)$ regret in terms of $K$ , improving the previous result $O(\\sqrt{K})$ (Ayoub et al., 2020; Fei et al., 2021; Russo and Van Roy, 2014). We have detailed this novelty in Section 4.2.\n4. **Risk-sensitive RLHF(Section 5):** We extend ICVaR-RL to encompass RLHF with general function approximation for both transition probabilities and reward modeling. This formulation represents the first for risk-sensitive RLHF. Furthermore, we introduce the first provably sample-efficient algorithm, ICVaR-HF, with a discretization approach for infinite reward function sets and a novel regret decomposition method to bridge the gap in the risk-sensitive value function. These advancements are detailed in the Section 5.\n\nRegarding computational tractability, we would like to clarify that ICVaR-L with approximate CVaR operator only has polynomial complexity. A detailed analysis of computation and space complexity is presented in the \"Computation Efficiency\" paragraph on page 5.\n\nWe believe these technical contributions significantly enhance the efficiency of our algorithms and provide brand-new technical tools for risk-sensitive RL with function approximation and human feedback. Thank you for your valuable feedback.\n\n\n### Question\n> 1. On page 2, in the first bullet, $\\sqrt{\\alpha^{-H}} \\to \\sqrt{\\alpha^{-2}}$.\n\nActually, this is not a typo. It is to show that the exponential term $\\sqrt{\\alpha^{-H}}$ in the regret bound is unavoidable.\n\n> 2. On page 8, it should be $\\sigma(x)$ in regularity.\n\nWe are not sure we fully understand your question. If you meant that we should assume $\\sigma(x)$ is regular, we do assume that the link function $\\sigma$ has the properties of \"Regularity\" in Assumption 4. If you have further questions, please do not hesitate to let us know.\n\n\n> 3. What is $\\tilde\\sigma$ in equation (14)?\n\n$\\tilde\\sigma$ is formally defined in equation (14). This notation is introduced to simplify the log-likelihodd function $\\mathcal{L}_k(r)$, and make the proof clear.\n\n> 4. Compared with the tabular setting, why the linear case has a bad dependence on H?\n\nIn the linear case, the bad dependence on $H$ is a shared characteristic with previous works in RL with linear function approximation (Jin et al., 2020, Zhou et al., 2021a, Zhou et al., 2021b).\nUnlike the tabular setting where the transition distribution is estimated by the sample-mean empirical probability directly, we use ridge regression for estimating the transition parameter in the linear case, which relies on the construction of regression feature corresponding to the value function within the range $[0, H]$. This design choice introduces an additional regret cost associated with $H$.\n\nImproving the $H$ term in linear function approximation is an interesting topic, and is a topic of our future research. \n\n---\nWe sincerely thank the reviewer for the invaluable feedback. Should our response effectively address your concerns, we kindly hope that you could consider raising the score rating for our work. We will also be happy to address any additional queries or points."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6915/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700418146488,
                "cdate": 1700418146488,
                "tmdate": 1700418146488,
                "mdate": 1700418146488,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "XlSkvvMZdz",
            "forum": "vW1SkPl4kp",
            "replyto": "vW1SkPl4kp",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6915/Reviewer_CSXT"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6915/Reviewer_CSXT"
            ],
            "content": {
                "summary": {
                    "value": "This paper considers the risk-sensitive RL under an Iterated Conditional Value-at-Risk (CVaR) objective. Both linear and general function approximations are discussed in this work. Several algorithms are proposed to address such problems with the provable complexity analysis. A novel efficient approximation of the CVaR operator and a new ridge regression\nwith CVaR-adapted regression features are also provided. Besides, human feedback is integrated into this framework."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "This paper is easy to follow, and the technique novelty is clear. To address the risk-sensitive RL under an Iterated Conditional Value-at-Risk (CVaR) objective, the authors propose two sample\nefficient algorithms with sample complexity analysis, ICVaR-L and ICVaR-G, for two different function approximations correspondingly. Also, the upper regret bounds of algorithms are provided. Besides, the authors consider the risk-sensitive RL in the human feedback setting."
                },
                "weaknesses": {
                    "value": "While I typically do not complain about the empirical results of this paper, I do expect that some implemented results on real-world practical problems could be contained in this paper."
                },
                "questions": {
                    "value": "no comment."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission6915/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6915/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6915/Reviewer_CSXT"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6915/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698744975107,
            "cdate": 1698744975107,
            "tmdate": 1699636804416,
            "mdate": 1699636804416,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "vVBUx0Kr9k",
                "forum": "vW1SkPl4kp",
                "replyto": "XlSkvvMZdz",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6915/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6915/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Reply to the review by Reviewer CSXT"
                    },
                    "comment": {
                        "value": "### Weakness\n> While I typically do not complain about the empirical results of this paper, I do expect that some implemented results on real-world practical problems could be contained in this paper.\n\nWe acknowledge the importance of practical validation through experimentation to underline the significance and verify the efficiency of our proposed algorithms. In our revision, we have addressed this concern by including numerical experiments in Appendix C. We compare our sample and computation effiticent algorithm ICVaR-L with two close baselines: LSVI (Zhou et al., 2021b) for risk-neutral Linear RL and ICVaR-VI (Du et al., 2023) for ICVaR-RL in tabular MDPs.\n\nThe results are presented in Figure 1 and 2 (Appendix C in our revision). As depicted in Figure 1 and 2, ICVaR-L consistently exhibits a sublinear regret with respect to the number of episodes, validating our theoretical result in Theorem 1.  Comparing ICVaR-L with the tabular algorithm ICVaR-VI, our algorithm demonstrates faster learning of the optimal risk-sensitive policy, highlighting its efficiency in ICVaR-RL with linear function approximation. Furthermore, LSVI exhibits nearly linear regret with the number of episodes, indicating its struggle to learn the optimal risk-sensitive policy.\n\nThese experimental evidences demonstrate the efficiency of ICVaR-L in risk-sensitive linear RL scenarios, providing empirical support for its theoretical advancements.\n\n---\nWe sincerely thank the reviewer for the invaluable feedback. Should our response effectively address your concerns, we kindly hope that you could consider raising the score rating for our work. We will also be happy to address any additional queries or points."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6915/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700418108707,
                "cdate": 1700418108707,
                "tmdate": 1700418108707,
                "mdate": 1700418108707,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "P2RZqub7ig",
            "forum": "vW1SkPl4kp",
            "replyto": "vW1SkPl4kp",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6915/Reviewer_wJB8"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6915/Reviewer_wJB8"
            ],
            "content": {
                "summary": {
                    "value": "This work focuses on risk-sensitive reinforcement learning for large state space. It propses three variants of Iterated Conditional Value-at-Risk (CVaR) algorithms for linear function approximation, general function approximation, and with human feedback respectively. Moreover, it provides theoretical analysis on the regret bound for each of the algorithms."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "1 poor"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "To the best of my knowledge, this paper is distinctive in its provision of the first theoretical analysis on regret bounds for ICVaR-RL algorithms in non-tabular settings. It sets a precedent which could lead to significant advancements in this field. Additionally, the introduction of human feedback into risk-sensitive RL opens a potentially fruitful avenue for future research."
                },
                "weaknesses": {
                    "value": "1. The presentation can be further enhanced in terms of clarity and logic:\n\n   - In the first paragraph on page 2, the paper introduces two proposed algorithms but fails to sufficiently detail how these tools embody and implement the ICVaR concept. This lack of substance makes the uniqueness and contribution of your algorithms unclear.\n\n   - The main argument presented in the second paragraph on page 2 is confusing. It's unclear whether the intention is to highlight the importance of integrating human feedback, with LLM as a successful example of this, or to underline the significance of risk-sensitive RL, with ChatGPT as an example. Additionally, why is \" LLMs operate in diverse conversational landscapes, where defining reward signals unequivocally is challenging\" relevant here?\n\n   - The third paragraph on page 2 attempts to give an outline of the key challenges in theoretical analysis for ICVaR algorithms with function approximation and human feedback. However, critical concepts and symbols which outline these challenges are not adequately defined or explained, which hinders the comprehension of arguments. For instance, without further context or clarification, the term \"key elliptical potential lemma\" remains obscure to readers. Moreover, the majority of the \"challenges\" outlined are essentially highlighting that current proof techniques and results cannot be seamlessly applied to your problem setting. However, there's a lack of explanation rooted in the problem's inherent characteristics.\n\n2. Limited discussion on the intuition and implications of their theoretical bounds, making it difficult to understand the relevance and significance of these results.\n\n3. Absence of algorithm implementation or experimental results limits the understanding of the theoretical results' real world impact and applicability. Practical validation through experimentation is essential to underline the significance and verify the efficiency of the proposed algorithms, which has been neglected in this paper."
                },
                "questions": {
                    "value": "See the weaknesses section."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6915/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698820666814,
            "cdate": 1698820666814,
            "tmdate": 1699636804274,
            "mdate": 1699636804274,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "SN0UVZNFgA",
                "forum": "vW1SkPl4kp",
                "replyto": "P2RZqub7ig",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6915/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6915/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Reply to the review by Reviewer wJB8 - Part 1"
                    },
                    "comment": {
                        "value": "### Weakness 1\n> 1. In the first paragraph on page 2, the paper introduces two proposed algorithms but fails to sufficiently detail how these tools embody and implement the ICVaR concept. This lack of substance makes the uniqueness and contribution of your algorithms unclear.\n\nTo maintain the readability of the introduction section, in this paragraph, we only briefly mention our algorithms ICVaR-L and ICVaR-G, as an introduction to the contribution of our paper, and defer the in-depth details for handling the Iterated CVaR concept to Section 4.\n\nWe agree with you that this could be made more explicit. Thus, we have revised the introduction to include pointers that guide readers to the detailed discussion in Section 4.\n\nWe believe this modification strikes a balance between maintaining readability of the introduction section and ensuring that readers access the necessary details in the corresponding sections. We hope this adjustment addresses your concern effectively.\n\n\n\n> 2. The main argument presented in the second paragraph on page 2 is confusing. It's unclear whether the intention is to highlight the importance of integrating human feedback, with LLM as a successful example of this, or to underline the significance of risk-sensitive RL, with ChatGPT as an example. \n\nIn the second paragraph on page 2, we use the example of LLM, specifically ChatGPT, to illustrate the practical relevance of risk-sensitive measures in Reinforcement Learning with Human Feedback (RLHF). Our intention is twofold. Firstly, we use it to underscore the importance of RLHFs, highlighting the practical efficacy of this approach. Secondly, we aim to emphasize the relevance of risk-sensitive RLHF, using ChatGPT as an example to illustrate the necessity of managing risks in RLHF.\n\nRegarding the statement, 'LLMs operate in diverse conversational landscapes, where defining reward signals unequivocally is challenging,' the relevance lies in demonstrating the difficulty of defining explicit reward signals in environments where LLMs operate, which necessitates the use of human feedback oracles in LLM problems (Glaese et al., 2022; Lee et al., 2023) . For instance, in the case of LLM, providing exact reward values for each response is challenging due to the nuanced and diverse nature of conversational landscapes. Consequently, researchers resort to human feedback oracles to gain a better understanding of the underlying reward dynamics and to enhance the performance of LLMs (Ouyang et al., 2022; Gulcehre et al., 2023).\n\nIn response to your feedback, we have revised this paragraph to clearly express our intention and motivation. We believe these examples about LLMs effectively illustrate the practical significance of risk-sensitive RLHF, and we hope this clarification and our revision effectively address your concerns.\n\n\n> 3. The third paragraph on page 2 attempts to give an outline of the key challenges in theoretical analysis for ICVaR algorithms with function approximation and human feedback. However, critical concepts and symbols which outline these challenges are not adequately defined or explained, which hinders the comprehension of arguments. For instance, without further context or clarification, the term \"key elliptical potential lemma\" remains obscure to readers. Moreover, the majority of the \"challenges\" outlined are essentially highlighting that current proof techniques and results cannot be seamlessly applied to your problem setting. However, there's a lack of explanation rooted in the problem's inherent characteristics.\n\n\nIn the third paragraph of the Introduction section, we outline the key challenges in designing and analyzing ICVaR-RL with function approximation and human feedback. To facilitate reading of the Introduction, we only present a high-level summary of these challenges, with detailed explanations provided in subsequent sections. \n\nThese challenges are deeply rooted in the inherent characteristics of the problem and cannot be addressed through the straightforward application of existing techniques. For instance, ICVaR-RL poses inherent difficulties due to the distortion of the distribution of every transition by the CVaR measure, disrupting the linearity of the risk-neutral Bellman Equation. Additionally, when dealing with a large or even infinite state space, efficient computation of the CVaR operator becomes impossible. These difficulties are fundamental to the problem and go beyond the limitations of previous techniques, highlighting the necessity for novel approaches to address these intrinsic difficulties.\n\nIn response to your concerns, we have refined this paragraph by providing a more accessible overview to ensure the key challenges are effectively conveyed. Please refer to the third paragraph in page 2 of the revision."
                    }
                },
                "number": 1,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6915/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700418008577,
                "cdate": 1700418008577,
                "tmdate": 1700418008577,
                "mdate": 1700418008577,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "PxzseYysQm",
                "forum": "vW1SkPl4kp",
                "replyto": "P2RZqub7ig",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6915/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6915/Authors"
                ],
                "content": {
                    "title": {
                        "value": "We are happy to answer your further question"
                    },
                    "comment": {
                        "value": "Dear Reviewer wJB8,\n\nAs the author reviewer discussion period is ending soon, we sincerely thank you for the invaluable feedback. Should our response effectively address your concerns, we kindly hope that you could consider raising the score rating for our work. We will also be happy to address any additional queries or points.\n\nBest regards,\nAuthors"
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6915/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700579874477,
                "cdate": 1700579874477,
                "tmdate": 1700579874477,
                "mdate": 1700579874477,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "HpxpkGnx8m",
                "forum": "vW1SkPl4kp",
                "replyto": "SN0UVZNFgA",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6915/Reviewer_wJB8"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6915/Reviewer_wJB8"
                ],
                "content": {
                    "comment": {
                        "value": "Dear Authors,\n\nThank you for your responses. They have clarified most of my existing concerns. However, I'll keep my score as I believe the manuscript needs a more comprehensive revision as outlined below:\n\n1/ There is a need for a more explicit summary of the two proposed algorithms. I recommend a brief overview outlining the **key changes/improvements in relation to the current literature** rather than referring to the subsections. A concise explanation of your contributions in the introduction would be sufficient, provided it comprehensively reflects your understanding of the subject.\n\n2/ The manuscript would benefit from a more focused revision centred around its unique challenges and contributions. For instance, while GPT/LLM is used to underline the significance of RLHF, the paper primarily discusses theoretical bounds for RLHF on sensitive RL. GPT/LLM may be related but does not directly highlight the key challenges of this work.The use of an entire paragraph in the introduction dedicated to these examples can be confusing for readers as it diverts from the focus of this study. Moreover, if GPT/LLM is crucial to your work, then incorporating an explanation and experiments demonstrating how your proposed bounds and algorithms can help solve existing reward design problems in GPT/LLM, would be insightful.\n\n3/ The inclusion of more comprehensive experimental results within the main text would greatly enhance the significance of this study. A structural revamp of the manuscript might be needed to incorporate this section suitably."
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6915/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700606727466,
                "cdate": 1700606727466,
                "tmdate": 1700606727466,
                "mdate": 1700606727466,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]