[
    {
        "title": "Scalable Diffusion for Materials Generation"
    },
    {
        "review": {
            "id": "gXqLuDCEhk",
            "forum": "wm4WlHoXpC",
            "replyto": "wm4WlHoXpC",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4178/Reviewer_LWEX"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4178/Reviewer_LWEX"
            ],
            "content": {
                "summary": {
                    "value": "This paper introduces a diffusion-based method for material generation. To adapt to the typical diffusion framework such as DDPM, the authors propose a new crystal representation, claiming to represent any crystal structures, for compatibility with UNet inputs. This representation integrates the locations of atoms within the crystal as additional dimensions of the element table, resulting in an image-like tensor analogous to those used in image-based diffusion models. In addition to applying existing metrics for evaluating material generation, the authors also propose a new evaluation approach using DFT to evaluate the physical validity of the generated materials. Experiments comparing a set of existing methods together with conditional generation are conducted to demonstrate the effectiveness of the proposed method."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "+ The paper presents a solid and novel technical contribution. The methodology distinctively diverges from existing diffusion-based material generative models by introducing a novel representation, more attuned to image-based diffusion models, which has been extensively explored in existing literature.\n\n+ A notable strength of this paper lies in the introduction of a new evaluative metric designed to assess the physical validity of generated materials. The emphasis on the synthesizability of material generation is a refreshing approach, addressing an area that has seen limited exploration within the community. Using the DFT relaxation method from material science enhances the practical applicability and utility of the material generation method, providing deeper insights into its effectiveness and practicality.\n\n+ The experimental outcomes presented in the paper are quite promising. The proposed method outperforms existing models by significant margins in most evaluated cases."
                },
                "weaknesses": {
                    "value": "- The authors claim that the proposed representation is capable of capturing any crystal structure, as well as being \"scalable and flexible.\" While the completeness of the representation is clear and well-articulated, there appears to be a lack of detailed discussion regarding its redundancy or compactness. It would be beneficial if the authors could provide further explanations or experimental insights that illuminate how compact or redundant this representation might be in practice.\n\n- In the section discussing conditional generation, the use of conditioning variables seems somewhat unclear. Specifically, on Page 4 under \"Conditioned Diffusion with UniMat,\" the conditioning variables are directly concatenated with the noisy material along the last dimension. However, this approach raises questions as there appears to be a disparity in the feature spaces of the conditioning variables and the noisy material. For reference, in image conditional generation, cross-attention modules are commonly used to align the input condition (like text) with the image space effectively. Without the incorporation of a similar module in this work, the mechanism by which the conditioning variables guide the generation process remains unclear.\n\n- Regarding the method's performance, it is noted that the proposed method does not attain 100% validity on larger datasets like MP20, in contrast to simpler approaches such as CDVAE. It would enhance the paper if the authors could delve deeper into this issue, offering more insights or explanations. Including potential solutions or future directions in addressing this limitation in the limitation section would also be quite valuable."
                },
                "questions": {
                    "value": "- In Figure 1, it might be beneficial to improve clarity by adding more descriptions or labels to the element table. It actually takes me some time to decipher that it represents an element table. Providing a more explicit explanation regarding the motivation and benefits of utilizing the element table for representation would also be advantageous. It seems that one evident benefit is the shared similarities in properties among neighboring elements in the table, potentially providing a useful prior for generation. Incorporating such observations and expanding on the motivations in the Introduction section would also be helpful.\n\n- In Section 2.2, it could be helpful to include references to DDPM and extend the discussion slightly to incorporate considerations of other diffusion models, elaborating on why DDPM was the chosen approach. The discussion doesn’t need to be overly complicated: a straightforward explanation, such as the effective performance of DDPM in the authors’ use case, accompanied by some contextual background, would enhance the readers' understanding.\n\n- In the section \"Conditioned Diffusion with UniMat\" on Page 4, the statement \"While the unconditional ... training distribution\" could be refined for precision and accuracy. It might be more accurate to state that DDPM primarily learns the score function rather than directly learning the training distribution, making it challenging to quantify the extent of overlap between the learned and training distributions.\n\n- The section \"Drawbacks of Learning Based Evaluations\" in Section 2.3 is quite motivating. However, it might be more seamlessly integrated by briefly mentioning its main points in the Introduction. This could help prepare the reader for the detailed discussion that follows in Section 2.3.\n\n- On Page 5 the reference format is wrong at the end of the second paragraph."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission4178/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4178/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4178/Reviewer_LWEX"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4178/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698676659909,
            "cdate": 1698676659909,
            "tmdate": 1699636383718,
            "mdate": 1699636383718,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "o8Mpcx1Sga",
                "forum": "wm4WlHoXpC",
                "replyto": "gXqLuDCEhk",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4178/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4178/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Author Response"
                    },
                    "comment": {
                        "value": "Thank you for the positive feedback. Please let us know if our response below addresses your questions and concerns.\n\n> How compact or redundant is the UniMat representation.\n\nThe answer to this question depends on the types of materials we are modeling. For small crystals with only a few atoms in a unit cell, the UniMat representation is not compact and in fact quite redundant (e.g., 99% atoms are null atoms). However, this representation allows handling of complex structures with up to thousands of atoms. We have included this discussion in the conclusion section.\n\n> Align input conditions and generations effectively.\n\nUniMat in fact uses self-attention layers to attend over the concatenated conditioning variable and noising materials. The skip connections in a UNet can been seen as a form of cross-attention (conditioning variables are passed to attention layer through the previous skip connection). This approach to conditioning is common in spatial and temporal super-resolution diffusion models [1] [2].\n\n[1] Video Diffusion Models. Jonathan Ho, Tim Salimans, Alexey Gritsenko, William Chan, Mohammad Norouzi, David J. Fleet.\n[2] Imagen Video: High Definition Video Generation with Diffusion Models. Jonathan Ho, William Chan, Chitwan Saharia, Jay Whang, Ruiqi Gao, Alexey Gritsenko, Diederik P. Kingma, Ben Poole, Mohammad Norouzi, David J. Fleet, Tim Salimans.\n\n> Low validity on MP20.\n\nWe have found MP20 to be a more difficult dataset where scaling up the model helps with validity (Figure 4). The validity metric from CDVAE is only a proxy metric that does not fully capture the generation quality. For instance, 100% validity could be due to overfitting to the training set and mostly generating training compositions. Hence, converge metrics and property statistics should be take into account, for which UniMat has better performance. We have included this limitation in the conclusion and limitation section.\n\n> Clarity of Figure 1 and motivation of periodic table representation.\n\nWe have updated Figure 1 to indicate each cells are entries in the periodic table. We have added additional motivations for the periodic table representation in the Introduction (second paragraph on Page 2).\n\n> The choice of DDPM.\n\nSince the denoising process of a DDPM nicely corresponds to the process of gradually moving atoms in space until they reach their target location, we choose DDPM over other diffusion models (e.g., denoising score matching). We included this intuition on Page 4.\n\n> In the section \"Conditioned Diffusion with UniMat\" on Page 4, the statement \"While the unconditional ... training distribution\" could be refined for precision and accuracy.\n\nThank you for catching this detail. We have updated the text on Page 4.\n\n> Mentioning drawbacks in learning based evaluations in the Introduction.\n\nThank you for the suggestion. We have updated the Intro section (second to last paragraph on Page 2)."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4178/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700185249884,
                "cdate": 1700185249884,
                "tmdate": 1700185249884,
                "mdate": 1700185249884,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "oPW46W7VHO",
                "forum": "wm4WlHoXpC",
                "replyto": "sc6hrZuqK1",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4178/Reviewer_LWEX"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4178/Reviewer_LWEX"
                ],
                "content": {
                    "comment": {
                        "value": "Thanks for the authors' rebuttal. I will keep my positive rating."
                    }
                },
                "number": 11,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4178/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700683536411,
                "cdate": 1700683536411,
                "tmdate": 1700683536411,
                "mdate": 1700683536411,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "yaIyQxGy3u",
            "forum": "wm4WlHoXpC",
            "replyto": "wm4WlHoXpC",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4178/Reviewer_HVsx"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4178/Reviewer_HVsx"
            ],
            "content": {
                "summary": {
                    "value": "The paper presents an new approach to materials generation using diffusion models and a novel materials representation. The authors employ diffusion models, originally designed for image generation, to generate complex material structures.\n\nThis approach is to find broad applications in materials science and chemical engineering, addressing the long-standing challenge of efficiently generating diverse materials, especially in larger and more complex systems. The models jointly handle continuous atom locations and discrete atom types, overcoming challenges associated with large and complex systems. The models are trained and tested on several datasets and are compared with previous methods. The results show that the models provide better superior generation quality compared to previous state-of-the-art methods."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "The paper's approach is innovative, offering a fresh perspective on materials generation.\n\nUniMat is the standout contribution of this work. It offers an elegant solution to the representation of materials, particularly in the context of the periodic table. The concept of sparsity in representation, with adaptability to chemical system size, is novel.\nThe utilization of diffusion models together with UniMat represents a clever combination of ideas.\n\nThe generated materials of diffusion models are validated through DFT calculations. This rigorous approach ensures the stability and reliability of the generated structures.\n\nThe paper also provides a detailed background on related work in materials generation, diffusion models, and evaluation methods. This context helps readers understand the significance of their contributions. The training hyperparameters and computational resources provided in the appendix are clear and understandable."
                },
                "weaknesses": {
                    "value": "The quality improvement of the paper is significant, especially for scaling up to large materials datasets. However, it would be helpful to provide a more in-depth analysis of the quantitative metrics and benchmarks used to make these comparisons."
                },
                "questions": {
                    "value": "The focus of the paper is primarily on crystalline materials. Expanding the applicability of UniMat and diffusion models to non-crystalline or amorphous materials is an area that has not been explored but could be of interest to researchers in diverse fields.\n\nThe UniMat representation is a powerful concept, but its complexity might deter some researchers. Some examples in the appendix could be helpful.\n\nIt would be good to have more explanation about UniMat’s advantages. E.g. Will it save some memory or is it efficient in computing? These are also important when generating new structures."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission4178/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4178/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4178/Reviewer_HVsx"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4178/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698810321785,
            "cdate": 1698810321785,
            "tmdate": 1699636383633,
            "mdate": 1699636383633,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "PKSbzDtx7h",
                "forum": "wm4WlHoXpC",
                "replyto": "yaIyQxGy3u",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4178/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4178/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Author Response"
                    },
                    "comment": {
                        "value": "Thank you for recognizing the significance of this work! Please see our response to your questions below.\n\n> More in-depth analysis of the quantitative metrics and benchmarks.\n\nWe totally agree that rigorous metrics and benchmarks are essential for further attesting scalability. Since we are the first to scale generative models for materials to large material datasets with millions of stable materials, we proposed standardized evaluation metrics and in-depth discussion on why these metrics make sense (Section 2.3). We hope these metrics will be utilized by future work for evaluating generated materials at scale.\n\n> Expanding UniMat to other materials.\n\nThis is indeed an exciting direction that we are actively exploring. In addition to non-crystalline or amorphous materials, the UniMat representation can also capture other chemical structures such as catalysts and proteins. We believe scaling to wide scientific data may eventually enable foundation models for science with broad knowledge in biology, chemistry, and quantum physics. We have included this in the conclusion section of the paper.\n\n> Additional examples of UniMat representation.\n\nWe have made [animations](https://drive.google.com/file/d/1L-c6jN1098J8S2WXTceLR9DWH86G1sOj/view?usp=sharing) visualizing the diffusion process to aid reader understanding. We will make this animation available in the final submission. We have also updated Figure 1 and its caption to make the UniMat representation easier to understand.\n\n> UniMat’s advantage.\n\nThe advantage of UniMat lies in modeling flexibility which enables scalability. UniMat also has benefit in computational efficiency compared to traditional search and substitution in materials discovery. UniMat has limited memory efficiency, as the representation is sparse. We have updated the conclusion to reflect these."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4178/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700185210900,
                "cdate": 1700185210900,
                "tmdate": 1700185210900,
                "mdate": 1700185210900,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "93jmK9kznN",
            "forum": "wm4WlHoXpC",
            "replyto": "wm4WlHoXpC",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4178/Reviewer_Xv1e"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4178/Reviewer_Xv1e"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes to use the diffusion model to generate novel crystal structures so as to discover novel materials. One challenge of crystal generation is the representation of a crystal structure. In this paper, the authors tackle this problem by using the atom locations in the the periodic table, the 3D coordinates of the atom in the crystal as well as maximum number of atoms per chemical element  to represent a crystal. The authors proposed methods for evaluating the generated material."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "- The proposed method is shown to be better than previous methods quantitatively in most cases (Table 1). \n\n- The proposed method generates crystal structures closer to those in the test set than the baseline method CDVAE."
                },
                "weaknesses": {
                    "value": "- There is no innovation in the diffusion model and the AI part. This paper just uses the standard diffusion model, and the conditional diffusion model to generate crystal structures. \n\n- I understand this paper may be a good paper for material science. Another venue related to material science, physics or chemistry may be a good venue to maximize the impact of this work. This paper presented at ICLR may have a small number of audience. In addition, Sec. 2.3, evaluating the generated materials using energy, is purely material science and has nothing related to AI. AI Researchers probably cannot evaluate the correctness and novelty of Sec. 2.3. Also, for the AI community, we do not learn any novel AI knowledge from this paper."
                },
                "questions": {
                    "value": "I would suggest the authors submit this work to a more related venue to maximize the impact of this work."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4178/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698820540875,
            "cdate": 1698820540875,
            "tmdate": 1699636383553,
            "mdate": 1699636383553,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "tQbz7WWs8y",
                "forum": "wm4WlHoXpC",
                "replyto": "93jmK9kznN",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4178/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4178/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response"
                    },
                    "comment": {
                        "value": "Thank you for the feedback. Please let us know if our response below addresses your concerns.\n\n> Lack of innovation.\n\nWe disagree that this work has “no innovation in the diffusion model and the AI part”. Despite the advances in generative models, their adoption to material science surfaces many unanswered questions. For instance, whether crystals should be represented using voxel images, pointclouds, phase fields, or graphs is unclear. How to jointly model discrete atoms and continuous locations has not been previously addressed. How to properly evaluate generated materials has been largely unattended. Whether generative models can scale to large material datasets has not been considered. Our work provides the first set of answers to many of these questions.\n\n> Irrelevance to the AI community.\n\nWe disagree that “evaluating generated materials using energy is purely material science and has nothing related to AI.”  How to properly evaluate generations lies at the core of generative models, where many metrics such as the Fréchet inception distance has been studied by the core AI community. Instead of leaving evaluation to material scientists, we believe it is more constructive for AI researchers to also understand and engage in application-specific evaluations of generative models. We also disagree that “we do not learn any novel AI knowledge from this paper”. In addition to the answers this work provides to crystal representations, joint modeling of discrete atoms and continuous locations, scaling up, and proper evaluations, this work illustrates diffusion models’ capability in modeling relationships other than spatial and temporal in images and videos (for which diffusion models were invented), opening up wider applications of diffusion models.\n\nFurthermore, “applications to physical sciences (physics, chemistry, biology, etc.)\" is listed as a subject area for ICLR 2024, and our submission significantly improves on the methodology and evaluation dimensions. These two dimensions cover two of the most important challenges of applying ML to any field."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4178/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700185174715,
                "cdate": 1700185174715,
                "tmdate": 1700185174715,
                "mdate": 1700185174715,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "wvNyD6bCal",
            "forum": "wm4WlHoXpC",
            "replyto": "wm4WlHoXpC",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4178/Reviewer_JpxX"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4178/Reviewer_JpxX"
            ],
            "content": {
                "summary": {
                    "value": "This work proposes a diffusion model for the task of material generation. Their model takes the material with atom locations as input and performs the denoising process by moving atoms from random locations to their original locations. The output results in crystals. The method is evaluated on three material generation datasets and compared against previous work in the topic."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. The paper is well-written and easy to follow. The theoretical background is well explained and clear.\n\n2. The idea of modeling the atom movement for material generation using diffusion models and the denoising process is interesting and novel to the best of my knowledge. I am not an expert in materials science, so I am not sure about the method novelty here."
                },
                "weaknesses": {
                    "value": "1. The utilized benchmarks seem to be saturated with values close to 100% performance. The performance gain is marginal and therefore could be a random improvement. Also, in some of the cases, the previous work has already achieved 100%, so there is no room for improvement.\n\n2. There is another work that uses diffusion models for the same task on the same datasets [a]. Although [a] uses diffusion models in a different way compared to this work, it has similar or better performance in some cases.\n\n[a] Pakornchote, Teerachote, et al. \"Diffusion probabilistic models enhance variational autoencoder for crystal structure generative modeling.\" arXiv preprint arXiv:2308.02165 (2023)."
                },
                "questions": {
                    "value": "1. Since ICLR is an ML conference, the paper would benefit from explaining the different evaluation criteria and their importance in the material generation task. E.g. what are the property statistics exactly and do they have higher importance compared to validity?\n\n2. The paper could be contrasted and compared against [a]."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4178/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699191175128,
            "cdate": 1699191175128,
            "tmdate": 1699636383488,
            "mdate": 1699636383488,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "R4KHvP3AMi",
                "forum": "wm4WlHoXpC",
                "replyto": "wvNyD6bCal",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4178/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4178/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response"
                    },
                    "comment": {
                        "value": "Thank you for the positive feedback. Please let us know if our response below addresses your concerns.\n\n> Existing benchmark saturated.\n\nThis is indeed the case. We have updated the text to reflect this (the last sentence of the first paragraph on Page 7).  Saturation of existing benchmarks and unreliability of learning based evaluations (elaborated in Section 2.3) were indeed what motivated us to propose three metrics based on DFT calculations in Section 2.3. We found that despite UniMat and CDVAE have close performance in learning based evaluations, UniMat performs drastically better than CDVAE under DFT calculations (i.e., what considered to be near ground truth evaluation in material science).\n\n> Related work on diffusion model for materials.\n\nThank you for pointing out the related work. We have updated Table 1 with comparison to this work and the related work section. We note that out of 19 metrics being reported, UniMat performs better than DP-CDVAE on 16 metrics. We hypothesize that DP-CDVAE uses a separate VAE to predict lattice parameters and number of atoms, which limits its flexible in jointly modeling of lattice parameters, number of atoms, and atom locations.\n\n> Relative importance of evaluation metrics.\n\nFrom our experience working with material scientists, the metrics in Table 1 can only serve as a proxy as opposed to reliable evaluation under the context of materials discovery, due to reasons listed in Section 2.3 (first paragraph). The property statistics are distributional distances (e.g., earth mover's distance) between property distributions (e.g., distribution of number of elements) in generated materials versus test materials. We have elaborated this more in the first paragraph of Section 3.1. If the property is predicted by another model (e.g., formation energy), the reliability of such evaluation is dependent on the quality of the other model, making the metric less reliable (compared to properties that don’t require prediction from another model, such as the number of elements). Not that property statistics are also proxy metrics, and the most reliable metrics should be DFT based."
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4178/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700185127866,
                "cdate": 1700185127866,
                "tmdate": 1700185127866,
                "mdate": 1700185127866,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "bvNUwtLy38",
                "forum": "wm4WlHoXpC",
                "replyto": "PgQLU0vE65",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4178/Reviewer_JpxX"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4178/Reviewer_JpxX"
                ],
                "content": {
                    "comment": {
                        "value": "I thank the authors for providing the feedback. The rebuttal addresses most of my concerns. The only concern that keeps me from increasing the rating is that I think the proposed method is novel in terms of the application in material science, but not much novel in terms of technical contribution in representation learning. Therefore, I keep my original rating."
                    }
                },
                "number": 12,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4178/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700740357992,
                "cdate": 1700740357992,
                "tmdate": 1700740357992,
                "mdate": 1700740357992,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]