[
    {
        "title": "AUGCAL: Improving Sim2Real Adaptation by Uncertainty Calibration on Augmented Synthetic Images"
    },
    {
        "review": {
            "id": "xszzRr0U9d",
            "forum": "WNQjN5HzXt",
            "replyto": "WNQjN5HzXt",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6015/Reviewer_WuQd"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6015/Reviewer_WuQd"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes a general Sim2Real adaptation framework, AUGCAL, for semantic segmentation and object recognition.\nAUGCAL introduces synthetic data augmentation and model calibration on synthetic data to reduce miscalibration during synthetic training. Combining with standard unsupervised domain adaptation methods on unlabeled real-world data, those techniques further improve SIM2REAL performance on real-world data.\nEspecially, this paper provides theoretical analysis to show the target calibration loss can be bound by the source calibration loss. This is the reason that calibration on synthetic data is beneficial for the performance of real-world data. Also, it shows the necessity of introducing the augmentaiton.\nExperiments are conducted on GTAV to Cityscapes and VisDA SIM2REAL, and show that the proposed framework can improve the baselines easily."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "4 excellent"
                },
                "strengths": {
                    "value": "[Clarity] The paper is well structured, and I find myself easy to follow.\n\n[Baseline] Baselines with AUGCAL outperform those without AUGCAL in all metrics.\n\n[Implementation] The presented method looks straightforward yet effective and easily re-implementable.\n\n[Novelty]\n- Augmentation and calibration are complementary and can be integrated easily to achieve the goal.\n- Miscalibration is an overlooked factor for unsupervised domain adaptation, and this paper proposes an easy way to handle it.\n- The paper provides insights on how the calibration loss on synthetic data can reduce miscalibration on real data via a theoretical analysis. This is beneficial for other related research fields."
                },
                "weaknesses": {
                    "value": "I listed some suggestions in Questions."
                },
                "questions": {
                    "value": "[Augmentation] The choice of augmentation should satisfy the property 1 in Sec. 3.2.2. Even Tab.1 shows that PASTA/R.Aug-SIM are closer to Real than SIM based on MMD, it is not intuitive. It would be better to clarify it more.\n- For PASTA, it is designed to bridge the syn-to-real gap and maybe reduce the artifacts of synthetic data. But I am not sure why R.Aug even closer to Real. \n- Also, if we have large-scale unlabeled real-world data, I am wondering if style transfer-based augmentation will have better performance because it directly uses unlabeled real-world data.\n- Last, as property 1 is a distribution distance, I am not sure how those appearance augmentations affected distribution.\n\n[OC] After Eq.3 and in Sec.4, the paper introduces overconfidence (OC) as a metric. But I am not sure of the exact definition.\n\n[Eq.9] Eq.9 shows a useful upper bound. It would be more interesting to provide more insights regarding this bound. For example, what issues (e.g., a large gap between syn and real) and why will those issues lead to the loose of the upper bound?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6015/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698735436992,
            "cdate": 1698735436992,
            "tmdate": 1699636645338,
            "mdate": 1699636645338,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "FpRNU6LXrd",
                "forum": "WNQjN5HzXt",
                "replyto": "xszzRr0U9d",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6015/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6015/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Thanks for the feedback!"
                    },
                    "comment": {
                        "value": "Thanks for providing feedback on our submission. We address individual concerns below.\n\n**PASTA vs RandAug distributional distances**\n\nPASTA was designed specifically to tackle Sim2Real discrepancies by introducing increased perturbations to high-frequency synthetic image components. RandAug, on the other hand, has no such constraints, and can generally perturb all (low, high frequency) components indirectly using chained photometric operations. From the measured distributional distances in Table 1 of main paper, PASTA and RandAug are similarly effective in reducing distributional distance on GTAV$\\to$City, whereas RandAug is more effective than PASTA on VisDA-C. We believe this is due to the nature of VisDA-C synthetic images. Synthetic images in VisDA-C are snapshots of CAD models of object classes from different viewpoints, lighting conditions in clear backgrounds. Consequently, increased focus towards high-frequency components (PASTA) in such settings could be less beneficial compared to peturbing all frequency components (RandAug). Using both AUG choices (Sim2Real specific and otherwise) allowed us to better demonstrate the general applicability of AUGCAL for Sim2Real settings. \n\n**Would style-transfer operations be eligible AUG choices?**\n\nGood point! While a style-transfer operation that can translate synthetic images to real style (while preserving semantics) can help reduce distributional distance, it cannot perfectly mitigate the distributonal gap. This is because Sim2Real discrepancies exist not only in terms of appearance, but also content. For instance, compared to Cityscapes, synthetic scenes from GTAV tend to be much less populated with vehicle and human instances. Similarly, synthetic source images in VisDA-C contain clear backgrounds (no surrounding context) unlike the real target counterparts. \n\nFurther, combining deep network (DNN) based style-transfer operations with state-of-the-art Sim2Real UDA methods is non-trivial since -- (1) it necessitates pre-training a translation network for every Sim2Real shift, (2) running DNN based style transfer online in conjunction with UDA is expensive and (3) doing such translations for synthetic source images offline would require quality checks for different Sim2Real shifts. Our intent behind experimenting with PASTA and RandAug as Aug transforms in AUGCAL was to consider simple eligible transforms (based on properties 1 and 2) that are inexpensive to combine with Sim2Real UDA methods while having shown demonstrable benefits in such settings (as shown in [A]).\n\n[A] - PASTA: Proportional amplitude spectrum training augmentation for syn-to-real domain generalization, ICCV 2023.\n\n**How do appearance augmentations affect marginal distributions?**\n\nThanks for bringing this up. Property 1 is based on distributional distances of the marginal input (image) distributions. Assuming covariate shift conditions, we parameterize this (and measure in Table 1) in terms of image feature distances. Since appearance augmentations on images impact features, they in turn affect feature distances or equivalently distributional distances.\n\n**Insights on target calibration error bound**\n\nThanks for the suggestion! The tightness of the bound presented in Eq. (9) depends on two key conditions -- (1) the extent to which the model is calibrated on labeled source data, (2) the extent to which the synthetic data distribution differs from the real data distribution. The first condition is straightforward to interpret -- calibration on labeled source synthetic data is necessary for calibration on real target data. The second condition, governed by the distributional distance between source and target, dictates the extent to which the stated bound is practically useful. Interventions like AUGCAL are useful when source and target marginal distributions differ substantially. If source synthetic data is highly similar to real data (in terms of appearance and content), then such interventions are unlikely to improve calibration on real data substantially."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6015/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700262962500,
                "cdate": 1700262962500,
                "tmdate": 1700262962500,
                "mdate": 1700262962500,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "bSqc9GKK5K",
                "forum": "WNQjN5HzXt",
                "replyto": "FpRNU6LXrd",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6015/Reviewer_WuQd"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6015/Reviewer_WuQd"
                ],
                "content": {
                    "comment": {
                        "value": "Thanks for the feedback. My concerns have been addressed."
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6015/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700653333873,
                "cdate": 1700653333873,
                "tmdate": 1700653333873,
                "mdate": 1700653333873,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "DV2cwv9n6b",
            "forum": "WNQjN5HzXt",
            "replyto": "WNQjN5HzXt",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6015/Reviewer_dFNn"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6015/Reviewer_dFNn"
            ],
            "content": {
                "summary": {
                    "value": "This paper starts with a nice theory demonstrating that to achieve better calibration loss in target domain, one should minimize the miscalibration in source domain and reduce the distributional distance between source and target domains. Then, to address this, the paper proposes AUGCAL, which augments the source data and apply a calibration loss on it. Experiments demonstrate the effectiveness of the proposed method."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "1. The theory is nice and understandable.\n2. The paper is well-written and experiments are extensive."
                },
                "weaknesses": {
                    "value": "1. Usually adding calibration loss will have lower ECE but also lower accuracy (in your case mIoU). Can you give some intuition in why adding calibration loss on source give better mIoU as shown in Table 3 (a)?\n2. This paper proposes two properties and empirically verifies PASTA and RandAugment satisfy the criterion. It would be good to give some intuition in the main text.\n3. [1] uses StyleNet which learns a style transfer from source to target, it would be interesting to analyze whether this inherently satisfy the property 1.\n[1] Donghyun Kim, Kaihong Wang, Kate Saenko, Margrit Betke, and Stan Sclaroff. A unified framework for domain adaptive pose estimation. In ECCV. Springer, 2022.\n4. Do the two AUG choice meet the property 2? Is the \\epsilon as small as before AUG?\n55. Since equation 9 is the upper bound of calibration loss, how is this related to mIoU?"
                },
                "questions": {
                    "value": "please see weaknesses"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission6015/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6015/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6015/Reviewer_dFNn"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6015/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698767024553,
            "cdate": 1698767024553,
            "tmdate": 1699636645211,
            "mdate": 1699636645211,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "uY0nbl9YKe",
                "forum": "WNQjN5HzXt",
                "replyto": "DV2cwv9n6b",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6015/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6015/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Thanks for the feedback!"
                    },
                    "comment": {
                        "value": "Thanks for providing feedback on our submission. We address individual concerns below.\n\n**Isolated CAL Improvements**\n\nGood catch! For in-distribution settings, an additional training time calibration loss ($\\mathcal{L}\\_{\\text{CAL}}$) doesn't necessarily compromise accuracy for reduced ECE (as shown for DCA, MDCA, MbLS). In our Sim2Real UDA setups, especially for methods that rely on self-training (or entropy minimization), errors on real data often stem from overconfident predictions. We believe adding only a training time calibration loss ($\\mathcal{L}\\_{\\text{CAL}}$) can help reduce overconfidence, leading to better pseudo-labels during adaptation, which can *potentially* improve adaptation performance in some cases. However, this behavior of minor improvements with only CAL is not universally applicable across settings, unlike AUGCAL. Do let us know if this helps answer your question.\n\n**Justifying AUG choices**\n\nThanks for bringing this up. Our intent was to choose AUG transformations that (1) satisfy the properties in Sec 3.2.2, and additionally, (2) are inexpensive when combined with Sim2Real UDA methods, and (3) have demonstrable benefits for Sim2Real shifts. We selected PASTA as it was **specifically** designed for Sim2Real shifts (by tackling high-frequency disparities) and RandAug because it has proven to be **generally** beneficial for Sim2Real shifts (through a series of photometric transforms, also shown in [A]). Using both AUG choices allowed us to better demonstrate the general applicability of AUGCAL. We have updated the paper to include this (in Sec. 3.2.2 in red).\n\n[A] - PASTA: Proportional amplitude spectrum training augmentation for syn-to-real domain generalization, ICCV 2023.\n\n**Do AUG choices satisfy property 2?**\n\nYes! Both AUG choices satisfy property 2. In the Table below, using DCA as $\\mathcal{L}\\_{\\text{CAL}}$, we log the value of $\\mathcal{L}\\_{\\text{CAL}}$ on source data at UDA training convergence for segmentation (GTA$\\to$Cityscapes) and classification (VisDA-C). We compute $\\mathcal{L}\\_{\\text{CAL}}$ at training convergence by tracking a moving average over a window of the past 500 iterations (equivalent to 16k source training samples for VisDA-Syn and 1k 1024 $\\times$ 1024 training crops for GTAV). Source $\\mathcal{L}\\_{\\text{CAL}}$ for AUGCAL (both AUG choices) is only marginally higher than CAL. DCA measures the absolute mean difference between confidence and accuracy, showing that for these cases on source data, aggregate prediction accuracies and confidence scores differ by approximately $\\sim0.01-0.02$ absolute points.\n\n|  | Shift | Sim2Real UDA Method | Setting | $\\mathcal{L}\\_{\\text{CAL}}$ at Convergence |\n| -------- | -------- | -------- | -------- | -------- |\n|   1   | G$\\rightarrow$C  | HRDA + MIC (DAFormer)    | CAL (DCA) | 0.01387 |\n|   2   | G$\\rightarrow$C  | HRDA + MIC (DAFormer)    | AUGCAL (PASTA, DCA)  | 0.01473 |\n|   3   | G$\\rightarrow$C  | HRDA + MIC (DAFormer)    | AUGCAL (RandAug, DCA)  | 0.01979 |\n|   4   | VisDA-C  | SDAT + MIC (ViT-B)     | CAL (DCA) | 0.00800 |\n|   5   | VisDA-C  | SDAT + MIC (ViT-B)    | AUGCAL (PASTA, DCA) | 0.01400 |\n|   6   | VisDA-C  | SDAT + MIC (ViT-B)    | AUGCAL (RandAug, DCA) | 0.01800 |\n\n**How is Eq.(9) related for performance (mIoU)?**\n\nAUGCAL aims to improve Sim2Real calibration while preserving transfer (UDA) performance. By optimizing for a calibration loss ($\\mathcal{L}\\_{\\text{CAL}}$) alongside supervised source ($\\mathcal{L}\\_{\\text{CE}}$) and unsupervised adaptation ($\\mathcal{L}\\_{\\text{UDA}}$) losses, it prevents excessive optimization for $\\mathcal{L}\\_{\\text{CE}}$ (or negative log-likelihood), a key contributor to miscalibration and overconfidence in model predictions. This approach ensures better-calibrated confidence scores on real target data (as indicated by equation 9), influencing prediction correctness (accuracy and mIoU). However, maintaining a balance between $\\mathcal{L}\\_{\\text{CE}}$ and $\\mathcal{L}\\_{\\text{CAL}}$ is crucial, as overly emphasizing $\\mathcal{L}\\_{\\text{CAL}}$ during UDA + AUGCAL training (extreme $\\lambda\\_{\\text{CAL}}\\geq 5$ values) can negatively impact transfer performance, as outlined in Table 4 of the appendix. Do let us know if this helps answer your question.\n\n**Would learned style-transfer satisfy property-1?**\n\nThanks for the pointer. Yes. A style-transfer operation (using StyleNet) capable of translating synthetic images to real style while preserving semantics can satisfy property 1. However, in practice, such a transformation cannot completely eliminate the distributional gap since Sim2Real differences exist not only in terms of appearance, but also content. For instance, compared to Cityscapes, synthetic scenes from GTAV tend to be much less populated with vehicle and human instances. We further highlight in the general response why simple yet effective AUG choices are better suited compared to learned style transfer operations for Sim2Real UDA + AUGCAL training."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6015/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700262877922,
                "cdate": 1700262877922,
                "tmdate": 1700262877922,
                "mdate": 1700262877922,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "pAMxYNS1Xz",
            "forum": "WNQjN5HzXt",
            "replyto": "WNQjN5HzXt",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6015/Reviewer_iaFo"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6015/Reviewer_iaFo"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes AUGCAL to improve the confidence calibration and model reliability of existing unsupervised domain adaptation approaches. Specifically, the authors propose to replace the original images with strongly augmented ones and additionally optimize for calibration loss on the augmented images. Detailed analytical justification has been derived to show how AUGCAL can reduce miscalibration on real data. Extensive experiments on different datasets and different UDA backbones have been conducted to show the effectiveness of AUGCAL."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. Extensive experiments on different tasks, datasets and UDA backbones are provided in the paper to evaluate the proposed method. \n\n2. Theoretical derivations have been provided to motivate the design of AUGCAL.\n\n3. The proposed AUGCAL is simple, which only introduces two small changes to the existing UDA pipelines."
                },
                "weaknesses": {
                    "value": "1. The technical contribution of this paper is a bit limited. The key components of AUGCAL are the data augmentation and DCA based calibration loss. However the data augmentation technique is commonly used in domain adaptation and the DCA proposed by previous work for model calibration.\n\n2. The proposed method is only compared with diffident backbone UDA models. A more convincing comparison would be to compare with existing confidence calibration methods, such as [Wang et al. 2022], [Gong et al. 2021].\n\n3. The paper exceeds the page limit of 9 pages."
                },
                "questions": {
                    "value": "Please refer to the weaknesses."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission6015/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6015/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6015/Reviewer_iaFo"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6015/-/Official_Review"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1700466444958,
            "cdate": 1700466444958,
            "tmdate": 1700466444958,
            "mdate": 1700466444958,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "9R4pVhNvYi",
                "forum": "WNQjN5HzXt",
                "replyto": "pAMxYNS1Xz",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6015/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6015/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Thanks for the feedback!"
                    },
                    "comment": {
                        "value": "Thanks for the comments. We address individual concerns below.\n\n**Limited Technical Contributions**\n\nWe would like to clarify our key contributions. The intent behind our proposed method, AUGCAL, was to reduce miscalibration of Sim2Real adaptation methods while preserving transfer performance. We first make the observation that errors by Sim2Real adaptation methods on \"real\" data are tied with increasing overconfidence on mispredictions. Based on the established goal and our observations,\n\n- We first provide a simple analytical justification surrounding how training time calibration interventions (CAL) on labeled \"synthetic\" source data can be helpful in reducing miscalibration on \"real\" target data. Building on top of this, we further demonstrate how incorporating **eligible** AUG transformations in this vanilla CAL setup (to form AUGCAL), can be even more effective in reducing Sim2Real miscalibration.\n- We empirically validate the effectiveness of AUGCAL by showing that it reduces Sim2Real miscalibration while retaining performance across multiple tasks, adaptation methods, intra-task backbones (CNNs & Transformers), and shifts. Additionally, we also assess AUGCAL effectiveness across multiple AUG (PASTA, RandAug) and CAL (DCA, MDCA, MbLS) choices.\n\nWe would like to re-emphasize that the key technical contribution in AUGCAL lies precisely in demonstrating that a combination of eligible (in accordance with the properties in Sec. 3.2.2) AUG transforms with training time CALibration losses is effective in reducing Sim2Real miscalibration across multiple settings while being easy to integrate (in a plug-and-play fashion) in existing setups.\n\n**Limited Comparisons**\n\nThanks for the suggestion. In out-of-distribution settings, both [A,B] study \"*post-hoc calibration methods*\" (based on temperature-scaling) for \"*zero-shot generalization*\" (when target data is **unavailable**). In contrast, we study \"*training time-calibration methods*\" (calibration losses at training time) for \"*unsupervised adaptation*\" (when modestly sized unlabeled target data is **available**). We note that the distinction between the two experimental settings is crucial, since unlike zero-shot settings (key experiments in [A], Sec 6.1.2 results in [B]), adaptation scenarios consist of repeated model updates based on intermediate miscalibrated target predictions. This makes adaptation scenarios much more sensitive to progressive miscalibration on target data.\n\nThat said, in addition to demonstrating the effectiveness of AUGCAL across different Sim2Real adaptation models (across tasks, UDA methods, intra-task backbones, and shifts), we also conduct experiments to assess AUGCAL effectiveness for different CAL choices ([C, D, E]; which are effective confidence calibration techniques on their own). Given the limited timeframe (review received two days before end of discussion period), we are unable to perform a new equivalent comparison (by adapating [A,B] to our experimental setting).  We would like to instead point the reviewer to our temperature-scaling (TS) comparisons on VisDA-C (in Sec 5.2 main paper; Sec. 5 appendix) where we show that TS methods overfit substantially to improved calibration on \"synthetic\" data, making them ineffective for improving calibration on \"real\" data for Sim2Real adaptation methods.\n\n[A] - Confidence Calibration for Domain Generalization under Covariate Shift (Gong et. al., 2021)\n\n[B] - On Calibrating Semantic Segmentation Models: Analyses and An Algorithm (Wang et. al., 2022)\n\n[C] - Improved trainable calibration method for neural networks on medical imaging classification, BMVC 2020\n\n[D] - A stitch in time saves nine: A train-time regularizing loss for improved neural network calibration, CVPR 2022\n\n[E] - The devil is in the margin: Margin-based label smoothing for network calibration, CVPR 2022\n\n**Manuscript Length**\n\nThe current revised submission (based on suggestions from R-dFNn, R-WuQd) is contained with 9 pages for the main text, with the reproducibility and ethics statement being on page 10. The author guide (see [F]) clearly specifies that both the ethics and reproducibility statements do not count towards the page limit.\n\n[F] - https://iclr.cc/Conferences/2024/AuthorGuide"
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6015/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700509732078,
                "cdate": 1700509732078,
                "tmdate": 1700509732078,
                "mdate": 1700509732078,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "mamRJUZNGr",
                "forum": "WNQjN5HzXt",
                "replyto": "9R4pVhNvYi",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6015/Reviewer_iaFo"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6015/Reviewer_iaFo"
                ],
                "content": {
                    "comment": {
                        "value": "Thanks for the authors' responses, which resolves most of my concerns. I will further discuss with other reviewers and change my rating accordingly."
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6015/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700620491733,
                "cdate": 1700620491733,
                "tmdate": 1700620491733,
                "mdate": 1700620491733,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]