[
    {
        "title": "CL-Calib: Enhancing Post-training Quantization Calibration through Contrastive Learning"
    },
    {
        "review": {
            "id": "6KRG5PXA4I",
            "forum": "Wxyyc2vvGd",
            "replyto": "Wxyyc2vvGd",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7689/Reviewer_Wd4w"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7689/Reviewer_Wd4w"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes CL-Calib, which is a contrastive learning-based activation calibration method for post-training quantization (PTQ). The core insight of CL-Calib is to formulate the parameter calibration as a self-supervised proxy task and maximize the mutual information between FP and post-quantized activation. The author theoretically proves that minimizing the proposed loss is the same as maximizing the mutual information. The proposed scheme is verified on various network architectures on the ImageNet dataset."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "1 poor"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. The theoretical analysis and proof for the mutual information (Sec 3.2) are comprehensive and insightful.\n\n2. Many network architectures are evaluated with the proposed CL-Calib in the experiments, which improves the soundness of this work."
                },
                "weaknesses": {
                    "value": "1. The presentation quality needs to be improved, including but not limited to:\n* Figure 1 is misleading, Why FP activation is extracted from the intermediate layer of the quantized network but the quantized activation is not? Why backward pass does not flow through the quantized network? \n* Many typos need to be fixed, e.g. Sec.1 contrastive learning (CT) => (CL), (e.g., ,) => (e.g.,) (remove one comma). Figure 1 Quantize Parameter => Quantization Parameter. Sec.2 (i.e., ,) => (i.e.,) (remove one comma), Eq. 6 there is one mismatch \"}\", etc.\n* The first subsection of section 3.1 (Instance Recognition (IR) for PTQ Calibration) has nearly no relationship with quantization, I suggest the author move this part to section 2 as the preliminary of contrastive learning.\n\n2. The motivation of this work is not very clear and straightforward. It seems more like a combination of contrastive learning and calibration of PTQ. I fully understand that the proxy contrastive learning task is the same as the optimization problem of Eq.5 as proved in Sec 3.2, but what is the real and core advantage of using this proxy CL task instead of directly optimizing the target?\n\n3. More tasks of PTQ other than image classification should be verified, such as object detection and even some NLP tasks. Also, experiments on Transformer-based model (including ViTs) is a plus. In Table 1, the author mentions that all experiments are implemented by them but why some results of specific methods on specific bit-width or models are missing? (ACIQ-Mix and Bit-split are not evaluated on RegNetX and MNasx2, BRECQ is not evaluated on 4/2, 2/4-bit, etc.)"
                },
                "questions": {
                    "value": "Please see the weakness above."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission7689/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission7689/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission7689/Reviewer_Wd4w"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7689/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698587766040,
            "cdate": 1698587766040,
            "tmdate": 1699636936121,
            "mdate": 1699636936121,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "ldJqqzjcgR",
            "forum": "Wxyyc2vvGd",
            "replyto": "Wxyyc2vvGd",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7689/Reviewer_CeZB"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7689/Reviewer_CeZB"
            ],
            "content": {
                "summary": {
                    "value": "In this paper, a self-supervised proxy task is proposed to assist in post-training quantization (PTQ) by using contrastive learning, named as CL-Calib. The main contribution of this work is that the CL-Calib can be an \"add-on module\" for state-of-the-art PTQ methods to help increase quantization accuracy."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. this work use a small amount of data (for example, 128 images in ImageNet) to construct positive and negative sample pairs for adjusting quantization parameters, i.e., scaling factor and zero point, for activations by using contrastive learning. This idea is incrementally novel.\n2. This module can be incorporated into many PTQ framework to improve accuracy."
                },
                "weaknesses": {
                    "value": "1. The  idea of contrastive learning for tuning quantization parameters is straightforward but also need very careful design of selecting positive and negative samples in different down-streaming tasks. In this paper, this design for tasks such as object detection is not clearly stated and the experimental setting is also not very clear. This makes this work not sounded for these tasks.\n2. The training stability of contrastive learning under such limited training images is mentioned but not very fully explained in this paper. How and why the mapping function can solve that problem very well theoretically and experimentally. In this paper, the experimental results did not provide a convincing evidence that this problem can be easily solved. For example, all experimental results should be displayed as a stable performance improvement under different selection of training samples rather than the best result shown in all tables and figures."
                },
                "questions": {
                    "value": "1. Please provide more information about the issues in the weakness section.\n2. Compared with QAT, we care about the efficiency of PTQ. So, how about the training time for CL-Calib for image classification and object detection?\n3. How about the performance of CL-Calib on tasks such as regression, image segmentation,  and other downstreaming tasks?\n4. If we use only L_CL-Calib without L_quant, the training process works or not, and why?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission7689/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission7689/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission7689/Reviewer_CeZB"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7689/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698636721347,
            "cdate": 1698636721347,
            "tmdate": 1699636936028,
            "mdate": 1699636936028,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "stYO9M7DWT",
            "forum": "Wxyyc2vvGd",
            "replyto": "Wxyyc2vvGd",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7689/Reviewer_Rw23"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7689/Reviewer_Rw23"
            ],
            "content": {
                "summary": {
                    "value": "The author proposes a contrastive learning based framework to learn the quantization parameters of activations. A theoretical guarantee is presented to illustrate minimizing the designed loss is equivalent to maximizing the desired mutual information."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "CL is an interesting idea in PTQ. Good performance."
                },
                "weaknesses": {
                    "value": "1, This paper does not provide the overall process. It only optimizes the quantization parameters of activations. Is that all? Nothing else? It confused me. A more clear description is needed.\n2, There is some confusion when Eq15 comes to Eq16. The author says: we can further loosen the lower bound to obtain the optimization objective. However, it is more likely a formula that's been forcibly pieced together.\n3, There is some missing paper that also uses contrastive learning in PTQ. [1]\n4, I do believe the proof in Appendix A.2 has some typos. For example, symbol between Eq15 and Eq16.\n\n[1] CPT-V: A Contrastive Approach to Post-Training Quantization of Vision Transformers"
                },
                "questions": {
                    "value": "As the author claims, QDrop, BRECQ, and PD-Quant all focus on activation calibration. However, as far as I know, BRECQ and PD-Quant rarely discuss activation calibration.\n\n'in this work We only consider uniform unsigned symmetric quantization': We -> we\n\n\nI am willing to accept this paper at this time and the final rating is upon the rebuttal."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7689/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698821333741,
            "cdate": 1698821333741,
            "tmdate": 1699636935917,
            "mdate": 1699636935917,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "sPwwTvLZK5",
            "forum": "Wxyyc2vvGd",
            "replyto": "Wxyyc2vvGd",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7689/Reviewer_ZHZD"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7689/Reviewer_ZHZD"
            ],
            "content": {
                "summary": {
                    "value": "This study introduces a approach to Post-Training Quantization (PTQ) calibration by maximizing mutual information between pre- and post-quantized activations. A Contrastive Learning (CL) framework is proposed for calibration, optimizing quantization parameters through a self-supervised proxy task. By incorporating CL, the method effectively utilizes positive pairs of quantized and Floating-Point (FP) activations from the same input samples and distinguishes them from negative pairs from different samples. The approach addresses common issues in CL, especially in limited calibration data scenarios, thanks to a well-designed critic function. The study also provides a theoretical guarantee, demonstrating that minimizing the proposed loss is equivalent to maximizing the desired mutual information. Experimental results indicate the method's effectiveness as an additional module for state-of-the-art PTQ methods, highlighting its practical utility and efficiency in enhancing quantized network performance."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "CL-Calib stands out due to its integration of self-supervised learning and contrastive learning within PTQ calibration. By maximizing mutual information between quantized and full-precision activations, it provides a deep theoretical understanding of the quantization process. CL-Calib's versatility is showcased through seamless integration with state-of-the-art PTQ methods, making it a powerful and adaptable tool for enhancing quantized neural network performance."
                },
                "weaknesses": {
                    "value": "1. The improvement in performance with 4-bit quantization is not substantial, and the absence of experiments in 8-bit quantization and language model domains limits the breadth and depth of the study.\n2. The study lacks significant innovation, as it does not introduce novel methods or techniques that significantly differ from existing research, making its innovative contribution less prominent.\n3. The practical utility of the proposed approach is constrained. Despite achieving results in 2-bit quantization, the performance gap compared to full-precision models remains considerable, restricting its applicability in real-world scenarios."
                },
                "questions": {
                    "value": "1. Is it possible to provide a clear description of the baseline performance in the experimental table? Specifically, does the table indicate whether the baseline results were achieved by combining QDrop and PD-quant, or were these methods used individually?\n\n2.It appears that there is no comparison made with the results presented in the paper available at https://arxiv.org/pdf/2208.11945.pdf. There seems to be a noticeable gap, especially in the 4-bit quantization results. Could you please address this discrepancy?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "details_of_ethics_concerns": {
                    "value": "no"
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "1: You are unable to assess this paper and have alerted the ACs to seek an opinion from different reviewers."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7689/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698835590679,
            "cdate": 1698835590679,
            "tmdate": 1699636935815,
            "mdate": 1699636935815,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    }
]