[
    {
        "title": "Learning Object-Centric Representation via Reverse Hierarchy Guidance"
    },
    {
        "review": {
            "id": "WMzHWtaQsM",
            "forum": "Y3NBqtrQat",
            "replyto": "Y3NBqtrQat",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7275/Reviewer_SoMm"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7275/Reviewer_SoMm"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes a method to improve on existing methods to parse scenes into object representations to better detect small/occluded objects. The method combines a bottom-up mechanism which tries to parse the scene into K object slots and a top-down mechanism which detects conflicts between the slot-based reconstruction and the original image and searches for a slot assignment which reduces conflicts. The approach gives improved results over benchmark algorithms on synthetic datasets."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "The paper is mostly clearly written (there is some awkward grammar/wording) and makes excellent use of figures to illustrate results.\n\nThe proposed method is simple and effective.\n\nThere is a good amount of analysis and visualisation to explain the method."
                },
                "weaknesses": {
                    "value": "The proposed method outperforms older SOTA models but does not clearly outperform some more recent work which incorporate different forms of “object” guidance into a bottom-up model:\nhttps://openaccess.thecvf.com/content/WACV2023/papers/Sauvalle_Unsupervised_Multi-Object_Segmentation_Using_Attention_and_Soft-Argmax_WACV_2023_paper.pdf\nhttps://arxiv.org/pdf/2305.19550.pdf\nGiven that these works involve some similar ideas to the current paper, it seems worthwhile to address them.\n\nThe section on \"generalization to real-world scenarios\" contains almost no information about what experiments were run or what the results were. If these results are important to evaluate the proposed method they should be explained in the paper."
                },
                "questions": {
                    "value": "How does this method differ from other recent work with similar performance? What are the advantages of this proposed approach?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7275/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698636045925,
            "cdate": 1698636045925,
            "tmdate": 1699636868659,
            "mdate": 1699636868659,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "AzM3Bm8CBI",
                "forum": "Y3NBqtrQat",
                "replyto": "WMzHWtaQsM",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7275/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7275/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you very much for your review of our submission. \n\n## About the model comparison in the paper\n\nWe have included a comparison of the two models mentioned in Weakness in the updated version of the paper. It is important to note that all of our models on the synthetic dataset are trained from scratch. For a fair comparison, AST-Seg-B3-BT is added to the table. In addition, the strategy of SLP on CLEVRTex-OOD dataset is different from us: we train the model on the original CLEVRTex dataset and evaluate on CLEVRTex-OOD without finetuning, while SLP split a training set from the OOD dataset and trains their model on this training set. Due to different training conditions, we did not record their OOD performance. We list the updated comparison in the table below:\n\n|Model|CLEVRTex|ObjectsRoom|\n|:-:|:-:|:-:|\n|AST-Seg|71.79|75|\n|SA+SLP|71.00|87|\n|BO-QSA+SLP|87.00|93|\n||||\n|RHGNet|89.53|87|\n|+Infer-RHG|89.90|88|\n\n## Experiment on real-world datasets\n\nIn our original paper, we mainly demonstrate the validity of our proposed method through experimental results on synthetic datasets. Experiments on real-world datasets are included in supplementary materials to prove that our method can be generalized to more complex scenarios. Thank you for your suggestions, we found that the generalization of the model in real-world scenarios is worth paying attention to, so we added the experimental data of the model in real-world scenarios in the updated paper. We list the ARI-FG comparison in the table below:\n\n|Model|MOVi-C|COCO|\n|:-:|:-:|:-:|\n|SA|43.8|16.4|\n|SLATE|43.6|24.1|\n|DINOSAUR|67.2|40.5|\n||||\n|RHGNet|70.50|41.02|\n|+Infer-RHG|73.00|41.14|\n\n## Difference between other Object-Centric methods\n\nOur main inspiration is to promote Object-Centric performance by incorporating some human visual system mechanisms into the network design. With an additional top-down pathway, we help the model learn more distinguishable features, as well as providing two alternative inference forms: a fast vision with a single bottom-up run, or a slow mode, running the network multiple times to get more accurate results. The experimental results show that our approach enables the model to learn more difficult samples, such as small or occluded objects in all the datasets, as well as texture-rich objects in CLEVRTex."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7275/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700028344966,
                "cdate": 1700028344966,
                "tmdate": 1700031885156,
                "mdate": 1700031885156,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "p8o4gjbrej",
                "forum": "Y3NBqtrQat",
                "replyto": "AzM3Bm8CBI",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7275/Reviewer_SoMm"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7275/Reviewer_SoMm"
                ],
                "content": {
                    "title": {
                        "value": "Response to authors"
                    },
                    "comment": {
                        "value": "Thanks for the further information."
                    }
                },
                "number": 8,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7275/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700634102951,
                "cdate": 1700634102951,
                "tmdate": 1700634102951,
                "mdate": 1700634102951,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "5u6TCAtaFX",
            "forum": "Y3NBqtrQat",
            "replyto": "Y3NBqtrQat",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7275/Reviewer_uwGV"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7275/Reviewer_uwGV"
            ],
            "content": {
                "summary": {
                    "value": "Inspired by Reverse Hierarchy Guidance, a theory related to human vision, the authors\npropose an improvement for object-centric models based on clustering features into\nslots. Central to the approach is measurement of conflicts between spatial feature\nsimilarities and the clustering predicted by the model. The paper shows that established\nobject-centric models can be improved by minimizing conflicts during training and/or by\nchosing the sampled segmentation with the least conflicts during inference. In\nparticular, the segmentation of small objects is improved which are more frequently\nmissed by existing methods."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "- Existing methods are consistently improved on established, synthetic datasets.\n- The authors provide an analysis that explains *why* the proposed method works by\n  qualitatively and quantitatively inspecting segmentation performance for objects of\n  different sizes. Beyond providing an improvemend model, the paper therefore also\n  improves the understanding of object-centric modeling approaches.\n- The Figures provided by the authors are helpful to understand the contribution. Beyond\n  aggregated quantitative evaluation, the authors present figures that qualitatively\n  showcase the improvements of the proposed method."
                },
                "weaknesses": {
                    "value": "- In the main text, the proposed method is only evaluated on relatively simple,\n  synthetic datasets. As shown in the supplement, the method can be combined with\n  state-of-the-art object-centric models that scale to natural images, but the\n  performance improvements do not seem to be significant.\n- The mathematical description of the method in Section 3 is imprecise at several\n  places. How exactly are the mappings $\\mathcal{K}$ and $\\mathcal{Q}$ defined? I.e.,\n  what are the dimensionalities of the quantities involved in equation 3? In equation 4,\n  the term in the summation does not depend on the summation index $K$."
                },
                "questions": {
                    "value": "- The performance comparison in Table 1 uses FG-ARI to quantify segmentation\n  performance. It has been pointed out several times in the literature that this metric\n  is problematic (e.g., Engelcke et al 2020, Karazija et al. 2021, Monnier et al. 2021). \n  How do the proposed methods perform in terms of the Object IoU metric?\n- Does the Object IoU metric include evaluating IoU for the background segment?\n- How were the object sizes chosen that where used to differentiate small, medium and\n  large objects? Which fraction of the objects is small, medium and large, respectively?\n  Beyond the agregated evaluation, it could be helpful to present a scatter plot of\n  object size vs IoU for all objects in the evaluation set.\n- How were the hyperparameters selected?\n- Which performance is achieved when the features are clustered using a conventional\n  approach such as normalized cuts instead of Slot Attention?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission7275/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission7275/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission7275/Reviewer_uwGV"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7275/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698660768754,
            "cdate": 1698660768754,
            "tmdate": 1700652150274,
            "mdate": 1700652150274,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "YsVLEey01t",
                "forum": "Y3NBqtrQat",
                "replyto": "5u6TCAtaFX",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7275/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7275/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you very much for your review of our submission. \n    \n## Model Performance on Real-world Datasets\n\nIn the supplemental material, the performance of DINOSAUR is directly taken from the report in [1]. However, DINOSAUR doesn't release public models. Therefore, we are not improving on their basis. Instead, we obtain a baseline model by simply changing the input and reconstruction objective of the network to DINO features, which achieve a bit lower performance than reported in [1]. This reduces the performance gains from our method. \n\nWe have recently taken a closer look at the training tricks of previous work [1], for example, they reduce the dimensions of pre-trained features to lower dimensions at the input side and recover to the original dimensions at the output side. We find that these modifications can improve the clustering performance of the network with less computation. We apply these tricks to our model and retrain the model on real-world datasets. In the table below we provide a comparison of model performance before and after retraining. \n\n|Model|MOVi-C|COCO|\n|:-:|:-:|:-:|\n|DINOSAUR|67.20|40.50|\n||||\n|original reproduction|65.68|37.90|\n|+Train-RHG|67.48|40.57|\n|+Infer-RHG|70.88|40.80|\n||||\n|new reproduction|67.08|38.74|\n|+Train-RHG|70.50|41.02|\n|+Infer-RHG|73.00|41.14|\n\nAfter more thorough training of the network, we can come to two conclusions: (i) our performance benefits from better network settings, reaching +5.80% and +0.64% ARI scores compared with DINOSAUR; (ii) Compared with our reproduced baseline model, both Train-RHG and Infer-RHG bring remarkable performance gains.\n\n## About Object-IOU metric\n\nIn the supplementary material, we present the comparison of our method and other models in terms of Object IoU in CLEVRTex (Table 6 in supplementary material), where our method still outperforms other SOTA methods compared in the paper. The computation of Object IOU doesn't consider background pixels because we focus on the ability of the model to distinguish objects.\n\n## About object size division\n\nWe divide objects by their size distribution. Specifically, we count the number of pixels that all objects occupy in the ground truth, and we classify objects into small, medium and large on a ratio of about 1 to 5 to 1. \n\nA scatter plot of object size vs IoU is a better way to express how the model's ability to discover objects varies with the size of objects. According to your suggestion, we have redrawn a plot and put it in the latest update, you can check it in the updated paper.\n\n## About hyperparameter choosing\n\nMost of the hyperparameter settings follow previous work [3]. The main hyperparameter discussed in this paper is the weight of top-down conflict loss. The weight is 0 at the beginning of the training and gradually increases to a maximum value. This setup follows the intuition that the model needs to first learn to distinguish objects, and then enhance low-level features through top-down guidance to gain a stronger ability to discover objects. \n\nThe maximum weight of top-down conflict loss depends on the complexity of datasets. For simple scenarios, such as CLEVR, smaller weights are appropriate because increasing the weights will lead to a decrease in the accuracy of model reconstruction and segmentation. For more complex datasets, such as the CLEVRTex dataset, it is more necessary to find missing objects than to get more accurate segmentation, thus requiring a larger top-down conflict loss weight.\n\n## Mathematical description and typo error\n\nWe'll add a more detailed description of the symbols in section 3. The mapping $\\mathcal{K}$ and $\\mathcal{Q}$ doesn't change the dimensionality of features, still retaining $C=64$ as described in section 4.1. In addition, the summation index $K$ in Equation 4 appears due to a typo error, and it should be removed. In the updated paper, we have corrected these problems.\n\n## Conventional clustering approach\n\nConsidering the similarity of slot attention and k-means algorithm, we use k-means to cluster the low-level features output by the CNN encoder. We take the CNN encoder from two networks, namely RHGNet and BUNet in the paper, and cluster them respectively. After clustering the features of RHGNet, we obtain an ARI-FG score of 52.29%, while the clustering score of BUNet is 41.42%. The results verify that RHGNet learns better features.\n\n[1] Bridging the gap to real-world object-centric learning\n\n[2] Self-supervised Object-Centric Learning for Videos\n\n[3] Object-Centric Learning with Slot Attention"
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7275/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700028216387,
                "cdate": 1700028216387,
                "tmdate": 1700031926921,
                "mdate": 1700031926921,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "rQUugyqTcF",
                "forum": "Y3NBqtrQat",
                "replyto": "YsVLEey01t",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7275/Reviewer_uwGV"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7275/Reviewer_uwGV"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for your response and the revision of the paper. Most of my points have been addressed.\n\nHowever I am confused by the newly added Figure 6, which shows the object IoU for different object sizes. To me these results do not show a clear performance improvement for small objects. In particular when comparing to BO-QSA, the performance of RHGNet seems to be only better for larger objects (>=300). Could you elaborate on this discrepancy to the qualitative results you discuss in the paper?\n\nFor clarification, how to you measure object size? Is it the number of pixels?"
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7275/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700217361667,
                "cdate": 1700217361667,
                "tmdate": 1700217361667,
                "mdate": 1700217361667,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "Fkj8y14wGo",
                "forum": "Y3NBqtrQat",
                "replyto": "ZnbXswHTP3",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7275/Reviewer_uwGV"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7275/Reviewer_uwGV"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for clarifying. The updates during the discussion phase clearly improved the paper in my view, therefore I am happy to increase my rating."
                    }
                },
                "number": 9,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7275/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700652137362,
                "cdate": 1700652137362,
                "tmdate": 1700652137362,
                "mdate": 1700652137362,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "wZl9zFZTvW",
            "forum": "Y3NBqtrQat",
            "replyto": "Y3NBqtrQat",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7275/Reviewer_TuCC"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7275/Reviewer_TuCC"
            ],
            "content": {
                "summary": {
                    "value": "The paper's major contribution is introducing idea of top-down modulation in Reverse Hierarchy Theory to the standard slot-attention model aimed for object-centric learning. The major architecture novelty is  a top-down path from the slots of slot attention model to attend the image features and directly generate an attention map by a CNN decoder. This attention map is in turn used to compute a conflict map against the original object mask produced directly by the slot representation through a spatial broadcasting. The conflict loss appears to be the major driving force for the model to improve its ability of discovering small objects, which other models often fail to detect. The model demonstrates superior performance to other models on several benchmark datasets with pure colors, but also generalizes to CLEVRTex which introduces some texture within each object with a dominant distinct color."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "(1) All the benchmark result show that the proposed model outperform previous models.\n\n(2) The idea of conflict loss between the two object mask maps appear novel.\n\n(3) Analysis of the representation of objects in CLEVRTex dataset shows that the model learned a representation that has smaller variance in intra-object feature (locked to image grids) than inter-object feature, which may help better group pixels within an object into a same slot. Such analysis is helpful for partially understanding why a model learns better (but I still remain somewhat puzzled, please see my comment in Questions)"
                },
                "weaknesses": {
                    "value": "(1) At inference, the model needs to be run for multiple times to get a performance gain. This increases computational time. \n\n(2) I think it is worth acknowledging some limitation observed in the visualization. One of the examples in ObjectsRoom of Figure 4 actually shows the proposed model is the only one that hallucinates the yellow color of the floor seen through the hollow part of the triangle shape. From the supplementary material, it seems often \"fill in\" the hollow part o the triangle in the segmentation mask, which should actually be background. From visual inspection, it seems that for the more challenging datasets such as CLEVRTex, missing small and partial objects is still frequent. And the model appears to often ignore the detailed texture in reconstruction but only captures the average color. Of course all models have limitations, I think it is worth pointing these out in discussion, and it will be interesting to postulate why texture often gets ignored.\n\n(3) It is more of a question but also a weakness (only for the sake of gaining insight): I still lack full understanding of where the teaching signal or inductive bias comes from to get the improvement. See my comment (1) in Questions."
                },
                "questions": {
                    "value": "(1) Although conceptually it makes sense that top-down modulation should help in object perception, because obviously the brain uses it, the computational mechanism of why it helps in the experiments presented in the paper still remains puzzling to me. I am happy to see the analysis in Figure 7 of the intra-object vs. inter-object feature variance and Figure 6 illustrates the failure of bottom-up only network. But my question is: what even caused these improvement. My guess is that \"in-principle\", when the top-down attention from the slot includes some aggregated information over pixels of the objects, it is possible for the low-level features to be biased towards such aggregated information. But \"in-principle\" does not mean this is guaranteed. Moreover, what drives the network being able to learn to detect small objects better? It sounds that the paper indicates that the conflict loss term is the guidance, but the conflict term is simply the conflict between two masks that are both internally generated and to be learned, with no additional inductive bias or teaching signals by introducing the top-down pathway. \n\nTo illustrate my point in more detail: if the slot representation has already lost one small object in the object masks M as in Figure 2, why would it necessarily produce the mask of the missing object through the attention to low-level feature and eventually show in the attention map A? Why would not minimizing the conflict loss C drive A to be more close to M (which will remove the small object) instead of vice versa? There seems to be no teaching signal directly from the image to constrain the attention map A, so I would guess that A is initially random in early stage of learning and is taught by M. Is that the case? If indeed A starts being better than M (it includes the missing objects while M does not), then why not just include A alone in the model? Why bother introducing M? \n\nOne guess is that the major contributor for the better ability of detecting small objects is just the extra depth in the attention map pathway introduced by the top-down attention. If so, would introducing more iterations in the original slot attention model achieve similar improvement? I wonder if the authors can elucidate the actual mechanism.\n\n(2) I would like to get a confirmation that no component of the network is pretrained on other tasks. If some of them are pre-trained, please explain.\n\n(3) At inference time, the model is run N times and the one with the smallest conflict C is chosen. I wonder whether the performance improvement mainly comes from this selection process. What happens to the performance if you set N to 1? I wonder if the authors think that this variation has some similarity to the brain? Perhaps the brain does not always detect all objects with one (or two) glances. The ones being missed by the brain depends on what a person's initial top down attention is on."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7275/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698757432867,
            "cdate": 1698757432867,
            "tmdate": 1699636868431,
            "mdate": 1699636868431,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "hea0f3CPL8",
                "forum": "Y3NBqtrQat",
                "replyto": "wZl9zFZTvW",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7275/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7275/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "We appreciate your review of our submission. \n\n## Pretraining confirmation\n\nAll the models on synthetic datasets are trained from scratch without using pretraining weight. Models on real-world datasets use the output feature of DINO to provide reconstruction objectives, and the pre-trained models have been indicated.\n\n## Weakness 1 & Question 3: Further explanation about Infer-RHG\n\nThe network can either quickly extract objects in the scene through a pure bottom-up inference, or it can run the network multiple times and search for a more precise perception through a top-down pathway. When N is set to 1, the network only runs the bottom-up process, which does not require more computational complexity, but still outperforms other SOTA models. When the top-down path is started during inference (Infer-RHG in the paper), the network requires more computation, and the performance will further increase. In the paper, every time we compare performance with other models, we list two performances that correspond to situations where N is set to 1 and 10 respectively.\n\nThe performance improvement of Infer-RHG comes from the selection of initial slot values. Random initial values in slot-attention will produce different attention distributions, eventually leading to performance differences, as shown in Figure 3 in the paper. This is similar to human visual perception, where sometimes we don't pay attention to objects with low saliency. Our model obtains multiple attention distributions through different initial slots so that these objects have a greater chance of being found. Using Top-down conflict as a signal, we pick out the perception that is most likely to find these objects, thus discovering small objects.\n\n## Weakness 2: RHGNet focuses more on object discovery ability\n\nThe top-down pathway demands the network to retain more general features because slots need to match all the features in the area they occupy, which causes slots to tend to reconstruct an \"average\" object that represents the overall features of the area while discarding more detailed features such as textures. This sometimes causes the model to converge to less precise reconstructions, but this doesn't always appear. We examined three models on ObjectsRoom trained with different random seeds. The model used for display had the problem described in Weakness, while the other two performed correctly, and all three models had an ARI score of 87% to 88%. We have updated the paper and replaced these figures with a correctly reconstructed version.\n\nIn addition, note that our displayed images are not carefully selected, but are directly chosen by taking out the first several images from test sets, thus the displayed result represents the average performance of our model. Among the 18 images shown in the supplementary material, a total of 107 objects appear, and our model misses 4 of them, which has made improvement compared with the current models shown in Figure 4 in the paper.\n\n## Weakness 3 & question 1: Working mechanism of our method\n\nConflict loss just drives $A$ to get closer to $M$. We add Information Integrity Loss $L_\\mathrm{info}$ to avoid the situation that the network learns to decrease conflict loss by removing an object from low-level features. We use a shallow decoder to reconstruct the image from output features of the CNN encoder, and $L_\\mathrm{info}$ is the reconstruction loss. This loss guarantees the existence of all objects in low-level features.\n\n$A$ is initially random and is meaningless at this time, thus we set the weight of conflict loss to 0 at the beginning. Using only reconstruction loss, slot attention can discover objects in a simple scene in the form of object mask $M$. This preliminary perception may miss objects, but it is at least \"broadly correct\". We think of $M$ as a pseudo label and use it to supervise the CNN encoder: it learns a segmentation task through conflict loss. Despite given annotations with some errors, the encoder can still effectively learn object concepts, which in turn makes slot attention clustering easier, thus obtaining better object discovery results.\n\nThe authors of [1] experimented with the number of slot attention iterations during training, finding that more iterations may decrease performance. We list experimental data on the number of slot attention iterations from their paper in the table below:\n\n|Iterations|ARI-FG on CLEVR6|\n|:-:|:-:|\n|1|85.2|\n|2|98.0|\n|3|98.8|\n|4|98.7|\n|5|92.0|\n\nThis suggests that the depth of the network is not necessarily beneficial for learning Object-Centric representations. Our top-down path does not introduce additional depth to the network, but rather introduces a shortcut that directly connects the perception of the upper level (slot) with the lower level (CNN features), thus benefiting the learning of low-level features.\n\n[1] Object-Centric Learning with Slot Attention"
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7275/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700027998506,
                "cdate": 1700027998506,
                "tmdate": 1700032630613,
                "mdate": 1700032630613,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "YgnwqhoOKI",
            "forum": "Y3NBqtrQat",
            "replyto": "Y3NBqtrQat",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7275/Reviewer_UGEP"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7275/Reviewer_UGEP"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes to add a top-down attention mechanism in current standard Object Oriented Learning models to overcome a blindness issue that occurs for occluded and small objects in crowded scenarios."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "The method introduced for using the top down guidance adds a loss function during training that is based on minimising a consistency measurement that evaluates the match of low features extracted with the object slots using KL divergence between these two factors.\nAt inference time, the number of iterations for the refinement with the top down consistency approach has an impact on the final performance, and it might be a nice way to having a compromise between inference computational time and final performance.\n\nA thorough experimental set-up with ablation studies is reported, demonstrating the higher accuracy of the model in comparision to state-of-the art and the contribution to each of the components."
                },
                "weaknesses": {
                    "value": "The connection to human visual system is rather weak, and even though it can serve as inspiration, there is no evidence that this could be a computational model for human computations of top down signals. There are other works that point to recurrent connections and other mechanisms for human brain modeling."
                },
                "questions": {
                    "value": "See weaknesses points"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7275/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699020789938,
            "cdate": 1699020789938,
            "tmdate": 1699636868317,
            "mdate": 1699636868317,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "QKrNhNyTyn",
                "forum": "Y3NBqtrQat",
                "replyto": "YgnwqhoOKI",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7275/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7275/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Connection between RHGNet and human visual system"
                    },
                    "comment": {
                        "value": "Thank you very much for your review of our submission. \n\nWe do not directly simulate the internal structure of human visual system, but rather achieve its function. In our main reference theory, Reverse Hierarchy Theory, the authors describe two main functions of human visual system, namely \"Vision at a glance\" and \"Vision with scrutiny\". The bottom-up and top-down pathways are responsible for the two kinds of vision. In our network, the top-down path will generate a conflict signal allowing the network to evaluate its output. The network selects a perception that minimizes the signal from multiple perceptions, thus obtaining as correct a perception as possible. At the same time, this process is optional, the model can not only obtain information quickly through pure bottom-up inference, but can also apply the top-down pathway for more careful observation and correcting perceptual errors. So, functionally, our networks are closer to the human visual system."
                    }
                },
                "number": 1,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7275/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700027350683,
                "cdate": 1700027350683,
                "tmdate": 1700027350683,
                "mdate": 1700027350683,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]