[
    {
        "title": "Composed Image Retrieval with Text Feedback via Multi-grained Uncertainty Regularization"
    },
    {
        "review": {
            "id": "vxA9czyZ11",
            "forum": "Yb5KvPkKQg",
            "replyto": "Yb5KvPkKQg",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission2369/Reviewer_cCoz"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission2369/Reviewer_cCoz"
            ],
            "content": {
                "summary": {
                    "value": "In this paper, the authors studied the image text composed retrieval in the field of fashion, aiming to prevent the model from prematurely excluding the correct candidate results in the early retrieval stage, and improve the recall of the retrieval task. To solve this problem, this paper proposed a composed retrieval model based on multi-granularity uncertainty regularization, which models coarse-grained and fine-grained retrieval simultaneously by considering multi-granularity uncertainty. The experiments showed that compared with existing methods, the proposed model can significantly improve the retrieval accuracy. This paper has strong practical significance and clear research motivation. However, there are also some problems in writing, which need to be strengthened."
                },
                "soundness": {
                    "value": "4 excellent"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "a.\tThis paper found that in the process of image text combination query in the real world, the multi-round interaction process inevitably includes coarse-grained retrieval and fine-grained retrieval, and the traditional fine-grained metric learning method cannot meet the requirements of coarse-grained reasoning.\nb.\tIn this paper, a new multi-granularity uncertainty regularization method is proposed. By uncertainty modeling and uncertainty regularization, fine-grained and coarse-grained matching can be learned during training. By controlling noise levels, the proposed method can be reduced to one-to-one metric learning, which is an extension of the traditional method.\nc.\tIn this paper, a large number of experiments are carried out on three public data sets, and the experiments showed that the proposed method can improve the recall rate of existing methods.\nd.\tSince the proposed method is orthogonal to traditional methods, it can be combined with existing works to further improve their performance."
                },
                "weaknesses": {
                    "value": "a.\tFigure 1.a and section 3.1 did not clearly explain why there is uncertainty in triplet matching, and it is recommended to give examples of situations where the description is unclear or the source image is inaccurate.\nb.\tSince this paper mainly built the network using existing works [1][2], but did not describe their implementation, it is recommended to provide a more detailed explanation of the details of the network.\nc.\tThere are some colloquial problems in the language of this paper, and some expressions need to be improved. It is suggested to polish the language.\n\nReference\n[1]\tLee S, Kim D, Han B. Cosmo: Content-style modulation for image retrieval with text feedback[C]//Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition. 2021: 802-812.\n[2]\tChen Y, Gong S, Bazzani L. Image search with text feedback by visiolinguistic attention learning[C]//Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition. 2020: 3001-3011.\n\n\nTypos and minors\nThere are non-standard punctuation marks, such as P8, the third line of \"Parameter sensitivity of the balance weight\", etc. It is recommended to check the whole paper."
                },
                "questions": {
                    "value": "please see the weaknesses."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission2369/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission2369/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission2369/Reviewer_cCoz"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission2369/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698674892104,
            "cdate": 1698674892104,
            "tmdate": 1699636169545,
            "mdate": 1699636169545,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "ax3znJhLE0",
                "forum": "Yb5KvPkKQg",
                "replyto": "vxA9czyZ11",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2369/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2369/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Dear Reviewer cCoz"
                    },
                    "comment": {
                        "value": "Dear Reviewer,\n\nThank you for your thoughtful feedback on our paper regarding composed image retrieval with text feedback. We appreciate your detailed analysis and constructive suggestions.\n\n**Q1. Why uncertainty in triplet matching?**\n\nA: Thank you. We will modify the figures and provide more samples. \nUsually, we do not know whether the triplet annotation is exactly one-to-one, and there may exist many false-positive candidates.\nFor instance, for coarse-grained matching, the short caption \"change red and short sleeves\" can match many different T-shirt candidates in the gallery; \nIn contrast, we also have many fine-grained annotations in the dataset, which could exactly match one target object, such as, \"change no sleeves with a black-white Micky mouse on the clothes\". \nTherefore, facing such triplet annotation uncertainty, we intend to propose a method that could automatically learn multi-grained matching with flexibility.\n\n**Q2. Details of the network**\n\nA: Thank you. We will provide a more comprehensive description of the network architecture details in Figure 2, and provide more details in implementation details. In particular, we adopt the same compositor structure in the existing work CosMo for a fair comparison, which contains two modules: the Content Modulator (CM) and the Style Modulator (SM). The CM uses a Disentangled Multi-modal Non-local block (DMNL) to perform local updates to the reference image feature, while the SM employs a multimodal attention block to capture the style information conveyed by the modifier text. The outputs of the CM and SM are then fused using a simple concatenation operation, and the resulting feature is fed into a fully connected layer to produce the final image-text representation.\n\nWe will add the above-mentioned details to the final version. \n\n\n**Q3. Language and punctuation**\n\nA: Thank you. We will refine expressions for clarity and formality, and conduct a comprehensive review to ensure proper punctuation marks throughout the entire paper.\n\n\nWe really appreciate your supports and understanding."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2369/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700643693651,
                "cdate": 1700643693651,
                "tmdate": 1700643855510,
                "mdate": 1700643855510,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "E0AdSW2sCN",
            "forum": "Yb5KvPkKQg",
            "replyto": "Yb5KvPkKQg",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission2369/Reviewer_FQ9t"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission2369/Reviewer_FQ9t"
            ],
            "content": {
                "summary": {
                    "value": "This paper identifies a training/test misalignment between the fine-grained metric learning and the demand on coarse-grained inference in the real-world image retrieval with text feedback. This paper introduces a new unified method to learn both fine- and coarse-grained matching during training. In particular, we leverage the uncertainty-based matching, which consists of uncertainty modeling and uncertainty regularization."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. The application is interesting, matching source image and text with target image.\n2. The paper is overall well-written and easy to follow.2\n3. The designed method is reasonable.\n4. The experimental results look good."
                },
                "weaknesses": {
                    "value": "1. The technical novelty and contribution are limited. It is trivial that adding noise to features can enhance the robustness. The other components in this method are trivial.\n2. The qualitative results are insufficient. The authors should provide more qualitative results, and provide in-depth analyses on the cases where the proposed method outperforms or underperforms the baselines."
                },
                "questions": {
                    "value": "1. Highlight the technical contributions.\n2. Provide more qualitative results and analyses."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission2369/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698736495215,
            "cdate": 1698736495215,
            "tmdate": 1699636169478,
            "mdate": 1699636169478,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "tCvRcDYjn8",
                "forum": "Yb5KvPkKQg",
                "replyto": "E0AdSW2sCN",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2369/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2369/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Dear Reviewer FQ9t"
                    },
                    "comment": {
                        "value": "Dear Reviewer,\n\nThank you for your thoughtful feedback on our paper regarding composed image retrieval with text feedback. We appreciate your detailed analysis and constructive suggestions.\n\n**Q1. Technical novelty and adding noise is too simple.**\n\nA: Thank you.\n \n(1) Simple is our advantage. It is worth noting that the performance improvement we achieved, especially in Recall@50, is nontrivial. On the three public datasets, i.e., FashionIQ, Fashion200k, and Shoes, the proposed method has achieved +4.03\\%, + 3.38\\%, and + 2.40\\% Recall@50 accuracy over a strong baseline, respectively. In this paper, we propose a new unified method to learn both fine- and coarse-grained matching during training. Additionally, our method is complementary, and when combined with SOTA, it can further enhance overall performance.\n\n(2) Adding noise is not an arbitrary idea. Actually, the noise assumption is designed in Eq.1 according to uncertainty. We derive the final uniform loss in Eq.5, and show the conventional fine-grained loss is a special case of Eq.5. \n\n**Q2. Insufficient qualitative result?**\n\nA: We appreciate you feedback regarding the qualitative results and the need for a more comprehensive analysis of the cases where our proposed method outperforms or underperforms the baselines. We have provided qualitative results in Figure 3. Can the reviewer specify what additional results of our experiment are needed? We are willing to provide them in the final version."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2369/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700643416559,
                "cdate": 1700643416559,
                "tmdate": 1700647090374,
                "mdate": 1700647090374,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "Xsql52rvUx",
            "forum": "Yb5KvPkKQg",
            "replyto": "Yb5KvPkKQg",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission2369/Reviewer_oWB8"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission2369/Reviewer_oWB8"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes a novel approach to simultaneously model the coarse- and fine-grained retrieval by using multi-grained uncertainty, which contains uncertainty modeling and uncertainty regularization. The corresponding experiments validate the effectiveness of the proposed method on three public datasets."
                },
                "soundness": {
                    "value": "4 excellent"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "1.The authors propose a new learning strategy in this paper, which is well-written and easy to follow.\n2.This paper provides comprehensive experimental analysis and ablation discussion."
                },
                "weaknesses": {
                    "value": "1.\tThe novelty is not well explained, please explain the difference from existing methods. The authors have to provide convincing proof to show why their proposed learning strategy is significantly different from the former methods. In Table 4(b), the author has provided a very simple discussion and experiment. However, it would be beneficial to include additional comparison methods and provide a more detailed discussion.\n2.\tIn the method section of this paper, it is important to highlight the unique aspects of your proposed learning strategy. While the uncertainty modeling approach presented is easy to follow, it should be acknowledged that its simplicity may also be considered a limitation in terms of novelty.\n3.\tThe comparison baseline of this paper is not sufficiently novel, consider exploring alternative methods that may be more unique. Recent three years of state-of-the-art methods should be included in the comparison experiment section to validate the effectiveness of the proposed method.\n4.\tAs mentioned, the main contribution of this paper includes three points. The description of the first contribution is not clear enough.\n5.\tThe tables in this paper are informative, but several of them require further standardization and uniformity."
                },
                "questions": {
                    "value": "None"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission2369/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission2369/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission2369/Reviewer_oWB8"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission2369/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698802249825,
            "cdate": 1698802249825,
            "tmdate": 1700645135580,
            "mdate": 1700645135580,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "iWUmBLDVMB",
                "forum": "Yb5KvPkKQg",
                "replyto": "Xsql52rvUx",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2369/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2369/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Dear Reviewer oWB8"
                    },
                    "comment": {
                        "value": "Dear Reviewer,\n\nThank you for your thoughtful feedback on our paper regarding composed image retrieval with text feedback. We appreciate your detailed analysis and constructive suggestions.\n\n**Q1-1. Explain novelty. The difference from existing methods with convincing proof**\n\nA: Thank you. Existing methods merely focus on the fine-grained search, by harnessing positive and negative pairs during training. This pair-based paradigm only considers the one-to-one distance between a pair of specific points, which is not aligned with the one-to-many coarse-grained retrieval process and compromises the recall rate. \nIn an attempt to fill this gap, we introduce an uncertainty learning approach to simultaneously modeling the coarse- and fine-grained retrieval by considering the multi-grained uncertainty.  \nIt is worth noting that the proposed method is focused on better learning objectives, which is complementary to existing works on compositor design. \n\n**Q1-2 / Q3. The baseline selection? More additional comparison methods and a more detailed discussion in Table 4(b). More SOTA methods.**\n\nA: Thank you. Considering the availability of open-source code, we select a widely-used method, CosMo, as baseline. We also show the scalability of our method to a recent baseline, Clip4Cir in Table 4(b). \nIn Table 1, we have compared ARTEMIS and DCNet, both within the last three years.\nWe will further add FashionViL and Pic2Word in comparison as follows.  \n \n| Average on FashionIQ | R@10      | R@50      |\n| -------------- | ----- | ----- |\n| ARTEMIS [1] | 26.05  | 50.29 |\n| DCNet [2] | 27.78 | 53.89  |\n| Pic2Word [4] | 24.70   | 43.70   |\n| FashionViL [3]    | 26.60 | 52.74 |\n| FashionViL* [3]  | 31.21 | 57.04  |\n| Ours   | **33.17**  | **61.39** |\n(* Note that FashionViL introduces extra datasets for training. )\n\n[1] Delmas et al. Artemis: Attention-based retrieval with text-explicit matching and implicit similarity. In ICLR, 2022.\n\n[2] Kim et al. Dual Compositional Learning in Interactive Image Retrieval. In AAAI, 2021.\n\n[3] Han et al. FashionViL: Fashion-Focused Vision-and-Language Representation Learning. In ECCV, 2022\n\n[4] Saito et al. Pic2Word: Mapping Pictures to Words for Zero-shot Composed Image Retrieval. In CVPR, 2023\n\nBesides, as suggested, we adopt a strong cross-modality baseline BLIP [5], and add our method. We observe that the proposed method could improve the performance as follows. \n\n| Shoes | R@10      | R@50      |\n| -------------------- | --------- | --------- |\n| BLIP  | 43.93 | 70.21 |\n| BLIP + Ours   | 48.40 | 75.29 |\n\n[5] Li et al. BLIP: Bootstrapping Language-Image Pre-training. In ICML 2022 \n\n**Q2. Highlight the unique aspects in Method Section. Too simple?**\n\nA: Thank you. One unique aspect is Eq. 5, which uniforms the fine-grained and coarse-grained learning. In particular, the fine-grained loss can be viewed as a special case of coarse-grained loss, whose variance is a constant term. In this way, we could unify the multi-grained learning losses and easily balance them via a dynamic weight $\\gamma$. We also have a detailed discussion at the end of Method Section on page 6. \n\nYes.  Simple is also our advantage. Despite its straightforward nature, our approach brings about significant performance improvements. On the three public datasets, i.e., FashionIQ, Fashion200k, and Shoes, the proposed method has achieved +4.03%, + 3.38%, and + 2.40% Recall@50 accuracy over a strong baseline, respectively. \nThis simplicity also ensures broader accessibility and applicability in various contexts. We hope that the simple method can serve as a new baseline and give the community a new perspective.\n\n**Q4. The description of the first contribution.**\n\nA: Thank you. In the first contribution, we hope to point out a long-exist misalignment problem, which compromises the training. The problem is due to the multi-grained annotation of the datasets. For instance, \"change red\" is a coarse-grained feedback, while \"change red and short sleeves with a blue white Micky mouse on the clothes\" is a fine-grained feedback. It is challenging to learn the multi-grained by the conventional one-to-one metric learning losses, like infoNCE loss, sphere loss and etc. We will modify the first point of motivation as follows: \n\n*We pinpoint a training/test misalignment in real-world image retrieval with text feedback, specifically between fine-grained metric learning and the practical need for coarse-grained inference. Traditional metric learning mostly focuses on one-to-one alignment, adversely impacting one-to-many coarse-grained learning. This problem identification underscores the gap we address in our approach.*\n\n**Q5. The standardization and uniformity of table**\n\nA: Thanks a lot for your suggestion. We will re-arrange the table location and modify the table style to make its style more uniform."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2369/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700644233718,
                "cdate": 1700644233718,
                "tmdate": 1700713008366,
                "mdate": 1700713008366,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]