[
    {
        "title": "Pre-Training and Fine-Tuning Generative Flow Networks"
    },
    {
        "review": {
            "id": "T0yOFjJK4U",
            "forum": "ylhiMfpqkm",
            "replyto": "ylhiMfpqkm",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission2598/Reviewer_gG5W"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission2598/Reviewer_gG5W"
            ],
            "content": {
                "summary": {
                    "value": "The paper describes a methodology for self-supervised reward-free pretraining of generative flow networks (GFlowNets). The authors propose a novel scheme for pretraining of GFlowNets and show its efficiency on a number of tasks. They also compare it with the baselines on a number of datasets. The authors include a number of improvements over the standard GFlowNets: \n\n- Self-supervised pretraining\n\n- Target task finetuning (or should it be called, e.g., task transfer as it does not finetune the coefficients of the original model to the new task?)\n\n- Amortisation procedure for the target task finetuning to alleviate the problem of high cost of estimation of the task-specific reward function (Eq 6)"
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "- (Originality, Significance) A multifold methodological contribution (see above), which helps define new ways to train and use the GFlowNet models, most importantly, including the insight about transferring the model to the downstream task without re-training (Section 4.2)\n\n- (Quality) Well-written paper\n\n- (Quality) Thorough analysis of the method on a number of tasks\n\n- (Reproducibility/Clarity) The paper appears to provide good explanation of the experimental conditions and therefore, addresses reproducibility well (apart from Q2)"
                },
                "weaknesses": {
                    "value": "- (Soundness aspects) There are some questions to resolve about the motivation of the outcome teleportation module (see Q1), hence the current score. \n\n- Clarifications on the experimental setting (see Q2)"
                },
                "questions": {
                    "value": "Q1: \nWhile the experimental results show clear improvement when using the outcome teleportation module, the theoretical  motivation of Eq 4 still remains not entirely clear. The  original detailed balance equation represents the reversibility of the Markov chain; the proposed method, in contrast, does not satisfy such condition as it is seemingly assymetrical with backwards flow. One possible way would be to consider the right hand side a factorisation of the transition function $\\tilde{P}_B(s | s’, y) = P_B (s | s’, y) R(x|y)$ but that won’t give $\\int \\tilde{P}_B(s | s’, y) ds = 1$. One can interpret it that it works as a regularisation of the loss function in Eq (5). Another related question relates to the transition between Eq 14 and Eq 15 in the Appendix related to the proof of this statement. It is not clear where did $R(x|y)$ disappear in between  Eq. (14) and (15). In the standard case of the detailed balance equation, that would have been a valid transition, but why is it valid for the non-1 R(x|y)?\n\nQ2: Not sure I completely understand how the number of discovered modes (normalised and unnormalised) is calculated  (see Figures 10 and 11)?\n\nQ3: “A remarkable aspect of GFlowNets is the ability to demonstrate the reasoning potential in generating a task-specific policy.“ Not sure the word reasoning would be the right way to describe it as I am not sure it is objective; despite not necessarily agreeing with the wording, I do think the meaning behind it, i.e. transferring to the task without re-training (Section 4.2), is a valuable aspect."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission2598/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission2598/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission2598/Reviewer_gG5W"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission2598/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698693211906,
            "cdate": 1698693211906,
            "tmdate": 1700591283590,
            "mdate": 1700591283590,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "JT5KRfi25Q",
                "forum": "ylhiMfpqkm",
                "replyto": "T0yOFjJK4U",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2598/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2598/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer gG5W (Part 1 of 2)"
                    },
                    "comment": {
                        "value": "We thank the reviewer for the valuable feedback on our work, and for noting that we propose \"a novel scheme\" that \"defines new ways to train and use the GFlowNet models\" with \"insights about task tranfer\" and \"thorough analysis\"， and show its \"efficiency on a number of tasks\". We greatly appreciate your comments! \n\nWe have updated the paper to address the reviewer's comments, where the revisions are marked in red.\n\n*Q1: While the experimental results show clear improvement when using the outcome teleportation module, the theoretical motivation of Eq 4 still remains not entirely clear. The original detailed balance equation represents the reversibility of the Markov chain; the proposed method, in contrast, does not satisfy such condition as it is seemingly assymetrical with backwards flow. One possible way would be to consider the right hand side a factorisation of the transition function $\\tilde{P}_B(s|s’,y) = P_B(s|s’,y)R(x|y)$ but that won’t give $\\int \\tilde{P}_B(s|s’,y)ds=1$. One can interpret it that it works as a regularisation of the loss function in Eq (5). Another related question relates to the transition between Eq 14 and Eq 15 in the Appendix related to the proof of this statement. It is not clear where did $R(s|y)$ disappear in between Eq. (14) and (15). In the standard case of the detailed balance equation, that would have been a valid transition, but why is it valid for the non-1 $R(x|y)$?*\n\nWe have included additional derivation steps and clarified this in Appendix B.1 in the updated draft. \n\n(Regarding the motivation for Eq. (4): efficient credit assignment) The outcome teleportation technique we introduce in Section 4.1.1 is designed specifically for the outcome-conditioned GFlowNet (OC-GFN), which has a binary reward function -- the reward is $1$ when the outcome is reached while the reward is $0$ when the agent fails to reach the target outcome. In particular, Eq. (4) is valid only in the case of binary rewards and is designed for efficiently training OC-GFN -- incorporating the reward in the learning objective for each transition enables more efficient credit propagation. \n\nLet's consider the case when the OC-GFN is trained perfectly, where the success rate for reaching the given goal is $100\\%$. If the outcome $y$ is a reachable goal from $s'$ (i.e., $R(x|y)=1$), then the flow consistency constraint in Eq. (4) will be $F(s, y) P_F(s'|s, y) = F(s'|y) P_B(s|s',y)$, which corresponds to usual detailed balance equation. Otherwise (when $R(x|y)=0$ for unreachable outcomes $y$), the flow consistency constraint will be $F(s,y) P_F(s'|s,y) = 0$, which quickly propagates the failure learning signal back to each transition directly.\n\nAnother perspective is that it can be considered as a special kind of return/energy decomposition [1] for improving credit assignment, i.e., $R(x) = \\prod_{t=0}^{n-1} r_t$, with $r_t$ denoting intermediate rewards. It can be considered as we decompose the terminal reward $1$ (or $0$) back to each step with a constant intermediate reward of $1$ (or $0$).\n\n(Regarding the proof) Accordingly in the proof, we leverage the fact that the reward for outcome-conditioned GFlowNet is binary ($0/1$) in Eq. (14) and Eq. (15) (which correspond to Eq. (17) and Eq. (18) in the updated draft). We first consider the case where the outcome is achieved, i.e., $x=y$ and $R(y|y)=1$ in Eq. (17), and then consider the other case where $R(x|y)= 0$ right after in Eq. (18). \n\n*Q2: Not sure I completely understand how the number of discovered modes (normalised and unnormalised) is calculated (see Figures 10 and 11)?*\n\nWe use the same evaluation metrics as in the literature in GFlowNets [1-2]. The number of modes is calculated using a sphere-exclusion procedure. Specifically, the generated candidates are sorted by reward, and then scanning down this sorted list, a candidate is added to the list of modes if it is above a certain reward threshold and is further away than some distance threshold from all other modes. For the normalized number of modes, we normalize the number of modes discovered in each task by min-max normalization, and average this value across different tasks. This procedure is adapted from [1-2] and we have added this description in Appendix C.1."
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2598/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700366325074,
                "cdate": 1700366325074,
                "tmdate": 1700366325074,
                "mdate": 1700366325074,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "czD1KVE2Wf",
                "forum": "ylhiMfpqkm",
                "replyto": "T0yOFjJK4U",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2598/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2598/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer gG5W (Part 2)"
                    },
                    "comment": {
                        "value": "*Q3: “A remarkable aspect of GFlowNets is the ability to demonstrate the reasoning potential in generating a task-specific policy.” Not sure the word reasoning would be the right way to describe it as I am not sure it is objective; despite not necessarily agreeing with the wording, I do think the meaning behind it, i.e. transferring to the task without re-training (Section 4.2), is a valuable aspect.*\n\nWe would like to thank the reviewer for recognizing the value of Section 4.2. Our goal was to emphasize the brain-inspired reasoning potential [3] that GFlowNets exhibit, while our work takes a step further by enabling efficient fine-tuning on downstream tasks. We acknowledge that the term \"reasoning\" may not be the most precise choice, and we have revised our wording to avoid confusion. \n\n---\nWe thank the reviewer for the time and effort in reviewing our work! We would greatly appreciate it if the reviewer could check our responses and the updates in the paper and let us know whether your concerns have been adequately addressed. We are happy to provide further clarification if you have any additional concerns.\n\n---\n*References*\n\n[1] Pan, Ling, Nikolay Malkin, Dinghuai Zhang, and Yoshua Bengio. \"Better training of gflownets with local credit and incomplete trajectories.\" arXiv preprint arXiv:2302.01687 (2023).\n\n[2] Bengio, Emmanuel, Moksh Jain, Maksym Korablyov, Doina Precup, and Yoshua Bengio. \"Flow network based generative models for non-iterative diverse candidate generation.\" Advances in Neural Information Processing Systems 34 (2021): 27381-27394.\n\n[3] Bengio, Yoshua, Nikolay Malkin, and Moksh Jain. The GFlowNet Tutorial. https://milayb.notion.site/The-GFlowNet-Tutorial-95434ef0e2d94c24aab90e69b30be9b3, 2022."
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2598/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700366363520,
                "cdate": 1700366363520,
                "tmdate": 1700495865894,
                "mdate": 1700495865894,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "Bkkqhi4mAH",
                "forum": "ylhiMfpqkm",
                "replyto": "T0yOFjJK4U",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2598/Reviewer_gG5W"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2598/Reviewer_gG5W"
                ],
                "content": {
                    "title": {
                        "value": "A small clarification on the statement"
                    },
                    "comment": {
                        "value": "Dear authors,\n\n\nAs I am going through the responses, I would like to kindly ask to clarify on the following statement: \"We would like to thank the reviewer for recognizing the value of Section 4.2. Our goal was to emphasize the brain-inspired reasoning potential [3] that GFlowNets exhibit, while our work takes a step further by enabling efficient fine-tuning on downstream tasks. We acknowledge that the term \"reasoning\" may not be the most precise choice, and we have revised our wording to avoid confusion.\"\n\nIn the response, I see references [1], [2], [5] but not [3]. I believe it's a typo, but still think it needs clarity. What paper do you refer to?\n\nMany thanks,\nthe Reviewer"
                    }
                },
                "number": 8,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2598/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700494701053,
                "cdate": 1700494701053,
                "tmdate": 1700494723787,
                "mdate": 1700494723787,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "f3Rk73zdu1",
                "forum": "ylhiMfpqkm",
                "replyto": "ZSsmNI6YiQ",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2598/Reviewer_gG5W"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2598/Reviewer_gG5W"
                ],
                "content": {
                    "comment": {
                        "value": "Dear Authors,\n\nI've gone through the responses to myself and other reviewers. Happy to change the score according to the revisions. \n\nQ1: Text before eq. (17): *Combining* Eq. 13. Other than that, I am happy with the clarification on the derivation, although I would clearly emphasise after Eq (4) that this is enabled by the fact the rewards are binary. \n\nQ2: Many thanks, it answers the original question\n\nQ3: The answer is clear, and changing the reasoning with adaptability looks good to me. \n\nI've also checked that there was another important comment from Reviewer ja74:\n\"Q1: There should be a discussions of assumptions behind the OC-GFNs pretraining. Namely, that transfer is only possible when the reward function changes but not if the action-space or the state-space change. Moreover, the goal-conditioning requires a well specified set of outcomes Y — presumably not all states s are terminal states — which makes the proposed method not truly unsupervised. These limitations (together with the applicability mentioned at the end of A.2) could be stated explicitly in the main text, and left to future work.\"\nI agree that the assumptions behind OC-GFNs pretraining needed to be addressed, and I think the revised version covers this point as well."
                    }
                },
                "number": 13,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2598/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700591202834,
                "cdate": 1700591202834,
                "tmdate": 1700591202834,
                "mdate": 1700591202834,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "eBMfECyix3",
            "forum": "ylhiMfpqkm",
            "replyto": "ylhiMfpqkm",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission2598/Reviewer_ja74"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission2598/Reviewer_ja74"
            ],
            "content": {
                "summary": {
                    "value": "- This paper tackles the problem of pretraining Generative Flow Networks (GFNs) and fine-tuning them to quickly approximate new sampling distributions.\n- The authors take a reinforcement learning (RL) perspective, and observe that for GFNs the state-space, action-space, and transition probabilities remain unchanged for many problems of interests.\n- This lets them apply goal-conditioned RL methods as a generic strategy to pretrain GFNs, which they dub outcome-conditioned GFNs (OC-GFNs).\n- For fine-tuning, they show how to immediately adapt OC-GFNs when given the reward function of a downstream task (see Eq. 6). Since this involves the computation of an intractable sum, they amortize it with a learned predictor.\n- The authors demonstrate the efficacy of their fine-tuned OC-GFNs on toy (GridWorld & BitSequence) and real-world biology problems (DNA binding, RNA generation, AMP generation), with some ablations on the toy problems."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "- The exposition is generally clear, and I enjoyed reading the paper. The authors first present the goal-conditioning idea and how it applies to GFNs, then walk the reader through their derivation and assumptions for amortized adaptation. I especially appreciated Section 2 which gave a clear and concise background.\n- The paper tackles an impactful problem for GFNs. While the pretraining solution is not particularly novel, it’s a neat application of goal-condition RL to an amortized sampling problem. The authors also figured out how to make it work on a wide range of problems, and provide several ablations in the main text and the appendix.\n- The insight that a new sampling policy can be readily obtained from an outcome-conditioned flow is neat and, as far as I can tell, novel. This could spawn interest in outcome-conditioned flows and different ways to amortize Eq. 6."
                },
                "weaknesses": {
                    "value": "- There should be a discussions of assumptions behind the OC-GFNs pretraining. Namely, that transfer is only possible when the reward function changes but not if the action-space or the state-space change. Moreover, the goal-conditioning requires a well specified set of outcomes Y — presumably not all states s are terminal states — which makes the proposed method not truly unsupervised. These limitations (together with the applicability mentioned at the end of A.2) could be stated explicitly in the main text, and left to future work.\n- While there are enough benchmarks, I believe none include continuous action/state spaces. Moreover, the experiments only one GFN variant — the detailed-balance one, which is also used for OC-GFN. It would help validate the generality of OC if we had experiments showing it worked on these different settings. Moreover, I’d be curious to know how other pretrained amortized sampling baselines (eg, VAEs, normalizing flows) fare against OC-GFN — and what about pretraining a GFN on task A (without OC) and fine-tuning it on task B?\n- (minor) The second and fourth paragraphs of Section 4.2 mention the “reasoning potential” of GFNs, and that intractable marginalization leads to “slow thinking”. Are these anthropomorphisms really needed for this paper?\n- (minor) I wished the preliminaries (Section 2) included a training objective like Eq. 5 & 9, and that these more clearly specified which are the optimization variables.\n- Some typos, there maybe more:\n    - p. 3: multi-objective what?\n    - p. 4: “given a reward R a posterior as a function”\n    - p. 4: autotelicly → autotelically?\n    - p. 5: “in log-scale obtained from Eq. (5)” should be Eq. 4?"
                },
                "questions": {
                    "value": "- Please comment on the weaknesses outlined above.\n- Figures 10 and 11, right: Why is adaptation slower for OC-GFN than GFN in the first few thousand iterations? This is surprising since one would hope pretraining helps bootstrap downstream performance as in vision / language / RL. If it’s an exploration phase, did you validate it and is there a way to side-step it?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission2598/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698821604164,
            "cdate": 1698821604164,
            "tmdate": 1699636197469,
            "mdate": 1699636197469,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "wduRL2tK9V",
                "forum": "ylhiMfpqkm",
                "replyto": "eBMfECyix3",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2598/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2598/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer ja74 (Part 1 of 2)"
                    },
                    "comment": {
                        "value": "We thank the reviewer for the useful feedback and positive assessment of our work, and for noting that we tackle \"an impactful problem\" with \"a novel and neat insight\", and \"the exposition is generally clear\". We are glad that the reviewer enjoyed reading the paper. \n We greatly appreciate your comments! \n\nWe seek to address each of your concerns as below, and we have updated the paper to address the reviewer's comments, where the revisions are marked in red.\n\n*Q1: There should be a discussions of assumptions behind the OC-GFNs pretraining. Namely, that transfer is only possible when the reward function changes but not if the action-space or the state-space change. Moreover, the goal-conditioning requires a well specified set of outcomes Y — presumably not all states s are terminal states — which makes the proposed method not truly unsupervised. These limitations (together with the applicability mentioned at the end of A.2) could be stated explicitly in the main text, and left to future work.*\n\nThanks for the suggestion. For the definition of the terminal states, as in most GFlowNets benchmarks, the agent is allowed to take a \"stop\" action at every state, so every state can be a terminal state. We explicitly include this in Section 4 in the main text and Appendix D due to space limitation. We hope that our general framework can induce many fruitful follow-ups in the pre-training and fine-tuning paradigm of GFlowNets, and combine the recent success of this paradigm in vision, language, and RL domains.\n\n*Q2: While there are enough benchmarks, I believe none include continuous action/state spaces. Moreover, the experiments only one GFN variant — the detailed-balance one, which is also used for OC-GFN. It would help validate the generality of OC if we had experiments showing it worked on these different settings.*\n\n(Continuous state/action spaces) On the one hand, while continuous GFlowNets have recently been studied theoretically [1], in practice they remain limited in terms of applications. As noted in [2], continuous GFlowNets can be quite tricky to train and are challenging to scale to realistic tasks (which is also an open problem in GFlowNets). Therefore, we focus on the discrete case which is much more reliable (and most of the success benchmarks for GFlowNets focus on discrete space), and consider the practical and challenging tasks in the biological sequence generation domain. On the other hand, we do note that our method, in theory, is still applicable to the continuous case. \n\n(Applicability on other GFlowNets objectives) We include an additional study of OC-GFN when built upon the sub-trajectory balance [3] objective (OC-SubTB) in Section 5.1, where a detailed discussion can also be found in Appendix B.2. The experiments validate the versatility of our proposed methodology, which is general and can be applied to different GFlowNets learning objectives that learn state flow functions. \n\n*Q3: Moreover, I’d be curious to know how other pretrained amortized sampling baselines (eg, VAEs, normalizing flows) fare against OC-GFN.* \n\nApproaches such as VAEs and normalizing flows differ from GFlowNets in a key way -- they are learned using samples from some distribution and typically cannot be trained directly with a reward function. Although methods like MCMC can be used to sample proportionally to a given function, they typically do not take advantage of machine learning, and we are not aware of any such methods exploiting unsupervised pre-training for MCMC. While we are not aware of any such approaches that are applicable to the domains we study, we would be happy to include any such baselines for comparison. \n\n*Q4: What about pretraining a GFN on task A (without OC) and fine-tuning it on task B?*\n\nWe include an additional comparison of a direct pre-training and fine-tuning scheme for GFlownets in Appendix C.3 (by pre-training a GFlowNet on task A, and then fine-tuning it on task B), which is also a motivation for our work. Results show that this simple scheme for pre-training GFlowNets does not lead to a universally helpful strategy for efficient transfer. This is because the GFlowNet learns to sample proportionally from the reward function of task A during the \"pre-training\" stage, and thus, if there is not enough shared structure between the rewards for task A and task B, the GFlowNet model pre-trained on task A may not be beneficial for the \"fine-tuning\" stage on task B, and could potentially even have a negative impact. On the contrary, our insight for unsupervised pre-training is that we cast this challenging problem as a self-supervised problem by learning to reach any goal for learning a *functional* understanding of the task."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2598/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700366177279,
                "cdate": 1700366177279,
                "tmdate": 1700366177279,
                "mdate": 1700366177279,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "f7CtTWyqfE",
                "forum": "ylhiMfpqkm",
                "replyto": "eBMfECyix3",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2598/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2598/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Dear Reviewer ja74,\n\nWe would like to thank you again for the detailed evaluation and helpful feedback! Since we are near the end of the discussion phase, we would like to take this opportunity to follow up on our previous responses. Please let us know if we have adequately addressed your concerns, or if there were any additional issues that we could address. We would be more than happy to discuss them during the ongoing discussion phase.\n\nThank you for your time and effort!"
                    }
                },
                "number": 11,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2598/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700535698384,
                "cdate": 1700535698384,
                "tmdate": 1700535698384,
                "mdate": 1700535698384,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "ZmleIawvwF",
                "forum": "ylhiMfpqkm",
                "replyto": "eBMfECyix3",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2598/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2598/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Dear Reviewer ja74,\n\nWe would like to thank you again for the detailed evaluation and helpful feedback! As we approach the end of the discussion phase, we would like to take this opportunity to follow up on our previous responses and revisions. \n\nIn summary, the major revisions include: 1) We included additional experiments to demonstrate the versatility of our approach by building OC-GFN upon the sub-trajectory balance (SubTB) objective, which validates the generality of our proposed framework. 2) We have included a comparison with a naive scheme for direct pre-training and fine-tuning, which motivated our work. This comparison highlights the inefficiency of the naive approach in achieving efficient transfer for GFlowNets. In contrast, our approach to unsupervised pre-training is based on the insight that we can frame this challenging problem as a self-supervised task by learning to reach any outcome, which enables us to develop a functional understanding of the task.\n\nCould you please let us know if we have adequately addressed your concerns? Thank you for your time and effort!"
                    }
                },
                "number": 16,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2598/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700704358387,
                "cdate": 1700704358387,
                "tmdate": 1700704551134,
                "mdate": 1700704551134,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "5mc95q5Npq",
            "forum": "ylhiMfpqkm",
            "replyto": "ylhiMfpqkm",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission2598/Reviewer_Deqj"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission2598/Reviewer_Deqj"
            ],
            "content": {
                "summary": {
                    "value": "The paper introduces a novel approach to pretrain generative flow networks (GFlowNet) in a self-supervised manner, focusing on aligning input with target outcomes. When adapting to a downstream task, there's no need to re-train the GFlowNet; instead, outcomes are integrated using Monte Carlo sampling. The authors cleverly introduce an amortized predictor to overcome sampling challenges."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "The concept presented in this paper is both simple and elegant. The unsupervised fine-tuning approach offers a significant contribution, adeptly addressing the training challenges associated with GFlowNet. Overall, the paper is well-structured and easy to follow, making it a valuable addition to the literature."
                },
                "weaknesses": {
                    "value": "See questions."
                },
                "questions": {
                    "value": "In the 'Discussion about applicability' section, the trajectory balance's inability to learn the stateflow function, and its subsequent inapplicability for converting a pre-trained GFlowNet on a new reward, is mentioned. Have the authors evaluated the sub-trajectory balance objective (as per Pan et al.) which does incorporate the state-flow function?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission2598/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission2598/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission2598/Reviewer_Deqj"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission2598/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698827075873,
            "cdate": 1698827075873,
            "tmdate": 1699636197345,
            "mdate": 1699636197345,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "o9TN8gedYM",
                "forum": "ylhiMfpqkm",
                "replyto": "5mc95q5Npq",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2598/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2598/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer Deqj"
                    },
                    "comment": {
                        "value": "We thank the reviewer for the useful feedback and positive assessment of our work, and for noting that we introduce \"a novel approach\" with \"an elegant concept\" that \"offers a significant contribution\" in \"a well-structured\" way, which makes it \"a valuable addition to the literature\". We greatly appreciate your comments! \n\nWe seek to address each of your concerns as below, and we have updated the paper to address the reviewer's comments, where the revisions are marked in red.\n\n*Q1: In the 'Discussion about applicability' section, the trajectory balance’s inability to learn the stateflow function, and its subsequent inapplicability for converting a pre-trained GFlowNet on a new reward, is mentioned. Have the authors evaluated the sub-trajectory balance objective (as per Pan et al.) which does incorporate the state-flow function?*\n\nThank you for the suggestion. We include an additional study of OC-GFN when built upon the sub-trajectory balance objective [1] (OC-SubTB) in Section 5.1, where a detailed discussion can be found in Appendix B.2. The experiments validate the versatility of our proposed methodology, which is general and can be applied to different GFlowNets learning objectives that learn state flow functions. \n\n---\n\nWe thank the reviewer for the time and effort in reviewing our work! We would greatly appreciate it if the reviewer could check our responses and the updates in the paper and let us know whether your concerns have been adequately addressed. We are happy to provide further clarification if you have any additional concerns.\n\n---\n\n*References*\n\n[1] Madan, Kanika, Jarrid Rector-Brooks, Maksym Korablyov, Emmanuel Bengio, Moksh Jain, Andrei Cristian Nica, Tom Bosc, Yoshua Bengio, and Nikolay Malkin. \"Learning GFlowNets from partial episodes for improved convergence and stability.\" In International Conference on Machine Learning, pp. 23467-23483. PMLR, 2023."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2598/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700366025422,
                "cdate": 1700366025422,
                "tmdate": 1700366025422,
                "mdate": 1700366025422,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "PPvxDenmKA",
            "forum": "ylhiMfpqkm",
            "replyto": "ylhiMfpqkm",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission2598/Reviewer_5Pd3"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission2598/Reviewer_5Pd3"
            ],
            "content": {
                "summary": {
                    "value": "The paper  proposes the outcome-conditioned GFlowNet (OC-GFN) for reward-free pre-training and fine-tuning of GFlowNets in order for efficient adaptation to downstream tasks. OC-GFN is learnt to reach any specified outcome, and an amortized predictor is learnt to approximate an intractable marginal required for fine-tuning. The paper provides extensive experimental results to validate the effectiveness of their proposed approach."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "1. The paper introduces a novel approach for reward-free pre-training and fine-tuning of GFlowNets, which can serve as a foundation for further research of GFlowNet pretraining.\n2. The paper provides a thorough description of the proposed approach, including the formulation of the problem, the training procedures, and the evaluation metrics. The experiments are well-designed and conducted, and the results are presented clearly."
                },
                "weaknesses": {
                    "value": "1. The paper lacks a comparison with existing approaches for pre-trained models or goal-conditioned RL methods."
                },
                "questions": {
                    "value": "1. How does the proposed approach perform compared to existing methods for pre-trained models or RL methods besides DQN? and what about the computation cost of these methods?\n2. Is the trained GAFlowNet necessary? What about its performance and how does it influence the results?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission2598/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699084622161,
            "cdate": 1699084622161,
            "tmdate": 1699636197250,
            "mdate": 1699636197250,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "1Dug9yELNk",
                "forum": "ylhiMfpqkm",
                "replyto": "PPvxDenmKA",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2598/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2598/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer 5Pd3 (Part 1 of 2)"
                    },
                    "comment": {
                        "value": "We thank the reviewer for the useful feedback and positive assessment of our work, and for noting that we introduce \"a novel approach\" and provide \"a thorough description\" of the proposed approach with \"well-designed and conducted experiments\", where \"extensive results are presented clearly\", and our work \"can serve as a foundation\" for future research on GFlowNet pretraining. We greatly appreciate your comments! \n\nWe seek to address each of your concerns as below, and we have updated the paper to address the reviewer's comments, where the revisions are marked in red.\n\n*Q1: How does the proposed approach perform compared to existing methods for pre-trained models or RL methods besides DQN? And what about the computation cost of these methods?*\n\nWe would like to highlight that we propose the *first* pre-training paradigm for GFlowNets, and there are no existing methods for pre-training GFlowNets models to the best of our knowledge. However, as a point of comparison, we also include a discussion of a simple scheme (pre-train a GFlowNet on task A and then fine-tune it on task B) in Appendix C.3, which also serves as a motivation for our work. Results show that this simple scheme for pre-training GFlowNets does not lead to a universally applicable strategy for efficient transfer. This is because the GFlowNet learns to sample proportionally from the reward function of task A during the \"pre-training\" stage, and thus, if there is not enough shared structure between the rewards for task A and task B, the GFlowNet model pre-trained on task A may not be beneficial for the \"fine-tuning\" stage on task B, and could potentially even have a negative impact. On the contrary, our insight for unsupervised pre-training is that we cast this challenging problem as a self-supervised problem by learning to reach any outcome for learning a \"functional\" understanding of the task.\n\nRegarding other RL baselines, we include additional comparisons with two other strong RL baselines (PPO and SAC) besides DQN in Appendix C.4 on two downstream tasks in TF Bind generation due to time limitation for the rebuttal period. As shown, the reward-maximization nature of RL approaches limits the resulting solution diversity [1], where OC-GFN continues to outperform these baselines consistently.\n\nWe also include computation costs for each method in Appendix C.4 (Figure 18), where we observe that OC-GFN only induces marginal additional computation cost.\n\n*Q2: Is the trained GAFlowNet necessary? What about its performance and how does it influence the results?*\n\nThank you for the question. The GAFlowNet model plays a critical role in the unsupervised pre-training stage. Please find our detailed discussion and experiments below.\n\n(Intuition) GAFlowNet [2] enables the learning of GFlowNet driven by intrinsic rewards (e.g., curiosity about states [3] -- which gives a higher reward for less familiar/unseen states and vice versa). This makes it very suitable in the unsupervised pre-training stage [4] where the agent generates the outcomes autotelically, which requires training it with full support over the outcomes. GAFlowNet improves the efficiency of generating diverse outcomes, which is particularly important in higher-dimensional spaces. \n\n(Experiments) We include an ablation study for the effect of the GAFlowNet model by replacing it with a random agent and a GFlowNet which is trained with task-irrelevant rewards ($R(x)=1$) in the unsupervised pre-training stage. (Please also note that the effect of completely removing this part has been studied in Section 5.1 (Figure 4), which is a key to the success of the unsupervised pre-training stage.)\n\n(Empirical results) We compare the success rate of each method for reaching given outcomes following Section 5.1. As shown in Figure 14 in Appendix C.2, OC-GFN (GAFN) learns much more efficiently than the other two variants, where the GAFN model is replaced with a GFN model trained with task-irrelevant rewards (OC-GFN (GFN)) or a random agent (OC-GFN (random)), with a more significant margin in larger maps. In addition,  we also study the generated outcome distribution by ablating this model design to gain a better understanding during the learning process. Figure 15 in Appendix C.2 demonstrates the outcome distribution generated by each method at the same iteration in a large map. As shown, GAFN generates outcomes that allow the agent to explore unfamiliar regions, resulting in a more diverse outcome distribution for training the OC-GFN and improving its learning efficiency, which also demonstrates the importance of the GAFN model."
                    }
                },
                "number": 1,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2598/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700365924753,
                "cdate": 1700365924753,
                "tmdate": 1700365924753,
                "mdate": 1700365924753,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "pf6Ppmb9Qn",
                "forum": "ylhiMfpqkm",
                "replyto": "PPvxDenmKA",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2598/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2598/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Dear Reviewer 5Pd3,\n\nWe would like to thank you again for the detailed evaluation and helpful feedback! Since we are near the end of the discussion phase, we would like to take this opportunity to follow up on our previous responses. Please let us know if we have adequately addressed your concerns, or if there were any additional issues that we could address. We would be more than happy to discuss them during the ongoing discussion phase.\n\nThank you for your time and effort!"
                    }
                },
                "number": 10,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2598/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700535669294,
                "cdate": 1700535669294,
                "tmdate": 1700535669294,
                "mdate": 1700535669294,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "0HsxP4iLaF",
                "forum": "ylhiMfpqkm",
                "replyto": "PPvxDenmKA",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission2598/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission2598/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Dear Reviewer 5Pd3,\n\nWe would like to thank you again for the detailed evaluation and helpful feedback! As we approach the end of the discussion phase, we would like to take this opportunity to follow up on our previous responses and revisions. \n\nIn summary, the major revisions include: 1) We have included additional RL baselines (PPO and SAC) to provide a more comprehensive comparison, where the results show that OC-GFN continues to outperform these baselines consistently. 2) Additionally, we have expanded our discussion and conducted further experiments to demonstrate the importance of GAFlowNets in the unsupervised pre-training stage.\n\nCould you please let us know if we have adequately addressed your concerns? Thank you for your time and effort!"
                    }
                },
                "number": 15,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission2598/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700704151352,
                "cdate": 1700704151352,
                "tmdate": 1700704569343,
                "mdate": 1700704569343,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]