[
    {
        "title": "Adversarial Attacks as Near-Zero Eigenvalues in The Empirical Kernel of Neural Networks"
    },
    {
        "review": {
            "id": "vE8FFeDnNo",
            "forum": "YmQyEdLIkU",
            "replyto": "YmQyEdLIkU",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission5540/Reviewer_YsYz"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission5540/Reviewer_YsYz"
            ],
            "content": {
                "summary": {
                    "value": "This paper makes contributions to the theoretical understanding of the adversarial examples. The authors use kernel theory, Mercer’s theorem in particular, to explain the adversarial examples. Specifically, the authors first prove that adversarial examples shift the Mercer’s spectrum of the empirical kernel so that the near-zero density of the Mercer eigenvalues is high. Extending the first theorem, the authors also explain the reason for the denseness of adversarial examples, i.e., adversarial examples are unlikely to appear in the test set, but they exist near every test sample. Lastly, the authors demonstrate their findings with small experiments."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "1. I briefly checked the proofs and the proofs look to be correct to me.\n2. To the best of my knowledge, this is an original work that makes theoretical progress in the field of adversarial machine learning. Considering that such theoretical works are rare in this field, the authors’ findings are valuable."
                },
                "weaknesses": {
                    "value": "1. As mentioned in Section 7, the theoretical result only covers limited neural network architecture, i.e., fully connected layers.\n2. This work is a theory-intensive paper, however, experiments can be improved further.\n    - For example, the authors can run more experiments on artificial data to reduce the heavy computation of diagonalization and then validate the theory more thoroughly.\n    - DeepFool algorithm is an old attack algorithm and cannot represent all the existing attacks (that are likely to be more powerful than DeepFool). The authors should perform similar experiments with other attack methods."
                },
                "questions": {
                    "value": "1. I cannot understand the reason for the assumption on the layer widths, i.e., all layers except the last layer have the same width $N$, because the proof mainly uses the empirical feature map that does not involve the intermediate layer output. Is this assumption necessary for the theorem? If so, how do you justify the assumption on the layer width?\n2. Minor comments\n    - According to the [formatting instruction](https://github.com/ICLR/Master-Template/raw/master/iclr2024.zip), in-text citations (`\\citet`) and citations in parentheses (`\\citep`) should be used differently, but I see only in-text citations in the paper writing. Please fix the citation style.\n    - I don’t think that Figure 1 is the best way to show the eigenvalue distributions. Why do you waste space by having a y-axis ranging from 0 to 1?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "details_of_ethics_concerns": {
                    "value": "N/A"
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission5540/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698594396731,
            "cdate": 1698594396731,
            "tmdate": 1699636568875,
            "mdate": 1699636568875,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "pJKiyb5YeQ",
                "forum": "YmQyEdLIkU",
                "replyto": "vE8FFeDnNo",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5540/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5540/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Remark: As mentioned in Section 7, the theoretical result only covers limited neural network architecture, i.e., fully connected layers.\n\nAnswer: As pointed out in the response to Reviewer DyBR and as indicated also in Section 7, our results can be seamlessly extended to any architecture where the feature map exhibits Lipschitz continuity.\n\nRemark: DeepFool algorithm is an old attack algorithm and cannot represent all the existing attacks (that are likely to be more powerful than DeepFool). The authors should perform similar experiments with other attack methods.\n\nAnswer: As pointed out in Section 7, additional experiments would indeed be beneficial. Please note, however, that our theory is independent from the characteristics of the data as well as of the adversarial attack method. We chose DeepFool as a widely-known algorithm simply for illustrative purposes. The power of the attack method does not affect our theory: as long as one is able to find an adversarial example for the task at hand, it can be described by our framework.\n\nQuestion: I cannot understand the reason for the assumption on the layer widths, i.e., all layers except the last layer have the same width $N$, because the proof mainly uses the empirical feature map that does not involve the intermediate layer output. Is this assumption necessary for the theorem? If so, how do you justify the assumption on the layer width?\n\nAnswer: You are correct in noticing this unnecessary simplification, which was in place only to avoid\ncumbersome notation. As already mentioned, our theory applies to any neural architecture where the feature\nmap exhibits Lipschitz continuity."
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5540/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1699901820947,
                "cdate": 1699901820947,
                "tmdate": 1699901820947,
                "mdate": 1699901820947,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "sXMRhwatr0",
            "forum": "YmQyEdLIkU",
            "replyto": "YmQyEdLIkU",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission5540/Reviewer_74hn"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission5540/Reviewer_74hn"
            ],
            "content": {
                "summary": {
                    "value": "The paper proposes a possible explanation for the existence of adversarial examples which allows for the emergence of the property that adversarial examples are hard to find (or does not occur naturally in test time).\n\nAs for existence, the paper proposes that an adversarial example is a point $x'$ in an $\\epsilon$-neighborhood of a natural sample $x^*$ for which the squared error $(y(x^*)-y(x'))^2$ diverges as $\\epsilon\\to 0$. The paper then proves that, for this definition of an adversarial example, the eigenvalues of the eigenfunctions of the Mercer's kernel vanish. Equivalently, $\\lim_{t\\to0}\\int_t^\\infty\\frac{1}{\\lambda^2}\\mathrm{d}\\mu(\\lambda)=\\infty$. Next, the previous theorem is utilized to show that the measure of adversarial examples vanishes as $\\epsilon\\to0$.\n\nGiven the computational constraints, the predictions of the theorems are verified empirically by considering a binary classification of 0 and 1 digits in the MNIST dataset."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "### Originality:\nEven though some aspects of the proposal appear in the literature, the paper adds an original perspective on the existence of adversarial examples from the point of view of kernels.\n\n### Quality:\nThe paper is exceptionally well-written. The assumptions and definitions are formally expressed, and claims of the paper is presented in concise steps and a rigorous manner.\n\n### Clarity:\nThe paper is clear in its goals and provides enough background for the average reader to understand the logic behind the claims.\n\n### Significance:\nThe proposed theorems could prove to be consequential in interpretation and mitigation of adversarial examples phenomenon."
                },
                "weaknesses": {
                    "value": "### Minor:\n- The axis of the figures does not bear any labels, and the captions are also a little encrypted.\n\n- The low-probability pockets perspective is credited to Goodfellow in the abstract, which is wrong. The main text however correctly credits Szegedy.\n\n### Major:\n- My main objection with the presented argument is that I am not sold on the definition of an adversarial example in the paper. Specifically, I think that the limiting process of $\\epsilon\\to0$ in the definition is flawed. This limiting process effectively adds two equal samples to the training set with two different targets. I am under the impression that the vanishing of the eigenvalues is a consequence of this construction ($K(X,X)$ wouldn't be invertible) and is not associated with the robustness of the network.\n\n- Assuming that my understanding of the limiting process is correct, the paper has rediscovered the robustness-accuracy trade-off as depicted in [A] (this is not a critique exactly). Zhang et al. in [A] propose that adversarial examples and natural samples overlap in the input space and that is why we observe a trade-off between robustness and accuracy in adversarial training. I think the paper should at the very least mention [A]. An alternative to the proposal of Zhang et al. that might be relevant is [B].\n\n[A]: https://proceedings.mlr.press/v97/zhang19p.html\n[B]: https://arxiv.org/abs/2309.17048"
                },
                "questions": {
                    "value": "- The limiting process that constructs $\\int_t^\\infty\\frac{1}{\\lambda^2}\\mathrm{d}\\mu(\\lambda)$ appear to be a Riemannian sum. However, I am curious to know if $M\\to\\infty$ is the same as asserting that the size of the training set approaches infinity."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission5540/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698704716867,
            "cdate": 1698704716867,
            "tmdate": 1699636568765,
            "mdate": 1699636568765,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "MLhzUbWCgO",
                "forum": "YmQyEdLIkU",
                "replyto": "sXMRhwatr0",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5540/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5540/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Remark: The limiting process of $\\epsilon \\to 0$ in the definition of an adversarial example seems flawed.\n\nAnswer: Please check our general remark to all reviewers and the corresponding modifications in the paper. Do not hesitate to ask should these modifications not adequately address your comments.\n\nRemark: Assuming that my understanding of the limiting process is correct, the paper has rediscovered the robustness-accuracy trade-off as depicted in A (this is not a critique exactly). Zhang et al. in A propose that adversarial examples and natural samples overlap in the input space and that is why we observe a trade-off between robustness and accuracy in adversarial training. I think the paper should at the very least mention A. An alternative to the proposal of Zhang et al. that might be relevant is B.\n\nAnswer: Thank you for pointing out these references. These potential connections are indeed interesting and worth exploring. Please note, however, that the focus of our work differs from that by Zhang et al., as we give a mathematical justification as to  why adversarial examples are rarely sampled by chance in practice, even if they \"overlap with natural samples\".\n\nQuestion: The limiting process that constructs $\\int_t^\\infty \\frac{1}{\\lambda^2} \\mathrm{d} \\mu (\\lambda)$ appear to be a Riemannian sum. However, I am curious to know if $M \\to \\infty$ is the same as asserting that the size of the training set approaches infinity.\n\nAnswer: Here, $M \\to \\infty$ refers to the infinite sum in the Mercer's decomposition theorem. This infinite sum is well-defined regardless of the size of the dataset."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5540/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1699901797830,
                "cdate": 1699901797830,
                "tmdate": 1699901797830,
                "mdate": 1699901797830,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "Xb04GW8m4f",
                "forum": "YmQyEdLIkU",
                "replyto": "MLhzUbWCgO",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5540/Reviewer_74hn"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5540/Reviewer_74hn"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for the response, but I do not find the general remarks very relevant to my question. Similar to other reviewers, I think that the papers perspective is promising. However I am under the impression that the assumptions in the proof theorem 1 are not warranted, and need some better argumentation, specially regarding infinities.\n\nIn the proof of theorem 1, the paper assumes that $(\\Phi(X)\\Phi(X)^T)^{-1}$ is bounded, but my understanding is that the assumption of $\\epsilon\\to0$ and $(y-N(x'))^2\\to\\infty$ is the same as assuming $\\Phi(x'\\cup X)\\Phi(x'\\cup X)^T$ is not invertible (because there is some $x$ in the dataset that has been added to the set twice, but with different targets). Consequently, generalization error is not the source of the error that is being analyzed in the paper."
                    }
                },
                "number": 8,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5540/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700665018950,
                "cdate": 1700665018950,
                "tmdate": 1700665018950,
                "mdate": 1700665018950,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "m66DA4IBT5",
            "forum": "YmQyEdLIkU",
            "replyto": "YmQyEdLIkU",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission5540/Reviewer_vXdv"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission5540/Reviewer_vXdv"
            ],
            "content": {
                "summary": {
                    "value": "The paper studies adversarial examples in the context of deep supervised learning and aims to show that adversarial examples are of low probability. The paper introduces a kernel-based framework to analyze adversarial examples, connecting adversarial examples to minor Mercer’s eigenvalues in the empirical kernel matrix of the neural net. Based on a definition of adversarial examples in section 2, the paper proves Theorem 1 showing that when the attack radius $\\epsilon$ is approaching $0$ the existence of an adversarial example means the density function of the kernel eigenvalues divided by $\\lambda^2$ is not integrable and uses this result to show in the limit case $\\epsilon\\rightarrow 0$ the adversarial examples have zero probability. Some numerical results on MNIST data and DeepFool attacks are presented in the paper."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "1 poor"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1- The paper applies a kernel-based framework to analyze adversarial examples which I find interesting. I appreciate the authors' idea of connecting the Mercer eigenvalues to adversarial examples."
                },
                "weaknesses": {
                    "value": "1- The paper's presentation should be improved. The theory sections are abstract and hard to follow in their current form. I think this is because the authors present the results in the most general and abstract way possible and also include the theorem proofs in the text, which makes the paper difficult to read for an average machine learning researcher. I suggest the authors postpone the proofs to an appendix and discuss some corollaries and examples of the theorems for some basic kernel functions. \n\n2- Theorem 1 is an asymptotic result and holds when the attack radius $\\epsilon\\rightarrow 0$. I think this could limit the implications of the theorem. Also, it seems that in Theorem 1 the bound on $\\epsilon$ in the limit statement depends on the choice of adversarial example $x'$ which means the asymptotic guarantee would not uniformly hold for all $\\epsilon\\le \\epsilon_0$ with $\\epsilon_0$ being independent of adversarial example $x'$.\n\n3- The definitions and notations in sections 2 and 3 are in some cases vague and raise questions: a) In the definition of adversarial examples, what is function $f(\\epsilon)$? The definition does not specify function $f$ and only states the condition $\\lim_{\\epsilon\\rightarrow 0}f(\\epsilon) = \\infty$, which would be problematic because for a fixed $\\epsilon >0$  we can always find a function $f$ for observed data that makes the definition hold for a perturbed $x'$. Also, in the proofs of Theorem 1,2 do the authors determine the function $f$ based on the dataset $X, y$ or is the choice of $f$ independent of $X,y$? \n\nb) In Theorem 1, what is the definition of $P_{X'}$ (with the prime)? Is it the delta function on $x'$ or a continuous density function related to data distribution $P_X$? \n\nc) I wonder what the authors precisely mean when they say \"In the limit $\\epsilon\\rightarrow 0$, .... \" in Theorems 1,2. Does that mean there is an $\\epsilon_0 >0$ independent of the choice of $x'$ such that the statement holds for every $\\epsilon\\le \\epsilon_0$? (clarification on  weakness 2)\n\nd) As another question, what is the precise mathematical definition of \"such that $|| x- x'||\\le \\epsilon$ for some example $(x^*,y)\\sim p$\"? If $p$ is a continuous distribution, then every point in $p$'s sample space has zero probability so whether $(x^*,y)$ is in the support set of $p$ or not does not change its zero likelihood to be sampled from $p$. The theorem should explain this sentence."
                },
                "questions": {
                    "value": "Please see the questions in the previous part."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission5540/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699175527345,
            "cdate": 1699175527345,
            "tmdate": 1699636568665,
            "mdate": 1699636568665,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "OZY0ID4KWX",
                "forum": "YmQyEdLIkU",
                "replyto": "m66DA4IBT5",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5540/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5540/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Remark: \nIt seems that in Theorem 1 the bound on $\\epsilon$ in the limit statement depends on the choice of adversarial example $\\mathbf{x}'$ which means the asymptotic guarantee would not uniformly hold for all $\\epsilon \\leq \\epsilon_0$ with $\\epsilon_0$ being independent of adversarial example.\n\nAnswer: \nIn Theorem 1, the possible adversarial examples $x'$ depend on the choice of $\\epsilon$, not the other way around. Hence the asymptotic guarantee does hold uniformly for all $\\epsilon \\leq \\epsilon_0$ with $\\epsilon_0$ independent of the adversarial example.\n\n\nQuestions: a) In the definition of adversarial examples, what is function $f (\\epsilon)$? The definition does not specify function $f$ and only states the condition $\\lim_{\\epsilon \\to 0} f (\\epsilon) = \\infty$, which would be problematic because for a fixed $\\epsilon >0$ we can always find a function $f$ for observed data that makes the definition hold for a perturbed $\\mathbf{x}'$. Also, in the proofs of Theorem 1,2 do the authors determine the function $f$ based on the dataset $\\mathbf{X}, \\mathbf{y}$ or is the choice of $f$ independent of $\\mathbf{X}, \\mathbf{y}$?\n\nAnswer:  Please check our general remark to all reviewers and the corresponding modifications in the paper. Do not hesitate to ask should these modifications not adequately address your comments.\n\n\n\nQuestion: In Theorem 1, what is the definition of $p_{\\mathbf{X}'}$ (with the prime)? Is it the delta function on $\\mathbf{x}'$ or a continuous density function related to data distribution $p_{\\mathbf{X}'}$?\n\nAnswer: The definition of \\emph{empirical probability distribution} for a dataset is provided in Section 2 at the end of the paragraph on empirical feature maps; it is essentially a summation of Dirac deltas. It's important to note that this definition is generic, and applicable to any design matrix (in particular to $\\mathbf{X}')$. The notation $\\mathbf{X}' = \\mathbf{X} : \\mathbf{x}'$ represents the concatenation of matrix $\\mathbf{X}$ and vector $\\mathbf{x}'$, as described also in Section 2.\n\n\nQuestion: I wonder what the authors precisely mean when they say \"In the limit $\\epsilon \\to 0$, .... \" in Theorems 1,2. Does that mean there is an $\\epsilon_0 > 0$ independent of the choice of $\\mathbf{x}'$ such that the statement holds for every $\\epsilon \\leq \\epsilon_0$? \n\nAnswer: It implies the existence of an $\\epsilon_0$ such that the statement holds for all $0 <\\epsilon \\leq \\epsilon_0$. The possible choices for $\\mathbf{x}'$ depend on $\\epsilon$, but not the other way around.\n\nQuestion: What is the mathematical definition of \"such that $|| \\mathbf{x}^* - \\mathbf{x}' || \\leq \\epsilon$ for some example $(\\mathbf{x}^*, y^*) \\sim p$.\n\"? If $p$ is a continuous distribution, then every point in $p$'s sample space has zero probability so whether $(\\mathbf{x}^*, y^*)$ is in the support set of $p$ or not does not change its zero likelihood to be sampled from $p$.\n\nAnswer: Each individual point has probability zero but not a zero \\emph{probability density}.\n For instance, in a Gaussian density, each real number has a probability of zero when sampled as a specific event; however, it's essential to note that each real number does have a non-zero probability density.\nThe statement\n$(\\mathbf{x}^*, y^*) \\sim p$ \nsimply means that point $(\\mathbf{x}^*, y^*)$ is sampled according to the same joint probability density $p$ as that of the training data."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5540/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1699901672468,
                "cdate": 1699901672468,
                "tmdate": 1699901672468,
                "mdate": 1699901672468,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "uRmmH7vkME",
            "forum": "YmQyEdLIkU",
            "replyto": "YmQyEdLIkU",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission5540/Reviewer_DyBR"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission5540/Reviewer_DyBR"
            ],
            "content": {
                "summary": {
                    "value": "This paper studies a novel interpretations of adversarial attacks as points that induce near zero Mercer eigenvalues in the kernel formed via the inner product of empirical feature maps (i.e. the activations at the penultimate network layer). The authors show under strong assumptions of locality that the set of adversarial examples is measure zero under the training data distribution, explaining why such points are practically never observed in the natural world. Preliminary experiments support the theoretical claims.\n\nThis reviewer was admittedly unable to check the details of the proofs to ensure correctness."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "This paper proposes a new mathematical explanation for the existence of adversarial examples through the application of kernel methods. Most hypotheses to date about this phenomena have lacked formal proofs. A successful mathematical model for adversarial examples could have significant impact by informing techniques to improve adversarial robustness.\n\nThe paper explains that neural networks generalize in the real world because the set of adversarial examples is measure zero. This proof supports a decade-old conjecture by Goodfellow et al.\n\nThe paper does an excellent job framing the challenge and decade-long history of adversarial examples. Notation is nicely defined, consistent, and clear throughout the paper."
                },
                "weaknesses": {
                    "value": "The paper is narrow in scope and parts of the paper appear to be hastily written. It is unclear whether the contribution is complete enough to justify a top-tier publication. In particular, the fact that the paper limits its consideration to adversarial points that are infinitesimally close to data points is probably unrealistic.\n\nThe definition of adversarial examples appears a bit different than the usual definitions, relying on a local limiting assumption. Some work needs to be done to explain the relationship between this paper’s definition and the working definition used of the broader community.\n\nThe figures are poorly presented, and captions could be clarified.\n\nThe paper says “Our results, however, are currently only directly applicable to FCNs and regression tasks. Nevertheless, we anticipate that the core insights from our research could be extended to encompass classification tasks as well as other neural architectures; this is a clear path for future research.” It is not clear in the experiments that the authors are training regression tasks on MNIST, if this is the case, this needs to be clarified in the paper.\n\nSmall issues:\n* Please check for style, e.g. correct use of \\citet and \\citep.\n* At the end of Section 1, the authors say they “estimated the integral of relevant quantities near zero.” Please make this more specific to outline contributions up front.\n* Space before comma 2nd line from the bottom on page 1.\n* At the end of Section 6, add a citation for the claim “Researchers have demonstrated that a technique involving the iterative elimination of the dominant eigenvalue direction in the Fisher Information Matrix leads to the generation of adversarial examples.”"
                },
                "questions": {
                    "value": "1. Are there geometric interpretations that your theory provides?\n2. Are the authors proposing that this method could serve to identify adversarial examples? If so, is there any contention with [1]?\n3. The notation $(x^*, y^*) \\sim p$ is strange from a probabilistic perspective. Isn’t there some probability mass on any point $x^*$? It also appears you are assuming no label noise (i.e. the labeling function $y(x)$ is deterministic).\n4. Is it really necessary to limit this paper to the consideration of fully-connected layers, or is a Lipschitz assumption sufficient?\n\n[1] Tramer, Florian. “Detecting adversarial examples is (nearly) as hard as classifying them.\" In International Conference on Machine Learning. 2022."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission5540/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission5540/Reviewer_DyBR",
                        "ICLR.cc/2024/Conference/Submission5540/Senior_Area_Chairs"
                    ]
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission5540/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699425769260,
            "cdate": 1699425769260,
            "tmdate": 1700451204647,
            "mdate": 1700451204647,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "luoSyWH8iP",
                "forum": "YmQyEdLIkU",
                "replyto": "uRmmH7vkME",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5540/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5540/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Remark: The definition of adversarial examples appears a bit different than the usual definitions, relying on a local limiting assumption. Some work needs to be done to explain the relationship between this paper’s definition and the working definition used of the broader community.\n\nAnswer:  Please check our general remark to all reviewers and the corresponding modifications in the paper. Do not hesitate to ask should these modifications not adequately address your comments.\n\nQuestion: Are there geometric interpretations that your theory provides?\n\nAnswer: We briefly mentioned the geometric interpretation of our results in Section 6, paragraph 4. We indicated the relationship between the shift towards zero eigenvalues and the shift in the input feature space towards the direction of non-robust features.\nThe latter is a common observation in the literature on adversarial attacks.\n\nQuestion: Are the authors proposing that this method could serve to identify adversarial examples? If so, is there any contention with [1]?\n\nAnswer: In their current form, our results may not be directly applicable for detecting adversarial examples in practical settings. Theorem 1 relies on an abstract test example that the neural network generalizes well to, and such examples are not always accessible in real-world scenarios. \n\nQuestion: The notation $(x^* , y^*) \\sim p$  is strange from a probabilistic perspective. Isn’t there some probability mass on any point $(x^* , y^*)$? It also appears you are assuming no label noise (i.e. the labeling function $y(x)$ is deterministic).\n\nAnswer: This notation indicates that $(x^*, y^*)$ is a data point sampled from the same distribution as the training data, with joint probability density $p$. \nAs stated by the reviewer, any point $(x^*, y^*)$ \nholds a probability mass, and it's precisely with respect to that probability measure that we showed the measure-zero property of adversarial examples.\nSince $p (x^*, y^*) $denotes a joint probability density, noise can be easily incorporated in its definition.\n\nQuestion: Is it really necessary to limit this paper to the consideration of fully-connected layers, or is a Lipschitz assumption sufficient?\n\nAnswer: Your observation is accurate. As pointed out in the second paragraph of Section 7, our results can be easily  extended to encompass other architectures verifying Lipschitz continuity."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5540/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1699901319532,
                "cdate": 1699901319532,
                "tmdate": 1699901319532,
                "mdate": 1699901319532,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "hNTAyFLEK5",
                "forum": "YmQyEdLIkU",
                "replyto": "luoSyWH8iP",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission5540/Reviewer_DyBR"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission5540/Reviewer_DyBR"
                ],
                "content": {
                    "title": {
                        "value": "Thank you for modifying the paper, slightly raising my score"
                    },
                    "comment": {
                        "value": "I appreciate the authors' detailed rebuttal, and especially appreciate the edits made in the paper to clarify the definition of adversarial examples. On the negative side, I tend to agree with Reviewer YsYz that the experiments are currently a bare minimum. On the positive side, the paper introduces a nice framework in which to analyze adversarial examples (through the lens of the empirical kernel).\n\nI am willing to slightly raise my score, and encourage the authors to continue to refine the draft if the paper is not accepted."
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission5540/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700451177860,
                "cdate": 1700451177860,
                "tmdate": 1700451177860,
                "mdate": 1700451177860,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]