[
    {
        "title": "Comparative Knowledge Distillation"
    },
    {
        "review": {
            "id": "BLVWd8nq2i",
            "forum": "z282NEQDbF",
            "replyto": "z282NEQDbF",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4224/Reviewer_fQMq"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4224/Reviewer_fQMq"
            ],
            "content": {
                "summary": {
                    "value": "This paper presents Comparative Knowledge Distillation (CKD), a method to perform knowledge distillation through comparisons in the setting of a limited number of teacher inference calls. The core idea is to formulate a k-wise distillation loss that compares the teacher and student representations of k different data points via self-similarity. The claim is that by having $k$-wise distillation loss function, the student can have exponentially more $\\mathcal O(n^k)$ comparisons to learn from."
                },
                "soundness": {
                    "value": "1 poor"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "* Improving knowledge distillation in the setting of a constrained number of teacher calls is well-motivated.\n* The idea to obtain more information from a limited number of points through k-wise comparisons is interesting."
                },
                "weaknesses": {
                    "value": "* The paper lacks clarity in key parts of the presentation. For example, the method itself is not clear: for $k=2$ in the stochastic optimization setting, are the pairwise comparisons done on a per-batch setting? \n* The method is not well-motivated or explained in context of prior works in Relational Knowledge Distillation. The loss here is KL divergence between $\\mathrm{softmax}(\\hat z_i - \\hat z_j)$ and $\\mathrm{softmax}(z_i - z_j)$, and the subtraction is motivated in Sec. 5.3. But, why does taking the KL divergence of the softmaxed difference of logits even make sense here? Why does, for instance, the squared difference between the normed differences, e.g., $$\\left(\\frac{||\\hat z_i - \\hat z_j||}{||\\hat z_i|| ||\\hat z_j||} - \\frac{||z_i - z_j||}{|| z_i ||||z_j||}\\right)^2$$ not make sense? How is the proposed approach novel and better than prior metrics used in relational KD?\n* My biggest qualm is that the entirety of the work is supported only by evaluations on CIFAR100, and no other datasets. Favorable evaluations on other data sets such as ImageNet and other tasks, such as language, would significantly improve the paper. As it stands, the claims of the paper rest solely on CIFAR100."
                },
                "questions": {
                    "value": "1. How does this method fare on other datasets besides CIFAR100, such as ImageNet? What about beyond vision tasks?\n2. What is the justification for the softmax nonlinearity and KL divergence as a comparator metric? How does it compare with other ways to measure differences between the logits?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4224/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698772251913,
            "cdate": 1698772251913,
            "tmdate": 1699636389440,
            "mdate": 1699636389440,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "m7DtXSburs",
            "forum": "z282NEQDbF",
            "replyto": "z282NEQDbF",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4224/Reviewer_xswU"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4224/Reviewer_xswU"
            ],
            "content": {
                "summary": {
                    "value": "The authors propose a relation-based KD loss, CKD, that is efficient and performs well with minimal teacher calls (the few-teacher inference KD setting). CKD achieves this by minimizing the difference between the student and teacher's high-dimensional representation.\n\nThe authors demonstrate that their method CKD consistently outperforms other KD methods in the minimum teacher call regime using a simple centroid function including in the white-box setting. The authors similarly mention that the difference between representations is more effective than addition or interpolation."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "The empirical results reported by CKD are impressive in the few-teacher inference setting considering how straightforward the loss formulation is. I found that the manuscript is well-written and does a good job of explaining the CKD method. This paper provides further evidence that KD approaches that mimic teacher outputs are not an effective distillation method, and supports relation-based/contrastive KD efforts for distillation.\n\nI similarly find this idea of few-teacher-inference knowledge distillation an interesting direction of research, and it is a nice contribution to have coined this term in the paper. Overall, the paper was interesting to read and naturally raised interesting clarification and next-step questions."
                },
                "weaknesses": {
                    "value": "My biggest concern is that this work is eerily similar to the relational knowledge distillation work (Park et al., 2019) barring the high-dimensional KD loss in CKD. I can appreciate that having a higher-dimensional loss formulation might be effective in tightly capturing relationships between two samples as compared to a single number as is the case in [1], however, I would have expected there to be further analysis on why this single differentiating factor elicits such a big change in empirical performance. I feel that there should be more emphasis on this aspect, and I find that Section 5.3 with the comparison function hints towards this direction, if you had to employ the same comparison function employed by [1], you should retrieve RKD in its complete form.\n\nTo address these concerns, I would encourage the authors to offer some justifications in the paper as to why a higher dimensional comparison between groups of samples is that effective in FTI-KD.\n\nMinor concerns:\n\n- Could the authors provide results that are averaged by more than three trials? Could you do more than 10 trials? Especially in Figure 2.\n\n- In Table 1, I assume the value and the subscript represent the mean and the variance. Could this be made clear in the caption?\n\n- In Figure 3, could you plot the x-axis beyond k>4 to get a better idea of the trend? Could you also average this over more than 3 trials?\n\n[1] Park, W., Kim, D., Lu, Y. and Cho, M., 2019. Relational knowledge distillation. In Proceedings of the IEEE/CVF conference on computer vision and pattern recognition (pp. 3967-3976)."
                },
                "questions": {
                    "value": "Clarification questions:\n\n- It's not entirely clear to me why teacher inference would be computationally or economically expensive. Inference in general is cheap, and fast. In comparison to jointly training a teacher and student model, having access to a teacher's inference is already a substantial improvement in computational resource time.  Could you provide more clarity on this?\n\n- How do you select the samples for each group to compute the centroid, are samples randomly selected or there is a method that is employed? \n\n- In Table 2, is there a reason why other methods beyond CKD were omitted in the white-box analysis?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4224/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698899820196,
            "cdate": 1698899820196,
            "tmdate": 1699636389371,
            "mdate": 1699636389371,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "HyZYapssL0",
            "forum": "z282NEQDbF",
            "replyto": "z282NEQDbF",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4224/Reviewer_P6qh"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4224/Reviewer_P6qh"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes Comparative Knowledge Distillation (CKD) which is a simple and easy-to-understand method for knowledge transfer. CKD simply makes the student learn the logic difference from the teacher. Experiments show promising results under special settings."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. This paper is well-organized and clearly written.\n2. Comparison with different methods are reported."
                },
                "weaknesses": {
                    "value": "1. Some statements are over-claimed in this paper. For example, it claims \"a novel learning paradigm ...  mimic the teacher’s difference in representation between the same samples.\" Actually, it is just the relation-based knowledge distillation which distills the relations between samples from the teacher. It looks me that this learning paradigm is not novel.\n2. Experiments are conducted in special settings where the baselines are pretty low, e.g., CRD has the performance of 29.37 on CIFAR with the given setting. The experiments are expected to conduct in normal settings for fair and convincing comparison. Currently, the experimental results are not convincing to me."
                },
                "questions": {
                    "value": "1. What is the difference between the proposed framework from the existing relation-based knowledge distillation?\n2. Why not compare the proposed method with the baselines in normal settings where they are well-benchmarked?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4224/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698941315849,
            "cdate": 1698941315849,
            "tmdate": 1699636389288,
            "mdate": 1699636389288,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "QFyAKHns5A",
            "forum": "z282NEQDbF",
            "replyto": "z282NEQDbF",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4224/Reviewer_WFsY"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4224/Reviewer_WFsY"
            ],
            "content": {
                "summary": {
                    "value": "The paper proposes a new method for knowledge distillation: instead of the student trying to mimic the direct output of the teacher, it mimics the difference between two samples (the student's difference should match the teacher's difference). The authors claim that their method is better suited in resource constrained situations where one can only get teacher's outputs a few times. They compare their proposed method (CKD) to different baselines and show improved results on CIFAR100 dataset."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "2 fair"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "1. The method proposed is simple, efficient and is shown to perform better than the baselines on the few-shot scenarios by a good margin (Table 1/2).\n\n2. The authors have done a nice analysis experiment to investigate the learnt representations by the student, showing that the correlations between the student's outputs is very similar to that of the teacher's outputs, even though this was never explicitly part of the objective. (Table 4)"
                },
                "weaknesses": {
                    "value": "1. The authors have motivated the Few-Teacher-Inference (FTI) setting and have proposed a method for that setting. However, there is no explanation for why the proposed distillation objective is better suited for it compared to the other baselines. This is especially relevant because there have been works which have tried to distill the *relationship* between the samples; beyond RKD, which the paper has cited and compared, there are also [1, 2, 3] (I am not asking the authors to compare to these). Given that these works are similar in spirit, what is different about the particular objective, beyond its empirical effectiveness?\n\n2. Continuing along the previous point, it is not clear why this method is relevant for few-shot settings specifically. What happens if you use this objective for the typical KD setting (same as Tian et al.) where you do have all the samples from the training set? That is, performing distillation using CKD on all the training examples. Does it still perform better than the baselines?\n\n3. I think there is a slight confusion in what the authors are providing as the motivation for Few-Teacher-Inference vs their actual experimental setup. Limited teacher call means that you only want to get teacher's responses on few-images. But the student can still be trained on the remaining examples with ground-truth (one-hot) labels. However, the experimental setup seems to be dealing with *few-shot* training scenario, in which you only have access to few training images. The authors should clarify this and present results according to their motivation in the beginning. For example, a sample experimental setup will look something like this: typical KD setup  = distilling on 50,000 images. Few-Teacher-Inference setup = distilling on 2000 images, **normal training** (L_CE; Eq. 4) on the remaining 48,000 images.\n\n4. Across the paper, as mentioned above, the explanation for many choices are not clear. For example, in Sec 5.3, the explanation for why difference, as opposed to interpolation (or other variant) of two output vectors performs better is not clear (Page 8; Table 3). Overall, it is difficult for a reader to get a comprehensive understanding for why things are working. As a sample question which is left unexplored - the objective makes the student mimic the difference. However, multiple outputs could have had the same difference; i.e., there is a loss of information. Yet, this loss does not hinder student's performance (and increases it). Why should it be this way?\n\n5. Even beyond this, I do not think the very specific problem is practically useful. It will be useful in case you want to use Few-Teacher-Inference (FTI) to match the performance of teacher inference on all the samples. That is, the knowledge that you inherit from the teacher using CKD is the similar whether you use 1000 teacher inferences or 10,000 teacher inferences. \n\n\nReferences\n\n[1] Knowledge Distillation via Instance Relationship Graph. Liu et al. CVPR 2019.\n\n[2] Similarity-Preserving Knowledge Distillation. Tung et al. arXiv 2019.\n\n[3] Correlation Congruence for Knowledge Distillation. Peng et al. arXiv 2019"
                },
                "questions": {
                    "value": "Comments:\n\n1. Typo: may prove may provide (page 3 top paragraph).\n\n2. The authors have cited some works from the field of psychology as the source of their motivation. While it is fine to refer to works from other fields, one should cite them only when there is something substantive to talk about. Right now, the section talking about those works (Section 1, paragraph 3) seems to have not much context/relevance to the particular problem that the authors are solving."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4224/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698972033990,
            "cdate": 1698972033990,
            "tmdate": 1699636389227,
            "mdate": 1699636389227,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    }
]