[
    {
        "title": "CAMMARL: Conformal Action Modeling in Multi Agent Reinforcement Learning"
    },
    {
        "review": {
            "id": "fm9cyt9jnz",
            "forum": "ZiHI6raor0",
            "replyto": "ZiHI6raor0",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7771/Reviewer_ECyq"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7771/Reviewer_ECyq"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes a multi-agent reinforcement learning (MARL) algorithm CAMMARL, where each agent's policy is not only conditional on its own observation, but also on the estimate of other agents actions. Specifically, it uses conformal predictions to learn confident sets containing other agents' probable action estimates. CAMMARL consider two agents setting and is tested on two MARL tasks, cooperative navigation and level-based foraging."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "- The paper is well-motivated. Modeling other agent's actions is intuitively helpful for learning a good policy.\n- There are some relevant  statistical analysis over how CAMMARL works, such as the averaged set sizes outputted by the conformal predictor. \n- A range of related baselines are considered."
                },
                "weaknesses": {
                    "value": "- The predicted conformal sets is exponentially growing with respect to $|\\mathcal{A_{other}}|$, which may not be scalable when $|\\mathcal{A_{other}}|$ is large.\n- The paper is restricted to the two agents setting. It is not clear if the proposed method can generalize to more complex tasks with potentially many agents.\n- The experiment results are preliminary in only two tasks. Further, the improvement over the baselines is not obvious, especially in CN in Figure 4."
                },
                "questions": {
                    "value": "- Can CAMMARL work in settings with more than two agents? If so, it is beneficial to show its effectiveness in some more complex MARL benchmarks with more agents.\n- Does $\\mathcal{N_{other}}$'s action also condition on $\\mathcal{N_{self}}$'s action?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission7771/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission7771/Reviewer_ECyq",
                        "ICLR.cc/2024/Conference/Submission7771/Senior_Area_Chairs"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7771/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698094071877,
            "cdate": 1698094071877,
            "tmdate": 1700709701562,
            "mdate": 1700709701562,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "46UaQBAdOp",
                "forum": "ZiHI6raor0",
                "replyto": "fm9cyt9jnz",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7771/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7771/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for the insightful comments and suggestions. We have addressed your concerns below.\n\n1. **Scalability**: Even with a small number of agents, MARL can be quite challenging to solve. Our main goal in this paper was to develop a framework for conformal action prediction for MARL. For every agent, the conformal set would grow by $|A_{other}|$. However, we can also use a common last layer for all the conformal prediction models and append that layer to the input states. That way, we can incorporate multiple agents seamlessly. Generally, even in a setting of many agents, for instance, 100 or 1000, one could also prefer modeling only a local set of agents instead of all of them, hence reducing the complexity of the scalability problem. Nonetheless, these ideas require a modified/upgraded design to be investigated and would be an interesting follow-up work.\n\n2. **Performance with respect to Baselines**: While we do agree that the performance improvement is not quite significant in CN, for LBF it is quite significant especially when considering the baselines, which have more full information about the actions of the other agents before taking any decisions. However, note that for CN, the baseline that CAMMARL majorly overlaps with EAP is actually CAMMARL with set size=1. Since action prediction is quite simple in CN, conformal predictions are not much better as in environments like LBF. GIAM is clairvoyant in that it has access to all the information, so comparing it against CAMMARL is unfair, and is meant as an upper bound on performance. In comparison to the other baselines, CAMMARL does better even in CN.\n\n3. **Multi Agents**: CAMMARL as an idea is not restrictive to two agents, and can be easily adapted to incorporate multiple agents. \nResults in mixed settings and more than 2 agents: We also show results in the non-cooperative Level Based Foraging Setting for 2 agents with 6 food locations in Section D.1 of the Appendix in the revised version of the paper.\nFrom this section, we can see that the utility of CAMMARL is not just restricted to cooperative settings, but it can be easily applied to a multitude of MARL problems.\nWe also show results on Pressure Plate with 4 agents which is a new environment described in Appendix Section A of the revised version. In Section D.2 of the revised paper, we show that CAMMARL converges 10% faster (in terms of the number of episodes) when compared with the other baselines in the domain. This definitely lends further credibility to conformal predictions, and additionally shows the adaptability of CAMMARL to other MARL domains with more agents.\n\n4. **Does N_other's action also condition on N_self's action?**:\nNo, it does not. The other agent has its own set of observations and actions and is not influenced by the actions of the main agent directly.\n\nGiven the limited compute resources, we believe that we could answer all your doubts and clarifications as much as possible. We would be grateful if you could consider increasing your score if you find our responses adequate."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7771/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700267095011,
                "cdate": 1700267095011,
                "tmdate": 1700267095011,
                "mdate": 1700267095011,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "YGbWbVPhpB",
                "forum": "ZiHI6raor0",
                "replyto": "46UaQBAdOp",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7771/Reviewer_ECyq"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7771/Reviewer_ECyq"
                ],
                "content": {
                    "title": {
                        "value": "Reply to rebuttal"
                    },
                    "comment": {
                        "value": "Thank you for your rebuttal. While some of my concerns are addressed, I still have some reservations.\n\n- The empirical results can be more convincing if CAMMARL is tested on some more complex MARL benchmarks such as [1] and [2]. There are some improvements in Appendix D.1, but the selected tasks are too simple.\n\n- If CAMMARL is not restricted to 2 agents setting, I suggest the authors to reframe section 3 with arbitrary number of agents.\n\n[1] The StarCraft Multi-Agent Challenge\n\n[2] Google Research Football: A Novel Reinforcement Learning Environment"
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7771/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700414952501,
                "cdate": 1700414952501,
                "tmdate": 1700414952501,
                "mdate": 1700414952501,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "05HJNppBAw",
                "forum": "ZiHI6raor0",
                "replyto": "PR5NKM8OpM",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7771/Reviewer_ECyq"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7771/Reviewer_ECyq"
                ],
                "content": {
                    "title": {
                        "value": "Reply to rebuttal"
                    },
                    "comment": {
                        "value": "Thank you for the update of the paper. I have raised the score."
                    }
                },
                "number": 15,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7771/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700709805688,
                "cdate": 1700709805688,
                "tmdate": 1700709805688,
                "mdate": 1700709805688,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "9BJbKiWSTa",
            "forum": "ZiHI6raor0",
            "replyto": "ZiHI6raor0",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7771/Reviewer_8c8j"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7771/Reviewer_8c8j"
            ],
            "content": {
                "summary": {
                    "value": "The paper proposes CAMMARL, a novel multi-agent reinforcement learning algorithm that uses conformal predictions to model the actions of other agents in the environment as sets that contain their true actions with high probability. The paper claims that these sets can inform the decision-making of an agent and improve its performance in cooperative tasks. The paper demonstrates the effectiveness of CAMMARL in two multi-agent domains and compares it with several baselines that use different types of information about other agents."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "The paper addresses an important and challenging problem of reasoning about other agents in partially observable environments. The paper introduces a novel way of using conformal predictions to model the uncertainty and confidence of other agents' actions. The paper presents extensive experiments on two challenging cooperative tasks and demonstrates that CAMMARL improves over various baselines in terms of returns, learning speed, set sizes, and coverage. The paper also discusses some limitations and future directions for extending CAMMARL to more complex scenarios. The paper is well-written, clear, and well-structured. The code is provided for reproduction."
                },
                "weaknesses": {
                    "value": "The paper has some limitations and possible areas for improvement.\n\n- The paper could provide more thorough discussions on experiment details. For example, the paper does not explain how the regularization term in the conformal prediction model is chosen or tuned, or how it affects the performance of CAMMARL. A more transparent and rigorous analysis of this aspect would enhance the credibility and generalizability of CAMMARL. Also, what are the differences of the settings between different baseline algorithms compared in the paper? Since they have different dimensions of input, maybe they also need slightly different training settings to achieve their own best performance.\n- The paper uses learning curves as the only evaluation metrics but does not provide any qualitative analysis or visualization of the learned policies or behaviors of CAMMARL agents, which would help to illustrate how they leverage conformal predictions to cooperate effectively.\n- The paper only considers fully cooperative settings and does not explore how CAMMARL would perform in competitive or mixed scenarios where other agents' intentions may not be aligned or predictable. Especially, in the competitive robust RL setting, the conformal set could potentially be used for worst-case analysis.\n- The paper does not discuss any potential drawbacks or challenges of using conformal predictions, such as computational costs, calibration issues, or sensitivity to hyperparameters."
                },
                "questions": {
                    "value": "- Intuitively, the idea of using conformal predictions to model the actions of other agents is to augment the agent’s state with the historical memory of other agents' behavior, which is similar to fictitious play in game theory. However, fictitious play only converges in some specific game settings, and MARL is known to be hard to converge in general settings. Moreover, the conformal predictions are based on previous observations but the other agent’s policy is also evolving. Is there any observation where the algorithm does not converge well or even has cycling behavior?\n- In the paragraph of Global-Information-Agent-Modeling (GIAM), the paper states that this can be infeasible in real-world scenarios. Why is that? Seems like the information used in this algorithm is the same as CAMMARL. The difference is that, the historical trajectories are used to first train a prediction model and then feed into the agent’s policy network, whereas in GIAM, it is directly used in the policy network in an end-to-end way.\n- How does CAMMARL handle different set sizes produced by the conformal model? How does it encode them into input features for policy learning? How does it affect the stability and convergence of policy learning?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission7771/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission7771/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission7771/Reviewer_8c8j"
                    ]
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7771/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698618889651,
            "cdate": 1698618889651,
            "tmdate": 1700681355095,
            "mdate": 1700681355095,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "mosVeDtRhW",
                "forum": "ZiHI6raor0",
                "replyto": "9BJbKiWSTa",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7771/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7771/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "We thank the reviewer for their detailed comments and suggestions for improving the paper. We address all the concerns below.\n\n1. **Regularization Term in Conformal Prediction**: We apologize for the lack of clarity in the explanation. Each time the conformal model is trained, we choose the lambda and k_reg parameters from a set that optimizes for small sizes of the action set. The k_reg values are dependent on the logits, however, the lambda values are in a set [0.001, 0.01, 0.1, 0.2, 0.5]. We have added a section in the Appendix explaining this. We apologize again, for the confusion and we have added this explanation in Section C of the Appendix in the revised version of the paper.\n\n2. **Hyper-parameters for the Baselines and CAMMARL**: Thank you for pointing this out. Yes, the hyper-parameters are different for the different baseline. We performed a moderate tabular search over the hyper-parameters and chose the best hyper-parameter to represent each of the individual baselines.\n\n3. **Visualization of Policies**: For all the environments, rewards provide a way to understand cooperation as well, as in all the domains, the rewards are designed to be higher for better cooperation. We show a learned policy by CAMMARL in Pressure Plate in Section D.3 of the Appendix of the revised version of the paper. We can see perfect cooperation among the 4 agents in the environment, with each agent staying behind to keep the gateway open.\n\n4. **Drawbacks and Sensitivity Issues**: The main drawback would be using an extra neural network for conformal action prediction, but this would be true for other methods that model actions from observations as well. \nLike any RL method, our method would also be sensitive to hyper-parameters, however, for the conformal regularization parameters, we sweep over every conformal model training step to find the optimal one for conformal sets. \nIn terms of calibration, we adopt the same procedure as in RAPS [1], and get a conformal calibration set from the data. The core conformal prediction algorithm is exactly the same as RAPS. We hope this clarifies your doubts.\n\n5. **Fictitious Play**: Thank you for pointing out this interesting comparison, and yes intuitively it is kind of similar to fictitious play. All the action modeling baselines include actions from the previous observations, and so they would be intuitively similar as well. However, the experiments we tested are all non-zero-sum games and we did not find any cycling behavior or non-convergent behavior in our experiments. \n\n6. **Clarification of GIAM and CAMMARL inputs**: We apologize for the confusion. GIAM is infeasible because it uses the real actions of the other agents as input for taking actions, whereas CAMMARL builds a model from replay data. GIAM is in a sense clairvoyant because before taking an action, it has access to the true actions of the other agents. So, GIAM is infeasible in real-world scenarios.\n\n7. **Different Set Sizes of Conformal Model**: In CAMMARL, the conformal prediction model is a separate MLP that learns (simultaneously with the RL agent) to output conformal prediction sets. However, these sets can be of varying sizes in different situations. So, we came up with numerous ways to be able to use them to implement CAMMARL. One of the ways is to pad the output set with zeros (or any other constant value) to bring them to the same fixed size (the total number of possible actions). Another way is to pick up the last layer of the conformal prediction model’s MLP as embeddings (hence always maintaining a fixed size) instead of sending the conformal set as input for the n_self agent. We provide some more details on this in Appendix B of the revised version with more experiments showing related results. \n\n[1] Anastasios Angelopoulos, Stephen Bates, Jitendra Malik, and Michael I Jordan. Uncertainty sets for image classifiers using conformal prediction.\narXiv preprint arXiv:2009.14193, 2020."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7771/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700266968916,
                "cdate": 1700266968916,
                "tmdate": 1700266968916,
                "mdate": 1700266968916,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "RVA8mdLfhc",
                "forum": "ZiHI6raor0",
                "replyto": "QqbZGsXjtZ",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7771/Reviewer_8c8j"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7771/Reviewer_8c8j"
                ],
                "content": {
                    "title": {
                        "value": "response to rebuttal"
                    },
                    "comment": {
                        "value": "The response addresses some of my concerns and given that the authors are adding them in the appendix, I will raise my score from 5 to 6."
                    }
                },
                "number": 10,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7771/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700681267845,
                "cdate": 1700681267845,
                "tmdate": 1700681267845,
                "mdate": 1700681267845,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "9dGGy5Z6iy",
            "forum": "ZiHI6raor0",
            "replyto": "ZiHI6raor0",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7771/Reviewer_Jmhr"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7771/Reviewer_Jmhr"
            ],
            "content": {
                "summary": {
                    "value": "The authors propose a multi-agent reinforcement learning algorithm that uses conformal prediction to explicitly reason about the behavior of other agents. To evaluate their proposed algorithm two experiments using cooperative simulated environments are conducted. The experiments show that CAMMARL outperforms alternative methods though is still short of a model with access to global information."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "* Applying conformal prediction to reason about agents in a MARL problem is a simple but straight-forward idea that doesn't suffer from the drawbacks of alternatives methods which require considerable more compute and data (e.g., inverse reinforcement learning).\n* The conformal approach not only supports reasoning about others but also provides confidence measures around its reasoning"
                },
                "weaknesses": {
                    "value": "* Beyond the idea of using conformal modelling for action prediction there does not appear to be large algorithmic advancements in solving the conformal problem in this setting\n* The simulated environments used in the experiments are quite simple \n* Algorithm 1 is difficult to follow. For example, there are many lines with multiple assignments and updates."
                },
                "questions": {
                    "value": "* What is $b_{conformal}$ in Algorithm 1?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "details_of_ethics_concerns": {
                    "value": "I have no concerns."
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission7771/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission7771/Reviewer_Jmhr",
                        "ICLR.cc/2024/Conference/Submission7771/Senior_Area_Chairs"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7771/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698802510875,
            "cdate": 1698802510875,
            "tmdate": 1700503363303,
            "mdate": 1700503363303,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "eGFgBvnYhm",
                "forum": "ZiHI6raor0",
                "replyto": "9dGGy5Z6iy",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7771/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7771/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for the thoughtful review. In our rebuttal, we have addressed your concerns sequentially.\n\n1. **Novelty**: While we added conformal modeling for action predictions, we explored different ways of incorporating them into the main RL algorithm. Since the conformal predictions can have different set sizes, we explored ways of incorporating them into the algorithm including using the embeddings of the model directly. Our main goal is to highlight that conformal predictions can be a really useful tool for agent modeling in MARL and can be more beneficial than just predicting the exact actions or their probabilities.\nSimple Envs: Multi-Agent Reinforcement Learning is in general not an easy problem to solve, and our environments are indeed difficult to solve based on the performance of NOAM in CN and LBF which does not do quite as well. \n\n2. **Results in mixed settings and more than 2 agents**: We also show results in the non-cooperative Level Based Foraging Setting for 2 agents with 6 food locations in Section D.1 of the Appendix in the revised version of the paper.\nFrom this section, we can see that the utility of CAMMARL is not just restricted to cooperative settings, but it can be easily applied to a multitude of MARL problems.\nWe also show results on Pressure Plate with 4 agents which is a new environment described in Appendix Section A of the revised version. In Section D.2 of the revised paper, we show that CAMMARL converges 10% faster (in terms of the number of episodes) when compared with the other baselines in the domain. This definitely lends further credibility to conformal predictions, and additionally shows the adaptability of CAMMARL to other MARL domains with more agents.\n\n3. **Algorithm 1**:  We apologize for the lack of clarity. We have made the changes in the revised version of the paper. \n\n4. **$b_{conformal}$**: $b_{conformal}$ is the replay buffer for the conformal model. It is the exact same as the replay buffer for $N_{other}$ ($b_{other}$) except the conformal model has a different update frequency than $b_{other}$.\n\nBecause of our limited compute resources, we tried to include as many new experiments as possible. We hope this rebuttal and the new experiments will clarify your doubts and answer your questions. We would be grateful if you could consider increasing your score if you find our responses satisfactory."
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7771/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700266801162,
                "cdate": 1700266801162,
                "tmdate": 1700266801162,
                "mdate": 1700266801162,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "RKUTKA7ub3",
                "forum": "ZiHI6raor0",
                "replyto": "eGFgBvnYhm",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7771/Reviewer_Jmhr"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7771/Reviewer_Jmhr"
                ],
                "content": {
                    "comment": {
                        "value": "I want to thank the authors for their thoughtful response. I am happy with the modifications namely improving the experimental section and improving the algorithmic clarity) and bumped my score up accordingly. I feel the main contribution is providing evidence that conformal modelling can be useful for MARL. To the AC, I am not an expert in the MARL literature so this may not be an advancement or strong evidence with respect to common baselines in the literature, but I don't see any obvious flaws."
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7771/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700503331693,
                "cdate": 1700503331693,
                "tmdate": 1700503331693,
                "mdate": 1700503331693,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "6NWSwbeIMm",
            "forum": "ZiHI6raor0",
            "replyto": "ZiHI6raor0",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission7771/Reviewer_XZg9"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission7771/Reviewer_XZg9"
            ],
            "content": {
                "summary": {
                    "value": "In this paper, the authors propose a multi-agent reinforcement learning (MARL) algorithm CAMMARL, which models the actions of other agents in different situations. The the estimates are used to inform an agent's decison-making. The experimental results illustrate that the proposed method elevates the capabilities of an autonomous agent in MARL."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "+ The motivation of this paper is reasonable.\n+ This paper is well-organized and well-written.\n+ The main idea of the proposed method is described in great details."
                },
                "weaknesses": {
                    "value": "+ It seems that the proposed method does not improve the performance greatly compared with other methods.\n+ The scenarios selected in this paper are not so convincing to some extend. More experiments should be conducted to demonstrate the superiority of the proposed method against other methods.\n+ The assumption of this paper is too ideal. Commonly, it is hard to obtain observations from other agents in MARL especially in the context of decentralization."
                },
                "questions": {
                    "value": "See weaknesses."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "5: marginally below the acceptance threshold"
                },
                "confidence": {
                    "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission7771/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698835820344,
            "cdate": 1698835820344,
            "tmdate": 1699636949259,
            "mdate": 1699636949259,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "hbKcRosaQ0",
                "forum": "ZiHI6raor0",
                "replyto": "6NWSwbeIMm",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission7771/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission7771/Authors"
                ],
                "content": {
                    "comment": {
                        "value": "We thank the reviewer for the helpful comments and suggestions to improve the paper. We address all the points mentioned sequentially below.\n\n1. **Performance with respect to Baselines**: While we do agree that the performance improvement is not quite significant in CN, for LBF it is quite significant especially when considering the baselines, which have more full information about the actions of the other agents before taking any decisions. However, note that for CN, the baseline that CAMMARL majorly overlaps with EAP is actually CAMMARL with set size=1. Since action prediction is quite simple in CN, conformal predictions are not much better as in environments like LBF. GIAM is clairvoyant in that it has access to all the information, so comparing it against CAMMARL is unfair, and is meant as an upper bound on performance. In comparison to the other baselines, CAMMARL does better even in CN.\n\n2. **More Domains**: CAMMARL as an idea is not restrictive to fully cooperative worlds and is generalizable to mixed/competitive settings. More specifically, if an agent in a mixed or competitive setting is required to model other agents in the environment, developers can consider applying CAMMARL in such situations too.\n\n**Results in mixed settings and more than 2 agents**: We also show results in the non-cooperative Level Based Foraging Setting for 2 agents with 6 food locations in Section D.1 of the Appendix in the revised version of the paper.\nFrom this section, we can see that the utility of CAMMARL is not just restricted to cooperative settings, but it can be easily applied to a multitude of MARL problems.\nWe also show results on Pressure Plate with 4 agents which is a new environment described in Appendix Section A of the revised version. In Section D.2 of the revised paper, we show that CAMMARL converges 10% faster (in terms of the number of episodes) when compared with the other baselines in the domain. This definitely lends further credibility to conformal predictions, and additionally shows the adaptability of CAMMARL to other MARL domains with more agents.\n\n3. **Using Observations of other agents**: We thank the reviewer for raising this important point. It is indeed a strong assumption particularly in the case of decentralized multi-agent learning, even with observations the problem is still quite challenging to solve. Also, in problems without ego-centric views, generally, the entire observation is available and the key challenge then is figuring out the actions of the other agents for complete information. We have added this as a limitation in Section 7 paragraph 2.\n\nGiven our limited computing resources, we hope we can address all of your concerns. Please consider increasing your score if you find our responses satisfactory. Additionally, we would be happy to answer any follow-up questions."
                    }
                },
                "number": 1,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission7771/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700266471163,
                "cdate": 1700266471163,
                "tmdate": 1700266471163,
                "mdate": 1700266471163,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]