[
    {
        "title": "Certified Robustness on Visual Graph Matching via Searching Optimal Smoothing Range"
    },
    {
        "review": {
            "id": "Szeh1IWYeZ",
            "forum": "zkzf0VkiNv",
            "replyto": "zkzf0VkiNv",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission8914/Reviewer_4FJt"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission8914/Reviewer_4FJt"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes a certified robustness method of visual graph matching (GM) against adversarial perturbations on image pixels and keypoint positions. The method, named CR-OSRS, uses a joint Gaussian distribution to construct a smoothed model and searches for the optimal smoothing range that balances the trade-off between certified robustness and matching performance. The paper also introduces a data augmentation technique and a regularization term to improve the model performance during training. The paper provides theoretical analysis and empirical evaluation of the proposed method on two GM datasets and four GM solvers."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "- The paper proposes a principled method that leverages the correlation between keypoints to construct a joint smoothing distribution and uses global optimization to find the optimal smoothing range.\n- The paper provides rigorous theoretical analysis and proofs for the certified robustness guarantee, as well as two methods to quantify the certified space.\n- The paper conducts extensive experiments on two GM datasets and four GM solvers, and demonstrates the effectiveness and superiority of the proposed method over the baseline method."
                },
                "weaknesses": {
                    "value": "- The paper lacks sufficient details regarding the implementation of the optimization algorithm for determining the optimal smoothing range, specifically the step 2 in Algorithm 1. Clarity is needed on the efficiency and scalability of this algorithm, especially in the context of larger-scale problems.\n- The literature review on graph matching and its robustness omits references to recent works on noisy correspondence in graph matching [2], which is closely related to the issue of adversarial attacks.\n- It is advisable to conduct a comparison between the proposed method and other existing techniques for robust GM, such as ASAR[1] and COMMON [2]. Specifically, COMMON addresses robust graph matching by considering noisy correspondence during training, while ASAR takes adversarial attacks into account during training. Evaluating these methods alongside CR-OSRS would provide more comprehensive experimental insights. Furthermore, reporting the certified accuracy and average certified radius for these models is encouraged.\n- Since the author outlines four challenges in the Introduction, it would be beneficial to emphasize these points within the Method section, using C1 to C4."
                },
                "questions": {
                    "value": "- Could you provide more details on the global optimization algorithm used to determine the optimal smoothing range? What is the computational complexity, and how scalable is this algorithm?\n- The choice of baseline methods and datasets in your evaluation appears somewhat dated (prior to 2021). Would it be possible to include the recent and popular Spair-71k [3] graph matching dataset in your experiments to provide more up-to-date and comprehensive results?\n\nThe primary focus of the rebuttal should be on addressing the concerns mentioned in the \"Weaknesses\" section, particularly by providing further experiments involving different methods and a larger dataset.\n\n[1] Appearance and Structure Aware Robust Deep Visual Graph Matching: Attack, Defense and Beyond, CVPR 2022\n\n[2] Graph Matching with Bi-level Noisy Correspondence, ICCV 2023\n\n[3] SPair-71k: A Large-scale Benchmark for Semantic Correspondence, arxiv 2019"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "8: accept, good paper"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission8914/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission8914/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission8914/Reviewer_4FJt"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission8914/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698305202872,
            "cdate": 1698305202872,
            "tmdate": 1700487066272,
            "mdate": 1700487066272,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "WMvfWu5BKY",
                "forum": "zkzf0VkiNv",
                "replyto": "Szeh1IWYeZ",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8914/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8914/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer 4FJt (1/2)"
                    },
                    "comment": {
                        "value": ">***Q1: The paper lacks sufficient details regarding the implementation of the optimization algorithm for determining the optimal smoothing range, specifically the step 2 in Algorithm 1. Clarity is needed on the efficiency and scalability of this algorithm, especially in the context of larger-scale problems.\nCould you provide more details on the global optimization algorithm used to determine the optimal smoothing range? What is the computational complexity, and how scalable is this algorithm?***\n> \n**R1:** Thank you for your question. We provide more details of the optimization algorithm below. We have also revised the paper accordingly, please refer to Appendix.C in the updated version for more details.\n\n* ***We first elaborate on the motivation for designing the optimization algorithm.*** As described in Sec.4.2, we employ a smoothing distribution $\\mathbf{B}$ with correlation to transform the basic GM model into a one with certified robustness. However, simply setting the values of $\\mathbf{B}_1$ and $\\mathbf{B}_2$ in advance may not achieve satisfactory results. Therefore, we propose to optimize $\\mathbf{B}_1$ and $\\mathbf{B}_2$ around the initial values to enhance the model’s certified robustness. We optimize $\\sigma$ and $b$ for the dataset, irrespective of the network parameters which are kept constant here.\n* ***Second, we describe the design rationale and implementation of the optimization algorithm.*** As mentioned in Sec.4.4, the proxy radius is a measure of the certified space, so our optimization algorithm aims to maximize the proxy radius on the dataset. Moreover, we enforce a constraint on $b$ in Eq.10, which is motivated by two main reasons. One is that $b$ has to be positive, since a negative b would invalidate the smoothing distribution; the other is to balance the trade-off between certified robustness and model performance. A natural solver for Eq.10 is stochastic gradient ascent with the expectation approximated by Monte Carlo samples. Thus, the gradient of the objective at the $k^{th}$ iteration can be estimated as follows:\n$$\n\\nabla_{\\sigma^k, b^k} \\ \n\\Phi^{-1}\\left(\\underline{p}\\right)\\sum_{i=1,2}\\left(\\sqrt[2m_{i}]{\\prod_{j}^{m_i} \\lambda_{ij}}\\right)+\\kappa b^k.\n$$\nIn this work, $\\underline{p}$ is estimated by the Monte Carlo sampling algorithm in the subsequent certification process, but we simplify its estimation in the optimization algorithm. Since we do not need a very precise $\\underline{p}$ value here, but a favorable trend, we calculate it by sampling only once. This approach not only improves the efficiency of the optimization algorithm but also avoids the high variance in the gradient estimation caused by multiple sampling.\n* In this work, we fix the number of iterations for all optimization algorithms to $K=10$, and the size of data used for optimization to 100. Therefore, the entire optimization process is relatively fast, with each optimization process taking less than 2 minutes on CPU (Intel(R) Core(TM) i7-7820X CPU @ 3.60GHz) and GPU (GTX 2080 Ti GPU). ***Consequently, the algorithm can be relatively easily applied to various visual GM models.*** We summarize the updates for optimizing by solving Eq.10 with $K$ steps of stochastic gradient ascent in Algorithm.2 in the paper, please refer to the revised version."
                    }
                },
                "number": 6,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8914/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700384402612,
                "cdate": 1700384402612,
                "tmdate": 1700384402612,
                "mdate": 1700384402612,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "bIM2ppoSu5",
                "forum": "zkzf0VkiNv",
                "replyto": "Szeh1IWYeZ",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8914/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8914/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer 4FJt (2/2)"
                    },
                    "comment": {
                        "value": ">***Q2: It is advisable to conduct a comparison between the proposed method and other existing techniques for robust GM, such as ASAR[1] and COMMON [2]. Specifically, COMMON addresses robust graph matching by considering noisy correspondence during training, while ASAR takes adversarial attacks into account during training. Evaluating these methods alongside CR-OSRS would provide more comprehensive experimental insights. Furthermore, reporting the certified accuracy and average certified radius for these models is encouraged.***\n> \n**R2:** \nWe appreciate your valuable feedback. We have performed additional experiments based on your suggestions and further elaborated our proposed certified robustness method. \n* The ASAR and COMMON methods you referred to are the recently proposed visual GM methods with relatively good results. We calculated CR (in link: https://anonymous.4open.science/r/Certified-Robustness-on-Visual-Graph-Matching-via-Searching-Optimal-Smoothing-Range-E5F0/Rebuttal/Figure/ASAR/ and https://anonymous.4open.science/r/Certified-Robustness-on-Visual-Graph-Matching-via-Searching-Optimal-Smoothing-Range-E5F0/Rebuttal/Figure/COMMON) and ACR (in table below) achieved by CR-OSRS and RS-GM on Pascal VOC under keypoint position perturbations for these two models. ***The results indicate that the certified robustness obtained by CR-OSRS is also superior on these two basic models.*** This result has been updated in the new version of the paper, please refer to Tab.1, Fig.6, Fig.7 and Appendix.E.1 in the paper.\n\nTable: ACR achieved by CR-OSRS and RS-GM for six GM solvers on Pascal VOC under keypoint position perturbations. \n\n|     | CR-OSRS+AUG+REG      | CR-OSRS+AUG+REG      | CR-OSRS+AUG+REG       | RS-GM+AUG+REG        | RS-GM+AUG+REG        | RS-GM+AUG+REG         | \n| --- | ----------------------- | ----------------------- | ------------------------ | ----------------------- | ----------------------- | ------------------------ |\n|     | $\\|\\|\\delta_{lower}\\|\\|$ | $\\|\\|\\delta_{upper}\\|\\|$ | $\\|\\|\\delta_{volume}\\|\\|$ | $\\|\\|\\delta_{lower}\\|\\|$ | $\\|\\|\\delta_{upper}\\|\\|$ | $\\|\\|\\delta_{volume}\\|\\|$ |     |\nCOMMON| 1.550|1.751|1.900|0.952|0.952|1.069|\nASAR|1.541|1.648|1.968|0.683|0.683|0.841|\nNGMv2| 1.425|1.586|1.934|0.778| 0.778|1.010|\nCIE-H|0.987|1.167|1.354|0.572 |0.572 | 0.731|\nPCA-GM|0.954|1.158|1.340|0.546|0.546|0.686|\nGMN|0.899|1.076|1.253|0.514| 0.514|0.617|\n\n* ***We offer more explanation on the difference between certified robustness and empirical robustness as well as the significance of CR-OSRS.*** The difference is that the results obtained by certified robustness are rigorously verifiable, that is, when the perturbation is within a certified range, the output is always invariant. However, empirical robustness does not have this theoretical guarantee, which means that it may have well defense capabilities against current attack methods, but it is highly susceptible to future unseen attacks. Therefore, the two types of robustness cannot be directly compared. This paper uses CR-OSRS to transform basic solvers into smoothed models with certified robustness for comparison and analysis. We also observe, in practice, that the better the matching performance of the basic model, the better the certified robustness and matching performance of the smoothed model will be. For instance, COMMON method enhances the model performance by leveraging noisy correspondence, which will make the smoothed models obtained by CR-OSRS more certifiably robust.\n\n>***Q3: Since the author outlines four challenges in the Introduction, it would be beneficial to emphasize these points within the Method section, using C1 to C4.***\n> \n**R3:** Thanks for your suggestion, which will improve the clarity of our paper. We have implemented the corresponding changes in the new version of the paper.\n\n>***Q4: The choice of baseline methods and datasets in your evaluation appears somewhat dated (prior to 2021). Would it be possible to include the recent and popular Spair-71k [3] graph matching dataset in your experiments to provide more up-to-date and comprehensive results?***\n> \n**R4:** We appreciate your suggestion, which will enhance the quality of our paper. We show the results on the dataset Spair-71k (in link: https://anonymous.4open.science/r/Certified-Robustness-on-Visual-Graph-Matching-via-Searching-Optimal-Smoothing-Range-E5F0/Rebuttal/Figure/SPair-71k). The figures show the CA achieved by CR-OSRS and RS-GM for NGMv2 on Spair-71k when perturbing keypoint positions. The figure displays the result for original $\\sigma=0.5$, $s=0.9$ , $\\beta=0.01$ and $n=2$. The curve of CR-OSRS is almost always above RS-GM, which implies greater certified robustness and matching accuracy. At the same time, it also illustrates that the proposed data augmentation and the regularization term are effective. This result has been updated in the new version of the paper, please refer to Fig.5 and Appendix.E.1 in the paper."
                    }
                },
                "number": 7,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8914/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700384571249,
                "cdate": 1700384571249,
                "tmdate": 1700384571249,
                "mdate": 1700384571249,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "tyDidPV4zU",
                "forum": "zkzf0VkiNv",
                "replyto": "Szeh1IWYeZ",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8914/Reviewer_4FJt"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8914/Reviewer_4FJt"
                ],
                "content": {
                    "title": {
                        "value": "Good job"
                    },
                    "comment": {
                        "value": "I appreciate the response from the authors. It would be beneficial if you could incorporate discussions on **certified robustness, empirical robustness (model robustness?), and adversarial robustness** (Point 2 of R2) into the paper. I'm happy to increase my rating."
                    }
                },
                "number": 8,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8914/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700486980182,
                "cdate": 1700486980182,
                "tmdate": 1700487044628,
                "mdate": 1700487044628,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "TxSX0A5Wps",
            "forum": "zkzf0VkiNv",
            "replyto": "zkzf0VkiNv",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission8914/Reviewer_wBHW"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission8914/Reviewer_wBHW"
            ],
            "content": {
                "summary": {
                    "value": "This work introduces a novel certified robustness algorithm for visual graph matching problem. To achieve a larger certified space as well as better trade-offs between certified robustness and matching performance, the authors propose to search the optimal joint Gaussian distribution for random smoothing with a subspace defined by a similarity threshold. The authors also provide theoretical analysis that the matching matrix can be bounded within the subspace. Extensive comparisons with various baselines demonstrate the effectiveness of the proposed algorithm."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "1. The paper is well-organized and easy to follow.\n2. The proposed algorithm is well motivated by the theoretical analysis.\n3. The results are promising compared with other baselines."
                },
                "weaknesses": {
                    "value": "My major concerns mainly lie in the ablation studies:\n\n1. In Eq. 10, the authors mentioned that a constraint on b is imposed in the optimization. However, how this constraint works is not well explained. The effectiveness of this constraint is not evaluated in the experiments.\n2. The authors introduced a regularization in Eq. 11, however, the ablation study of the variant without this regularization is missing."
                },
                "questions": {
                    "value": "1. Please provide more details of the constraint in Eq. 10 as well as ablation studies.\n2. Please provide the ablation study of the regularization in Eq. 11."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission8914/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698658182149,
            "cdate": 1698658182149,
            "tmdate": 1699637121558,
            "mdate": 1699637121558,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "sUQfaq1YXA",
                "forum": "zkzf0VkiNv",
                "replyto": "TxSX0A5Wps",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8914/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8914/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer wBHW"
                    },
                    "comment": {
                        "value": ">***Q1: In Eq. 10, the authors mentioned that a constraint on b is imposed in the optimization. However, how this constraint works is not well explained. The effectiveness of this constraint is not evaluated in the experiments. Please provide more details of the constraint in Eq. 10 as well as ablation studies.***\n> \n**R1:** Thank you for your questions and suggestions. We will clarify the role of the constraint and its ablation study. We have also revised the paper accordingly, please refer to Appendix.C and Appendix.E.1 in the updated version for more details.\n* ***We first explain the rationale behind the design of the optimization algorithm.*** As described in Sec.4.2, we employ a smoothing distribution $\\mathbf{B}$ with correlation to transform the basic GM model into a one with certified robustness. However, simply setting the values of $\\mathbf{B}_1$ and $\\mathbf{B}_2$ in advance may not achieve satisfactory results. Therefore, we propose to optimize $\\mathbf{B}_1$ and $\\mathbf{B}_2$ around the initial values to enhance the model’s certified robustness. It is worthwhile to mention that we optimize $\\sigma$ and $b$ on the dataset, regardless of the architecture and the training procedure of the basic model.\n* As mentioned in Sec.4, the proxy radius is a measure of the certified robustness of the algorithm, so our optimization algorithm aims to maximize the proxy radius on the dataset as shown in Eq.10. ***Moreover, we enforce a constraint on the correlation parameter $b$, which is motivated by two main reasons.*** One is that $b$ has to be positive, since a negative $b$ would invalidate the smoothing distribution; the other is to balance the trade-off between certified robustness and model performance. A large $b$ may improve the matching performance but reduce the certified space.\n* We have performed ablation experiments to examine the effect of parameter $\\kappa$ on the certification results as in figures (https://anonymous.4open.science/r/Certified-Robustness-on-Visual-Graph-Matching-via-Searching-Optimal-Smoothing-Range-E5F0/Rebuttal/Figure/Ablation%20study%20of%20kappa/). The figures shows that $\\kappa$ had little overall influence on the outcomes, but a larger $\\kappa$ results in a larger $||\\delta_{volume}||$ and $||\\delta_{upper}||$ as well as a smaller $||\\delta_{lower}||$. However, we still stress that the constraint plays a vital role in ensuring that the value of $b$ remains within a reasonable optimization range. This result has been updated in the new version of the paper, please refer to it in Appendix.E.1 and Fig.9.\n\n>***Q2: The authors introduced a regularization in Eq. 11, however, the ablation study of the variant without this regularization is missing. Please provide the ablation study of the regularization in Eq. 11.***\n> \n**R2:** Thank you for your question. We actually have presented the ablation study you referred to in Fig.2. We evaluate the certification results of RS-GM and CR-OSRS on the basic model, the model with data augmentation (AUG), and the model with data augmentation and the regularization term (AUG+REG). We also explain in Sec.5.2 that the regularization term is always related to data augmentation as shown in Eq.11. In the absence of data augmentation, the outputs corresponding to all copy data are identical and thus the regularization term is always zero. Fig.2 demonstrates that the proposed data augmentation and the regularization term are effective."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8914/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700383831297,
                "cdate": 1700383831297,
                "tmdate": 1700383831297,
                "mdate": 1700383831297,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "LxlI2z5JIQ",
            "forum": "zkzf0VkiNv",
            "replyto": "zkzf0VkiNv",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission8914/Reviewer_eczv"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission8914/Reviewer_eczv"
            ],
            "content": {
                "summary": {
                    "value": "This paper addresses the challenge of robustness certification in visual graph matching, a problem lying between traditional regression models and combinatorial optimization. Two key technical innovations are introduced: using pairs of graph data as inputs and adding constraints to the output space. The authors propose an Optimal Smoothing Range Search approach, inspired by random smoothing techniques, to enhance robustness. Practical techniques such as output space partitioning based on similarity, data augmentation, and a similarity-based regularization term are also presented. Experimental results confirm the effectiveness of these methods."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "1. The paper addresses an intriguing and essential problem, as existing certification methods are primarily geared toward image recognition, leaving structured prediction, especially combinatorial optimization, less explored. While graph matching is a well-studied problem in recent machine learning literature, certification in this context has been notably absent.\n\n2. The novel techniques, particularly the global optimization search algorithm, stand out as a reasonable and innovative approach, well-suited to the new problem setting examined in this paper.\n\n3. The paper introduces two new methods for measuring the certified space, offering valuable tools for quantitative analysis.\n\n4. The paper achieves a commendable balance between matching accuracy and robustness certification, as evidenced by extensive experiments."
                },
                "weaknesses": {
                    "value": "1. The presentation can be improved for better clarity, as it involves multiple areas ranging from graph matching (combinatorial optimization), robustness certification, visual recognition, etc.\n2. the paper lacks some discussion for enlarging its potential impact to other combinatorial tasks or any limitation and difficulty to extend its adaption to other tasks."
                },
                "questions": {
                    "value": "1. Have you explored the possibility of extending your approach to address problems beyond graph matching? Given the ubiquity of combinatorial optimization on graphs, a discussion on a potentially more general framework could be beneficial.\n\n2. Can you add a table or figure to summarize and compare related methods from multiple aspects for better accessibility of readers?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission8914/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698809626331,
            "cdate": 1698809626331,
            "tmdate": 1699637121439,
            "mdate": 1699637121439,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "hcbV9nfIan",
                "forum": "zkzf0VkiNv",
                "replyto": "LxlI2z5JIQ",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8914/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8914/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer eczv (1/3)"
                    },
                    "comment": {
                        "value": ">***W1/Q2: The presentation can be improved for better clarity, as it involves multiple areas ranging from graph matching (combinatorial optimization), robustness certification, visual recognition, etc. Can you add a table or figure to summarize and compare related methods from multiple aspects for better accessibility of readers?***\n> \n**R1:** We appreciate your insightful suggestions. Our research draws on knowledge from multiple fields, and we aim to present and compare them more rigorously and clarify their relevance to this study according to your suggestions. We show the comparison of visual GM methods and certified robustness methods in Tab.1 and Tab.2 below. We have also revised the paper accordingly, please refer to Appendix.B in the updated version for more details.\n\n* **First**, we provide a brief introduction to visual Graph Matching(GM). GM is a fundamental problem in combinatorial optimization that involves identifying node correspondences between graphs. As introduced in Sec.3, deep visual GM deals with images with keypoints as inputs and solves in an end-to-end manner. Visual GM consists of three components: keypoint feature extractor, affinity learning, and final correspondence solver. ***We introduce and compare the main visual GM methods used in this work in Tab.1 below, which we have added to the paper, please refer to Appendix.B for more details.***\n\nTable 1: Summary of main existing literature in learning GM. \n\n| Method | Introduction|\n| -------- | ------------------------------------------------------------------------------------------------------------------------------------------------------------------------ |\n|GMN[1]|The seminal work that employs a convolutional neural network to extract node features and constructs an end-to-end model with spectral matching.|\n|PCA-GM[2]| Leveraging intra-graph and cross-graph structural information using graph convolutional networks.|\n|CIE-H[3]|Enhancing end-to-end training by edge embedding and Hungarian-based attention mechanism.|\n|NGMv2[4]|Developing a matching-aware graph convolution scheme with Sinkhorn iteration.|\n|ASAR[5]|An appearance-aware regularizer is employed to explicitly increase the dissimilarities between similar keypoints and improve model robustness through adversarial attacks.|\n|COMMON[6]|Integrating the momentum distillation strategy to balance the quadratic contrastive loss and reduce the impact of bi-level noisy correspondence.|\n* **Second**, we introduce the concept and methods of certified robustness, which aims to design solvers that can verify the consistency of their prediction for any input within a certified perturbation range. As discussed in Sec.2, various methods have been proposed to achieve certified robustness, but only the Randomized Smoothing (RS) class of methods can scale up to large models and ImageNet-level datasets. ***We present some of the representative RS-based methods in Tab.2, along with their applicable scenarios and features.*** We have added the comparison to the paper, please refer to Appendix.B in the updated version for more details. As analyzed in Sec.1, none of these methods can be directly applied to visual GM. Therefore, we propose the CR-OSRS method, which can transform any basic visual GM model (described in Tab.1) into a model with certified robustness.\n\nTable 2: Summary of main existing literature in RS-type methods for robustness certification. \n\n| Method | Introduction|\n| ------ | -------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |\n|RS[7]|A pioneering work on certified robustness for classification tasks, demonstrating that Gaussian smoothing distributions can provide a provable $\\ell_2$ perturbation bound.|\n|DSSN[8]|Providing a novel non-additive smoothing robustness certificate for the $\\ell_1$ threat model.|\n|Median Smoothing[9]|Developing a new variant of smoothing specifically for detection based on the medians of the smoothed predictions.|\n|RS for Segmentation[10]|Presenting a scalable certification method for image and point cloud segmentation based on randomized smoothing.|\n|RS for Community Detection[11]|Building a new smoothed community detection method via randomly perturbing the graph structure.|\n* **Third**, this work concentrates on the performance of the visual GM model, which only requires visual feature extraction, and not visual recognition. Visual recognition is beyond the scope of this work, so the visual recognition model will not be evaluated and discussed."
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8914/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700383427829,
                "cdate": 1700383427829,
                "tmdate": 1700383427829,
                "mdate": 1700383427829,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "zp2fE27OB1",
                "forum": "zkzf0VkiNv",
                "replyto": "LxlI2z5JIQ",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8914/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8914/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer eczv (2/3)"
                    },
                    "comment": {
                        "value": ">***W2/Q1: The paper lacks some discussion for enlarging its potential impact to other combinatorial tasks or any limitation and difficulty to extend its adaption to other tasks. Have you explored the possibility of extending your approach to address problems beyond graph matching? Given the ubiquity of combinatorial optimization on graphs, a discussion on a potentially more general framework could be beneficial.***\n> \n**R2:** We appreciate your valuable suggestions. Below we will discuss the challenges of extending certified robustness research to general combinatorial optimization (CO) problems. Then we will introduce the particularities of the visual graph matching (GM) problem that this work focuses on and its advancement for the general issue.\n* First, we emphasize that robustness certification aims to provide a mathematical guarantee that the model output is bounded by a certain region when the input is slightly modified. We share your interest in developing a provably robust method that can be applied to a broader range of CO problems. ***However, we encounter several challenges in this direction. First***, different CO problems may have different input and output formats. Therefore, it is necessary to devise a way to unify the diverse input and output formats. For instance, many CO problems can be represented as graph input forms, but there is no standard and unified format for the outputs, to the best of our knowledge. One possible solution is to use a general structured data format to unify the outputs. After unifying the input and output formats, we can design a general robustness certification method. ***Second***, there is currently a lack of sufficient research on the robustness certification of complex models that take graphs as inputs and structured data as outputs. Most of the existing work can only handle simple classification problems. ***Third***, we need to define the notion of certified robustness for CO problems clearly. The paper [12] proposes a heuristic robustness criterion for CO problems, but it does not guarantee the certified robustness of the model.\n* Second, visual GM, as a special case of CO, has a distinctive input and output format, as described in Sec.1. The input consists of pairs of images and their corresponding keypoints, and the output is a matching matrix that indicates the correspondence between the keypoints. To address this task, we propose a novel method that designs a randomized smoothing distribution with correlation constraints and a subspace partitioning. This not only provides a theoretical guarantee for the robustness of visual GM, but also preserves the model performance and the rationality of the verification. In addition, we define the certified robustness of visual GM as the condition that when the perturbation is within the certified input space, the smoothed model always predicts the output within the output subspace. ***These address the above-mentioned challenges of CO robustness certification in the visual GM problem.***\n***Our work has implications for the robustness certification of general CO problems***. Particularly, our method provides an effective solution for processing matrix output, which is also a special kind of structured data; our proposal of joint smoothing distribution may also be beneficial in inspiring the processing of constrained input formats in many CO problems; the data augmentation and the regularization term may suggest a similar approach to balancing certified robustness and model performance for general CO problems. ***However, the unification of input and output formats, the certification methods for complex graph tasks, and the reasonable certified robustness definitions are still pending to be solved.***\n* In conclusion, we attempt to solve a special case of the robustness certification problem for CO in this paper. We are working on addressing the challenges for general CO certification and will share our findings in the future."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8914/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700383516680,
                "cdate": 1700383516680,
                "tmdate": 1700383516680,
                "mdate": 1700383516680,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "MueE3xpngn",
                "forum": "zkzf0VkiNv",
                "replyto": "LxlI2z5JIQ",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission8914/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission8914/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer eczv (3/3)"
                    },
                    "comment": {
                        "value": "[1] Zanfir A, Sminchisescu C. Deep learning of graph matching[C]//Proceedings of the IEEE conference on computer vision and pattern recognition. 2018: 2684-2693.\n\n[2] Wang R, Yan J, Yang X. Learning combinatorial embedding networks for deep graph matching[C]//Proceedings of the IEEE/CVF international conference on computer vision. 2019: 3056-3065.\n\n[3] Yu T, Wang R, Yan J, et al. Learning deep graph matching with channel-independent embedding and hungarian attention[C]//International conference on learning representations. 2019.\n\n[4] Wang R, Yan J, Yang X. Neural graph matching network: Learning lawler’s quadratic assignment problem with extension to hypergraph and multiple-graph matching[J]. IEEE Transactions on Pattern Analysis and Machine Intelligence, 2021, 44(9): 5261-5279.\n\n[5] Ren Q, Bao Q, Wang R, et al. Appearance and structure aware robust deep visual graph matching: Attack, defense and beyond[C]//Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition. 2022: 15263-15272.\n\n[6] Lin Y, Yang M, Yu J, et al. Graph matching with bi-level noisy correspondence[C]//Proceedings of the IEEE/CVF International Conference on Computer Vision. 2023: 23362-23371.\n\n[7] Cohen J, Rosenfeld E, Kolter Z. Certified adversarial robustness via randomized smoothing[C]//international conference on machine learning. PMLR, 2019: 1310-1320.\n\n[8] Levine A J, Feizi S. Improved, deterministic smoothing for L_1 certified robustness[C]//International Conference on Machine Learning. PMLR, 2021: 6254-6264.\n\n[9] Chiang P, Curry M, Abdelkader A, et al. Detection as regression: Certified object detection with median smoothing[J]. Advances in Neural Information Processing Systems, 2020, 33: 1275-1286.\n\n[10] Fischer M, Baader M, Vechev M. Scalable certified segmentation via randomized smoothing[C]//International Conference on Machine Learning. PMLR, 2021: 3340-3351.\n\n[11] Jia J, Wang B, Cao X, et al. Certified robustness of community detection against adversarial structural perturbation via randomized smoothing[C]//Proceedings of The Web Conference 2020. 2020: 2718-2724.\n\n[12] Lu H, Li Z, Wang R, et al. ROCO: A General Framework for Evaluating Robustness of Combinatorial Optimization Solvers on Graphs[C]//The Eleventh International Conference on Learning Representations. 2022."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission8914/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700383581372,
                "cdate": 1700383581372,
                "tmdate": 1700383616510,
                "mdate": 1700383616510,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]