[
    {
        "title": "Error Norm Truncation: Robust Training in the Presence of Data Noise for Text Generation Models"
    },
    {
        "review": {
            "id": "Q3hjPl2N4t",
            "forum": "zMvMwNvs4R",
            "replyto": "zMvMwNvs4R",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6463/Reviewer_p8xo"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6463/Reviewer_p8xo"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes a method for automatically identifying which data points are potentially noisy.\nSpecifically, this is done based on identifying points that have high L2 norms of the error and removing them from the loss function."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "* Overall, I do really like the concept of the paper. It is simple and generally makes sense.\n* The method seems to have strong empirical results in synthetic settings, and reasonable experimental results in less synthetic settings.\n* Figure 4 is a nice analysis demonstrating that intuitively why the proposed method is better than log likelihood."
                },
                "weaknesses": {
                    "value": "I have a few concerns about the paper:\n\n* It seems that some hyperparameter tuning (detailed in appendix C) was done for all of the loss modification methods, but none was done for MLE. Because of this, perhaps some of the gains over MLE can be attributed to randomness in training, rather than to inherent goodness of the method.\n* The results on real-world datasets (sections 5.3 and 5.4) are somewhat underwhelming. I see small gains (and perhaps small gains are a good result already given how simple the method is), but I'm also a little bit concerned whether these are interesting enough for practitioners to be excited and go back and implement/use this method. Overall, I feel like the paper lacks a big convincing results, such as  significant improvements to SOTA on a dataset that people care about.\n\nNote that I am not saying that the work is solid, it seems to be done reasonably well, I'm just not sure how much impact it will have on the community given the current empirical evidence."
                },
                "questions": {
                    "value": "1. How was the thereshold hyperparameter tuned in all experiments in the experimental section?\n2. I was confused by the second equation in section 3, should it be a \"less-than\" sign rather than a \"greater-than\" sign?"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission6463/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6463/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6463/Reviewer_p8xo"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6463/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698940784512,
            "cdate": 1698940784512,
            "tmdate": 1700611098859,
            "mdate": 1700611098859,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "hjOQ6pQTLh",
                "forum": "zMvMwNvs4R",
                "replyto": "Q3hjPl2N4t",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6463/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6463/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to reviewer p8xo"
                    },
                    "comment": {
                        "value": "We sincerely thank the reviewer for the insightful feedback and for appreciating the simplicity of our method, as well as for acknowledging our “strong empirical results in synthetic settings, and reasonable experimental results in less synthetic settings.”\n\nWe hope to address the concerns of the reviewer below: \n\n> perhaps some of the gains over MLE can be attributed to randomness in training, rather than to inherent goodness of the method.\n\nTo address the reviewer’s concerns, we performed additional tuning on the MLE baseline for our opus-MT experiments (Table 4), varying the learning rate and dropout probability:\n\n| lr              | dropout | BLEU |\n|-----------------|---------|------|\n| 5e-4 (our reported baseline) | 0.1     | 30.1 |\n| 1e-3            | 0.1     | 30.0 |\n| 1e-4            | 0.1     | 28.4 |\n| 7e-4            | 0.1     | **30.2** |\n| 5e-4            | 0       | 29.1 |\n| 5e-4            | 0.2     | **30.2** |\n| 5e-4            | 0.3     | 29.8 |\n\n**We tuned the baselines extensively.** We show the number of additional hyper-parameter configurations for each baseline in the following chart: \n\n | Method         | Number of Hyper-parameters Tuned |\n|---------------------|----------------------------------|\n| TaiLr [3]           | 10                               |\n| Loss Truncation [2] | 3                                |\n| ENT-Threshold       | 3                                |\n| ENT-Fraction        | 1                                |\n\n> Overall, I feel like the paper lacks a big convincing results, such as significant improvements to SOTA on a dataset that people care about. \n\nOur main claim is that our method improves the robustness of text generation models against various types of data noise, outperforming **existing truncation methods based only on loss** across three different tasks, rather than our method achieving SOTA in language generation. SOTA methods for different tasks usually require task-specific handling (e.g., using bilingual pre-trained masked language models for translation [1], using contrastive learning between candidate summaries for summarization [4]), making them less generalizable. In contrast, our proposed approach **does not make such task-specific assumptions**, making it applicable to any text generation task to improve robustness.\n\nMoreover, **our gains are not limited to synthetic settings**: We would like to highlight that our method yields large improvements in language modeling (-1.58 Perplexity, Table 3), and in Appendix F, we show that our method improves upon the MLE baselines from +0.5 to 0.9 BLEU on Paracrawl MT data. To further address the reviewer’s concerns, we added experiments to show that our method can be used in conjunction with SOTA task-specific methods [1, 4] to improve the performance:\n\n| IWSLT 14 De-En  | Test BLEU |\n|----------------------------------|-----------------|\n| BiBERT (Table 2 in [1])      | 37.58     |\n| BiBERT (reproduced) | 37.62     |\n| BiBERT + ENT-Fraction        | **38.29**    |\n\n| CNN/DM            | Rouge-1 | Rouge-2 | Rouge-L |\n|-------------------|---------|---------|---------|\n| BRIO (Table 2 in [4])   | 47.78   | 23.55   | 44.57   |\n| BRIO (reproduced) | 47.81   | 23.52   | 44.52   |\n| BRIO + ENT-Fraction  | **48.04**   | **23.61**   | **44.81**   |\n\nWe also conducted additional experiments in a more realistic setting: We use the Human+GPT mixture data in [5] and perform instruction tuning on LLama 2 7B. We show the results of adding ENT below:\n\n|                                   | MMLU (0-shot Acc.) | TyDiQA (F1) |\n|-----------------------------------|--------------------|-------------|\n| Llama2-7b instruct (Table 5 in [5])     | 49.2               | 52.8        |\n| LLama2-7b instruct (reproduced)   | 50.1               | 52.1        |\n| LLama2-7b instruct + ENT-Fraction | **51.3**               | **54.0**        |\n\n\n> How was the threshold hyperparameter tuned in all experiments in the experimental section?\n\nWe choose the best of {1.35, 1.38, 1.4} for ENT-Threshold in all our experiments. More details of how we tuned the hyper-parameters can be found in Appendix C.\n\n>  I was confused by the second equation in section 3, should it be a \"less-than\" sign rather than a \"greater-than\" sign?\n\nWe thank the reviewer for pointing this out, and we have made revisions to the manuscript (marked in blue).\n\n[1] BERT, mBERT, or BiBERT? A Study on Contextualized Embeddings for Neural Machine Translation (Xu et al., EMNLP 2021)\n\n[2] Improved Natural Language Generation via Loss Truncation (Kang & Hashimoto, ACL 2020)\n\n[3] Tailoring Language Generation with Total Variation Distance (Ji et al., ICLR 2023)\n\n[4] Bringing Order to Abstractive Summarization (Liu et al., ACL 2022)\n\n[5] How Far Can Camels Go? Exploring the State of Instruction Tuning on Open Resources (Wang et al., NeurIPS 2023)"
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6463/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700409392415,
                "cdate": 1700409392415,
                "tmdate": 1700409633055,
                "mdate": 1700409633055,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "0NZMVZt5Ee",
                "forum": "zMvMwNvs4R",
                "replyto": "hjOQ6pQTLh",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6463/Reviewer_p8xo"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6463/Reviewer_p8xo"
                ],
                "content": {
                    "title": {
                        "value": "Response to rebuttal"
                    },
                    "comment": {
                        "value": "Thank you for the additional details and experiments.\n\nI believe that the additional experimental evidence will make the paper somewhat stronger, and am happy to raise my score from 5->6 (as lack of experimental evidence was my main reason for the low rating in the first place). However, I am still not super-convinced that this paper is going to be hugely impactful given the current results, and thus still think it is more-or-less on the borderline."
                    }
                },
                "number": 5,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6463/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700611081985,
                "cdate": 1700611081985,
                "tmdate": 1700611081985,
                "mdate": 1700611081985,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "k9r1sdSmt5",
            "forum": "zMvMwNvs4R",
            "replyto": "zMvMwNvs4R",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6463/Reviewer_Fsrz"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6463/Reviewer_Fsrz"
            ],
            "content": {
                "summary": {
                    "value": "This paper introduces a new method for noisy data truncation. It computes the l2 norm of the difference between the model's token distribution and the one-hot groundtruth. The error norm provides a measure of data quality. The Experiments on language modeling, machine translation, and summarization demonstrate the effectiveness of the proposed method."
                },
                "soundness": {
                    "value": "4 excellent"
                },
                "presentation": {
                    "value": "4 excellent"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "- The proposed method is simple, effective, and robust.\n- The analysis experiments are insightful.\n- The experiment results on language modeling, machine translation, and summarization are comprehensive and the results are good."
                },
                "weaknesses": {
                    "value": "- The improvements over existing methods seem marginal in some experiments.\n- The motivation of the proposed method is a bit unclear to me. See my question below."
                },
                "questions": {
                    "value": "One motivation of the proposed method is that previous works treat all non-ground truth tokens as equally incorrect. However, I do not see how the proposed method solve this problem. In my opinion, all non-ground truth tokens are treated in the same way in the proposed method. can you explain?\n\nFollowing above, I think one potential improved version of the proposed method is to take into account the similarity between non-ground truth tokens and ground truth tokens when computing the l2 norm."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6463/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698990153681,
            "cdate": 1698990153681,
            "tmdate": 1699636722608,
            "mdate": 1699636722608,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "IY2q3Ya7XB",
                "forum": "zMvMwNvs4R",
                "replyto": "k9r1sdSmt5",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6463/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6463/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Response to Reviewer Fsrz"
                    },
                    "comment": {
                        "value": "We sincerely thank the reviewer for the helpful and insightful comments. We appreciate that the reviewer acknowledges that our method is “simple, effective and robust” and our experiments are “insightful” and “comprehensive”. \n\nWe address the concerns and questions shared in the review:\n\n> The improvements over existing methods seem marginal in some experiments.\n\nWhile the improvements may seem marginal, we believe they are meaningful gains for the following reasons: \n\n1. **Our experimental setup gives a lot of advantage to our baselines:** The baseline results on opus-MT and CNN/DM have already been tuned extensively, and even the state-of-the-art truncation methods [1] can only yield, in your words, “marginal” improvements (+0.58 Rouge-1 and +0.78 BLEU) with exhaustive hyper-parameter tuning (e.g. [1] performed a grid search of 12 combinations of their two hyper-parameters). On the contrary, our proposed approach shows consistent gains in MT (+0.5 BLEU averaged across all directions) with minimal hyper-parameter tuning. We show the number of hyper-parameter configurations we tuned in the following table:\n\n| Method         | Number of Hyper-parameters Tuned |\n|---------------------|----------------------------------|\n| TaiLr [1]           | 10                               |\n| Loss Truncation [2] | 3                                |\n| ENT-Threshold       | 3                                |\n| ENT-Fraction        | 1                                |\n\n2. **Consistent across different tasks and models:** In spite of the strong baselines, our method yields large improvements in language modeling (-1.58 Perplexity) and machine translation with noise injected (up to +2 BLEU) with no computational overhead. Our method also yields consistent gains on **multiple languages** in multilingual MT and on **two different models** on text summarization. In Appendix F, our method yields larger gains (+0.5 - 0.9 BLEU) on an unfiltered Machine Translation dataset (Paracrawl), \nshowing that our method yields larger gains in noisier settings.\n\n> In my opinion, all non-ground truth tokens are treated in the same way in the proposed method. can you explain?\n\nWe understand that there is a nuance in how we define “all non-ground truth tokens are treated in the same way”.  We meant that existing methods ignore the predicted distribution over the non-ground truth tokens - therefore treating all probability distributions over the non-ground truth tokens as equal, whereas our method differentiates between when the predicted distribution over non-target tokens is skewed versus uniform. Empirically, we found compelling evidence that the error norm clearly distinguishes between clean and noisy tokens (Figure 4). Thank you for pointing this out, and we have made revisions to clarify our motivation in Section 2 (Marked in blue).\n\n> Following above, I think one potential improved version of the proposed method is to take into account the similarity between non-ground truth tokens and ground truth tokens when computing the l2 norm.\n\nYour point is well taken. We agree that a variant of our method that incorporates semantic similarity is an exciting future direction. However, one challenge is that the target and non-target token could be very similar and the data might still be an error (e.g., The capital of Maryland is Baltimore V.S. Annapolis). As also mentioned by Reviewer p8xo, Figure 4 provides compelling evidence that the error norm itself clearly distinguishes between clean and noisy data, therefore we opted to only use error norm for simplicity.\n\n[1] Tailoring Language Generation with Total Variation Distance (Ji et al., ICLR 2023)\n\n[2] Improved Natural Language Generation via Loss Truncation (Kang & Hashimoto, ACL 2020)"
                    }
                },
                "number": 1,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6463/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700409296444,
                "cdate": 1700409296444,
                "tmdate": 1700409296444,
                "mdate": 1700409296444,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "BXbbZAYaZu",
                "forum": "zMvMwNvs4R",
                "replyto": "IY2q3Ya7XB",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission6463/Reviewer_Fsrz"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission6463/Reviewer_Fsrz"
                ],
                "content": {
                    "comment": {
                        "value": "The authors addressed my concerns in their rebuttal. I am very happy to learn that they revised the motivation part to avoid confusion. I will keep leaning towards positive."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission6463/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700566028653,
                "cdate": 1700566028653,
                "tmdate": 1700566028653,
                "mdate": 1700566028653,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "YS16XhSTXv",
            "forum": "zMvMwNvs4R",
            "replyto": "zMvMwNvs4R",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6463/Reviewer_FiyE"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6463/Reviewer_FiyE"
            ],
            "content": {
                "summary": {
                    "value": "This paper proposes a method called Error Norm Truncation (ENT) to enhance the robustness of text generation models against errors in the training data. The Error Norm Truncation (ENT) method is to truncate training data with high L2 error norm. The comprehensive experiments show that ENT improves the robustness of language models and machine translation models against various types of noise and outperforms previous methods."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "- This paper studies a fundamental issue in training neural models. \n- The proposed method is easy to implement and sounds appealing.\n- Experiments show that the proposed method can outperform previous methods on some tasks such as machine translation and language modeling."
                },
                "weaknesses": {
                    "value": "- Even though the results have proven the effectiveness of ENT, I think the motivation of using error norm to estimate data quality can be further discussed and provide more insights about how do they correlate. \n - Theoretically, whether an example is helpful to train a model not only depends on the correctness of its label but also on the uncertainty (or entropy) of this example, according to the lessons from active learning. As uncertainty also takes into account of the prob of non-targets as ENT does. Therefore, it would be important to discuss the relationship between uncertainty and ENT in this paper.  \n- The proposed method achieves significant improvements on simulated training data with manually added noise (with two types of noise) but it only yields modest improvements on the standard benchmarks where training data may contain less noise. Therefore, it would be helpful if the proposed method works well on natuarally noisy benchmarks. Of course, it may be difficult to collect a large scale of training data and thus it is practical to apply the proposed method under the finetuning scenario, where a small scale of naturally noisy data is used for finetuning (for example, there is such a shared task in WMT).   \n\u000bp.s. I know there is no time for authors to add new experiments into the paper, because I am an emergency reviewer and submit the reviews just before the deadline. However, I would be happy to see more experiments from the dialog box in the openreview system a couple of days later."
                },
                "questions": {
                    "value": "N/A"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "details_of_ethics_concerns": {
                    "value": "N/A"
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission6463/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6463/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6463/Reviewer_FiyE"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6463/-/Official_Review"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1700655333735,
            "cdate": 1700655333735,
            "tmdate": 1700655333735,
            "mdate": 1700655333735,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    },
    {
        "review": {
            "id": "9RStRmL1RR",
            "forum": "zMvMwNvs4R",
            "replyto": "zMvMwNvs4R",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission6463/Reviewer_CBUj"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission6463/Reviewer_CBUj"
            ],
            "content": {
                "summary": {
                    "value": "This work proposes Error Norm Truncation (ENT), a method to clean low-quality data in training text generation models. The proposed method measures the distribution of each token between the predicted distribution and the ground-truth distribution, which is more robust than previous works of measearuing loss or probability."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "1. The first half of the paper is well-organized and clearly written. I enjoy reading this part, which provides me a clear understanding of your motivation and method.\n2. The proposed method is technically sound, echoing your motivation, with theoritical proof and experimental studies.\n3. The experiments, overall, provide a good evidence of the effectivenss of the proposed method."
                },
                "weaknesses": {
                    "value": "1. The last half of the paper is not well wrtitten with some temrs not clearly explained:\n1.1 In Figure 5, ENT (largest) and ENT (smallest) are not explained. I did not find where explains these two terms.\n1.2 In Figure 6, what and how are the ENT threshold and ENT fraction set?\n2. The authors claim that previous work would rely on hyper-parameter tuning (on fraction or threshold). But the proposed ENT method also requires these hyper-parameters. I am not sure the proposed method would be more efficient on hyper-parameter selecting.\n3. In $5.2, apart from the two settings, another setting \"Over translated\" (noted by the authros in Figure 2) should also be included.\n4. In $5.4, it is inadequate to draw such a conclusion on using which method for pre-trained model and using which method for from-sractch model, with only a summarization task. More downstream tasks should be conducted to draw such a conclusion.\n5. Title of Section 4 could be re-considered to like \"Analysis\", as case studies always provide study on a few specific \"cases\" from the dataset. But this section is analyzing on the whole dataset. However, this is just a suggestion, and does not affect my rating."
                },
                "questions": {
                    "value": "1. In Table 1, when the untranslated ration is 10%, MLE outputperforms all the methods with a relatively large margin. This is interesting and also confusing, comparing to other ratio. Do you have any explain or study on this? Moreover, in real scenoria, I think the untranslated ratio in the dataset is not as large as more than 20%, so does this result suggest that under common situation, using MLE is enough to beat other modifications?\n2. In Table 2, the advantages of ENT and also the Loss Trunc. and TaiLr are not significant against MLE when ratio <=30%. Also in real scenoria, the misordered ratio might not be that high, which also raieses the same question as above."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission6463/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6463/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission6463/Reviewer_CBUj"
                    ]
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission6463/-/Official_Review"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1701073963384,
            "cdate": 1701073963384,
            "tmdate": 1701073963384,
            "mdate": 1701073963384,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": []
    }
]