[
    {
        "title": "Pricing with Contextual Elasticity and Heteroscedastic Valuation"
    },
    {
        "review": {
            "id": "d7eMHE2Gje",
            "forum": "zt8bb6vC4m",
            "replyto": "zt8bb6vC4m",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4003/Reviewer_6Reb"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4003/Reviewer_6Reb"
            ],
            "content": {
                "summary": {
                    "value": "This paper studies an online dynamic pricing problem by considering a novel model with feature-based price elasticity.  The authors provide a novel algorithm, ``Pricing with Perturbation (PwP),\" that efficiently solves this pricing problem and obtains near-optimal regret, which matches the lower bound of regret up to log terms."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "1. The presentation is clear. Beginning with the introduction part, the paper clearly lists its comparisons and generalizations from previous work. Later in the main text, the intuition of the algorithm is also well described. The assumptions made in the paper are also clearly listed and justified.\n\n2. The novelty of the algorithm and its technical contributions are sound. The proposed Pricing with Perturbation (PwP) algorithm is smart and can efficiently solve the problem of a lack of fisher information.\n\n3. Discussions on potential extensions of the work are discussed in detail in the appendix."
                },
                "weaknesses": {
                    "value": "1. The motivation for this contextual price elasticity seems unclear.\n\n2. Certain assumptions, such as $x^\\top \\eta$ having a positive lower bound, lack a real-world explanation.\n\n3. Lack of applying this framework to real-data studies"
                },
                "questions": {
                    "value": "1. Can the authors present certain real-world motivations for this contextual price elasticity? e.g., why is it reasonable to rely on the context $x_t$, and is it reasonable to assume that for all $x_t$, $x_t^\\top \\eta$ is positive all the time? \n\n2. About the linear assumption on $x_t^\\top \\eta$, can this be generalized to some non-linear function of $x_t$? Also, when $x_t$ is stochastic, can the assumption of $x_t^\\top \\eta>0$ be relaxed to $E[x_t^\\top \\eta]>0$, where $E[\\cdot]$ is the expectation over $x$?\n\n3. Can the authors provide a real-world (or semi-real) data study? on evaluating the performance of algorithms in real-life situations.\n\n4. In terms of the presentation of simulation results, could the authors present log-log plots and compare them with the $1/2 log T$ curve? Since it would be hard to see the regret order if they are not presented in this way,"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission4003/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4003/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4003/Reviewer_6Reb"
                    ]
                }
            },
            "number": 1,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4003/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698589805767,
            "cdate": 1698589805767,
            "tmdate": 1699636362362,
            "mdate": 1699636362362,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "niOGBzGwQQ",
                "forum": "zt8bb6vC4m",
                "replyto": "d7eMHE2Gje",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4003/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4003/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Authors Response to Reviewer 6Reb"
                    },
                    "comment": {
                        "value": "Thank you for your positive feedback and insightful comments! Please kindly find our response as follows:\n\n1, As in the generalized linear demand model $S(\\alpha p + x_t^\\top\\beta)$, the real-world motivations of assuming the price elasticity $\\alpha=x_t^{\\top}\\eta^*$ as contextual are mainly from the fact that different products have different price elasticities [Anderson et al. 1997], given how crucial they are for our daily life and work.\n\nThe assumption that $\\alpha=x_t^\\top\\eta^*>0$, i.e. a negative elasticity, is necessary for the monotonicity of a demand-price function, given that the link function $S(\\cdot)=1-F(\\cdot)$ is non-increasing. Stated as *the law of demand* [Gale, 1955] [Hildenbrand, 1983], that the quantity purchased varies inversely with price, is derived from the law of diminishing marginal utilities and has been widely accepted and used [Marshall, 2009].\n\nThe assumption that $\\exists C_{\\beta}>0$ as a positive constant such that $x_t^{\\top}\\eta>C_{\\beta}>0$ comes from the boundedness of the noise variance. Recall that an equivalent valuation model for our generalized linear demand is $y_t = \\frac1{x_t^\\top\\eta^*}\\cdot(x_t^\\top\\theta^*+N_t)$ where $N_t$ is an iid noise. Therefore, we know that $Var(y_t) = \\frac1{(x_t^\\top\\eta^*)^2}Var(N_t)$. Therefore, it is necessary to assume the existence of $C_{\\beta}$ in order to achieve a finite variance bound of $y_t$.\n\nWe will include our explanation above and add more details in the updated version.\n\n2, As for the generalization of our linear price elasticity model (i.e. $\\alpha=x_t^\\top\\eta^*$), we believe that our algorithm design and analysis are still applicable within a slight generalization from Euclidean space to *known* kernel spaces. As for the generalization from $x_t^\\top\\eta^*>0$ to $\\mathbb{E}[x_t^\\top\\eta^*]>0$ for stochastic setting, we do not think it is necessary given *the law of demand*, i.e. the necessity of assuming $x_t^\\top>0$ listed above as our response to your first question.\n\n3, We are actually motivated by real-world scenarios to consider a heteroscedastic setting where the price elasticity is feature-based. However, it is unfortunate that we are unable to have real-world evaluations of our algorithm, which requires either massive investments or confidential commercial-use data. On the one hand, a pricing algorithm cannot be fairly evaluated until being put into market. This is because customers’ valuations demand curves are never revealed precisely, causing a totally unknown demand on any not-proposed prices. Therefore, if an algorithm does not propose the historical price, then we cannot know how the demand would have been if this algorithm was applied. On the other hand, although big online retail companies could build up real-world demand simulators that are trained on historical sales records, we still have no access to either the simulator or the data as they are confidential. Besides, our contributions are mainly in theoretical aspects, and a real-world demand simulator is itself a challenging research topic that is out of the scope of this work.\n\n4, It’s a good catch that a log-log plot would better show the regret rate. In fact, our plots are indeed presented in log-log diagrams, and therefore a slope-$\\alpha$ line indicates an $O(T^{\\alpha})$ regret.To show the regret rate, we also plotted the linear asymptote of each regret curve. The curve of $\\frac12\\log T$ on a logT-diagram as you suggested should be a straight line with slope $0.5$ adding some constant. This idea is brilliant, but it is not necessary since we already have such asymptotes.\n\n\nReferences:\n\nMarshall, A. (2009). Principles of economics: unabridged eighth edition. Cosimo, Inc..\n\nAnderson, P. L., McLellan, R. D., Overton, J. P., & Wolfram, G. L. (1997). Price elasticity of demand. McKinac Center for Public Policy. Accessed October, 13(2).\n\nHildenbrand, W. (1983). On the\" law of Demand\". Econometrica: Journal of the Econometric Society, 997-1019.\n\nGale, D. (1955). The law of supply and demand. Mathematica scandinavica, 155-169."
                    }
                },
                "number": 3,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4003/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700301230493,
                "cdate": 1700301230493,
                "tmdate": 1700301230493,
                "mdate": 1700301230493,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "BPOPTf75MX",
            "forum": "zt8bb6vC4m",
            "replyto": "zt8bb6vC4m",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4003/Reviewer_vsAQ"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4003/Reviewer_vsAQ"
            ],
            "content": {
                "summary": {
                    "value": "The paper investigates a context-based dynamic pricing problem, where customers decide whether to purchase a product based on its features and price. The authors adopt a novel approach to formulating customers’ expected demand by incorporating feature-based price elasticity. The paper provides a matched regret bound for the problem."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "3 good"
                },
                "strengths": {
                    "value": "Generally speaking, from my point of view, the paper is well written. I really enjoy reading the discussions the authors make, including the relationship between two different formulations and Section 4.1.1. The technical part is solid. The idea of perturbation, though not completely novel, is quite interesting."
                },
                "weaknesses": {
                    "value": "1.\tIn my opinion, Ban and Keskin (2021) should be given more credits. As far as I know, Ban and Keskin (2021) is the first to consider the heterogenous price elasticities which are formulated to be linear with context. At least when introducing the formulation, I think the paper should be cited and discussed more.\n2.\tI understand that a known link function is a good starting point and a common practice. One direction that I think might further improve the paper is to consider (or at least discuss about) an unknown link function. The reason why I mention this point is that Fan et al. (2021) studies a problem with unknown noise distribution. According to equivalence of the two formulation, it seems that it is not undoable to consider a version without knowing the link function. \n3.\tAbout the Perturbation, similar ideas can be found in the dynamic pricing literature (see, e.g., Nambiar et al. 2019). From my perspective, the only reason why the time horizon $T$ should be known in advance is because we need it to calculate $\\Delta$. Nambiar et al. (2019) dynamically change the magnitude of the perturbation, which may potentially help the current algorithm to get rid of the known time horizon $T$. Please correct me if I am wrong.\n\nReference:\nGah-Yi Ban and N Bora Keskin. Personalized dynamic pricing with machine learning: High-dimensional features and heterogeneous elasticity. Management Science, 67(9):5549–5568, 2021.\n\nJianqing Fan, Yongyi Guo, and Mengxin Yu. Policy optimization using semiparametric models for dynamic pricing. arXiv preprint arXiv:2109.06368, 2021.\n\nMila Nambiar, David Simchi-Levi, and He Wang. Dynamic learning and pricing with model misspecification. Management Science, 65(11):4980-5000, 2019."
                },
                "questions": {
                    "value": "See above."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
                },
                "code_of_conduct": {
                    "value": "Yes"
                }
            },
            "number": 2,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4003/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698794304737,
            "cdate": 1698794304737,
            "tmdate": 1699636362256,
            "mdate": 1699636362256,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "BrkqLESraL",
                "forum": "zt8bb6vC4m",
                "replyto": "BPOPTf75MX",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4003/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4003/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Author Response to Reviewer vsAQ"
                    },
                    "comment": {
                        "value": "Thank you for your support to our work. We have received some similar comments from our previous submission to NeurIPS, and we have already addressed their concerns with certain updates in our current version. Specifically, we have:\n\n1,  We have attributed our model to Ban and Keskin (2021) who introduced the generalized linear demand model with heterogenous price elasticity (coefficient) for the first time, which well-motivates a feature-based heteroscedasticity and how it affects the price-demand relationship.  We also reduce a broadly adopted linear-valuation model to this generalized linear-demand model and show that they are equivalent.\n\nOur demand model is generally similar to theirs, but we generalize the demand model from two perspectives: (1) We assume the incoming feature sequence $[x_t]_{t=1}^T$ is adversarial while they assume iid series. (2) We assume a Boolean-censored demand while they assume an add-on iid noise on the demand. Those generalizations escalate the problem hardness substantially. As a result, their ILQX algorithm, which highly depends on the concentration of the empirical Fisher Information, shall not achieve $O(d\\sqrt{T}\\log T)$ in an adversarial (instead of iid) environment as we assume.\n\nCompared with our previous submission, we have added more in-depth discussion about Ban and Keskin (2021) in the current literature review. Please kindly see Sec 2.\n\n2, Thanks for your suggestions! Unfortunately, our algorithm is unable to be generalized to the online contextual pricing problem with linear valuation and unknown noise distribution that has been studied by Fan et al. (2023). Indeed, the problem becomes substantially harder when the noise distribution is unknown to the agent. Existing works usually adopt bandits or bandit-like algorithms to tackle that problem. For example, Fan et al. (2022) approaches it with a combination of exploration-first and kernel method (or equivalently, local polynomial), Luo et al. (2023) uses a UCB-styled algorithm, and Xu et al. (2022) adopts a discrete EXP-4 algorithm. However, none of them close the regret gap even under the *homoscedastic elasticity* environment as they assumed, and the known lower bound is at least $\\Omega(T^{\\frac23})$, or $\\Omega(T^{\\frac{m+1}{2m+1}})$ for smooth ones (Wang et al. 2021). On the other hand, we study a parametric model, and it is not quite suitable for a bandit algorithm to achieve optimality in regret. In a nutshell, these two problems (known vs unknown noise distributions), although seem similar to each other, are indeed substantially different.\n\nCompared with our previous submission, we have included a detailed discussion about this unknown link function setting. Please kindly refer to Appendix C.\n\nReferences:\n\nFan, Jianqing, Yongyi Guo, and Mengxin Yu. \"Policy optimization using semiparametric models for dynamic pricing.\" Journal of the American Statistical Association (2022): 1-29.\n\nLuo, Yiyun, Will Wei Sun, and Yufeng Liu. \"Distribution-free contextual dynamic pricing.\" Mathematics of Operations Research (2023).\n\nXu, Jianyu, and Yu-Xiang Wang. \"Towards agnostic feature-based dynamic pricing: Linear policies vs linear valuation with unknown noise.\" International Conference on Artificial Intelligence and Statistics. PMLR, 2022.\n\nWang, Yining, Boxiao Chen, and David Simchi-Levi. \"Multimodal dynamic pricing.\" Management Science 67.10 (2021): 6136-6152.\n\n\n3, Thanks for pointing out this work and their methods. Nambiar et al. (2019) studies a contextual pricing problem with *linear demand* and is different from ours by a link function $S$, and we have included more discussions on this stream of works in our updated literature review (see Sec 2). Actually the knowledge of $T$ is not a big issue. As we indicated on the footnote of Page 3, we may always play a “doubling-epoch trick” without knowing $T$ in advance, which is introduced by Javanmard and Nazerzadeh, (2019).  In specific, we divide the whole $T$ horizon into a series of *doubling epochs*, $T_1=2, T_2=4, \\ldots, T_K = 2^K$ with $K=\\log_2 T$.We do not need any knowledge to make this division. Then we play our PwP algorithm in each Epoch $k$ with its time horizon $T_k=2^k$, in each of which we do a cold start independently. Therefore, the total regret is still $\\tilde O(\\sum_{k=1}^{\\log_2 T}\\sqrt{dT_k})=\\tilde O(\\sqrt{dT})$. This indicates we may assume a known $T$ without loss of generality.\n\nWe have also corrected every typo and redundant description that we could find. Again many thanks for your detailed and professional comments! Would you please kindly consider raising the score if our updates have addressed your concerns?"
                    }
                },
                "number": 2,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4003/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700301165684,
                "cdate": 1700301165684,
                "tmdate": 1700642029935,
                "mdate": 1700642029935,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "7mtJnU5nyo",
                "forum": "zt8bb6vC4m",
                "replyto": "BrkqLESraL",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4003/Reviewer_vsAQ"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4003/Reviewer_vsAQ"
                ],
                "content": {
                    "comment": {
                        "value": "Thanks for all your efforts and clarifications. I really appreciated."
                    }
                },
                "number": 13,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4003/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700686475288,
                "cdate": 1700686475288,
                "tmdate": 1700686475288,
                "mdate": 1700686475288,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "8rE7Vjlke7",
            "forum": "zt8bb6vC4m",
            "replyto": "zt8bb6vC4m",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4003/Reviewer_g3du"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4003/Reviewer_g3du"
            ],
            "content": {
                "summary": {
                    "value": "This paper unifies the ``linear demand'' and the ``linear valuation'' by proposing a new demand model where each item has a feature-dependent price elasticity. The authors devise an effective online optimization algorithm that can achieve a nearly optimal regret bound. Some numerical simulations are conducted to empirically show the effectiveness of the proposed approach."
                },
                "soundness": {
                    "value": "3 good"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "S1. A new demand model for the contextual pricing problem.\n\nS2. The proposed algorithm has a regret bound close to the theoretical lower bound.\n\nS3. Numerical simulations are conducted."
                },
                "weaknesses": {
                    "value": "W1. Although the proposed demand model extends existing models by considering the feature-dependent price elasticity, the proposed model and online algorithm still rely on linear forms of elasticity and valuation. Remember ICLR is a deep learning conference. A potentially more suitable treatment may be substituting the linear functions with a neural tangent kernel and then devising online algorithms correspondingly.\n\nW2. What is the major technical challenge if we replace the uniform \\alpha with a feature-dependent price elasticity? The authors may want to discuss more the impact of introducing feature-dependent price elasticity terms on algorithm design as well as regret analysis. \n\nW3. As the authors mention in Ethic issues, personalized pricing may have fairness issues. Therefore, it is essential to discuss how to deal with the cases when we add some fairness regularization terms or fairness constraints to the optimization problem. \n\nW4. Still about personalized pricing. As the objective is purely the interest of the platform, I would like to see discussions or experimental results on how the personalized pricing algorithm affects customer well-being metrics such as consumer surplus."
                },
                "questions": {
                    "value": "W2"
                },
                "flag_for_ethics_review": {
                    "value": [
                        "Yes, Discrimination / bias / fairness concerns"
                    ]
                },
                "details_of_ethics_concerns": {
                    "value": "Please refer to W3 and W4."
                },
                "rating": {
                    "value": "6: marginally above the acceptance threshold"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission4003/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4003/Reviewer_g3du",
                        "ICLR.cc/2024/Conference/Submission4003/Senior_Area_Chairs"
                    ]
                }
            },
            "number": 3,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4003/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1698930603674,
            "cdate": 1698930603674,
            "tmdate": 1700722619651,
            "mdate": 1700722619651,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "RXbrVxoDeR",
                "forum": "zt8bb6vC4m",
                "replyto": "8rE7Vjlke7",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4003/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4003/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Authors Response to Reviewer g3du"
                    },
                    "comment": {
                        "value": "Thanks for your detailed feedback. We will first address the technical questions, and then get to the issue you raised about pricing fairness.\n\n> W1. \"ICLR is a deep learning conference\" \"replace linear with NTK\"\n\nWhile ICLR starts as a deep-learning focused conference, I believe it is now widely regarded as exchangeable with ICML and NeurIPS.  The topic list in the 2024 Call for Papers seems very inclusive and we believe our paper is within scope. The AC and SAC should confirm this?\n\nAs for replacing our model with a kernelized counterpart, it is potentially doable with techniques from Calandriello, Lazaric  & Valko, ICML'2017 on \"Second-order kernel online convex optimization with adaptive sketching\".    In short, we might be able to replace the dimension d in our regret bound with an effective dimension d_eff.  However, we emphasize that this extension would be complementary to our current work. The main new techniques that allowed us to solve the linear case would still be essential for the kernel case.  We will see if it is feasible to add this in the appendix (if it ends up being a straightforward extension). \n\n> W2. Q1. \"What makes replacing a fixed price elasticity $\\alpha$ by $x_t^\\top\\eta^*$ hard?\"\n\nIt actually makes learning optimal pricing policy substantially more challenging.  Note that in our setting $x_t$’s are adversarially chosen, this gives the adversary the ability to adversarially adjust the price coefficient $x_t^\\top\\eta^*$ which forces the learner to more actively \"explore\" --- hence our noise-adding procedure. In contrast, the simpler setting with an unknown but fixed alpha* still permits the same kind of implicit exploration that existing work leverages in their MLE-type methods.\n\nExisting works [e.g. Javanmard and Nazerzadeh, 2019] have studied this fixed-$\\alpha$ problem setting and proposed algorithms to tackle it. Some of them achieve $O(\\sqrt{T})$ regret under certain conditions, but none of them can achieve $O(\\sqrt{T})$ in our contextual-elasticity and adversarial input settings.\n\nBesides, we would like to kindly remind you that we are not intentionally *introducing* feature-dependent elasticity in algorithm design and analysis. Instead, they come from the problem setting where we consider different products should have different price elasticities, depending on their features. \n\nWe will include more discussions on the difference between our linear-contextual elasticity model and an unknown fixed elasticity model, in the aspects of motivations, formulations, techniques and analysis. \n\n\n\n> W3. \"fairness in personalized pricing\", \"fairness inducing regularization\"\n\n> W4. \"the objective is purely the interest of the platform\" \"how does personalized pricing affect buyer well-being\" \n\nWe agree these are important problems. However, our problem setting is *not* personalized pricing!  The context $x_t$ describes only the features of the product being sold and the same price is applied to any buyer.  This is clear in the motivating example for the whole line of work on \"feature-based dynamic pricing\" or \"contextual dynamic pricing\" started in Cohen et al. 2020, and Javanmard & Nazerzadeh, 2019. \n\nWe agree that our algorithm can be used for personalized pricing if $x_t$  includes features from user profiling --- that is why we are discussing this point in the first place in the paper, i.e., to warn against potential unethical applications. Also, this is not specific to our work but rather an issue of the entire body of research on contextual pricing. More fundamentally, every new technology has a potential risk of being abused. In our humble opinion, this should not be the reason why we stop research that pushes the scientific frontier. Specific to contextual pricing, our algorithm can certainly help improve market efficiency.\n\n\nReferences:\n\nAdel Javanmard and Hamid Nazerzadeh. Dynamic pricing in high-dimensions. The Journal of Machine Learning Research, 20(1):315–363, 2019.\n\nCohen, M. C., Elmachtoub, A. N., & Lei, X. (2022). Price discrimination with fairness constraints. Management Science, 68(12), 8536-8552."
                    }
                },
                "number": 4,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4003/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700301938642,
                "cdate": 1700301938642,
                "tmdate": 1700640833677,
                "mdate": 1700640833677,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "Cq5GgtH6c9",
                "forum": "zt8bb6vC4m",
                "replyto": "RXbrVxoDeR",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4003/Reviewer_g3du"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4003/Reviewer_g3du"
                ],
                "content": {
                    "comment": {
                        "value": "Thank you for the response and clarification. I have raised my score from 5 to 6."
                    }
                },
                "number": 14,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4003/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700722669081,
                "cdate": 1700722669081,
                "tmdate": 1700722669081,
                "mdate": 1700722669081,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    },
    {
        "review": {
            "id": "1EXSOhCnBq",
            "forum": "zt8bb6vC4m",
            "replyto": "zt8bb6vC4m",
            "signatures": [
                "ICLR.cc/2024/Conference/Submission4003/Reviewer_DP3X"
            ],
            "nonreaders": [],
            "readers": [
                "everyone"
            ],
            "writers": [
                "ICLR.cc/2024/Conference",
                "ICLR.cc/2024/Conference/Submission4003/Reviewer_DP3X"
            ],
            "content": {
                "summary": {
                    "value": "In this work, the authors face the problem of contextual dynamic pricing in a heteroscedastic environment. The authors face this applicative problem by proposing a new theoretical framework. They provide a lower bound on the expected regret for the setting. Then, the authors provide an algorithm, for which they discuss the upper bound, which matches the lower bound up to log factors. The authors also provide a numerical validation of the solution."
                },
                "soundness": {
                    "value": "2 fair"
                },
                "presentation": {
                    "value": "3 good"
                },
                "contribution": {
                    "value": "2 fair"
                },
                "strengths": {
                    "value": "The work faces a problem of interest from the applicative point of view. \n\nThe relevant literature is properly discussed."
                },
                "weaknesses": {
                    "value": "The presentation can be improved, in particular from the introductory part.\n\nThe main concern is about the theoretical analysis of this paper. Indeed, an important focus of this work is related to heteroscedasticity, which is its differential part w.r.t. existing literature. However, this phenomenon is not highlighted in the analysis. For example, in Thr 4.5, the authors retrieve a bound in which such a phenomenon is not highlighted, and the result presented is already present in the literature. Furthermore, the result presented is known for a setting that is simpler than the one presented in this paper, so it holds in this scenario."
                },
                "questions": {
                    "value": "See weaknesses."
                },
                "flag_for_ethics_review": {
                    "value": [
                        "No ethics review needed."
                    ]
                },
                "rating": {
                    "value": "3: reject, not good enough"
                },
                "confidence": {
                    "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
                },
                "code_of_conduct": {
                    "value": "Yes"
                },
                "first_time_reviewer": {
                    "value": "Yes",
                    "readers": [
                        "ICLR.cc/2024/Conference/Program_Chairs",
                        "ICLR.cc/2024/Conference/Submission4003/Senior_Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4003/Area_Chairs",
                        "ICLR.cc/2024/Conference/Submission4003/Reviewer_DP3X"
                    ]
                }
            },
            "number": 4,
            "invitations": [
                "ICLR.cc/2024/Conference/Submission4003/-/Official_Review",
                "ICLR.cc/2024/Conference/-/Edit"
            ],
            "domain": "ICLR.cc/2024/Conference",
            "tcdate": 1699005113456,
            "cdate": 1699005113456,
            "tmdate": 1699636362126,
            "mdate": 1699636362126,
            "license": "CC BY 4.0",
            "version": 2
        },
        "responses": [
            {
                "id": "MCLOoJ4xzJ",
                "forum": "zt8bb6vC4m",
                "replyto": "1EXSOhCnBq",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4003/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4003/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Could you provide more information about your main concern?"
                    },
                    "comment": {
                        "value": "Thanks for writing the review.  \n\nHowever, we find some of your comments a bit hard to parse. Do you mind providing more details on what you are referring to when you wrote: \n> \"this phenomenon (heteroscedasticity) is not highlighted in the analysis. \"\nand that\n> \"the authors retrieve a bound in which such a phenomenon is not highlighted, and the result presented is already present in the literature\"\n\nHeteroscedasticity is part of our problem setup, as discussed in the paragraph right after Eqn (2) on Page 2. Theorem 4.1 provides a guarantee for our algorithm that operates in the heteroscedastic environment and shows that it has no regret against an oracle who knows both the demand and the data-dependent noise distribution.  In that sense, we did show that our method is success for in a heteroscedastic environment, didn't we?\n\n> You wrote \"Furthermore, the result presented is known for a setting that is simpler than the one presented in this paper, so it holds in this scenario.\"\n\nWhich result are you referring to?  Could you share a reference so we can address your question concretely?"
                    }
                },
                "number": 1,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4003/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700203514292,
                "cdate": 1700203514292,
                "tmdate": 1700203514292,
                "mdate": 1700203514292,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "axTHmoAQEu",
                "forum": "zt8bb6vC4m",
                "replyto": "MCLOoJ4xzJ",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4003/Reviewer_DP3X"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4003/Reviewer_DP3X"
                ],
                "content": {
                    "comment": {
                        "value": "> Heteroscedasticity is part of our problem setup, as discussed in the paragraph right after Eqn (2) on Page 2. Theorem 4.1 provides a guarantee for our algorithm that operates in the heteroscedastic environment and shows that it has no regret against an oracle who knows both the demand and the data-dependent noise distribution. In that sense, we did show that our method is success for in a heteroscedastic environment, didn't we?\n\nYes, indeed the proposed algorithm is not among the concerns I raised in my review. My main concerns are related to the presentation, which should be improved in the introductory part (not clear in my opinion), and the way in which the theoretical analysis is conducted.\n\n> Which result are you referring to? Could you share a reference so we can address your question concretely?\n\nConsider the result of Thr 4.5. The theoretical analysis conducted is not formal, and cannot be verified properly given that several steps are missing. Moreover, do you agree that your setting is more complex than the one of linear bandits? If true, do you agree that the results you present is known?"
                    }
                },
                "number": 10,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4003/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700644338864,
                "cdate": 1700644338864,
                "tmdate": 1700644338864,
                "mdate": 1700644338864,
                "license": "CC BY 4.0",
                "version": 2
            },
            {
                "id": "37wsPxzOAB",
                "forum": "zt8bb6vC4m",
                "replyto": "1EXSOhCnBq",
                "signatures": [
                    "ICLR.cc/2024/Conference/Submission4003/Authors"
                ],
                "readers": [
                    "everyone"
                ],
                "writers": [
                    "ICLR.cc/2024/Conference",
                    "ICLR.cc/2024/Conference/Submission4003/Authors"
                ],
                "content": {
                    "title": {
                        "value": "Our main contribution is the algorithm"
                    },
                    "comment": {
                        "value": "We also would like to add that if you have a simple method to reduce linear bandits (or another problem class with known complexity) to our problem and replace our current stated lower bound, then we are happy to use that instead and drop our claim on any novel contribution about the lower bound.  As we explained in the last post, it might not be as easy as you thought.\n\nOur main contribution is to solve the problem optimally, i.e., to design an algorithm in a new problem setting with provable no-regret learning guarantees. The lower bound is a smaller contribution that we added to certify that the rate of our regret bound is optimal.\n\nNow thinking about it perhaps this was your point about how \n>“our lower bound does not highlight heteroscedasticity”.  \n\nIs what you were actually trying to say that:\n\n> “adding heteroscedasticity does not seem to increase the minimax regret, therefore the problem is not interesting from the theoretical point of view”?\n\n\nPlease allow us to argue for our theoretical contribution by the following table (which we could add to our introduction). \n\n|                    |Known $\\alpha$ | Unknown $\\alpha$ (i.i.d x) | Unknown $\\alpha$ (adversarial x) | Heteroscedastic  $\\alpha=x_t^T\\eta^*$ |\n|:--------------------:|:----------------:|:--------------------------:|:--------------------------------:|:---------------------------------------:|\n| Regret upper bound | $d \\log T$     | $\\sqrt{d T}$  |   $\\infty \\Rightarrow \\sqrt{dT}$ **(new)**          |  $\\infty \\Rightarrow \\sqrt{dT}$ **(new)**                 |\n| Regret lower bound | $d\\log T$       | $\\sqrt{T}$               | $\\sqrt{T}$                     | $\\sqrt{T} \\Rightarrow \\sqrt{dT}$ **(new)**                 |\n\nSo our theoretical contribution is to settle the problem for the column on the right by proving a new upper bound (and slightly improving the lower bound).  \n\nWhile the heteroscedastic case might not be *information-theoretically harder* than the homoscedastic case with unknown $\\alpha$, that doesn't mean that it is easy to construct an algorithm. To say it differently, our results imply that we can solve the harder problem with heteroscedasticity with the same asymptotic regret bound compared to an easier problem.  That is a good news, isn’t it?"
                    }
                },
                "number": 12,
                "invitations": [
                    "ICLR.cc/2024/Conference/Submission4003/-/Official_Comment"
                ],
                "domain": "ICLR.cc/2024/Conference",
                "tcdate": 1700682996687,
                "cdate": 1700682996687,
                "tmdate": 1700683059841,
                "mdate": 1700683059841,
                "license": "CC BY 4.0",
                "version": 2
            }
        ]
    }
]