[
    {
        "id": "bwhMLuIRJc",
        "original": null,
        "number": 1,
        "cdate": 1666558253946,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666558253946,
        "tmdate": 1666661779277,
        "tddate": null,
        "forum": "0xHVGIiYK2n",
        "replyto": "0xHVGIiYK2n",
        "invitation": "ICLR.cc/2023/Conference/Paper1348/-/Official_Review",
        "content": {
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "The paper studies a multiagent POMDP and proposes a communication mechanism for the agents to exchange information about their decision-making. In the process, the agents have the same objective, aiming to find a joint policy that maximizes their utility. The authors introduced a communication mechanism for the agents, which consists of a negotiation phase and a lauching pahse. In the negotiation phase, the agents communicate their observations, and in the lauching pahse, they communicate their decision-making. The latter is further implemented according to a hierarchical structure, where the agent at each level k send information to the agent at level k+1. The paper prents both theoretical results about the convergence of the agents' strategies to an equilibrium and empirical results about the performance of the proposed approach.",
            "strength_and_weaknesses": "Strengths: \n\nThe problem is well-motivated. The paper is overall clearly writen and well organized. The idea of introducing communication into the process is natural and the proposed approach of hierarchical communication is also novel and looks interesting.\n\nWeaknesses: \n\nThough the idea of hierarchical communication is interesting, it is unclear what are its advantages compared with letting one agent makes a centralized decision and broadcasting the decision (especially now that the agents' objectives are the same and their policy space is already broken down through factorization).",
            "clarity,_quality,_novelty_and_reproducibility": "The experiments are comprehensive and the results look sound and presented in sufficient detail and clarity. Experiment settings are described clearly. ",
            "summary_of_the_review": "In summary, a well presented paper with an interesting key idea and comprehensive results. Though the advantages of the proposed approach are a bit unclear compared with centralized decision-making (see Weaknesses) and require more justifications. ",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper1348/Reviewer_7QwV"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper1348/Reviewer_7QwV"
        ]
    },
    {
        "id": "N0BX5bYXqQx",
        "original": null,
        "number": 2,
        "cdate": 1666675768982,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666675768982,
        "tmdate": 1666679355363,
        "tddate": null,
        "forum": "0xHVGIiYK2n",
        "replyto": "0xHVGIiYK2n",
        "invitation": "ICLR.cc/2023/Conference/Paper1348/-/Official_Review",
        "content": {
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "The paper proposes a novel communication scheme, Sequential Communication (SeqComm), for cooperative multi-agent reinforcement learning (MARL).\nIn communication for cooperation in MARL, circular dependencies can sometimes occur. This is caused by synchronization in communication. The proposed model assumes asynchronous communication. The upper-level agents make decisions before the lower-level ones.\nThey, theoretically, show that policies learned by SeqComm are\nguaranteed to improve performance monotonically and converge. Also, the empirical performance is shown by comparing the proposal with other existing methods.",
            "strength_and_weaknesses": "Strength\n+ The theoretical proof is provided. \n+ The performance is empirically shown in the experiment.\n\nI think the title does not sufficiently represent this paper's main characteristics. \"Asynchronicity\" seems to be the keyword of the paper. ",
            "clarity,_quality,_novelty_and_reproducibility": "The paper's quality and clarity are satisfactory.\nThe theoretical proposal has a certain amount of novelty. \nInformation for implementation is provided to reproduce the experiment.",
            "summary_of_the_review": "The paper proposes a new communication method, SeqComm, for multi-agent reinforcement learning.\nThey provide not only empirical results but also theoretical proof as well. \nThe paper is properly written. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "details_of_ethics_concerns": "N/A",
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper1348/Reviewer_TanN"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper1348/Reviewer_TanN"
        ]
    },
    {
        "id": "37S6Z4sjRWD",
        "original": null,
        "number": 3,
        "cdate": 1666797357255,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666797357255,
        "tmdate": 1666797357255,
        "tddate": null,
        "forum": "0xHVGIiYK2n",
        "replyto": "0xHVGIiYK2n",
        "invitation": "ICLR.cc/2023/Conference/Paper1348/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "Authors present a sequential communication framework to address the relative overgeneralization problem in multi-agent reinforcement learning and test it against a number of communication-free and communication-based baselines. Performance figures drawn against the number of training steps show higher average rewards in the MPE and SMAC environments.",
            "strength_and_weaknesses": "Introducing sequential decision making may prove both a valuable and feasible approach to some MARL tasks.\n\nHowever, the domain on which the proposed algorithm would successfully operate seems largely exaggerated. The underlying game-theoretic construct of MARL tasks should most definitely considered as a given, and not as a control knob. Whether a game will play out sequentially or simultaneously is -- at least within the approach and scope of building a novel MARL algorithm -- the innate characteristic of the game and not a choice for the algorithm designer. SeqComm may function correctly in MARL tasks that naturally and inherently involve sequentiality, but such a demonstration is missing. This lack significantly undermines the applicability of the algorithm.\n\nEven if there is some justification as to the applicability of SeqComm on arbitrary MARL tasks, the performance gain comes at a huge cost of communicating n-1 rounds. Actual performance may deteriorate from this best case (n-1 rounds), as \"some agents are required to communicate intention values with others multiple times until the priority of decision-making is finally determined.\" Furthermore, each of those rounds involves Monte Carlo sampling. This means that every single tick in the x-axis (steps) actually involves, at best n-1 \"sub-steps\", each of which carries out Monte Carlo sampling. Since every figure in the paper is plotted against the number of training steps, not a single figure pictures a fair comparison between SeqComm and the baselines.\n\nMoreover, the paper needs a much better foundation in terms of its connection to game theory. Simultaneous games are prone to non-stationarity precisely because the players' information sets are limited. Making a distinction between the decision-making phase and the action execution phase does not change the fact SeqComm alters information sets. There is no discussion whatsoever in this regard (e.g., information sets, bounded rationality, non-stationarity), and SeqComm proceeds straight to interfere with the players' information sets, which are dictated by the nature of the game and not by the algorithm's working mechanism.",
            "clarity,_quality,_novelty_and_reproducibility": "Clarity\nIt is unclear how SeqComm would be applicable to arbitrary MARL tasks. Even if applicable, the performance gain must be normalized against the additional computation.\n\nQuality\nPlots against training steps are misleading. \"Miscoordination\" on page 6 is not defined, so its avoidance cannot be measured. The latency tolerance disclaimer on page 6 is unsupported. Improvements on SeqComm runtime on real-world communication technology (e.g., 5G) cannot be measured/claimed unless accompanied by training (wall clock) times in seconds.\n\nOriginality\nTo the best of my knowledge, SeqComm is a novel algorithm.",
            "summary_of_the_review": "Major concerns raised above render SeqComm borderline faulty. I find it unlikely that additional experiments, clarification, and/or proofs would make the paper suitable for this venue.",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper1348/Reviewer_44Uf"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper1348/Reviewer_44Uf"
        ]
    },
    {
        "id": "LxHdm5d5FU1",
        "original": null,
        "number": 4,
        "cdate": 1667066314850,
        "mdate": null,
        "ddate": null,
        "tcdate": 1667066314850,
        "tmdate": 1667066314850,
        "tddate": null,
        "forum": "0xHVGIiYK2n",
        "replyto": "0xHVGIiYK2n",
        "invitation": "ICLR.cc/2023/Conference/Paper1348/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "## Summary\nThe paper presents SeqComm, a multi-agent communication scheme allowing agents to condition on one another's actions by imposing ordering over the agents. The paper introduces multi-agent sequential decision and demonstrates that ordering in this paradigm can affect the optimality of the learnt policy. \n\nThe authors then present SeqComm. Each agent in SeqComm learns a policy which conditions on the joint hidden state and other agents' actions via an attention mechanism. The ordering is chosen by weighing the value of each agent's intention, which is the paper defines as the agent's future behaviour without considering the action of others. In the second phase of communication, the agents the produce a joint action. The authors then prove that monotonic improvement of the policy is independent of priority, and provide a bound on the performance loss associated with using a world model for the ordering.\n\nThe authors then evaluate SeqComm on MPE and SMAC tasks.",
            "strength_and_weaknesses": "## Strengths\n- The setting of adding some communication to CTDE is an interesting way to alleviate miscoordination and work in this area is welcome. \n- The paper is quite clearly written.\n- The authors include ablation studies to evaluate why their method works.\n- The matrix game in Figure 1 nicely illustrates why an order is theoretically useful. \n\n## Weaknesses\n\n- I'm not sure that I understand the setting. If agents can broadcast functions of their observations to all other agents, then how is that different from joint learning, where all agents can view the same joint observation? This seems to not be the CTDE setting at all to me, but instead joint learning. I understand that TarMAC [1] adopts a similar setting, but I would appreciate some clarification from the authors on how this differs from joint learning.\n- The communication-free baselines MAPPO and IPPO are not a fair comparison, and it is not clear that SeqComm's performance is better TarMAC or the random-priority ablation. The authors claim that their method clearly outperforms the ablations and TarMAC, but the gap is only slight and seems to be mostly within a standard deviation. \n- The authors do not compare with a centralised method such as PPO (but conditioning the policy on the joint observation and outputting the joint action). This seems strange given this is an obvious alternative to the method, and would require approximately the same communication.\n- The empirical evaluation is only over 4 SMAC maps, and no further results are included. This does not seem enough to provide convincing evidence of outperformance.",
            "clarity,_quality,_novelty_and_reproducibility": "## Clarity\n\nThe paper is fairly clearly written. I do not believe that the authors open-source their code, which makes reproducibility difficult. It is also not clear to me which implementation of the QMIX and MAPPO baselines is used or how hyperparameters were chosen for the baselines.",
            "summary_of_the_review": "Although some communication is no doubt useful in MARL, requiring that functions of the observation can be broadcast to all allies does not seem to be decentralised execution to me. Additionally, I remain unconvinced by the empirical results both in their breadth and performance difference. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper1348/Reviewer_emu3"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper1348/Reviewer_emu3"
        ]
    }
]