[
    {
        "id": "PYCLOV5TQj",
        "original": null,
        "number": 1,
        "cdate": 1666177742162,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666177742162,
        "tmdate": 1666177742162,
        "tddate": null,
        "forum": "7bvWopYY1H",
        "replyto": "7bvWopYY1H",
        "invitation": "ICLR.cc/2023/Conference/Paper650/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper aims to learn general-purpose location embeddings which are useful for downstream geospatial prediction tasks. The idea is to learn this representation by binning geographic entity occurrence data from OpenStreetMap (OSM) and applying a convolutional autoencoder with a special custom decoder head. The binning and convolution are done on a hexagonal grid. The proposed method (GeoVeX) is compared against two competing approaches to geospatial representation learning (Hex2Vec and Space2Vec) on two datasets. ",
            "strength_and_weaknesses": "# Strengths\n* Learning geospatial representations that generalize to many downstream tasks is an interesting and worthwhile goal. \n* The idea of autoencoding OSM data is a reasonable approach to geospatial representation learning.\n* The proposed ZIP head is novel to the best of my knowledge. \n\n# Weaknesses\n* A key claim of the paper is that it produces \"the first geospatial vectors trained on worldwide open data\" - this does not seem to be true as written. For instance, [mac2019presence] learns embeddings for each location on earth from freely available data from iNaturalist. See also [sheehan2019predicting], which represents locations using embeddings of nearby geo-located Wikipedia articles. \n* A key claim of the paper is that the proposed method learns \"task-agnostic global geospatial vectors.\" Are they task agnostic? It is not obvious to me that using OSM data makes it \"task agnostic\" automatically, since OSM contains a limited set of categories with a particular focus on certain land use / land cover categories. More broadly, if the claim is that the proposed method learns significantly more general features than prior methods, it would probably make sense to demonstrate this on more than two datasets. \n* A key claim of that paper is that it is \"the first use of hexagonal convolutions within autoencoder architectures.\" First, I would like to be convinced that this is significant by itself. Can't hexagonal convolutions can be used with any convolutional architecture? Is there a reason we wouldn't expect it to work for autoencoders? Second, it seems like [hahner2022mesh] may have done this first - please comment and clarify. \n* It's a bit tricky to interpret the results in Table 1 and Table 2 without more context. The magnitude of the performance differences between the methods seems small, and the ranking of methods seems to depend on the metric. Given this, it may be important to report average results across a few training runs (both the representation learning and the GBM) to determine whether we are observing robust performance differences or random fluctuations.\n* GeoVeX several components, including the use of hexagonal spatial units, the ZIP head, and special terms in the loss function, none of which are characterized with an ablation study. The relative importance of these components is therefore unclear. \n\nMinor comments:\n* The paper claims that a linear probe does not work well in this context because GBM does better than the linear probe when combined with the baseline features. But isn't this what we'd expect if the baseline features are not very good? We would expect linear regression to work better with more powerful features. \n* Why are GeoVeX features always combined with task-specific features (Figure 1)? Why not evaluate the utility of the features on their own for downstream tasks? \n* In the related work section, the paper notes that Space2Vec \"uses trigonometric functions with different frequencies to model a given position in space... However, the embeddings are not learnt based on the nearby geographical entities...\" - note that [mac2019presence] does both of those things, where the geographic entities are species observations. \n\n@inproceedings{sheehan2019predicting,\n  title={Predicting economic development using geolocated wikipedia articles},\n  author={Sheehan, Evan and Meng, Chenlin and Tan, Matthew and Uzkent, Burak and Jean, Neal and Burke, Marshall and Lobell, David and Ermon, Stefano},\n  booktitle={Proceedings of the 25th ACM SIGKDD international conference on knowledge discovery \\& data mining},\n  pages={2698--2706},\n  year={2019}\n}\n\n@inproceedings{mac2019presence,\n  title={Presence-only geographical priors for fine-grained image classification},\n  author={Mac Aodha, Oisin and Cole, Elijah and Perona, Pietro},\n  booktitle={Proceedings of the IEEE/CVF International Conference on Computer Vision},\n  pages={9596--9606},\n  year={2019}\n}\n\n@inproceedings{hahner2022mesh,\n  title={Mesh Convolutional Autoencoder for Semi-Regular Meshes of Different Sizes},\n  author={Hahner, Sara and Garcke, Jochen},\n  booktitle={Proceedings of the IEEE/CVF Winter Conference on Applications of Computer Vision},\n  pages={885--894},\n  year={2022}\n}",
            "clarity,_quality,_novelty_and_reproducibility": "# Clarity\n* The paper is generally well-written, with clear tables and figures. \n\n# Novelty\n* The proposed ZIP head for the decoder is novel to the best of my knowledge. \n* Some of the other novelty claims made by the paper are questionable - the details are provided in the \"Weaknesses\" section above. \n\n# Reproducibility\n* There is not sufficient information in the paper to reproduce the results e.g. hyperparameter settings, tuning procedures. The paper makes reference to an appendix, but it does not seem to be included. Since this paper is meant to demonstrate the superiority of the proposed method, is important to provide details about how all methods (especially competing methods) were trained and tuned. \n* How was the data split for the downstream tasks? Uniformly at random? \n* What is the embedding dimensionality for GeoVeX, Space2Vec, and Hex2Vec? If the dimensions are different, does this provide unfair advantages to some methods? \n",
            "summary_of_the_review": "This paper tackles an interesting problem and I enjoyed reading it. However, some of the (rather strong) claims made by the paper seem to be inadequately supported or incorrect. In addition, there are some important details missing (hyperparameters, tuning procedures, split construction) which makes it difficult to take the experimental results at face value. ",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper650/Reviewer_Fj26"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper650/Reviewer_Fj26"
        ]
    },
    {
        "id": "R9s5FI53gD8",
        "original": null,
        "number": 2,
        "cdate": 1666655133915,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666655133915,
        "tmdate": 1666655133915,
        "tddate": null,
        "forum": "7bvWopYY1H",
        "replyto": "7bvWopYY1H",
        "invitation": "ICLR.cc/2023/Conference/Paper650/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "Authors proposed GeoVEX as a framework for global representation learning in gespatial settings. The apprach leverages the H3 geospatial indexing system and data from Open Street Maps to create an embedding for each location on earth. An autoencoder like network architecture was introduced for the embedding generation which includes a novel hexagonal convolutional operation and adds a Zero-Inflated Poisson probabilistic output layer. The learnt representations were tested for the tasks of vacation rentals price prediction and temperature interpolation. ",
            "strength_and_weaknesses": "-- Strengths:\n- Approach is novel, technically sound, and relevant to many applications\n- Great potential impact\n- Article is well written and set in context\n\n-- Weaknesses:\n- Not enough evaluation was done to fully test the power of the learnt representations. Only two downstream tasks were tested without comparing performance to other strong approaches\n- Further ablation studies are needed to understand better the proposed approach. How important is the use of the ZIP output layer? What is the performance without it? How GeoVex would perform using other geographic systems?",
            "clarity,_quality,_novelty_and_reproducibility": "Please refer to the strengths and weaknesses section. Overall, the paper is well written and novel. ",
            "summary_of_the_review": "There is enough contribution for the paper to be accepted but it would be stronger with a better set of downstream task evaluations and comparisons to other approaches for those.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper650/Reviewer_pWwW"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper650/Reviewer_pWwW"
        ]
    },
    {
        "id": "70orfa6IGR",
        "original": null,
        "number": 3,
        "cdate": 1666858080426,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666858080426,
        "tmdate": 1666858080426,
        "tddate": null,
        "forum": "7bvWopYY1H",
        "replyto": "7bvWopYY1H",
        "invitation": "ICLR.cc/2023/Conference/Paper650/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "The author proposed to a new geo-encoding method called GeoVeX. The idea is to train an autoencoder on the OSM data projected to H3. Experiments show that GeoVeX outperforms baselines like Hex2Vec and Space2Vec.\n",
            "strength_and_weaknesses": "Strength\n- The paper is clearly written and experiments demonstrated GeoVeX's improvement.\n\nWeakness\n- The novelty of the paper is limited. The general idea (using OSM + H3) is very similar to the Hex2Vec paper.\n- The paper lacks ablation study on understanding why the proposed method work.\n",
            "clarity,_quality,_novelty_and_reproducibility": "3. Clarity, Quality, Novelty And Reproducibility\n\nClarity: The paper is clear\nQuality: The technical quality is sound\nNovelty: The novelty of the paper is very limited given the existence of Hex2Vec and Space2Vec.\nReproducibility: The author can provide more details in how they are training the mdoels in the Appendix.\n",
            "summary_of_the_review": "Vote for weak reject due to lack of novelty.\n",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper650/Reviewer_zeEd"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper650/Reviewer_zeEd"
        ]
    },
    {
        "id": "9hbAw6WO21s",
        "original": null,
        "number": 4,
        "cdate": 1666930067437,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666930067437,
        "tmdate": 1666930067437,
        "tddate": null,
        "forum": "7bvWopYY1H",
        "replyto": "7bvWopYY1H",
        "invitation": "ICLR.cc/2023/Conference/Paper650/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "The paper proposes to learn spatial embedding for coordinates based on H3 hexagons and convolutional autoencoders using the OSM’s tag data. ",
            "strength_and_weaknesses": "S1. The problem is important and using convolutional autoencoders in building global spatial embeddings seems to be novel.\n\nW1. The method is very similar to Hex2Vec (both based on hexagons and OSM data). The performance improvement in the experiments is also very marginal.\n\nW2. The scale effect is very important for spatial big data analysis. However, the current method only learns representation for a fixed scale of the spatial region (H3 hexagon), which may not be useful for practical spatial data analysis.\n\nW3. The evaluation is only conducted for US and Italy, which cannot well support the motivation that the learned embedding is for the whole earth.\n",
            "clarity,_quality,_novelty_and_reproducibility": "clarity: the paper's basic idea is clear\n\nnovelty: using a hexagon convolution encoder seems to be novel, but existing work has already used the same data for learning spatial embeddings and achieved similar performance (Hex2Vec).\n\nquality: more experiments on multi-scale/global spatial data analysis tasks are preferred.",
            "summary_of_the_review": "In brief, learning global spatial embedding is a valuable task. However, the currently proposed method and the used data lack significant contribution beyond existing work.",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper650/Reviewer_3Ztx"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper650/Reviewer_3Ztx"
        ]
    }
]