[
    {
        "id": "a---T-BWCg",
        "original": null,
        "number": 1,
        "cdate": 1666569855825,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666569855825,
        "tmdate": 1666569855825,
        "tddate": null,
        "forum": "7WiIzqeqBNL",
        "replyto": "7WiIzqeqBNL",
        "invitation": "ICLR.cc/2023/Conference/Paper2703/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "The authors proposed a new technique for multi-view blind source separation. The formulation involves a linear summation of a linear approximation of the blind sources from different views (Eq.(1)). The authors then derive a theorem to ensure the identity so that the source signal can be uniquely recovered from the set of mixed signals.\n",
            "strength_and_weaknesses": "Strengths:\n(1) The paper considers the theoretical aspects of multi-view blind source separation\n(2) The experiments have properly evaluated against its baselines and other state-of-the-art approaches\n\nWeaknesses:\n(3) The approach is very simplistic and lacks any novelty. The entire contribution can pretty much be summarized as Eq.(1) (followed with theoretical guarantees and optimization) which in my opinion does not meet the bar for publication at ICLR.\n",
            "clarity,_quality,_novelty_and_reproducibility": "(a) The problem of multi-view BSS has not been properly motivated in the introduction. The introduction only provides an introduction on what BSS is, but not the multi-view part.",
            "summary_of_the_review": "Overall, the paper has a well-evaluated experiment section. The writing of the paper is easy to follow as it is written in dot-point form. But this is non-standard for papers published at ICLR.\n\nI am very familiar with the field of multi-view learning and blind source separation, so I was able to follow the paper. However, I felt that readers who are less familiar with this area will be unable to follow the paper as the introduction (Section 1), Problem Formulation (Section 2), and the theorem in Section 3 are not well written.\n\nI have recommended rejecting the paper because of the combination of (i) clarity of the writing in both motivating the problem and formulating the problem, and (ii) the novelty proposed is incremental which can pretty much be summarized by Eq.(1)",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2703/Reviewer_Kgmf"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2703/Reviewer_Kgmf"
        ]
    },
    {
        "id": "GhyJPOuDi0",
        "original": null,
        "number": 2,
        "cdate": 1666621332466,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666621332466,
        "tmdate": 1666621398068,
        "tddate": null,
        "forum": "7WiIzqeqBNL",
        "replyto": "7WiIzqeqBNL",
        "invitation": "ICLR.cc/2023/Conference/Paper2703/-/Official_Review",
        "content": {
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully.",
            "summary_of_the_paper": "This paper considers the problem of ICA with multiple views, where the goal is to estimate independent sources shared by a group of subject. The originality of this work lies in the addition of individual sources: the data of each subject is a mixture of individual and shared sources, allowing for a more flexible model. The authors demonstrate the identifiability of the proposed model, and propose an algorithm to recover sources and mixing matrices. The authors finally validate their approach on synthetic and genomics problems.",
            "strength_and_weaknesses": "# Strengths\n- The authors consider a realistic and important problem: indeed, in practice the common assumption of group ICA  that all sources are shared is problematic, and assuming a mix of individual and shared sources is an elegant solution to this problem\n- While expected, the identifiability result provides a solid theoretical basis for the method\n- The proposed algorithm is sound, as it maximizes a likelihood under orthogonal constraint, as is classical in single subject ICA.\n- The experiments are convincing, and clearly show that the proposed algorithm is able to recover the sources, and brings something new on the table in practice.\n- The paper is very well written, it was a pleasure to read.\n\n# Weaknesses\n- The practical optimization method could probably be improved. Trivialization methods were originally developed for deep learning. Here using these methods destroys some of the nice structure of the problem. For instance we lose the Hessian structure that is used in [Ablin et al 18] and [Richard et al. 20] to get fast algorithms. I think that this is why the proposed method is slower than MultiviewICA (fig.3), while using a similar optimization technique as in [Richard et al. 20] should give a similar runtime.\n- The  authors do not release code for the peer review phase, which greatly hinders the reproducibility of this work",
            "clarity,_quality,_novelty_and_reproducibility": "# Quality\nThis paper is a pleasure to read, the results of the paper are correct, the model and methods are sound, and the empirical evaluation is convincing. This is a paper of high quality.\n\n# Clarity\nThis paper is clearly written\n\n# Novelty\nThe authors study a novel model that is interesting to the community.\n\n# Misc\n- In fig.3, I think that Infomax-O is rather Picard-O? If the authors use the picard package then this is definitely not infomax.\n- The fonts in the figures are sometimes too small - they should be of the same size as the text",
            "summary_of_the_review": "This is a solid paper: the authors study a new model that is relevant to the community, establish some theoretical results about it, and then provide a fast practical algorithm to maximize its likelihood. Finally, the empirical study is convincing. For me, this paper is worthy of acceptance.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "empirical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2703/Reviewer_8FCr"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2703/Reviewer_8FCr"
        ]
    },
    {
        "id": "dueYfh5ODj",
        "original": null,
        "number": 3,
        "cdate": 1666622646258,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666622646258,
        "tmdate": 1666622646258,
        "tddate": null,
        "forum": "7WiIzqeqBNL",
        "replyto": "7WiIzqeqBNL",
        "invitation": "ICLR.cc/2023/Conference/Paper2703/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "The authors extend ICA for multi-view settings, building on similar latent variable models that have been used for modelling correlations between multiple views. This paper extends the formulation for supporting non-gaussian latent distributions to enable identification of individual sources, following the standard ICA principles. The method is demonstrated to outperform competing methods in specific conditions, mostly when there are tens of views.",
            "strength_and_weaknesses": "Strengths:\n- The theoretical guarantee for identifiability for multi-view learning setups is a valuable contribution\n\nWeaknesses:\n- The motivation for multi-view BSS remains poor. The concert example is clearly artificial and the other examples (fMRI etc) are not explained well enough to understand why they correspond to multi-view BSS tasks. The linearity assumption is also poorly motivated, by merely stating that it holds in these applications. It is far from obvious for the reader why fMRI or biological datasets would exhibit prominently linear mixing.\n- Core method is poorly explained and seems to be fairly incremental",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is in general relatively well written and easy to understand, but remains on too high level of abstraction. The task itself is motivated by listing application domains, rather than explaining properly how they are best addressed as multi-view blind source separation problems, and the optimization algorithm is explained only by references to Lezcano-Casado's works and by introducing the notation for the problem formulation. A more formal treatment would be helpful. The technical sections also make the paper feel rather incremental -- every core element is explained by saying how it follows directly from a specific previous work, without really explaining why these choices were made; multi-view models for the basic structure, Richard et al. (2020) for the likelihood expression, and Lezcano-Casado et al. for optimization. The Supplement includes detailed derivation of the mathematical details and suggests that there may be non-trivial elements, but they are not properly communicated in the main paper. Finally, the identifiability proof (which is probably the most interesting result) builds on standard results of Comon (1994) and Davies (2004).\n\nThe main problem of the work is that the problem setup itself is poorly motivated. As someone who was worked on MRI data, ICA and multi-view setups I can imagine there are indeed ways of representing MRI data analysis tasks as multi-view BSS problems, but I feel that I would have no hope of understanding the main motivations of this work without having this personal background. For instance, I could not accept the validity of the linearity assumption if not knowing how MRI works and what it measures. Most importantly, however, I do not think you ever give a proper justification on why we should be interested in the specific problem formulation in Section 2. You provide a technical definition and you provide high-level motivation of multi-view settings being interesting in general, but it feels like you are not really verbalising the need for these methods in the context of ICA/BSS.\n\nThe empirical experiments are reasonably carried out, but the results do not stand out as strong enough to override the somewhat weak presentation and incremental contribution. It seems that the proposed method works very well on artificial data with high (tens) number of views, but since the paper does not provide good examples of tasks that need this the result remains weak. The transcriptome data, in turn, is a not very easy to understand for typical ICLR readers and while it serves as a nice demonstration it does not add much value.\n",
            "summary_of_the_review": "Technically okay paper that suffers from presentation issues (lack of transparent motivation, algorithmic details on very high level) and incremental contribution. I do not see potential for high impact because the need for the problem remains vague. Empirical experiments are reasonable, but not strong enough to overcome the other problems.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2703/Reviewer_g5xN"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2703/Reviewer_g5xN"
        ]
    },
    {
        "id": "6tK0m1rCawQ",
        "original": null,
        "number": 4,
        "cdate": 1667583939395,
        "mdate": null,
        "ddate": null,
        "tcdate": 1667583939395,
        "tmdate": 1667583939395,
        "tddate": null,
        "forum": "7WiIzqeqBNL",
        "replyto": "7WiIzqeqBNL",
        "invitation": "ICLR.cc/2023/Conference/Paper2703/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper studies the problem of multiview linear independent component analysis. The identifiability is analyzed and a constrained joint log-likelihood-based formulation is provided. Experiment results are obtained on real data for a source separation task.",
            "strength_and_weaknesses": "Strength: ICA is a fundamental and important problem, the identifiability of which is also of great importance.\n\nWeakness: \n\n1. the submission focus on the linear case, which limits the applicability of the proposed approach, but I can understand that \n2. justification for assumptions are not sufficient\n3. experimental results are not sufficient",
            "clarity,_quality,_novelty_and_reproducibility": "1. Justifications of the assumptions need to be clarified. There are 4 assumptions for the proof, but only one of them has a reference. It is necessary to provide some justifications for the assumptions to show how this suits real-world applications.\n\n2. The reviewer finds the clarity of the paper should be improved: the objective function needs to be motivated instead of just claiming \"applying similar derivations as in Richard et al. (2020)\" to be self-explanatory\n\n3. The reviewer finds many justifications and derivations are following Richard et al. (2020), while the reviewer understands the problem setting is slightly different, more clarification and discussion is needed about the novelty and specific challenge of the present paper\n\n3. The experiments should be improved. For example, Figure 5 is hard to read and to understand with so many lines with same line type and similar colors.",
            "summary_of_the_review": "Overall, the reviewer finds the paper studies an important problem, but the experiments need to be improved, and novelty and challenges should be clarified",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2703/Reviewer_vDv7"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2703/Reviewer_vDv7"
        ]
    }
]