[
    {
        "id": "nqzBBm8eMn",
        "original": null,
        "number": 1,
        "cdate": 1666491977330,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666491977330,
        "tmdate": 1666491977330,
        "tddate": null,
        "forum": "C0q9oBc3n4",
        "replyto": "C0q9oBc3n4",
        "invitation": "ICLR.cc/2023/Conference/Paper3127/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "The authors propose a Windowed Feature Importance in Time\n(WinIT) method for explaining time series predictions. They have also investigated the evaluation approaches with different complementary masking strategies. Experiments have been conducted to show the proposed approach performs well in synthetics and real-world data sets.\n",
            "strength_and_weaknesses": "S1: The paper proposes a method for solving the challenges in explaining time series predictions. \n\nS2: The paper is well structured and easy to follow.\n\nS3: Experiments are comprehensive.\n\n\nW1: The proposed method looks incremental. The measure of feature importance at a time step follows the measure of Tonekaboni et al. (2020) by extending it to prediction difference and Jensen Shannon divergence.\n\nW2: The algorithm needs more justifications. The reason for the average over a window of size N is unclear to me. The window size N introduces another parameter to tune. Also, the definition of $i(S)^b_a$ needs more justifications. “We formulate the importance in Eq. 1 as a difference due to the time series nature of the data” is not clear enough to explain the intuition. Figure 1b has not been explained in the text. What does exactly $i(S)^b_a$ mean? Is a large (or small) value of $i(S)^b_a$ preferred? Without these explanations, Figure 2 is not easy to understand.  Furthermore, the predictions of time series with the information being masked should be presented. It is confusing that the predictions in all three cases (a) (b) and (c) are the same (the right hand sides before and after the minus symbol '-'). I wonder why $i(S)^b_a$s are different in the three cases when the predictions before and after masking are the same. \n\nW3: The example of Figure 1 is too simple to show teh usefulness of the proposed method.  In Figure 1,  Y is determined by a single signal. Many time series predictions are determined by patterns (multiple signals). There needs an example to show that the proposed importance measure can handle pattern signals to convince readers that EinIt is useful for real world applications.\n\nW4: In Figure 4, the AUC drops and Prediction changes are quite inconsistent. Can authors provide some explanations?\n",
            "clarity,_quality,_novelty_and_reproducibility": "Clarity: Good. The paper is well organised and easy to follow. However, there need more justifications for the proposed measure. \nQuality: I have not spotted a flaw.\nNovelty: The idea is incremental. \nReproducibility: Most details are provided for reproducibility.\n\n",
            "summary_of_the_review": "It is a technically solid paper. The clarity of the proposed measure can be further improved. Without the explanations, it is difficult to judge the empirical impact of the methods for dealing with the pattern signals.\n",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper3127/Reviewer_CWz4"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper3127/Reviewer_CWz4"
        ]
    },
    {
        "id": "AM0l8JfGCEH",
        "original": null,
        "number": 2,
        "cdate": 1666597149458,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666597149458,
        "tmdate": 1666597149458,
        "tddate": null,
        "forum": "C0q9oBc3n4",
        "replyto": "C0q9oBc3n4",
        "invitation": "ICLR.cc/2023/Conference/Paper3127/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper provides a new method, WinIT, for interpreting predictions of multivariate time series. It provides an importance score for each feature in a multivariate time series according to explainability, considering the dependencies of features between time steps and variation in feature importance over time. The method considers differences between consecutive time points and measures importance over multiple time steps to quantify temporal variation in importance. The novelty is in combining these two aspects in the importance score. Analyses on synthetic and real data sets are used to demonstrate advantages and consistency compared to currently available alternatives and assess model evaluation.",
            "strength_and_weaknesses": "Strengths:\n+ Addresses a relevant and timely issue of improving interpretability of machine learning techniques \n+ Comprehensive set of evaluation approaches\n+ The method shows clearly improved performance over alternatives\n\nWeaknesses:\n- Fixed window size is a potentially weak spot in the algorithm design as it will require heuristic window size selection schemes\n- LImitations and weaknesses of the method could be addressed in more detail as these are relevant for any subsequent application\n- Publicly available implementation does not appear to be available, limiting the practical utility.",
            "clarity,_quality,_novelty_and_reproducibility": "The reporting is clear and good quality, the proposed approach is new, and the relevant literature has been properly and comprehensively cited. I did not find any mention of data and code availability, which may pose a severe bottleneck for reproducibility.",
            "summary_of_the_review": "Overall, this is am interesting and well documented contribution on a timely topic. Reproducibility of the work is a key limitation. ",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper3127/Reviewer_4Fvg"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper3127/Reviewer_4Fvg"
        ]
    },
    {
        "id": "beIZjKI6bWI",
        "original": null,
        "number": 3,
        "cdate": 1666694378246,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666694378246,
        "tmdate": 1666694378246,
        "tddate": null,
        "forum": "C0q9oBc3n4",
        "replyto": "C0q9oBc3n4",
        "invitation": "ICLR.cc/2023/Conference/Paper3127/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper introduces a new explainability framework for multi-variate time series data. This new explainability framework is a feature removal model. The authors motivate their approach by the fact that the observation of same feature over subsequent time steps is not independent and that feature can have varying level of importance to the model prediction over time. Using extensive experimental study, the authors show that the proposed method is superior to the existing explainability models for time series data.",
            "strength_and_weaknesses": "Strengths:\n1-\tAddresses a very important problem\n2-\tNovelty\n3-\tExtensive experimental study\n\nWeakness:\n1-\tNotation could be improved\n2-\tAt places, it is difficult to follow the text.\n",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is very novel, to the best of my knowledge. It is also relative clear even though at places, it can be improved. ",
            "summary_of_the_review": "This paper addresses the practically important problem of explainability of black box classifiers for time series data. The authors introduce a novel framework that calculates the feature importance as the difference of the importance over multiple time steps and aggregates\nthe importance of each observation over a window of predictions. The authors also a generative approach for the feature removal, which is interesting. The authors also provide extensive experimental studies to support that the new framework works better than the existing explainability approaches for time series data. Overall, this is a good paper. ",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper3127/Reviewer_vrY7"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper3127/Reviewer_vrY7"
        ]
    }
]