[
    {
        "id": "ySNm41h5kIC",
        "original": null,
        "number": 1,
        "cdate": 1666613280763,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666613280763,
        "tmdate": 1666613280763,
        "tddate": null,
        "forum": "hxUwnEGxW87",
        "replyto": "hxUwnEGxW87",
        "invitation": "ICLR.cc/2023/Conference/Paper4099/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "The paper tackles the general problem of synthetic data estimation under differential privacy (DP). Specifically, the authors prove upper and lower bounds on DP estimation of PrivBayes, a marginal-based Bayesian network synthetic data generation method. More specifically, the authors prove upper-bounds on the total variation and L2 distance between the estimated distribution and the true distribution under the assumption that the raw data is generated from a graph with causal edges and bounded number of parent nodes for each node. The authors also show utility upper bounds, as well as total variation lower bounds.",
            "strength_and_weaknesses": "Strengths\n- The paper tackles an interesting problem, synthetic data generation under differential privacy\n- The paper is clearly written and relatively straightforward to follow\n- The bounds provide an interesting picture on the dependency to various factors (size of training data n, dimension d, 'breadth' of the model k, budget epsilon, etc.)\n\nWeaknesses\n- the upper bound seems rather loose. For example, theorem 4.1 depends exponentially on k. If we plug n=40k, d=40 and epsilon=10 which are generarous estimates, we get 12 d^2/(n*epsilon) ~ 0.05 so with k=3 the bounds becomes vacuous (and that's without looking at the log factor). ",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is clear and well-written. To the best of my knowledge, this statistical analysis of PrivBayes is new.",
            "summary_of_the_review": "Overall I think the paper provides interesting bounds on a classical mechanism for synthetic data generation, PrivBayes. I am a bit on the fence for a general recommendation as I am not 100% familiar with the synthetic data literature but I lean towards borderline+.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper4099/Reviewer_BqvB"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper4099/Reviewer_BqvB"
        ]
    },
    {
        "id": "45EL5OsTgw",
        "original": null,
        "number": 2,
        "cdate": 1666647358921,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666647358921,
        "tmdate": 1669001669296,
        "tddate": null,
        "forum": "hxUwnEGxW87",
        "replyto": "hxUwnEGxW87",
        "invitation": "ICLR.cc/2023/Conference/Paper4099/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "\nAuthors consider the case where the synthetic data distribution can be represented by a Bayesian network, while the raw data distribution is approximated by a collection of low-dimensional marginals. Differential privacy (DP) is guaranteed by introducing random noise to each low-dimensional marginal distribution. Authors study DP data synthesis algorithms based on Bayesian networks (BN) from a statistical perspective. \n",
            "strength_and_weaknesses": "Strengths:\n\n\nAuthors have a good grasp of some of the challenges of differentially private computations in the context of the paper. The paper is generally well-written. The framework of using a BN for distribution representation is sensible n many applications, hence there is merit to the problem under study. \n\n\nWeakness:\n\nThe paper only focuses on Boolean data. There is an aside claim that it can be generalized to any categorical data with finite support, but this extension is not clear from the paper. Also, it does not seem that the main steps would extend easily without considerable problems related to scaling of the computations. It is not clear to me whether the BN is estimated from the data, or is considered known. If it is estimated from the data, is the estimation algorithm differentially private? \n",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is clearly written, the quality of the empirical work seems fine but there is a lack of adequate theoretical developments. The algorithm may have some elements of novelty, and the results look reproducible.\n",
            "summary_of_the_review": "Restriction to just Boolean data is a major limitation. Other than that, there are positive points about this paper. \n\n\nRevised report: I had given a score of 5 (marginally below acceptance) initially.  Given the clear answers provided by the authors, especially to the main question I had, i am happy to change my recommendation and now recommend acceptance.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper4099/Reviewer_mQvM"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper4099/Reviewer_mQvM"
        ]
    },
    {
        "id": "KCjdIEQaoA",
        "original": null,
        "number": 3,
        "cdate": 1666691346083,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666691346083,
        "tmdate": 1666691346083,
        "tddate": null,
        "forum": "hxUwnEGxW87",
        "replyto": "hxUwnEGxW87",
        "invitation": "ICLR.cc/2023/Conference/Paper4099/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper analyzes the accuracy of PrivBayes by giving upper bounds on the distances between real and synthetic data and on utility errors of synthetic data from downstream supervised learning tasks.  The authors also proved the lower bound for total variation distance for \\epsilon-DP synthetic data generator.",
            "strength_and_weaknesses": "The authors derived three novel bounds which has not been carefully studied before. I found the proofs are compelling and the well-conveyed. The authors deliver the proofs clearly and they bound the utility errors by neatly splitting the errors into several parts.\n\nHowever, the authors only derived new bounds under total variation distance and L^2 distance. Perhaps more statistical distances should be employed to evaluate the synthetic data for higher completeness of the paper.\n\n",
            "clarity,_quality,_novelty_and_reproducibility": "Yes",
            "summary_of_the_review": "In general, the findings are interesting, and the work is well-supported and well-organized. Although the results leave rooms for further improvement, I would recommend this paper to be accepted.\n\n",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper4099/Reviewer_sYaP"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper4099/Reviewer_sYaP"
        ]
    },
    {
        "id": "7EmMmsQuM72",
        "original": null,
        "number": 4,
        "cdate": 1667559207518,
        "mdate": null,
        "ddate": null,
        "tcdate": 1667559207518,
        "tmdate": 1667559207518,
        "tddate": null,
        "forum": "hxUwnEGxW87",
        "replyto": "hxUwnEGxW87",
        "invitation": "ICLR.cc/2023/Conference/Paper4099/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "The paper studies the problem of Bayesian structure based synthetic data generation and its theoretical guarantees with respect to (probability) distance from the real data. Also, lower bounds for the TV distances between the two distributions is provided and differ by a factor of dimension d. ",
            "strength_and_weaknesses": "Pros:\n     (A) Establishes the quality of the synthetic datasets by providing concrete distance upper-bounds on the generated datasets which are O(d^2 2^k/n) ignoring log factors and setting epsilon to 1. Similarly, utility of the datasets is provided for the downstream tasks. \n     (B) Lower bounds are also provided for the hypercube setting and is O(d/n). The suboptimality arises due to the composition component of DP. \nCons:\n\n   (i) While the theoretical guarantees that are shown in the paper are nice, it is not clear how tight they are? For typical values of k, d and n the values seem\nto be way larger than 1 and not entirely useful?\n\n   (ii) Experiments showing the tightness of the lower and upper bounds on real-world datasets would have been helpful in understanding the strengths and limitations of the theory. \n",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is pretty clear on its contributions with proof sketches for the main results sprinkled throughout the main body. The problem setting is well motivated and the novelty is in deriving rigorous guarantees.  \n",
            "summary_of_the_review": "Overall, the paper studies an important problem setting by providing rigorous theoretical guarantees for synthetic data generation. I have some questions which I hope to discuss with the authors.  ",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper4099/Reviewer_PzT1"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper4099/Reviewer_PzT1"
        ]
    }
]