[
    {
        "id": "gekRNiaVTp",
        "original": null,
        "number": 1,
        "cdate": 1666419576955,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666419576955,
        "tmdate": 1666971924111,
        "tddate": null,
        "forum": "ICYasJBlZNs",
        "replyto": "ICYasJBlZNs",
        "invitation": "ICLR.cc/2023/Conference/Paper1024/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This paper proposes a graph variational Bayesian causal inference framework to predict a cell's gene expression under counterfactual perturbations, gene regulatory networks were used to aid the individualized cellular response predictions. A robust estimator for the asymptotically efficient estimation of the marginal perturbation effect was also proposed. Empirical studies showed its superiority over state-of-the-art methods.",
            "strength_and_weaknesses": "Strengths: 1. Paper is well written and easy to follow.\n                  2. The idea of combining graph representation learning with variational bayesian causal inference is interesting, and the method is sound.\n\nWeaknesses: 1. The performance is not significant compared to other competing methods in Table 1.\n                       2. There is no model complexity study.",
            "clarity,_quality,_novelty_and_reproducibility": "See above.",
            "summary_of_the_review": "Overall, I like the idea of this paper, and it seems theoretically sound. My only concern is the performance compared to other methods is not significant, and it lacks model complexity study, so I don't know whether the performance of the model outweighs its computational cost.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper1024/Reviewer_TW7F"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper1024/Reviewer_TW7F"
        ]
    },
    {
        "id": "BbLEW7P-Qz",
        "original": null,
        "number": 2,
        "cdate": 1666521196909,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666521196909,
        "tmdate": 1666521196909,
        "tddate": null,
        "forum": "ICYasJBlZNs",
        "replyto": "ICYasJBlZNs",
        "invitation": "ICLR.cc/2023/Conference/Paper1024/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "In this paper, the authors proposed a Graph Variational Causal Inference (GraphVCI) network to estimate gene response under perturbations.\nTo this end, the component of (hypothetical) counterfactual perturbations is integrated into the GraphVCI network to assist the reconstruction training of the proposed Graph autoencoder.  On three commonly used datasets and a soon-to-be open-sourced dataset, the proposed model demonstrated clear improvement compared to several baselines. ",
            "strength_and_weaknesses": "Strength: Overall, the paper delivers clear explanations regarding 1. the motivation for cell response under different perturbations, 2. model architectures 3. experimental results discussions. To validate the proposed GraphVCI method, the authors run experiments on several publicly available datasets, which I consider the main experiments are thorough. Besides, the codes are supplemented in the submission, this can help or guide interested readers to reproduce the results. \n\nWeakness: I think the ablation studies such as excluding the counterfactual-related losses and features should be performed in the paper,\nthis can disentangle the contributions that come from different network components. Second, I don't know why the predicted distributional shift presented in Figure 5 matches the true shift, and I feel that they look quite different from each other. Could the authors explain this to me? In the end, the authors introduced 'the causal relation diagram' in Figure 1. I think it would be important to compare it with the standard causal graph definition such as the structural causal model (SCM). ",
            "clarity,_quality,_novelty_and_reproducibility": "The clarity and quality of the paper are good. It seems to me that interested readers can reproduce the paper with supplemented codes.\n",
            "summary_of_the_review": "Overall, I think this is an interesting paper that brings some new insights to the analysis of the cell responses to different perturbations, which can potentially achieve a good impact on the ML for the biology community.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper1024/Reviewer_qD32"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper1024/Reviewer_qD32"
        ]
    },
    {
        "id": "ST3ikjI3QjE",
        "original": null,
        "number": 3,
        "cdate": 1666553084011,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666553084011,
        "tmdate": 1666553084011,
        "tddate": null,
        "forum": "ICYasJBlZNs",
        "replyto": "ICYasJBlZNs",
        "invitation": "ICLR.cc/2023/Conference/Paper1024/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "The authors aim to tackle the problem of predicting the effect on gene expression of cellular perturbations such as gene knock-out. The authors build upon Variational Causal Inference (Wu et al 2022b). VCI takes as input a set of features X, given treatment T (e,g, drug treatment or knockout of a particular gene) and outcome Y (RNA-seq following treatment). It aims to predict, for some alternative treatment T', the corresponding outcome Y'. The authors extend VCI by additionally taking as input a gene regulatory network (GCN). The authors evaluate the method by holding out several perturbations for a particular cell type and using their method to predict the held-out values. ",
            "strength_and_weaknesses": "Overall, the paper is strong. The text and figures are understandable. The results have significance both in terms of methodology and application. The experimental results are good.\n\nNovelty is moderate because most of the paper is an extension of (Wu et al 2022b). However, the addition of the GCN to VCI is novel.\n\nThere is no description of how the authors go from experimental RNA-seq data to values of X and Y, including in Appendix C, which explains some other parts of the experiments. In particular, I couldn't figure out what X is for their experiments. I think they followed (Lotfollahi et al 2021a) in this, but it was hard to figure out what the authors of this paper did even when examining Lotfollahi et al 2021a. My best guess is that X is a discrete indicator of cell type.\n\nThe setup is rather specific to the application to RNA-seq because it requires that each individual has an information-rich outcome. It doesn't seem obvious that the same setup would work in a setting such as clinical drug response, where each individual has information-rich features but simple outcomes (e.g. symptoms resolved or not resolved). \n\nIt is unclear whether the revised GCN produced by the method of Sec 2.3 is improved according to the desirable criteria for GCNs. There are many existing methods for producing GCNs, so it would be helpful to argue if this improvement method is a better approach for producing a GCN in general, or if it is a preprocessing step useful only for input to a NN method like this. ",
            "clarity,_quality,_novelty_and_reproducibility": "See above.",
            "summary_of_the_review": "See above.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper1024/Reviewer_FrCx"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper1024/Reviewer_FrCx"
        ]
    },
    {
        "id": "WwktdWz2Hs",
        "original": null,
        "number": 4,
        "cdate": 1667107538936,
        "mdate": null,
        "ddate": null,
        "tcdate": 1667107538936,
        "tmdate": 1667107538936,
        "tddate": null,
        "forum": "ICYasJBlZNs",
        "replyto": "ICYasJBlZNs",
        "invitation": "ICLR.cc/2023/Conference/Paper1024/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "The authors propose a novel variational causal inference model for constructing the gene expression counts in cells after counterfactual perturbations that relies on information from two sources: individual features embedded in the outcome Y, and response distributions of similar individuals that did indeed receive the treatment. The method is aided by an additional method for updating the connections of the GRN prior to model training. The authors compare this method to known methods and find that theirs produces state-of-the-art R^2 in out-of-distribution predictions.",
            "strength_and_weaknesses": "Strengths:\n- Novel methods leading to state-of-the-art results compared with other models trained for generating individual counterfactual outcomes\n- Paced introduction to help understand the method\n- Excellent figures and legends\n- Makes use of GRNs in novel way\n- Introduces new CROP-seq dataset\n\nWeaknesses:\n- Contains a lot of complex notation and indices, some of which is not intuitive (e.g., indices of graph latents)\n- It is not clear that the manner in which the GRN is incorporated is necessary, and it is reasonable to expect that a simpler approach could yield equivalent results.\n- In Figure 5, the predicted distributions do not often look like the ground-truth distributions. Moreover, many of the ground-truth distributions look like control distributions, and so would be difficult to distinguish from the background anyway.",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is written clearly, though it would benefit from providing even more background on causal inference pertinent to the problem at hand, e.g. differences between individuals and levels. It appears to be both of high-quality and the particular variational formulation is novel.",
            "summary_of_the_review": "The authors do a good job of motivating the variational causal inference formulation, but not the particulars of the graph latents. While some of the results show clear superiority over existing methods, there are overlapping error bars in Table 1, and Figure 5 seems not to show what is claimed. Clarifying these, as well as better motivating why the particular method for generating graph latents, would make this a stronger paper.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper1024/Reviewer_kcXz"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper1024/Reviewer_kcXz"
        ]
    }
]