[
    {
        "id": "SQExV0gEmKA",
        "original": null,
        "number": 1,
        "cdate": 1666639424810,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666639424810,
        "tmdate": 1666639424810,
        "tddate": null,
        "forum": "JmC_Tld3v-f",
        "replyto": "JmC_Tld3v-f",
        "invitation": "ICLR.cc/2023/Conference/Paper6236/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper gives new methods for privacy loss accounting in differentially private (DP) algorithms, and illustrates the improvements of its methods over prior work through experimental results. The experiments are mainly performed via the case of running private gradient descent (DP-GD) in various learning tasks. As the paper lists in Section 1.1, it contains four main contributions.\n1. Analysis of fully adaptive compositions of DP mechanisms using Gaussian differential privacy (GDP), which in turn gives tight $(\\varepsilon, \\delta)$ bounds for compositions of Gaussian mechanisms.\n2. Using the idea of dominating pairs of distributions and the Blackwell Theorem, they provide an approximative $(\\varepsilon, \\delta)$ accountant, which frequently leads to better $\\varepsilon$ bounds than the traditional Renyi differential privacy (RDP) accountants.\n3. It provides efficient numerical techniques to account for individual privacy parameters using privacy loss distributions (PLD's) and and FFT, which improves on the running time of existing accountants.\n4. It gives experimental results to show the improvements in privacy accounting over RDP for both the aforementioned methods. It also observes that a result of individual filtering is that it leads to disparate loss in accuracies among subgroups while training using a neural network via DP-GD.",
            "strength_and_weaknesses": "Strengths:\n1. The paper is well-written, with the flow and the preliminary ideas being easy to follow. The definitions and the ideas are explained quite nicely, along with supporting examples at different places. I also like the idea of keeping the appendix within the same document because for me, personally, it makes it easier to read.\n2. The ideas are backed by rigorous proofs, which seem believable to me. So, the paper appears strong enough to me mathematically.\n3. The experiments support the claims, too, as the improvements over the usual RDP accountants are clearly visible.\n4. On a high level, I think this does seem to be an important problem to work on because of the existing gap between deployable DP systems and the theoretical foundations. Of course, more progress has been made, especially in the last few years to invent more practical algorithms for various applications, but tighter accounting is a great step here. It feels like a significant problem to study to learn about the limits of the existing DP tools or even for what we could possibly hope to achieve privately. Essentially, all I'm saying is that I like the paper also because of the problem they're trying to solve.\n\nWeaknesses:\n1. I did see comparisons with prior work, but only through experiments. I'm not *super* familiar with this particular aspect of DP literature, so I'm wondering if it were possible at all to have more in-depth theoretical comparisons, as well?\n2. The experiments were somewhat convincing, but not fully, if I'm honest. For example, in Figure 1, the plot of $\\delta$-vs-$\\varepsilon$ doesn't give me that much details as to how it compares with the RDP accountant. Also, I'm not sure how much we gain by improving $\\delta$ because any non-trivial DP algorithm usually has polylogarithmic dependence on $\\delta$ in its accuracy guarantees. Isn't $\\varepsilon$ the quantity we should be focussing on more? More clarity on these details would be nice, unless I'm missing something obvious.\n3. I wish I could see more applications of their work besides DP-GD. That would have given me a better idea of how useful this is for other techniques that don't involve the Gaussian mechanism, for example, those that use stability-based techniques. What do I expect the results to look like in those cases, and why?",
            "clarity,_quality,_novelty_and_reproducibility": "As mentioned earlier, I think the paper is well-written, so I don't have much issues with clarity, barring the questions I raised in the same section of the review.\n\nThere seems to be sufficient novelty in the techniques -- sure, many ideas do seem to be based on recent prior work, but the idea of trying GDP did the trick to improve. I'm satisfied by that!",
            "summary_of_the_review": "I do vote for acceptance of this paper based on what I wrote earlier -- the positives seem to outweigh the negatives, in my opinion. That said, my review might change depending on the authors response.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper6236/Reviewer_6fJh"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper6236/Reviewer_6fJh"
        ]
    },
    {
        "id": "VIvwMT-a3E",
        "original": null,
        "number": 2,
        "cdate": 1666665468976,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666665468976,
        "tmdate": 1668784347558,
        "tddate": null,
        "forum": "JmC_Tld3v-f",
        "replyto": "JmC_Tld3v-f",
        "invitation": "ICLR.cc/2023/Conference/Paper6236/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This paper generalizes the Renyi Filter techniques and individual privacy accounting results by Feldman and Zrnic (2021) from Renyi DP to Gaussian DP. At the end of this paper, the authors use experiments with MIMIC-III to obtain a similar result to Yu et al. (2022) which shows a correlation between the average of individual privacy guarantees and the accuracies among different groups. ",
            "strength_and_weaknesses": "Major strengths: \n1. The Gaussian DP is a special case of f-DP which is one of the optimal DP definitions for tight privacy analysis, and the Renyi filter is also one of the most important breakthroughs for fine-grained DP analysis. It is great to see this work connect these two ideas.\n\nMinor strengths: \n1. The paper is well-written and easy to read. \n\nMajor weaknesses: \n1. The results in this paper are not as comprehensive and novel as I expected. It is natural to use the idea of dominating pair of distributions which is equivalent to f-DP. Since Gaussian DP is mostly useful in asymptotic composition results, and the tight privacy analysis often requires f-DP, I would like to know why the proof of Theorem 11 cannot be generalized to f-DP. \n2. The Blackwell theorem used in Section 5 is not very appropriate since it is based on the relationship between two tradeoff functions (as shown in the Gaussian DP paper). There is no such result in the dominating pair paper (Zhu et al. 2022). I mean, the authors should provide or cite such a result that if $(P,Q)$ is a dominating pair, then the tradeoff function $T_{P,Q}$ is a lower bound for the tradeoff functions of neighboring datasets. By the way, I guess the stochastic transformation $T$ is a Markov kernel instead of a Markov process, therefore there is a typo on Page 8.\n3. The experimental results are not very related to the main topic of this paper.\n\nMinor weaknesses:\n1. The composition result of Gaussian DP is not stated in the main text (the proof description of Theorem 11) but it must be used somewhere (I know it is shown at the end of Appendix Section B, but I cannot find it in the main text.). This confuses me since in the proof of Theorem 12, the authors used $\\sum_{i=1}^t \\mu_i \\geq B$ instead of $\\sum_{i=1}^t \\mu_i^2 \\geq B^2$ (which I think is a typo and appears again in the line above Equation (5.1).)\n2. Algorithm 1 may need to be revised. I suggest the authors check 'Algorithm 2 by Feldman and Zrnic (2021)' again since we need $(X, X^{-i})$ to be any $(S_1,S_2) \\in \\mathcal{S}(X_i,n)$. By the way, I think $\\mu_{j+1}^{(i)}$ should be $\\mu_{j}^{(i)}$\n3. Theorem 12 should be put before Algorithm 1 since the two conditions, HALT and CONT, need to be defined.\n4. In Section 4.1, the worse-case analysis is said to be $(\\varepsilon=1.0, \\delta=10^{-5})$, but this is not shown in Figure 3. Is Figure 3 an average result of individual privacy accounting?\n5. In Section 6, the authors claim that 'we find that while the individual filtering leads to more equal group-wise $\\varepsilon$ values, ...' I cannot find any result that shows the 'more' equal values. There seems to be no such comparison in Figure 2.\n",
            "clarity,_quality,_novelty_and_reproducibility": "This paper is mostly well-written. The statements in the paper are clear and concise. The novelty of this paper is not very high (see the weaknesses). I believe that the experimental results are reproducible, and I have checked the theoretical results which mostly look good to me.",
            "summary_of_the_review": "This paper is easy to read and follow. The authors connect the existing work together (Gaussian DP, dominating pairs, and Renyi Filter), so their results are natural and correct. It is like an exact follow-up to the work done by Feldman and Zrnic (2021). There are minor issues in this paper but I believe all are fixable. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper6236/Reviewer_MJHk"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper6236/Reviewer_MJHk"
        ]
    },
    {
        "id": "u2oNiij4v6",
        "original": null,
        "number": 3,
        "cdate": 1666760284939,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666760284939,
        "tmdate": 1666760284939,
        "tddate": null,
        "forum": "JmC_Tld3v-f",
        "replyto": "JmC_Tld3v-f",
        "invitation": "ICLR.cc/2023/Conference/Paper6236/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This work derives privacy accounting for Gaussian-DP under fully adaptive composition, which gives tighter privacy bounds than RDP analysis. Efficient numerical techniques are proposed to compute the privacy parameters in practice. The theoretical findings are verified by experiments.",
            "strength_and_weaknesses": "Strengths\n- The proposed accountant method achieves tighter bounds for the Gaussian mechanism than the commonly used RDP accounting. \n- Efficient numerical calculation method is proposed.\n\nWeakness\n- The writing can be improved. Overall the paper looks very technical. The main results and their implications do not stand out well. \n- Technically this work mainly uses existing techniques from previous works. \n- More experiments can help to sufficiently demonstrate the effectiveness of the proposed PLD method \n- The disparate loss among subgroups for DP is observed in previous works and this part is somewhat orthogonal to the main contribution of this work.",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is technically solid. However, the presentation can be improved to highlight the main results. The techniques used are mainly from existing works.",
            "summary_of_the_review": "This work derives tighter privacy accounting for Gaussian mechanisms with Gaussian-DP than RDP accounting. However the presentation needs improvement, and technical contributions is somewhat limited. ",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper6236/Reviewer_ERD6"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper6236/Reviewer_ERD6"
        ]
    },
    {
        "id": "60GpCQXa2CK",
        "original": null,
        "number": 4,
        "cdate": 1667242691738,
        "mdate": null,
        "ddate": null,
        "tcdate": 1667242691738,
        "tmdate": 1667242691738,
        "tddate": null,
        "forum": "JmC_Tld3v-f",
        "replyto": "JmC_Tld3v-f",
        "invitation": "ICLR.cc/2023/Conference/Paper6236/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "The paper extends previous results on individual privacy accounting from Rényi DP to Gaussian DP. It also considers methods to maintain approximate privacy filters.",
            "strength_and_weaknesses": "## Strengths\n- The paper has adequate review of the relevant literature, is mostly self-contained, and clearly states the prior results it builds upon.\n- It provides a proof for a natural (and perhaps not surprising) extension of the prior individual privacy accounting in the RDP case.\n\n## Weaknesses\n- The technical contribution seems incremental (proof of Theorem 11), but I will leave the assessment of the paper's novelty to the experts in this particular topic.\n- Experiments should better highlight the practical use of individual GDP accounting compared to RDP. Figure C.3 shows one example for private GD, with a fixed number of steps. Perhaps showing similar plots under different settings (e.g. different number of steps) can help.\n- Experiments in Section 6 merit further discussion. Besides the disparate impact problem, the experiments suggest that even in terms of overall AUC (Figure 4), very soon after filtering starts, the overall AUC begins to drop, which suggest a limited benefit from individual accounting. Did the authors compare to not using individual accounting?",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is well-written and clearly positions itself within the relevant literature. Code for the experiments is provided in the supplement.",
            "summary_of_the_review": "A nice extension of previous individual accounting results, from the Rényi DP to the Gaussian DP case.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper6236/Reviewer_wyyZ"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper6236/Reviewer_wyyZ"
        ]
    }
]