[
    {
        "id": "R-nhOtJ99z",
        "original": null,
        "number": 1,
        "cdate": 1666604003812,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666604003812,
        "tmdate": 1666604003812,
        "tddate": null,
        "forum": "ju_Uqw384Oq",
        "replyto": "ju_Uqw384Oq",
        "invitation": "ICLR.cc/2023/Conference/Paper1168/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "The authors argue that 1D time series data are composed of multiple intraperiod-variations and interperiod-variations. Since there is a limit to capturing these variations as 1D time series representation, the authors transform the 1D time series into a set of 2D tensors based on multiple periods so that the analysis can be performed in a 2D space. The proposed method can adaptively discover multi-periodicity and extract complex temporal changes from 2D tensors. Experimental results show state-of-the-art performance in five mainstream time series analysis tasks, including short-term prediction, long-term prediction, imputation, classification, and anomaly detection.",
            "strength_and_weaknesses": "Strength:\n1. The proposed method solves the bottleneck of representation capability in 1D space and enables simultaneous representation of intra-period and inter-period variation in 2D space. While 1D time series could only represent variations between temporally adjacent time points, the proposed method offers the possibility of representing variations of the same phase in different periods. As the result, the proposed method allows the 2D kernel to simultaneously handle changes in adjacent time and changes between adjacent periods.\n\n2. Good design for flexibility. The inception block can be replaced by any model of the type that uses a 2D kernel. In fact, the authors investigated its performance by replacing the inception block by other models such as ResNet and ResNeXt, etc. \n\n3. The proposed method provides SOTA performance in five main tasks in time-series data analysis. While the models of previous studies differ in their strengths in each task, the proposed method almost consistently performs the best.\n\n\nConcerns:\n1. What does the dimension “C” of time series data correspond to in this study?\n\n2. According to the appendix, the top-k was experimentally decided to be three (k=3). As far as I see the Fig.8, the performance was not so changed in the range between 1 and five. How carefully should the parameter k be decided? If a larger k is selected, is there any possibility to increase/decrease the performance?\n\n3. Small concern. I found a paper, which has already submitted in Arxiv. The contents of both papers are almost same except for author area: one is anonymized, the other shows the author list. I hope this doesn't violate the double blind rule.",
            "clarity,_quality,_novelty_and_reproducibility": "The proposed TimesBlock is novel. The paper is well organized, and well written.",
            "summary_of_the_review": "The proposed method provides a new approach for 1D time series data by transform the 1D time series into a set of 2D tensors. It enables to use 2D kernels for analysis of both intraperiod- and interperiod-variations simultaneously. The inception block can be easily replaced by other existing models so that its flexibility is also high.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "Yes, Other reasons (please specify below)"
            ],
            "details_of_ethics_concerns": "A paper which has almost the same contents, organizations, was hound in Arxiv. \nIf the paper in Arxiv was sbmitted by the authors of this paper, I have come to know the authors, and I am concerned about whether this will be a problem as a double-brined rule.",
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper1168/Reviewer_v92e"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper1168/Reviewer_v92e"
        ]
    },
    {
        "id": "ZeRqG4OEr_Y",
        "original": null,
        "number": 2,
        "cdate": 1666629168636,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666629168636,
        "tmdate": 1666629168636,
        "tddate": null,
        "forum": "ju_Uqw384Oq",
        "replyto": "ju_Uqw384Oq",
        "invitation": "ICLR.cc/2023/Conference/Paper1168/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper focuses on modeling the temporal variations in the time series data. Specifically, based on the observation that there are often multiple periodicities in time series data, the paper proposes to divide a single multi-dimensional time series into several sets of smaller pieces of the time series, each with a different periodicity. Then, the inner-period variance and intra-period variance could be modeled together with a CNN backbone, like inception as used in this paper. Empirical evaluations are conducted with multiple datasets on forecasting, imputation, classification, and anomaly detection tasks.",
            "strength_and_weaknesses": "Strengths:\n\n- The idea of tackling the long-term dependency by utilizing the multiple periodicities in time series is reasonable and the use of FFT to extract the period from the frequency domain also makes sense.\n- The empirical evaluation is comprehensive and promising results are shown.\n\nWeaknesses:\n\n- The periodicity in time series is an important assumption in this paper. Some time series data are not strictly periodic, but instead, they are composed of several repeating segments. In such cases, it is not clear if the proposed method still works.\n- It is not clear if the proposed model can be applied to a dataset containing multiple datasets but with different period lengths for each data sample. For example, the time series data for patients in hospitals.\n\n\nA minor detail: In the line before Eq. (1), \"Fast Fourier Transformer (FFT)\" should be \"Fast Fourier Transform (FFT)\".",
            "clarity,_quality,_novelty_and_reproducibility": "In terms of clarity, the paper is well-organized and easy to follow. The proposed model uses FFT to identify periodicity and uses 2D vision backbones like inception to model the temporal dependency. Although both techniques are not novel, the idea of combining them to better utilize the multiple periodicities in time series to improve downstream task performance is reasonable and well executed in this paper. The paper discussed the implementation details and hyperparameter settings in appendices, so I personally believe the paper should be reproducible given that the source codes will be released.",
            "summary_of_the_review": "Overall, I think this paper proposes a reasonable idea to tackle the long-term dependency issue in time series data modeling tasks and the solution is also sound. The empirical evaluations also show impressive results.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper1168/Reviewer_Re8p"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper1168/Reviewer_Re8p"
        ]
    },
    {
        "id": "BW9z4ZuDLNd",
        "original": null,
        "number": 3,
        "cdate": 1667325816345,
        "mdate": null,
        "ddate": null,
        "tcdate": 1667325816345,
        "tmdate": 1667343503669,
        "tddate": null,
        "forum": "ju_Uqw384Oq",
        "replyto": "ju_Uqw384Oq",
        "invitation": "ICLR.cc/2023/Conference/Paper1168/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "\nThis paper focuses on temporal variation modeling and proposes a representation method intended for incorporating multiple intraperiod- and interperiod-variations.\nFor each selected frequency, the proposed method generates a two-dimensional representation of the original time series and applies a convolutional network to the representation.\nThe proposed method is evaluated on several time series tasks including long/short-term forecasting, imputation, classification, and anomaly detection.  ",
            "strength_and_weaknesses": "Strength:\n\nThe proposed method takes into account the multiple frequencies that could exist in multi-variate time series. \nThe experimental evaluation is extensive on several different time series tasks and shows competitive performance. \n\nWeakness:\n\nIncorporating different component information from time series into neural network-based models is not a new idea, for instance, one of the very recent works is [1]. Meanwhile, the following issues would affect the assessment of the paper. \n\n(a) Some math notation would be misleading. e.g., $X_{1D}$ is two-dimensional to represent multivariate time series. \n\n(b) Figure 2 is confusing. According to Eq. (1), the frequency analysis is applied to the multivariate time series, while Figure 2 gives the impression that it is to the univariate time series. \n\nBased on Eq. (5), the Inception is applied to a matrix of dimension $ (f_i * p_i) * C$, while the illustration of 2D kernel seems to show that one dimension of the input to the Inception CNN is the number of frequencies. \n\n(c) Given the frequencies selected based on the magnitude, the efficacy of adaptive aggregation Eq. (6) is unclear. It would be good to have some ablation study on this. \n\n(d) During the training, the frequency analysis is applied to individual data instances or the batch of instances? Would the different granularities of this operation affect the performance?\n\n(e) The truncate operation in Eq.(5) looks a bit unconvincing, given that it could blindly get rid of useful information depending on the dimension size relative to the dimension T. \n\n(f)  In Table 11, the result of the baseline DLinear seems to be worse than that in the original paper [2]. It would be good to elaborate on it.\n\n[1] Woo, Gerald, et al. \"ETSformer: Exponential Smoothing Transformers for Time-series Forecasting.\" arXiv preprint arXiv:2202.01381 (2022).\n\n[2] Zeng, Ailing, et al. \"Are Transformers Effective for Time Series Forecasting?.\" arXiv preprint arXiv:2205.13504 (2022).\n\n",
            "clarity,_quality,_novelty_and_reproducibility": "The presentation of this paper is relatively clear, though some clarification is needed as mentioned above. \nExtensive experiments show the competitive performance of the proposed method.\n\nThe main concern is about the novelty and soundness of the proposed method. First, incorporating different component information (e.g., trend, seasonality, levels, etc.) from time series into neural network-based models is not a new idea. The proposed method is particularly focused on multi-periodicity and mostly employs well-known techniques. Second, compared with baselines intended for capturing different patterns in time series (e.g., periodicity, trend, levels, autocorrelation, etc.), the proposed method focusing on periodicities can mostly outperform. Consequently, it raises the concern of whether this outperformance is generalizable. In other words, the proposed method would have been positioned to a more specific scenario of periodic time series, instead of the \"general time series\" as it is now. ",
            "summary_of_the_review": "\nThis paper focuses on temporal variation modeling and proposes a representation method intended for incorporating multiple intraperiod- and interperiod-variations. The proposed method is based on some existing ideas. It is evaluated on several time series tasks including long/short-term forecasting, imputation, classification, and anomaly detection, and shows competitive performance. The main concern is about the novelty and soundness of the proposed method, and probably a more appropriate positioning of the work. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper1168/Reviewer_gBbZ"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper1168/Reviewer_gBbZ"
        ]
    }
]