[
    {
        "id": "lKHKybNpExe",
        "original": null,
        "number": 1,
        "cdate": 1666593750898,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666593750898,
        "tmdate": 1666593750898,
        "tddate": null,
        "forum": "kn7w8UX05a",
        "replyto": "kn7w8UX05a",
        "invitation": "ICLR.cc/2023/Conference/Paper1091/-/Official_Review",
        "content": {
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully.",
            "summary_of_the_paper": "This paper leverages double descent for scientific data analysis, with face-based social behavior as a case study.",
            "strength_and_weaknesses": "The organization is clear and easy to follow.\n\nMy concerns regarding this paper are as below.\n1. Limited novelty. The main contributions of this paper are not enough for ICLR.\n2. Some related works are missing, e.g., Integrated Face Analytics Networks through Cross-Dataset Hybrid Training.",
            "clarity,_quality,_novelty_and_reproducibility": "See Strength And Weaknesses.",
            "summary_of_the_review": "See Strength And Weaknesses.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper1091/Reviewer_ZkzX"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper1091/Reviewer_ZkzX"
        ]
    },
    {
        "id": "JksJ6kYAIN",
        "original": null,
        "number": 2,
        "cdate": 1666664319796,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666664319796,
        "tmdate": 1666664319796,
        "tddate": null,
        "forum": "kn7w8UX05a",
        "replyto": "kn7w8UX05a",
        "invitation": "ICLR.cc/2023/Conference/Paper1091/-/Official_Review",
        "content": {
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully.",
            "summary_of_the_paper": "This paper studies correlations between perceived facial traits and social preference. This is a well studied topic in social psychology. The authors collected manual annotations on various facial traits for 72 images from undergraduate students (by the way the dataset used in the paper already provides such ratings for thousands of images). The paper uses AAM to extract features from facial images and fits a linear regression to estimate the coefficients. Some findings about relationship between social traits are reported.  ",
            "strength_and_weaknesses": "I don't understand the main contributions of this paper. This paper doesn't feel like a paper about AI. It would be much more appropriate in psychology venues. But even then, I don't think this paper has original contributions. Both in psychology and computer vision literature, the use of CV/ML models has been explored extensively. These methods include traditional methods such as HOG and SVM as well as deep neural networks. Any of these papers are discussed in the manuscript. If this paper is about demonstrating that one can use automated methods for studies in face perception, many papers already exist. This paper is not about proposing a new method. Overall it's unclear what this paper tries to achieve or how it relates to the ICLR community. ",
            "clarity,_quality,_novelty_and_reproducibility": "This paper has lots of mathematical formula and proofs, but essentially it's about linear regression. I don't know if that's necessary given the focus of this paper. As mentioned above, I'm skeptical about the novelty and relevance of this paper. Another key question is about the choice of AAM. I'm not against using old methods, but there's no rationale provided regarding this choice despite numerous results and evidence showing the advantage of deep neural networks on this very topic published in the last decade. I'm also not sure about the design of the entire study, why not just use manual ratings? Why do we use a computational model when we have only 72 images? Also, I don't know how come AAM features are of length over 10k. They are usually much shorter. ",
            "summary_of_the_review": "I don't think this paper is relevant to AI or ICLR community. The quality and novelty are very limited too. ",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "empirical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "1: strong reject"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper1091/Reviewer_nFuG"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper1091/Reviewer_nFuG"
        ]
    },
    {
        "id": "sS2gCPbsvDr",
        "original": null,
        "number": 3,
        "cdate": 1666721514197,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666721514197,
        "tmdate": 1666721514197,
        "tddate": null,
        "forum": "kn7w8UX05a",
        "replyto": "kn7w8UX05a",
        "invitation": "ICLR.cc/2023/Conference/Paper1091/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "The authors propose a linear framework that relies on overparametrized representations in order to facilitate analysis of features, and their impact to multiple response variables.  The authors motivate this in underdetermined problems, with a larger number of features than data points.  The authors show some conditions for a linear regression framework with an overparameterized full rank design matrix, e.g., when the model constitutes an above chance estimator.  They then proceed to describe an experiment, which is used to validate the hypothesis - given that such conditions are hard to be satisfied by real-world data.  The experiment is based on data from a study including ~ 600 participants on social decision making tasks, with outliers excluded automiatically.  72 images were used in the study.  Computationally, the authors train an AAM, however they used the full set of principal components to get an overparameterized representation.  They then proceed to analyse the results, and find correlations between traits and the social decision making tasks.  Some related insights are presented.",
            "strength_and_weaknesses": "The paper presents interesting insights in the experimental part based on the study, relating various traits to social decision making tasks.  The proposed framework is essentially a linear regression setting, however as the authors also mention - some degree of non-linearity may be necessary for modelling these mappings due to the nature of the data.  At the same time, although some theoretical conditions are described, the authors mention that the experiment is used to verify the framework since real-world data does not adhere to most of these conditions, however the only support that the conditions are satisfied is  the MSE Plot - Fig 3.   The conclusions on beauty penalty and trustworthiness are quite interesting.  The concept of orthogonalized estimators is also interesting in this context and appears to offer insight into the relationship between them.",
            "clarity,_quality,_novelty_and_reproducibility": "The methodology part is potentially novel in the estimator conditions presented, which however may not be applicable to real world data\n\nthe application part uses the idea of AAM's - when not reducing the dimensionality after PCA - in order to use as design matrix in this specific linear regression setting.  Insights from the experiment may be novel to the relevant community",
            "summary_of_the_review": "I think that some of the insights presented on social decision making can be interesting and feature representations are central to this paper.   However *in my opinion which may be wrong* technically the paper seems to be oriented more at the intersection of statistics and psychology.   There are also no comparisons to any other methods that may facilitate some interpretability - e.g., what if a different representation than full PCA on AAMs was used?",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper1091/Reviewer_9oX1"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper1091/Reviewer_9oX1"
        ]
    },
    {
        "id": "ecVNawImwT",
        "original": null,
        "number": 4,
        "cdate": 1666964534542,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666964534542,
        "tmdate": 1666964534542,
        "tddate": null,
        "forum": "kn7w8UX05a",
        "replyto": "kn7w8UX05a",
        "invitation": "ICLR.cc/2023/Conference/Paper1091/-/Official_Review",
        "content": {
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "The authors analyse via mathematical modelling and 600+ participating students the effects of facial beauty. They find both rewards (including based on perceived trustworthiness) and penalties from +/- beauty.",
            "strength_and_weaknesses": "This is an interesting study from a social perspective. The findings bear merit and all is well described. The mathematical model is of interest.\n\nIt is, to the reviewer, however, largely unclear what the core relation to ICLR is.",
            "clarity,_quality,_novelty_and_reproducibility": "All well written and perfectly clear.",
            "summary_of_the_review": "A great paper for social sciences, psychology, or other venues - the reviewer does not see sufficient connection to ICLR, though.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "Yes, Other reasons (please specify below)"
            ],
            "details_of_ethics_concerns": "Involvement of humans and beauty are a potential critical  topic.",
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper1091/Reviewer_pCsM"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper1091/Reviewer_pCsM"
        ]
    }
]