[
    {
        "id": "hUPFLS9LN-y",
        "original": null,
        "number": 1,
        "cdate": 1665841428862,
        "mdate": null,
        "ddate": null,
        "tcdate": 1665841428862,
        "tmdate": 1665841450753,
        "tddate": null,
        "forum": "n3RFM5cBB4",
        "replyto": "n3RFM5cBB4",
        "invitation": "ICLR.cc/2023/Conference/Paper3297/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper proposes to jointly formulate particle and continuum for model multi-scale, non-equilibrium, and no-body physical systems. Specifically,  this model contains three components, 1) a classical solver for kinetic particles, 2) a neural network for the evolution of thermal sub-population with fluid representation, and 3) an injection neural network from a fluid state to a particle state. \n\nCompared with existing methods on non-equilibrium, and no-body physical systems, it uses the hybrid representation instead of the uniform representation. Though the method is simple, it achieves a good balance between accuracy and speed, i.e. faster than classical particle solvers and more accurate than the deep-learning baselines.\n\n",
            "strength_and_weaknesses": "Strength:  \n1）This paper focuses on an important and interesting problem that models the non-equilibrium, N-body nonlinear， which has the potential for complex physical systems analysis.\n2) The hybrid representation makes sense and works well in the simulations. \n3) The basic idea and technical details are clear.  More details of the network architecture are attached in the supplementary details.\n\nWeakness:\nThe main weaknesses of this paper lie in experimental comparison and technical contribution:\n1）There seem to be some existing methods in the field of nonlinear physical systems modeling, such as LED[1] and  Solver-in-the-loop[2]\nIt is suggested to compare the proposed method with these existing methods. \n2)  There are some methods to fuse the representation of different views, such as Cross-Attention and CCA. Do these information-fusing methods work well in physical systems modeling?\n3) The whole method contains three components.  Which one is most important? It is suggested to add a detailed ablation study.\n4) Using a neural network to learn particle-continuum coupling is not difficult. Did existing methods use the neural network for coupling? If yes, which is the advantage of this method? If not, it is better to analyze the effect of different deep-learning-based coupling methods.\n\n\n",
            "clarity,_quality,_novelty_and_reproducibility": "Overall, this paper is well written. The idea and model details are clear enough.  \nBeyond the uniform representation, using hybrid representation achieves good performance on nonlinear physical systems.\nIt is not surprising and it is better to provide more analysis of different information coupling methods.\n\n\nFor reproducibility, the details of the neural networks are attached in the supplementary material. But it is better to provide the source code so that more details can be checked. ",
            "summary_of_the_review": "Balancing the strength and weaknesses, I think this paper would be better when more comparisons and analyses are conducted. \nBesides, the technical contribution of adding a neural network to learn particle-continuum coupling is limited. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper3297/Reviewer_qT1Y"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper3297/Reviewer_qT1Y"
        ]
    },
    {
        "id": "xipFpviIPa",
        "original": null,
        "number": 2,
        "cdate": 1666670096090,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666670096090,
        "tmdate": 1666670096090,
        "tddate": null,
        "forum": "n3RFM5cBB4",
        "replyto": "n3RFM5cBB4",
        "invitation": "ICLR.cc/2023/Conference/Paper3297/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This paper proposes a hybrid framework for modeling N-body systems. It uses a classical solver for the non-thermal particle distribution. The neural networks are used in two components: (1) in modeling the thermal part using a continuum representation, (2) in coupling the continuum model and the particle model. The proposed method has been shown effective in modeling laser plasmas. Overall, this paper is interesting as it combines classical physical approaches with neural networks to address a challenging and important physical problem. ",
            "strength_and_weaknesses": "Strengths\n1.\tThe proposed method combines classical approaches with neural networks models in addressing important scientific problems.\n2.\tA separate neural network is used to couple the classical solver for particle distribution and the NN model with continuum representation. \n\nWeaknesses\n1.\tWhy not use NN to simulate the non-thermal part? I assume a NN-based surrogate model for both thermal and non-thermal component can further accelerate the speed. \n2.\tIt would be better to evaluate the method in more than one application. \n",
            "clarity,_quality,_novelty_and_reproducibility": "The presentation of the paper is clear, but may not be easy to follow by people outside this area. The idea presented in the paper is interesting. ",
            "summary_of_the_review": "Overall, this paper proposes an interesting idea of combining the classical solver of physical systems and neural network models, and evaluates this algorithm on a challenging problem. \nIt would be more convincing to compare with (1) different design of NN models (e.g., using NN for non-thermal part as well), and (2) different NN architecture. Also, it can be more convincing to show the effectiveness in multiple physical applications.\n",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper3297/Reviewer_gLTB"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper3297/Reviewer_gLTB"
        ]
    },
    {
        "id": "mvk0i-QpCe",
        "original": null,
        "number": 3,
        "cdate": 1666673913068,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666673913068,
        "tmdate": 1666673913068,
        "tddate": null,
        "forum": "n3RFM5cBB4",
        "replyto": "n3RFM5cBB4",
        "invitation": "ICLR.cc/2023/Conference/Paper3297/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This work studies a new learning system to model a non-equilibrium N-body system. In particular, the new method combines two learning components to jointly model the near-equilibrium (thermal) flow and far-from-equilibrium (non-thermal) particles. The experiments show that this hybrid model outperforms a model that only describes the system in a single mode (thermal or non-thermal). ",
            "strength_and_weaknesses": "Strength:\n+ the motivation is clear, and the proposed method seems to work.\n+ The writing of the paper is generally clear. I can read the paper well though I don't have much background knowledge in physics. \n\nWeakness:\n\n- The novelty of the proposed method is limited in terms of machine learning techniques. This type of system is typical in machine learning. \n- This work may not be able to draw much interest from the wide audience of this conference, whose main focus is on innovations in learning systems. ",
            "clarity,_quality,_novelty_and_reproducibility": "It's better to give a clear definition or description of the loss function. ",
            "summary_of_the_review": "Overall I think the main focus of this work is to solve a modeling problem in physics. But I don't have enough knowledge to judge the novelty and correctness of this contribution. On the machine learning side,  I feel that the proposed model is very typical and does not bring much innovation. I also worry that the work deviates too much from the main theme of this conference. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper3297/Reviewer_mprf"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper3297/Reviewer_mprf"
        ]
    }
]