[
    {
        "id": "XHWr7ar-CYp",
        "original": null,
        "number": 1,
        "cdate": 1666502652801,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666502652801,
        "tmdate": 1669450066295,
        "tddate": null,
        "forum": "Nvlqsofsc6-",
        "replyto": "Nvlqsofsc6-",
        "invitation": "ICLR.cc/2023/Conference/Paper5188/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper introduces a method that combines the strengths of advanced time-series sequence modeling (with the HiPPO features) with neural PDE solvers. In a 2-D Kolmogorov flow, the method shows improved high-correlation duration, compared to baselines with learned correction or raw features.",
            "strength_and_weaknesses": "Strength:\nThe paper addresses an important problem. It is written clearly. The experiment is sound.\n\n\nWeaknesses:\n1. The use a the temporal stencil, and especially the use of HiPPO features is not well motivated. Since this is the most important part of the paper, it can be motivated better, and maybe shorten the background part. Also, it would be nice to give an intuition about the HiPPO features, even if the introduction is in the appendix.\n\n2. The main contribution is a simple combination of the time-series sequence modeling (with the HiPPO features) and SOTA neural PDE solvers, the novelty is limited.\n\n3. It would strengthen the paper, if the method is demonstrated in another (potentially more difficult, larger) dataset, to show the generality and/or scalability of the method.",
            "clarity,_quality,_novelty_and_reproducibility": "Clarity: good.\n\nQuality: fair.\n\nOriginality: limited.\n\nReproducibility: fair.",
            "summary_of_the_review": "In summary, the paper introduces a method that improves upon prior SOTA neural solver with the temporal stencil modeling. My main concern is limited novelty and limited experiment evaluation of the paper, as stated in the weakness part of the paper.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper5188/Reviewer_41X5"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper5188/Reviewer_41X5"
        ]
    },
    {
        "id": "VBKPY80sKwW",
        "original": null,
        "number": 2,
        "cdate": 1666651353363,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666651353363,
        "tmdate": 1666651353363,
        "tddate": null,
        "forum": "Nvlqsofsc6-",
        "replyto": "Nvlqsofsc6-",
        "invitation": "ICLR.cc/2023/Conference/Paper5188/-/Official_Review",
        "content": {
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "The work proposed a neural PDE solver with temporal stencil modeling. The neural solver incorporate the state of the art temporal HiPPO feature of low-resolution results as inputs for super resolution. The method was evaluated on 2-D Kolmogorov flows and consistently outperform a series of baselines.",
            "strength_and_weaknesses": "Strength:\n\nThe core idea of the work is clear and simple. The motivation for using temporal feature for super-resolution PDE solution is intuitive and strong. The evaluation of the proposed method is comprehensive.I especially appreciate the generalization test experiment results and the method consistently outperforms existing approaches.\n\n\nWeakness:\n\nI do not have major concerns about the work except for two minor ones: 1) It’s clear HiPPO feature is used because it’s the SOTA temporal feature but have the authors considered other temporal features like learnable features from RNN and transformer models? 2) There’s a typo in the first paragraph of Section 4.1. Simulated Data-> Simulated Data",
            "clarity,_quality,_novelty_and_reproducibility": "I have no concerns about the clarity, quality or novelty of the work.",
            "summary_of_the_review": "The idea of using HiPPO temporal features for neural PDE super-resolution solution is clear and well motivated. Comprehensive experiment results show strong and convincing performance of the proposed methods.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper5188/Reviewer_ay4D"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper5188/Reviewer_ay4D"
        ]
    },
    {
        "id": "r-8fe3TFiSc",
        "original": null,
        "number": 3,
        "cdate": 1667290354304,
        "mdate": null,
        "ddate": null,
        "tcdate": 1667290354304,
        "tmdate": 1667290354304,
        "tddate": null,
        "forum": "Nvlqsofsc6-",
        "replyto": "Nvlqsofsc6-",
        "invitation": "ICLR.cc/2023/Conference/Paper5188/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This paper suggests a Machine Learning (ML) driven method to support solving the Navier-Stokes equation of incompressible flows, a classical problem in Computational Fluid Dynamics (CFD). The submitted approach learns to infer the stencils of advection-diffusion fluids in a Finite Volume Method framework. \n\nThe authors introduce the mathematical setting of incompressible constant density Navier Stokes equation for fluids. They then report their ansatz by using embedded HIPPO features and learning a small Convolutional Neural Network (6 layer Unet) to estimate the spatio-temporal stencils. These stencils are used to perform a super-resolution-like task by which a reduced resolution input field (64x64) is regressed to a full-resolution solution of the aforementioned PDE solution (e.g. 2048x2048). \n\nThey then describe and show experimental results on low-resolution input data to compare their predictions against the ground truth at high resolution. The comparison is contrasted with one other ML-driven approach taken from [Kochkov et al 2021]. From these results, they infer strong indications that their approach is superior to the existing model by [Kochkov et al 2021].\n",
            "strength_and_weaknesses": "The paper is strong in introducing the domain of CFD to a reader from the ML community, i.e. not versed in CFD. The text is easy to follow (despite minor language issues) for an audience versed in partial differential equations (PDEs). The metrics under study are designed in an approachable manner, so that these metrics' interpretation is straight forward. The authors add with indicative visualizations (fig. 2) of the mathematical fields under study. The ML based approach is described in a condensed textual but also visual fashion (fig 1), which is helpful to understand the rational. Towards the end, the authors strive to underpin the trustworthiness of their approach by reporting an ablation study as well as tests for general applicability.\n\nA major weakness of this article is the lack of standard techniques in machine learning. A clear description of the input and output data as well as the network architecture is scattered throughout the paper. It woud be beneficial to have this under 'Experimental Setup'. Moreover, the network architecture used appears to be rather small (6 conv layers with 256 feature channels each). A clear description and comparison to the approach of LI would help.\n\nOne more major weakness along this line of thought: a cross-validation (standard technique in ML) could have been undertaken to sample the predictive performance of the network. If done with the competing approach too, this could provide a basis for a statistical treatment of the results and hence increase trustworthiness of any eventual interpretation. Related, the authors claim a \"significant\" improvement without conducting a statistical analysis of their predictions, i.e. a hypothesis test (or Bayes Factor computation) or estimation of a confidence/credible interval. This severely weakens the interpretations brought forward and raises severe doubts that the findings are significant in the narrow (statistical) sense of the term.\n",
            "clarity,_quality,_novelty_and_reproducibility": "The presented work struggles to keep a clear plot of the discussion. While the first third of the paper (up to section 3) is well structured and approachable for a non-CFD reader, the remainder is convoluting domain specific lingo (WENO, HIPPO, FNO, temporal bundle, trajectories) and puts less emphasis on the analysis of the experimental results unfortunately. In addition, many of the plots reported appear made in a rush (e.g. see figure 5: missing units, aspect ratio of plots, multiple legends with and without borders). \n\nThe approach appears to bring novelty to field for sure. However, a missing statistical analysis and missing details about the architecture and data set hide important details of the approach (i.e. does the model overfit, how does the loss behave). Finally, the reproducibility statement contains a corrupted URL. By this lack of reproducible code and given the weaknesses indicated earlier, this work may be assumed to NOT be reproducible. The authors could use the rebuttal to fix this flaw easily.\n\nFinally, a central penalty to clarity is the fact, that in the section titled \"generalization tests\" the approach is found to generalize, while the summary clearly reports that no experiments have been done to check the method with 3D simulations. To me, this is a clear contradiction.",
            "summary_of_the_review": "I congratulate the authors for their submission to ICLR'23. The presented paper demonstrates a novel approach to solving the Navier Stokes PDE in a highly relevant parameter domain (of incompressible flows). This work is hence very relevant for practical concerns and has the potential to push the CFD domain to new PDE or parameter space domains.\n\nThe ML-driven TSM approach under study is found to provide strong performance gains beyond one singular competing ML based approach. The evidence in favor of this can be considered weak. I encourage the authors to continue their work and add a more thorough statistical analysis of the predicted fluid fields with their setup. This may include a cross-validation study of the CNN, an estimation of the predicted estimates and a statistical analysis of the obtained confidence intervals. \n",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper5188/Reviewer_PBxt"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper5188/Reviewer_PBxt"
        ]
    },
    {
        "id": "mb8Sth4Frw",
        "original": null,
        "number": 4,
        "cdate": 1667398179019,
        "mdate": null,
        "ddate": null,
        "tcdate": 1667398179019,
        "tmdate": 1670424049147,
        "tddate": null,
        "forum": "Nvlqsofsc6-",
        "replyto": "Nvlqsofsc6-",
        "invitation": "ICLR.cc/2023/Conference/Paper5188/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "The authors proposed TSM that combines time series modeling method HiPPO and neural PDE solver. This proposed method has higher accuracy than existing models in 2-D Navier Stokes equation, and has lower inference latency. The authors generally identified these characteristics in various forcing and Reynolds number environments.",
            "strength_and_weaknesses": "Strengths : \n\n- TSM-HiPPO encodes raw fluid velocity using the HiPPO, which operates by projecting the previous trajectories as polynomial bases. This approach can well extract features of time-varying fluid dynamic.\n\n- In addition to the ML based model, the authors also experimented with the physics-type model.\n\n- It was confirmed in the paper that TSM-HiPPO has better performance than baselines at various environment not in a single fixed environment.\n\n\nWeaknesses :\n\n- It is not possible to verify that the proposed model is available for general PDEs. In this paper, the authors verified the performance of the model only for Navier Stokes equation and did not compare it with other PDEs. Additional experiments are needed on various other PDEs that existing models are solving.\n\n- There is a lack of baseline in the neural operator field. In this paper, only Fourier Neural Operators (FNO) are compared as baseline. It is necessary to add models that appeared after FNO as baselines. Additional comparisons with wavelet transform based neural operator(MWNO), transformer based neural operator, and other models that the authors mentioned in Related work are needed.\n",
            "clarity,_quality,_novelty_and_reproducibility": "In general, the paper is understandable. This method has some novelty that needs more experiments for justification.",
            "summary_of_the_review": "Due to the following concerns, I think the paper is not at the acceptance level yet:\n\n- Did the authors compare other basic deep learning models besides CNN?\n\n- It seems necessary to compare it with other models that perform the Super-resolution task in the PDE Problem. Neural Operator models also perform super-resolution tasks. It is necessary to compare.\n\n- TSM does not seem to have significantly changed from the existing HiPPO and Neuarl PDE solver models. Can you explain this in more detail?\n\n- I wonder if using 64 x 64 grid for all learnable solvers in Table 2 is a fair comparison. How does the performance of the models change for different resolutions?\n\nHowever, I think this paper adds some value to the physics-informed machine-learning community. During the rebuttal period, I recommend they address as many issues as possible and I will reconsider my evaluation in a positive way.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper5188/Reviewer_EevF"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper5188/Reviewer_EevF"
        ]
    }
]