[
    {
        "id": "3ufJDoRCPRm",
        "original": null,
        "number": 1,
        "cdate": 1666590909493,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666590909493,
        "tmdate": 1666590909493,
        "tddate": null,
        "forum": "O4fNuE8F51T",
        "replyto": "O4fNuE8F51T",
        "invitation": "ICLR.cc/2023/Conference/Paper2549/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This paper proposes a new data augmentation method, PMixUp. Specifically:\n\n* This paper performs a relatively comprehensive study of the importance of POS tags in topic classification and sentiment analysis.\n* This paper proposes a new data augmentation method, PMixUp, that utilizes both replacement-based and feature space interpolation methods.\n* The authors tests their new method on nine public benchmark settings.\n\n",
            "strength_and_weaknesses": "Strengths:\n\n* This paper combines the replacement-based method and the feature space interpolation method together to increase the performance.\n* This paper answers a lot of why questions instead of how questions.\n\nWeaknesses:\n\n* I don't think our field put topic classification and sentiment analysis into the same category.",
            "clarity,_quality,_novelty_and_reproducibility": "This paper is relatively clear and the content is original. It might be hard to replicate the experiments since the details are fuzzy.",
            "summary_of_the_review": "I am leaning towards acceptance but would like to see some revisions to the paper.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2549/Reviewer_mExN"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2549/Reviewer_mExN"
        ]
    },
    {
        "id": "I5ohbZ-9Nic",
        "original": null,
        "number": 2,
        "cdate": 1666606526663,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666606526663,
        "tmdate": 1666607350947,
        "tddate": null,
        "forum": "O4fNuE8F51T",
        "replyto": "O4fNuE8F51T",
        "invitation": "ICLR.cc/2023/Conference/Paper2549/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper describes PMxiUp, a new way to add to text data augmentation by replacing parts of speech (POS) and interpolating features. The proposed method swaps out tokens that belong to a particular POS tag and uses feature space interpolation in order. The author discovered through experimentation that nouns are essential in determining how to label a topic. At the same time, verbs and adjectives are paramount in figuring out how someone feels about something. In the reported experiments on nine public benchmark datasets to test PMixUp's best performance on classification performance rather than previous works, it becomes a new state-of-the-art in specific settings.",
            "strength_and_weaknesses": "An exciting new text method is presented in text data augmentation, focusing on using different POS correlates to the performance of topic classification and sentiment analysis; nouns are critical determinants in topic classification, whereas verbs or adjectives are essential in sentiment analysis. The results show that the proposed model using CKA during training performs well when comparing the representation similarities at different layers when the model is trained with different augmentation strategies scaling between 0 and 1.\n\nSome assertions are made that are not entirely supported by the results obtained. Maybe this is how I felt because the results did not thoroughly analyze how the proposed method would perform with the class imbalance dataset and whether it would be inadequate for a robust model.\n\nMany why questions instead of the how ones are addressed in this article.",
            "clarity,_quality,_novelty_and_reproducibility": "The proposed approach is nuanced, but the algorithm for replicating this is unclear. If possible, perhaps the author can briefly discuss how PMxiUp can be reproduced. Maybe very difficult to implement compared to Emix, a data augmentation method that uses interpolations of word embeddings and hidden layer representations to construct virtual examples (https://aclanthology.org/2020.coling-main.611/).",
            "summary_of_the_review": "Good: This paper is of interest to the *ICLR audience and could be published, but might not be appropriate for a top-tier publication.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "empirical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "details_of_ethics_concerns": "No comments",
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2549/Reviewer_iN19"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2549/Reviewer_iN19"
        ]
    },
    {
        "id": "2uQp1pcB__w",
        "original": null,
        "number": 3,
        "cdate": 1666646978483,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666646978483,
        "tmdate": 1666646978483,
        "tddate": null,
        "forum": "O4fNuE8F51T",
        "replyto": "O4fNuE8F51T",
        "invitation": "ICLR.cc/2023/Conference/Paper2549/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This manuscript combines two reasonable augmentation strategies to improve topic classification and sentiment analysis.  The first is replacement based augmentation and TMix style feature space augmentation.\n\nThe findings suggest that using Part of speech (POS) to drive replacement augmentation matters, and its impact is different based on the task.  Second, these two strategies combine effectively.",
            "strength_and_weaknesses": "Strengths\n* This is a reasonable combination of existing techniques.\n* Decent analyses of different POS influence on performance of different tasks on a variety of corpora.\n\nWeaknesses\n* The identification of which POS is relevant for which task remains very manually derived. It would be interesting to see the conditioning on POS as part of an objective function that could be learned as part of the training operation. This would eliminate the need for a user to perform a POS base analysis in order to bring this framework to a new task.\n* The reported claims of NOUNS for topic classification and VERBS and ADJECTIVES for sentiment is not as clearly supported by the data as the abstract would suggest.  While the role of nouns in topic classification is reasonably well supported, Table 3 suggests a more nuanced situation in the Sentiment Analysis corpora with less consistency across corpora.  Similarly Table 4 suggests that there are corpora differences again in the value of replacing different POS classes.  While the syntactic class as a space for augmentation.\n* The reported differences in Tables 5 and 6 are small.  Some significance testing would go a long way to understanding the relevance of these findings.  Specifically, it's not clear that the value of PMixUp compared to TMix is substantial enough to warrant the additional training and risk of poor replacement generation. \n* The findings from Tables 1-3 seem to be inconsistent with those in Table 5.  The replacement based augmentation benefits from NOUNS for topic classification somewhat strongly.  However, in Table 5, this suggests that VERB replacement is better when replacement augmentation is combined with TMIX.  This relationship is surprising and suggests that initial analyses based on, say replacement, may not be useful to designing a system.  The two approaches aren't entirely complementary",
            "clarity,_quality,_novelty_and_reproducibility": "Clarity: Mostly clear.  Additional contextualization for the analyses would be helpful.  The claims made in the abstract and introduction are less consistently supported by the data than would be expected.\n\nQuality: Reasonably high\n\nNovelty: Modest.  Both TMix and replacement augmentation have been previously developed. Their combination is being addressed in this work, with additional analysis for the tasks the paper focuses on.\n\nReproducibility: High\n\n",
            "summary_of_the_review": "The approach of combining TMix and replacement augmentation is sensible.  The particular claims about the relationship between POS classes and sentiment analysis are not as clean as would be expected from the presentation of the work.  It's not clear how this would be extended to some other NLP/NLU task without a similar precursor POS analysis.  Additionally the value of POS sensitive replacement is not obviously necessary for either task; while there is some improvement, it is typically quite modest and not entirely consistent across tasls .\n\nTable 6 includes a typo 9017 should be 0.9017.  \nTable 5 why is StackOverflow 10, TMix (reproduced) only 0.0663 while even the no augmentation baseline is 0.2668?",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2549/Reviewer_8rka"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2549/Reviewer_8rka"
        ]
    },
    {
        "id": "FU00o7nuI_",
        "original": null,
        "number": 4,
        "cdate": 1670046984630,
        "mdate": 1670046984630,
        "ddate": null,
        "tcdate": 1670046984630,
        "tmdate": 1670046984630,
        "tddate": null,
        "forum": "O4fNuE8F51T",
        "replyto": "O4fNuE8F51T",
        "invitation": "ICLR.cc/2023/Conference/Paper2549/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper proposes PMixUp that combines two augmentation methods (replacement-based augmentation and feature space augmentation) for the topic classification and sentiment analysis. They emphasis the importance of POS tags for those NLP tasks based on their study, and apply the feature space interpolation to swap out tokens corresponding to those POS tags. The results indicate that nouns are matter to some extent when selecting to label the topics.  ",
            "strength_and_weaknesses": "Strengths:\n* The paper reads well and it is in general easy to follow.\n* The idea is neat and easy to implement the method of combining the two augmentations is clear.\n\nWeaknesses:\n* The novelty of the proposed method is relatively limited, especially in terms of theoretical contribution. \n* Determining which types of POS are relevant to model performance on push tasks is still somewhat unclear. It would be great to further explore the error analysis based on the tokens and sentences.\n* The impact of model performance by augmenting Nouns, Verbs and Adjectives for those NLP tasks are limited from the results shown in Table 3 and Table 4.",
            "clarity,_quality,_novelty_and_reproducibility": "Clarity and Quality:\nThe paper is clear and the content is easy to read.\n\nNovelty:\nThe novelty of the proposed method is relatively limited, especially in terms of theoretical contribution.\n\nReproducibility: \nDue to the lack of details of the experimental setup, it might be difficult to reproduce the experiment.",
            "summary_of_the_review": "The method of combining two augmentation of techniques is reasonable. The results show the types of POS can impact for the model performance in some circumstances. However, it is not clear to demonstrate the settings for all the experiments. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper2549/Reviewer_Rbzx"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper2549/Reviewer_Rbzx"
        ]
    }
]