[
    {
        "id": "Ibv6NdYf5dw",
        "original": null,
        "number": 1,
        "cdate": 1665649957944,
        "mdate": null,
        "ddate": null,
        "tcdate": 1665649957944,
        "tmdate": 1669037208547,
        "tddate": null,
        "forum": "PFbzoWZyZRX",
        "replyto": "PFbzoWZyZRX",
        "invitation": "ICLR.cc/2023/Conference/Paper660/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "The paper proposes an efficient ANN-SNN conversion method based on Spike Calibration. The experiments show that the conversion using the proposed approach reaches competitive accuracy with few time-steps.",
            "strength_and_weaknesses": "Strengths:\n1. The tackled problem is relevant to the scope of ICLR.\n2. The results look promising.\n\nWeaknesses:\n1. It is recommended to change the title to avoid confusion with the following paper:\nYang Li, Xiang He, Yiting Dong, Qingqun Kong, Yi Zeng. Spike Calibration: Fast and Accurate Conversion of Spiking Neural Network for Object Detection and Segmentation. CoRR abs/2207.02702 (2022).\n2. In Section 2: \"Inspired by these works, we incorporate the concept of calibration spike time into the conversion pipeline to bridge the gap between ANNs and SNNs.\" This sentence is too vague. The differences between the related works and the proposed work should be properly discussed in detail.\n3. All the figures are too small (in particular the legends). It is recommended to increase their size to make them readable.\n4. The description of the proposed method in Section 4 looks too vague and hard to follow. It is recommended to use algorithms, schemes, examples to ease the discussion. (To save space, the content of Section 3 can be moved to the appendix.)\n5. It would be useful to provide the source code for reviewers' inspection during the rebuttal.",
            "clarity,_quality,_novelty_and_reproducibility": "Clarity: 6/10\n\nQuality: 6/10\n\nNovelty: 6/10\n\nReproducibility: 6/10",
            "summary_of_the_review": "Borderline paper where several concerns should be clarified.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper660/Reviewer_EoJ9"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper660/Reviewer_EoJ9"
        ]
    },
    {
        "id": "2oiLP8nkBId",
        "original": null,
        "number": 2,
        "cdate": 1666081914596,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666081914596,
        "tmdate": 1668735003092,
        "tddate": null,
        "forum": "PFbzoWZyZRX",
        "replyto": "PFbzoWZyZRX",
        "invitation": "ICLR.cc/2023/Conference/Paper660/-/Official_Review",
        "content": {
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully.",
            "summary_of_the_paper": "This paper proposes the offset spike to measure the deviation of expected spikes and actual spikes of SNNs in ANN2SNN conversion, so as to avoid evaluating different conversion errors and then eliminating these errors. The authors find that the case of firing one more (or less) spike is the main reason for the degradation of SNN performance in ANN2SNN conversion. Thus they propose an optimization method to reduce the offset spike by shifting up or down the initial membrane potential. Overall they achieve SOTA accuracy on CIFAR-10/100 and ImageNet datasets with fewer time steps.",
            "strength_and_weaknesses": "Strength:\n\n1. This paper is well-written and easy to follow.\n\n2. The idea of the offset spike is interesting. The conclusion that the case of firing one more (or less) spike is the main reason for the degradation of SNN performance in ANN2SNN conversion is impressive.\n\n3. The proposed framework is supported by theoretical analysis.\n\n4. The proposed method achieves SOTA performance in ANN2SNN conversion and comparable performance as BPTT with less computational cost.\n\nWeakness:\n1. All figures are too small to follow.\n\n2. The proposed method needs to take extra steps to acquire the remaining membrane potential, which decides the lower bound of the time steps.\n\n3. The paper lacks ablation experiments to show that the proposed shifting strategy is optimal.\n\nMore questions:\n\n1. The definition of offset spike (equation 8) lacks explanation. The authors should claim that they follow the QCFS framework with $\\lambda=\\theta$. Otherwise, it can not represent the gap between ANN and SNN output.\n\n2. It is interesting to see that the proposed method has an iterative property to reduce conversion error. However, why are the Ratio and MSE in Table 3 not zero after multiple iterations?\n\n3. Please add the ablation experiments to show that the proposed shifting strategy is optimal. The authors should compare it with other initialization strategies.\n\n4. The proposed method needs to take extra steps to acquire the remaining membrane potential. Can you comment on the implementation on Neuromorphic chips?\n\n5. I think figure 1 is under the condition of $T=L$. Am I right? How to rectify the firing rates of neurons in Figure 1c-d?\n\n6. Please clarify the value of L and T in Figure 3.",
            "clarity,_quality,_novelty_and_reproducibility": "The paper appears to be technically sound, and the main idea is novel. Key codes are available, and the experimental details are provided such that an expert should be able to reproduce the main results.",
            "summary_of_the_review": "This paper proposes the offset spike to eliminate ANN2SNN conversion error with a new perspective. I like the idea and would like to increase my score if the authors can solve my concerns.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper660/Reviewer_rBPQ"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper660/Reviewer_rBPQ"
        ]
    },
    {
        "id": "IC_AWnwV3NP",
        "original": null,
        "number": 3,
        "cdate": 1666407130643,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666407130643,
        "tmdate": 1666407130643,
        "tddate": null,
        "forum": "PFbzoWZyZRX",
        "replyto": "PFbzoWZyZRX",
        "invitation": "ICLR.cc/2023/Conference/Paper660/-/Official_Review",
        "content": {
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully.",
            "summary_of_the_paper": "This work proposes a spike calibration algorithm for reducing the conversion errors in ANN-SNN conversion models. The authors provide a new measurement for the conversion error by the offset spike and develop an optimization strategy that can shift initial membrane potential to offset the conversion errors iteratively. They also analyse the optimal shifting strategy theoretically. Their results on CIFAR10, CIFAR100 and ImageNet demonstrate a high inference accuracy with low latency. This paper proposes a simple and powerful method for the ANN-SNN conversion model, which promises in deploying the neuromorphic chips for energy-efficient inference.",
            "strength_and_weaknesses": "Strength:\nThe writing is well-written and readable in general. The overall idea makes sense and demonstrates a high performance compared with other conversion methods.\n\nWeakness:\nThe proposed approach requires the computation of additional offset spikes iteratively for each layer. Did the authors evaluate the additional computational cost of this method, e.g., the additional running time and the number of operations? Also, it would be better to provide a comprehensive comparison that incorporates this part with other conversion methods.\n\nThe key observation of using offset spikes for reducing conversion errors is derived from the QCFS function and IF model. Can it be generated to any conversion model with other activations or other neuron models?\n\nThe comparison between the computational complexity of backpropagation approaches and ANN-SNN conversion is unclear and inaccurate. What’s the exact meaning of complexity? Does the comparison incorporate the training of ANN parts for converted models?\n\nPlease provide necessary explanations for each figure in the corresponding legends, for example, the different types of bars in Fig. 3. Also, please adjust the font size in each figure to make it readable.",
            "clarity,_quality,_novelty_and_reproducibility": "The authors propose a new perspective to analyze the conversion errors from the offset spikes and develop a conversion method for ANN-converted SNN models. ",
            "summary_of_the_review": "This paper proposes a simple and powerful method for the ANN-SNN conversion model, which promises in deploying the neuromorphic chips for energy-efficient inference.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "empirical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper660/Reviewer_NhRe"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper660/Reviewer_NhRe"
        ]
    },
    {
        "id": "eyl1rgo0lP",
        "original": null,
        "number": 4,
        "cdate": 1666993345448,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666993345448,
        "tmdate": 1670475808858,
        "tddate": null,
        "forum": "PFbzoWZyZRX",
        "replyto": "PFbzoWZyZRX",
        "invitation": "ICLR.cc/2023/Conference/Paper660/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "The authors address the issues underlying ANN to SNN conversion and identify the firing of one more or less spikes as the main reason of failing conversion. This can be exploited in an optimization procedure over existence of an offset spike. Evaluation is done on simulated firing rates of cifar-100.\n",
            "strength_and_weaknesses": "+: The paper has a good introduction to the ANN-SNN conversion paradigm\n+: The authors make two good observations about the offset spike\n+: The authors state and show two theorems. While the math seems right, it is difficult to judge their relevance  \n\nUnfortunately, the paper is pretty much unreadable and I could only understand the technical part following the equations only but not the text.\n",
            "clarity,_quality,_novelty_and_reproducibility": "The paper has significant problems concerning readability. \nA lot of spelling and grammar mistakes make the text incomprehensible, and in many occasions, the reader has to guess what a sentence means. \n\n\"low time-steps\" means low number of time-steps or steps of short time?\n\n\"and answer the question of where the extreme performance of ANN-SNN conversion is.\"\nprobably means which are the reasons in the lack of performance of ANN-SNN conversion methods.\n\nThe text is rich in many such examples.\n\n",
            "summary_of_the_review": "The paper has very good technical content and it would make an acceptable contribution if the authors would write the non-mathematical part from scratch.\nI apologize that I cannot give a longer review, but the paper is not comprehensible.\n\nAuthors have made a significant revision and their efforts are really appreciated. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper660/Reviewer_oG9M"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper660/Reviewer_oG9M"
        ]
    }
]