[
    {
        "id": "bA_1A6YLYzq",
        "original": null,
        "number": 1,
        "cdate": 1666074267338,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666074267338,
        "tmdate": 1669100242886,
        "tddate": null,
        "forum": "rzrqh85f4Sc",
        "replyto": "rzrqh85f4Sc",
        "invitation": "ICLR.cc/2023/Conference/Paper764/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper propose a new approach for one-shot federated learning, by generating diverse outliers and introduces them as an additional unknown class in local training to improve the voting performance. The paper proposes novel outlier generation approaches by corrupting the original features and further develop adversarial learning to enhance the outliers. The experimental results demonstrate the effectiveness of the proposed method. ",
            "strength_and_weaknesses": "Pros:\n\n- The paper is technically sound and easy to understand.\n\n- The method of introducing unknown class is novel and reasonable in FL learning.\n\n- The experimental results show the effectiveness of the proposed method.\n\nCons:\n\n- Lack of details of the experimental setting of distilled FedOV.",
            "clarity,_quality,_novelty_and_reproducibility": "The clarity, quality, novelty and reproducibility of this paper is good.",
            "summary_of_the_review": "In short, the paper is novel and technically sound and easy to understand. The experimental results demonstrate the effectiveness of this paper.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper764/Reviewer_Y1Mp"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper764/Reviewer_Y1Mp"
        ]
    },
    {
        "id": "nnSfbZbVn59",
        "original": null,
        "number": 2,
        "cdate": 1666158001775,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666158001775,
        "tmdate": 1666158176151,
        "tddate": null,
        "forum": "rzrqh85f4Sc",
        "replyto": "rzrqh85f4Sc",
        "invitation": "ICLR.cc/2023/Conference/Paper764/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper proposes a novel approach named FedOV which generates diverse outliers and introduces them as an additional unknown class in local training to address the label skew issue in one-shot Federated Learning (FL). Concretely, it proposes novel outlier generation approaches by corrupting the original features and further develops adversarial learning to enhance the outliers based on open-set recognition.\n\nThe main contributions of this paper are:\n\n- This paper points out that the voting-based FL approaches are either directly used as a final model for predictions or distilled as a single model, thus failing to produce high-quality federated learning models.\n\n- This paper may be the first time to propose open-set voting in FL by introducing the “unknown” class, which significantly improves the accuracy compared to traditional close-set voting in FL.\n- This paper proposes two techniques (i.e., data destruction and adversarial outlier enhancement) for generating diverse “unknown” outliers without requirement on the number of classes of the training data.\n\n",
            "strength_and_weaknesses": "### Strength\n\n- The problem studied in this paper is interesting and valuable. Specifically, label skews is an essential issue that exists in one-shot federated learning and is urgent to be solved.\n- This paper provides some novel perspectives. Applying Open-Set Recognition (OSR) into FL to introduce an unknown class to improve the voting is a novel view for overcoming label skews in one-shot FL.\n- This paper conducts extensive experiments and demonstrates the advantages of the proposed method over the state-of-the-art LDL methods, which can effectively reflect the performance of the algorithm.\n- The paper is well-organized and clearly written, which is easy to follow.\n- The code is provided in the attachment for reproduction.\n\n### Weaknesses\n\n- In section 1, the author mentioned, \"For example, in an extreme case where each client only has one label (e.g., face recognition), all clients predict the input as its own label and the voting result is meaningless\". This case is a typical situation studied in this paper. However, there exist some works handling this case that are not mentioned in this paper, such as [1]. I think it is necessary to discuss and compare the proposed algorithm with these methods.\n\n- In Table 3, one can notice that the performance of Distilled FedOV is worse than FedDF. The authors should analyze the reason for this phenomenon.\n\n[1] Yu, Felix, et al. \"Federated learning with only positive labels.\" *International Conference on Machine Learning*. 2020.",
            "clarity,_quality,_novelty_and_reproducibility": "Clarity: The paper is well-organized and clearly written.\n\nQuality: Technically solid paper, with a high impact on the research field of federated learning.\n\nNovelty: The paper makes non-trivial advances over the current state-of-the-art.\n\nReproducibility:  Key details are sufficiently well-described for competent researchers to confidently reproduce the main results.",
            "summary_of_the_review": "I believe this paper is innovative and puts forward some new perspectives in the field of federated learning. However, I have concerns about whether this work can be accepted in its current form. I will update my reviews based on the authors' responses.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper764/Reviewer_hyjU"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper764/Reviewer_hyjU"
        ]
    },
    {
        "id": "sfT5wXOyNV",
        "original": null,
        "number": 3,
        "cdate": 1666531210494,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666531210494,
        "tmdate": 1668824982560,
        "tddate": null,
        "forum": "rzrqh85f4Sc",
        "replyto": "rzrqh85f4Sc",
        "invitation": "ICLR.cc/2023/Conference/Paper764/-/Official_Review",
        "content": {
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully.",
            "summary_of_the_paper": "This paper focuses on the label skew problem in one-shot federated learning. The author identifies the problem is attributed to the limited scale of certain class in different participants, which brings unreliable voting scores and thus results in ineffective global model. In this paper, authors propose FedOV, which leverage generated diverse outliers as additional unknown class to increase voting efficiency. Extensive experiments are conducted on MNIST, Fashion-MNIST, CIFAR-10 and SVHN datasets.",
            "strength_and_weaknesses": "Pros:\n+ It is intriguing to introduce the concept of unknown class into federated learning and investigate a novel problem open set voting federated learning\n+ The proposed method achieves new SOTA results on widely used benchmarks, which demonstrates the effectiveness of the proposed method.\n\nCons:\n- The authors propose data destruction and adversarial outlier enhancement modules to respectively generate outliers from true samples and learn a tighter boundary. However, these two components seem not specifically aims for missing class issue in label skew one-shot fl. It would be better to further consider the relation with federated learning setting.\n\n- The compared methods such as fedavg, fedprox, fednova are not designed for one-shot fl, it is nature that these methods perform worse on these experiments (Table1). So, it is not sure whether it is fair comparision.\n\n- Typing Errors\n\n1) ‘are used as part’  ‘are used as the part’\\\n2) ‘the above method’ ‘the above methods’\n3) ‘train 100 epochs each client’ ‘train 100 epochs for each client’\n4) ‘which causes massive’ ‘which cause massive’\n",
            "clarity,_quality,_novelty_and_reproducibility": "Marginal",
            "summary_of_the_review": "This paper investigates an interesting problem, label skew in one-shot federated learning. But the proposed method is lack of novelty, seems the directly combines of existing strategies. Besides, authors do not provide in-depth rationale analysis and spend a large space of article to incorporate methodology into existing methods.\n\nPost-rebuttal:\nThe authors provide comprehensive analysis in the response. Some issues have been clarified. I would like to raise my score to 6. However, some unclear parts should be clarified in the final version (if accepted).",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper764/Reviewer_ZcP3"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper764/Reviewer_ZcP3"
        ]
    }
]