[
    {
        "id": "Ns2q9TvM0ht",
        "original": null,
        "number": 1,
        "cdate": 1666323679972,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666323679972,
        "tmdate": 1666335802007,
        "tddate": null,
        "forum": "ToYi8C6fetv",
        "replyto": "ToYi8C6fetv",
        "invitation": "ICLR.cc/2023/Conference/Paper1247/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This paper studies the non-iid subgraphs of the clients in an FL course and proposes a novel pFL algorithm to tackle this challenge. The idea of measuring subgraph similarity via functional embeddings' similarities is novel, and the adaptive masking is synergistic and seems to be helpful. The authors have conducted extensive empirical studies, which confirms the effectiveness of FED-PUB and the rationale behind its components.",
            "strength_and_weaknesses": "Strengths:\n1. This paper is well-written, with each figure, table, and paragraph being very self-contained.\n2. The proposed method, FED-PUB, is the first one to exploit the functional embeddings for measuring subgraph similarities. Meanwhile, the authors introduce the client-wise learnable mask to further personalized the GNN models, in addition to the subgraph similarity-based cluster-based pFL aggregation.\n3. The empirical studies in this paper is solid, with SOTA federated graph learning algorithm as a baseline, public datasets, and in-depth analysis from various perspectives.\n\nWeaknesses:\n1. It seems that there is no theoretical analysis about the effect of similarity measure, not to mention the eventual generalization risk. Actually, the relationship between graph data and the model parameters is intricate. Although the similarity in functional space seems to be a reasonable proxy, why it is useful needs to be analyzed and answered.\n2. The masking scheme is not that novel to personalized federated learning. Thus, the technical contribution(s) of this paper seems to be insufficient (only the subgraph similarity measurement).",
            "clarity,_quality,_novelty_and_reproducibility": "Clarity: It is easy for me to follow the story. All the components of the proposed method is well defined and explained at least intuitively.\n\nQuality: The proposed techniques are well-motivated. Their design seems reasonable, at least from an intuitive aspect. The research questions answered in experiments are tightly related to the proposed method. However, without a theoretical analysis, I cannot persuade myself that the subgraph measurement must be helpful for clustering the clients. BTW, the discussions of related works could be further supplemented to be more comprehensive.\n\nNovelty: FED-PUB mainly consists of two main components: one is the subgraph measurement to promote cluster-based personalized federated learning; another is the adaptive masking. The measurement utilizes the similarity in functional space, which is novel to me, in the jargon of graph learning (actually, it has been extensively studied in general machine learning). However, the adaptive masking has been observed in recent personalized federated learning works.\n\nReproducibility: All the adopted datasets are publicly available. All the considered baselines have open-sourced implementation. The experimental protocols and results are detailed.",
            "summary_of_the_review": "This paper is completed and \"standard\". Techniques introduced in this paper are naturally motivated and sound helpful. However, the lack of a rigorous theoretical analysis makes me feel it is still below the bar of ICLR. I strongly encourage the authors to supplement such an indispensable part.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper1247/Reviewer_jjc2"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper1247/Reviewer_jjc2"
        ]
    },
    {
        "id": "9gQWImDH11",
        "original": null,
        "number": 2,
        "cdate": 1666352812053,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666352812053,
        "tmdate": 1666352812053,
        "tddate": null,
        "forum": "ToYi8C6fetv",
        "replyto": "ToYi8C6fetv",
        "invitation": "ICLR.cc/2023/Conference/Paper1247/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "Unlike the existing subgraph federated learning methods that overlook the heterogeneity among subgraphs, this paper proposes a personalized subgraph federated learning framework named FED-PUB, which enhances collaborative learning of subgraphs within the same community. To this end, it captures the communities based on functional embeddings of clients, then employs personalized sparse masks on the local GNN. Empirical results on six public datasets demonstrate the effectiveness of the proposed method. ",
            "strength_and_weaknesses": "Pros:\n\tThe motivation of this paper, i.e., considering the heterogeneity among subgraphs in the subgraph federated learning, is reasonable and has rarely been explored.\n\tThe ideas are technically sound.\n\tExtensive experiments show the superiority of the proposed method compared to other subgraph federated learning methods.\n\nCons:\na)  The idea that performs subgraph federated learning among similar subgraphs is relatively incremental, limiting this paper's novelty.\nb)  Some notations are confusing such as θ vs θ_i on page 4.\nc)  The functional embeddings are key ingredients in the proposed FED-PUB, and the authors utilize a randomly sampled graph as the input of GNNs at each client. However, the influence of different random graphs is missing.\nd)  At the beginning of model training, the functional embeddings derived from each client may not be accurate, resulting in the inaccurate grouping of communities. How does the proposed method deal with this situation?\ne)  The description of baselines is incorrect. For example, FedPerGNN/FedGNN actually introduces a trusted third-party server to augment subgraphs, rather than based on the similarity between the nodes in the local client and the nodes in other clients. Furthermore, FedGNN is a method based on heterogeneous user-item bipartite graphs, and it is unclear how the authors apply it to homogeneous graphs (e.g., Cora). Therefore, it is better to provide a detailed description of experimental settings.\n",
            "clarity,_quality,_novelty_and_reproducibility": "a)\tClarity: this paper is well-written and easy to follow.\nb)\tQuality: the quality of this paper is good.\nc)\tNovelty: the idea is quite incremental, which limits the novelty of this paper.\nd)\tReproducibility: The authors have attached the source codes in the supplementary file, \n",
            "summary_of_the_review": "Due to the limited technical novelty and misleading descriptions of related works, I recommend reject.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper1247/Reviewer_PHC3"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper1247/Reviewer_PHC3"
        ]
    },
    {
        "id": "s7xk0sBQKB",
        "original": null,
        "number": 3,
        "cdate": 1666906483213,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666906483213,
        "tmdate": 1666906483213,
        "tddate": null,
        "forum": "ToYi8C6fetv",
        "replyto": "ToYi8C6fetv",
        "invitation": "ICLR.cc/2023/Conference/Paper1247/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper proposes a personalized method for subgraph learning with multiple clients in different communities. The key idea is to measure the similarity between each customer pair and use that similar information for succeeding updates. Empirical results demonstrate superior performance on test accuracy.",
            "strength_and_weaknesses": "Strengths: \n1. This paper proposes an implicit method to exploit the community structure within the graph using pairwise similarity scores on clients. With this method, we can properly handle missing edges and subgraph heterogeneity with a reasonable performance gain in accuracy.\n\n2. Some implementation refinements, such as masking and regularizations, are applied to achieve better performance.\n\nWeaknesses:\n1. The method may sacrifice the user's privacy by calculating personalized information on the server side. From Equation (4), even though the information among different clients are mixed together on the server's side, there is a chance that personal data can leak since the mixing rule encourages aggregating similar clients. However, the paper needed to articulate the tradeoff between privacy and accuracy.\n\n2. The paper should have explicitly modeled a rigid community structure on the server's side. Instead, it uses an implicit similarity measurement that can potentially measure more complicated structures, such as overlapping communities. However, the empirical analysis needed to show a deeper insight using the similarity structure.",
            "clarity,_quality,_novelty_and_reproducibility": "A few comments on paper writing:\n1. In Section 3 \"each column represents a ...\" -> \"each row represents a ...\".\n2. Section 3 uses superscripts with brackets for both rounds and layers.\n3. In Section 3, \"few existing methods\" -> \"existing methods\".\n4. In Equation (2), what does it mean by summing over G_i when optimizing (\\theta_i, \\mu_i)?\n5. Figure 2 caption: \"each of which consists of one/two subgraphs\" -> \"community A consists of one subgraph, and community B consists of two subgraphs.\"",
            "summary_of_the_review": "This paper proposed a personalized idea for subgraph federated learning. My concern is that the accuracy gain may come from user information leakage. And there is no systematic discussion regarding the privacy-accuracy tradeoff.",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper1247/Reviewer_TrJG"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper1247/Reviewer_TrJG"
        ]
    }
]