[
    {
        "id": "Q18Y9besoD",
        "original": null,
        "number": 1,
        "cdate": 1666566616148,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666566616148,
        "tmdate": 1666566616148,
        "tddate": null,
        "forum": "uFZt0ZJi8BX",
        "replyto": "uFZt0ZJi8BX",
        "invitation": "ICLR.cc/2023/Conference/Paper379/-/Official_Review",
        "content": {
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully.",
            "summary_of_the_paper": "The authors propose a graph aware deep neural network for point cloud completion. The design a novel displacement aware augmenter layer to effectively up sample and refine coarse point clouds. The authors demonstrate state of the art performance of their proposed method on PCN and MVP datasets.",
            "strength_and_weaknesses": "The paper is very well written. The proposed method is very interesting and shows very good performance both quantitatively and qualitatively. The authors describe well all their design choices. The paper is well evaluated and also includes ablation studies to support the design choices of the proposed method. The authors provide their code to allow reproducibility of their results. The method shows a consistent improvement over competing method. Overall, I think this paper is a solid submission and I recommend the paper to be accepted.   ",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is well written, with proper use of the English language.\nThe authors explain their design choices in details and also provide code for reproducibility. \nMany components of the work can be considered incremental but are well executed. The authors also propose a novel displacement aware transformer. ",
            "summary_of_the_review": "The paper is well written. The proposed method demonstrates state of the art performance. The ideas are well explained and enough experiments and ablation studies have been conducted. I recommend the paper to be accepted.  ",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "10: strong accept, should be highlighted at the conference"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper379/Reviewer_CpHT"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper379/Reviewer_CpHT"
        ]
    },
    {
        "id": "XA1ME1qUQ4",
        "original": null,
        "number": 2,
        "cdate": 1666572228246,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666572228246,
        "tmdate": 1666572341391,
        "tddate": null,
        "forum": "uFZt0ZJi8BX",
        "replyto": "uFZt0ZJi8BX",
        "invitation": "ICLR.cc/2023/Conference/Paper379/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This paper proposes a model for coarse-to-fine point cloud completion. The model first extracts global features from a partial input, then produces a coarse point cloud which is fed to several blocks in a sequential manner, each increasing the number of output points and modifying them. Overall, architecture heavily relies on the use of restricted local self-attention and multi-scale feature processing.\n\nArchitecture is evaluated on PCN and MVP datasets and compared to a large list of recent related models showing performance exceeding state of the art. Additionally, the authors provide several ablation studies, evaluating the performance of various model components; and compare their model in terms of memory footprint and computational efficiency.",
            "strength_and_weaknesses": "Strength:\n* The model demonstrates state-of-the-art performance.\n* Evaluation is done for two benchmarks and the chosen baselines are recent.\n* Ablation studies are provided, showing how important different components are.\n***\nWeaknesses:\n* Although complete model is very specifically engineered, overall novelty is limited, since the proposed techniques rely on existing prior ideas.",
            "clarity,_quality,_novelty_and_reproducibility": "Overall clarity of presentation is sufficient, however the use of various acronyms is a bit excessive and hinders general readability.\n\nQuality of the written text and schematic visualizations of model components is good, visualization of point clouds is ok, but could be better.\n\nNovelty is somewhat limited, since the model is mostly a combination of existing techniques.\n\nThe authors provided sufficient details and uploaded the code for their experiments, so reproducing results should be straightforward.",
            "summary_of_the_review": "Given overall quality of the submission including detailed introduction of the model, extensive experiments with two benchmarks and various ablation studies, and the resulting state-of-the-art performance, I think this paper is a good candidate for acceptance, even if the novelty of the approach is limited. If the authors will release their code, it will definitely be interesting to the community.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper379/Reviewer_97KL"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper379/Reviewer_97KL"
        ]
    },
    {
        "id": "JcmPRoZ8km",
        "original": null,
        "number": 3,
        "cdate": 1666619918206,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666619918206,
        "tmdate": 1666619918206,
        "tddate": null,
        "forum": "uFZt0ZJi8BX",
        "replyto": "uFZt0ZJi8BX",
        "invitation": "ICLR.cc/2023/Conference/Paper379/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This paper proposes a Graph-Aware Network (GANet) for point cloud completion. The network consists of 1) a graph-based Multi-scale Edge Aggregator (MEA) to extract global features from the input partial point clouds, and 2) a Displacements-aware Point Augmentor (DPA) to upsample and refine the point clouds. GANet achieves state-of-the-art performance on PCN and MVP datasets.",
            "strength_and_weaknesses": "Strength:\n1) GANet achieves the state-of-the-art performance on PCN and MVP datasets.\n\nWeakness:\n1) Lack of clarity: \n\n1.1) In Section 3.1, the input to Local Edge Aggregator (LEA) is defined as P’ (Nx3) and F’ (NxD). While in Figure 2-left, the input becomes P (NxC) and F is missing. The symbols used in Figure-2 left and right are also inconsistent. \n\n1.2) In Section 3.1 Para. 1, “we use a different definition of edge”, what is this definition?\n\n1.3) In Section 3.1, “we define K1, K2, K3 as 10, 20, N respectively”, what is N?\n\n1.4) In Section 3.2, “the input of DPA is the point cloud Pi (Mx3)”, then what are the input point features? \n\n1.5) Connection between Section 3.1 and 3.2 is missing. It is difficult for readers to understand the complete pipeline of the proposed method.\n\n1.6) Symbols are also inconsistent between Section 3.1 and 3.2. \n\n\n2) Lack of clear motivation:\n\n2.1) The paper claims “Prior PointNet-based methods can hardly learn geometric information as they learn the global and local features from individual points” (Section 3.1) and “They (prior methods) usually employ MLPs-based feature extractor to learn the features of input, which may fail to exploit the geometric and structural features of the input” (Section 3.2) as the motivations of the proposed GANet. More in-depth analysis about the drawback of MLP-based feature extractor and the advantage of GANet is expected. Otherwise, the proposed method is not convincing. A simple quantitative comparison in Table 3 seems not enough.\n\n2.2) It’s hard to find the relation between GANet and “graph-aware”. In its core graph-based Local Edge Aggregator (LEA), the operations shown in Equations (1) & (2) seem no difference from MLP-based paradigm.\n\n\n3) Originality:\nThe core graph-based Local Edge Aggregator (LEA) is not novel. The paper does not clarify the definition of “edge” in this part, but:\n--> If the “edge” is defined in Euclidean space of raw points, there is no difference from PointConv [1].\n--> If the “edge” is defined in feature space, there is no difference from RandLA-Net [2].\n\n[1] W. Wu et al, “PointConv: Deep Convolutional Networks on 3D Point Clouds”, CVPR 2019.\n[2] Q. Hu et al, “RandLA-Net: Efficient Semantic Segmentation of Large-Scale Point Clouds”, CVPR 2020.\n\n",
            "clarity,_quality,_novelty_and_reproducibility": "The presentation is unclear and difficult to understand.\nThe core component in the proposed method is not novel. ",
            "summary_of_the_review": "The problem this paper aims to address is not clear, and core component in the proposed method is not novel. Besides, the overall presentation can be significantly improved, especially in Section 3, due to the confusing organization and symbols.",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "details_of_ethics_concerns": "N.A.",
            "recommendation": "3: reject, not good enough"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper379/Reviewer_NrG5"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper379/Reviewer_NrG5"
        ]
    }
]