[
    {
        "id": "TYrS1H16w5h",
        "original": null,
        "number": 1,
        "cdate": 1666627453495,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666627453495,
        "tmdate": 1666627453495,
        "tddate": null,
        "forum": "WVZQa2QYJN",
        "replyto": "WVZQa2QYJN",
        "invitation": "ICLR.cc/2023/Conference/Paper6448/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "The paper presents a database of precipitation forecasting from 30 Russian meteorological stations, and a benchmark of state-of-the-art deep learning methods for the forecast estimation. ",
            "strength_and_weaknesses": "Strengths:\n- The dataset is rich, containing information at several altitude levels, during 2 years, and with additional fields that are not always present in such datasets.\n- the comparison with other datasets is detailed, clear and very useful\n- a large number of state-of-the-art deep learning methods are compared on this dataset\n- a study on uncertainty estimation, performed by varying the seed of the learning phase, is performed\n\nWeaknesses:\n- from the table 1, it is not clear how this new dataset would make a difference, in particular, it looks to me that the fact that this dataset is coarse (the one with the smaller grid size yet on a large region) is probably very limiting for a task such as precipitation.\n- there are no methodological novelties\n- the uncertainty estimation is rather simple\n",
            "clarity,_quality,_novelty_and_reproducibility": "The paper is very well written and clear. \nWhile a very cutting-edge database release, revealing new insights and new model usages, can be worth publishing, it looks to me that this database is too similar to the others to be publishable in ICLR. The release of such dataset is important, and it is good for the community to have access to it, but it can't be the main contribution of an ICLR paper.\nBoth codes and data are released, even if it is not possible to access it now (the url is hidden due to blind review)",
            "summary_of_the_review": "The paper is very clear and presents an interesting database and benchmark of different precipitation forecasting databases and deep learning forecast estimation models. But I don't think it is enough for an ICLR publication as there is no particular novelty on either the database nor the methods.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper6448/Reviewer_ae7S"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper6448/Reviewer_ae7S"
        ]
    },
    {
        "id": "gYDO9jrX_dk",
        "original": null,
        "number": 2,
        "cdate": 1666679542119,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666679542119,
        "tmdate": 1666679542119,
        "tddate": null,
        "forum": "WVZQa2QYJN",
        "replyto": "WVZQa2QYJN",
        "invitation": "ICLR.cc/2023/Conference/Paper6448/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This work builds a new weather radar dataset to explore the precipitation nowcasting task, which additionally considers a wide variety of geographical and climatic conditions.  Moreover, the authors carefully describe the acquisition process and distributions of their dataset. Then, they perform several baselines for evaluation on their proposed dataset. ",
            "strength_and_weaknesses": "Strength: \nTheir proposed weather radar dataset considers more dimensions in contrast to previously published works, which could be useful to achieve the precipitation nowcasting. This dataset covers multiple climate zones, large timestamps over a two-year period. \n\nWeaknesses:\nThe baseline methods seem too naïve and lacks more ablation study experiments.\n1.\tThe authors claim their dataset could be applied into other ML task, e.g. data studying, anomaly detection. Wish to conduct related experiments to verify this statement.\n2.\tI wonder whether there exist additional data from other zones, which could be implement the cross evaluation of their baseline models.\n3.\tThere seems lack more details related works about this topic.\n4.\tThe evaluation metric just uses MSE in Table 2, which cannot reflect the accuracy of nowcasting.\n5.\tThe results of the previous methods on the proposed dataset also should be listed.\n",
            "clarity,_quality,_novelty_and_reproducibility": "Could you provide an evaluation of the quality, clarity and originality of the work?\nThe proposed dataset is significantly important, which will be practical in precipitation nowcasting. \nThe method could be easily implemented follow their descriptions. \n",
            "summary_of_the_review": "I suggest the authors could submit to a more appropriate journal will have a higher impact in their community.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper6448/Reviewer_MvGQ"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper6448/Reviewer_MvGQ"
        ]
    },
    {
        "id": "rjAYcq5ZETz",
        "original": null,
        "number": 3,
        "cdate": 1666720200450,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666720200450,
        "tmdate": 1666720200450,
        "tddate": null,
        "forum": "WVZQa2QYJN",
        "replyto": "WVZQa2QYJN",
        "invitation": "ICLR.cc/2023/Conference/Paper6448/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "1) This paper propsed a different weather prediction model by inducing a new dataset [above russia] which is adopted to evaluate all current models such as ConvLSTM etc. \n\n2) The results looks promising on this new datasets. ",
            "strength_and_weaknesses": "Pro: \n1) The dataset is attractive, I wonder how the models performance across different datasets, are their performance rankings consistent or not ? \n\nCons: \n2) The methods used are relatively low-cost, I wonder how heavy cost models, such as transformers like architectures, perform comparing with these baselines. \n\nHow is the dataset usability ?  Is the model trained based on such dataset can be comparable with the most advanced weather forcast devices .\n\n",
            "clarity,_quality,_novelty_and_reproducibility": "1) The paper is clear and easy to understand, novelty is limited but the dataset is attractive.  The paper should be easy to reproduce. ",
            "summary_of_the_review": "Good dataset, while limited domain relativity and novelty. ",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper6448/Reviewer_TLZx"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper6448/Reviewer_TLZx"
        ]
    }
]