[
    {
        "id": "-XUXEzfsED",
        "original": null,
        "number": 1,
        "cdate": 1666477392851,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666477392851,
        "tmdate": 1666477392851,
        "tddate": null,
        "forum": "YaPPldR6te",
        "replyto": "YaPPldR6te",
        "invitation": "ICLR.cc/2023/Conference/Paper4988/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "The problem tackled is that of the decay in performance of BCI systems over time. The article presents an analysis of an electrocorticography data set (n=6) used for brain-computer interface, and in particular discusses the importance of the different features used by a predictive model built with machine learning techniques.\nFour different models are put to the test and the one exhibiting highest prediction rates is further analyses to decode the importance of the different features.\nAlthough ML is popular for BCI applications, I agree with the statement that for the specific case of boosting longitudinal stability of the BCI its application is novel.\n",
            "strength_and_weaknesses": "Strengths\n\n+ The problem studied is clear and remains open and the study proposed in this draft is a clear contribution to the field.\n+ The introduction is entertaining and of adequate depth, the literature review is extensive and its use throughout the article is excellent, the methodology is solid, the results are clear, the discussion (embedded within the results) is interesting, and the article has high nomological validity.\n\nWeaknesses\n\nNot many…\n+ Absence of inferential statistics, and even the descriptive statistics is incomplete. For example, the standard deviations of the different statistics are not described, the statistical power analysis is not described, etc.\n",
            "clarity,_quality,_novelty_and_reproducibility": "This is certainly one of the strengths of the paper. Except for a couple of aspects that I would like to ask for more detail, but certainly this paper scores high on all; clarity, quality, novelty, and reproducibility. Regarding that couple of aspects:\n+ Why is the 6th rat considered useful for “external validity” yet there Is no evidence or explanation that this rat would be statistically different from the first 5, and certainly the surgery date is not a factor affecting the neural responses of the rodent, is it? If the rat is then statistically similar to the others (besides the natural inter-subject variability for which the other rats may be as different for all that I understand) then there is no reason to accept the 6th subject as useful for claiming external validity and it might be better to use it to increase the internal validity.\n+ 1000 replication for 95% statistical power seems pretty large even for small effect sizes. No further details of the power analysis is given. Can the authors indicate how was this calculated? Is perhaps the study overpowered?\n",
            "summary_of_the_review": "+ Without an analysis of error propagation it is difficult to anticipate how far in the long term would the predictive power of the model hold within useful boundaries.\n+ There appears to be no measure of the degradation of the performance of the xML pipelines as the prediction horizon is further away.\n+ Cross-correlated variables were removed. Were corrections considered (as opposed to simply dropping) e.g. statistical whitening, Bayesian multivariate decoupling, ARIMA models with a cross-variate feed, etc?\n+ The explanatory approach methods taken here (SHAP and decision paths) is actually very insightful and in principle is generic, hence it could be translated to other BCI modalities; e.g. EEG based, fNIRS based, etc. What adaptations would be suggested to do so?\n+ Although the translation to humans is identified as one of the limitations of the study, I can see how rather than a limitation of this study that makes up for a different study altogether. In this sense, my question is a bit more humble, regardless of the length of the BCI intervention, and focusing strictly on the predictive horizon of the model (currently shown at 15 weeks for the rats), is it likely to be at least equally long in humans? Even if it is only for 15 weeks, that remains a quite reasonable horizon in humans, but unfortunately, with a much more complex nervous system, I reckon the decay of the performance of the predictive models might suffer more heavily?.\n\n\nMinor details\n+ Figures looks grainy on my end (although readable). Not sure whether this is only on my side, but just in case it does not cost much to double check.\n+ AI and ML are closely related but not the same. The authors seem to use explainable machine learning and explainable artificial intelligence interchangeably. If this is intentional, I’m fine with it. If not, why not stick to only one of them? Subjectively I would say this paper in particular is closer to xML rather than xAI but I wouldn’t argue with other perceptions.\n+ Some of the things explaining the figures are in the main text. Of course, every author has its style and I do not want to interfere. But if there is no strong preference, may I suggest to move such parts to the figure caption to make the images self-contained?\n\n",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "empirical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "flag_for_ethics_review": [
                "Yes, Other reasons (please specify below)"
            ],
            "details_of_ethics_concerns": "Animal models are used for experimentation. Moreover, an invasive procedure is conducted (to implant the electrodes). However, no ethical approval details are indicated.",
            "recommendation": "8: accept, good paper"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper4988/Reviewer_byYz"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper4988/Reviewer_byYz"
        ]
    },
    {
        "id": "y9xY3TVmJa",
        "original": null,
        "number": 2,
        "cdate": 1666667480643,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666667480643,
        "tmdate": 1670382160429,
        "tddate": null,
        "forum": "YaPPldR6te",
        "replyto": "YaPPldR6te",
        "invitation": "ICLR.cc/2023/Conference/Paper4988/-/Official_Review",
        "content": {
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully.",
            "summary_of_the_paper": "The authors propose a new unique longitudinal dataset with a custom-designed microelectrode array implanted in 5 rats to develop models for predicting microelectrodes arrays dead channels and, more importantly, explain what factors are the most influential for predicting dead channels.  \n",
            "strength_and_weaknesses": "The collected data is very interesting and useful for the proposed task (predicting dead channels and explaining what factors influence dead channels). The analysis is sound and well-conducted. \n\nHowever, I think that the claims made in the paper are a little too strong. \n\nThe claim, in the abstract, that \"Predicting whether a channel will have sortable units across time would mitigate this issue and increase the utility of these devices by reducing uncertainty, yet to-date, no such methods exist\" is not true. This has been done (see for example Spike sorting pipeline for the International Brain Laboratory, IBL, 2022), with a method predicting bad channels in Neuropixels probes based on similarity with neighboring channels. I agree that this is different from the work in this paper but it would be worth explaining the difference a little better. \n\nAlso, I think it would be straightforward to extend the author's analysis to high-density probe recordings where dead channels can be detected, to evaluate the accuracy of the prediction. \n\nI would have liked to see a schematic of the experiments, showing a diagram of the probe (it is hard to know what the probe looks like from the text), and also explain the features that are input to the model in more depth. I couldn't understand if the authors use all the spikes info, and how they calculate SNR, amplitude or magnitude for the channels. \n\nThe novelty of the approach is that the model predicts dead channels using features like Subject/time post implantation, that have a high SHAP value. However, lots of additional features could have been used and the selection of features seems bit arbitrary. Why use channel's amplitude and SNR? Having a model that solely predicts the dead channels using info that is not contained in the signal would be much more impressive and informative. Moreover, I think it should be easy to get higher accuracy when using signal info. \n\nFinally, it seems to me that \"time post-implantation\" is obviously important to predict dead channels, as well as \"Subject\" and it does not really inform us about the reason why a channel dies (i.e. Subject could mean many different things - such as a problem when implanting the probe or else), which make the conclusions a little less informative. \n\n\n\n",
            "clarity,_quality,_novelty_and_reproducibility": "this work is clear and novel. ",
            "summary_of_the_review": "The idea presented in this paper is interesting and novel, but the model should be refined (i.e. by using different features for prediction and explaining the choice of features a bit more). The conclusions drawn from the model could potentially be much more informative using a different set of features. I hence don't recommend acceptance of this paper.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper4988/Reviewer_eCAt"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper4988/Reviewer_eCAt"
        ]
    },
    {
        "id": "nmW8Ycjwln",
        "original": null,
        "number": 3,
        "cdate": 1666805530964,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666805530964,
        "tmdate": 1666805530964,
        "tddate": null,
        "forum": "YaPPldR6te",
        "replyto": "YaPPldR6te",
        "invitation": "ICLR.cc/2023/Conference/Paper4988/-/Official_Review",
        "content": {
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked.",
            "summary_of_the_paper": "This paper uses explainable machine learning methods to study which factors impact the number of active channels in a BCI. The authors analyse a number of important factors such a intersubject variability, time post-implantation, electrochemical properties and electrode design. The analysis relies on a reasonable dataset in mice. ",
            "strength_and_weaknesses": "I am not sure how this paper fits into a typical ICLR paper, bu this paper addresses an important problem in BCI. \n\nIn addition to the SHAP values associated with each parameter, it might be helpful to see the impact of each parameter directly on the % of active channels (similar to what is done for electrode design parameters in Section 3.2). This would help understand how the methods used in this paper help with better explainability. \n\nStability of SHAP values across different partitions of individuals would be useful to know. That is, how uniform are the contributions of different features across different individuals? \n\nDo the factor contributions (SHAP values) change with classifier type?",
            "clarity,_quality,_novelty_and_reproducibility": "Well written paper overall.\n\nThe text is not clear on how global explanations and local explanations are related, and how they differ. \nSimilarly, it is not clear what question is being answered in Section 3.5. ",
            "summary_of_the_review": "While more analysis can be done, I think the paper is a nice contribution to an important BCI question. I am not sure how much this aligns with the theme of ICLR. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper4988/Reviewer_Mjwm"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper4988/Reviewer_Mjwm"
        ]
    },
    {
        "id": "-_gAQiEiolW",
        "original": null,
        "number": 4,
        "cdate": 1666893837456,
        "mdate": null,
        "ddate": null,
        "tcdate": 1666893837456,
        "tmdate": 1666896691717,
        "tddate": null,
        "forum": "YaPPldR6te",
        "replyto": "YaPPldR6te",
        "invitation": "ICLR.cc/2023/Conference/Paper4988/-/Official_Review",
        "content": {
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work.",
            "summary_of_the_paper": "This paper focuses on invasive brain-computer interfaces (BCIs) using intracortical electrodes that are susceptible to degradation of signal quality over time. The goal of the study is to predict whether channels in intracortical electrodes are active based on features from neural recordings, electrochemical data and physical characteristics of the electrodes and assess feature importance. Results are presented from an animal experiment.",
            "strength_and_weaknesses": "Strength\n- Well designed study with novel dataset that is highly relevant to the neuroscience/BCI/machine learning community.\n\nWeaknesses\n\n- It is not clear that the paper answers the question of when a channel will become inactive or assesses the longitudinal behaviour of channels over time (\"Predicting when stability of neural signals will decrease and understanding which features of the interface contribute to this, would benefit clinicians and researchers and improve utility of intracortical BCIs.\")\n\n- Authors do not provide results demonstrating how predicting whether a channel is active, and consequently the proportion of active channels is related to the downstream BCI task (e.g., movement of robotic arm). Assuming the proportion of active channels can be predicted, how is this information relevant to predicting the longitudinal performance of the BCI task?\n\n- Not really clear what additional insight is revealed by some of the feature analysis (e.g., sections 3.4 and 3.5) and based on previous analysis in the literature (section 3.3, e.g., intuitively, the longer the implant duration, the higher probability of inactive channels due to build-up, high impedance, etc.). \n\n- Small sample size and short duration of study, but understandable given the nature of the experiment. Authors acknowledge limitations.\n",
            "clarity,_quality,_novelty_and_reproducibility": "Clarity\n- Overall paper is well written and well illustrated. \n\nQuality\n\n\nNovelty\n- Novel dataset. Authors apply previous methods in the data analsyis analysis. Authors claim that \"no ML studies have been applied on the longitudinal stability of intracortical BCIs.\" Custom-designed intracortical microelectrodes appears to be novel, but beyond the scope of the conference.\n\nReproducibility\n- Reviewer is unable to comment on the details of the animal study/data generation. Details are provided to reproduce the data analysis.\n\n\n",
            "summary_of_the_review": "\nRecommendation is based on the strengths and weaknesses described above.\n\nOther Comments:\n\n-    While Figure 1 is well-annotated, caption should be more informative and direct reader through understanding the various components of the figure. Same for Figure 4.\n\n-\tOffline Sorter: Authors need to provide more details about Offline Sorter because it is confusing. Is it a software algorithm than can automatically identify spike waveforms or does it require manual review with “blind reviewers”? If Offline Sorter is automated, why is a ML algorithm need to predict active channels if similar information can be obtained using Offline Sorter?\n\n-\tCustom-designed intracortical microelectrode: Are some of the features able to be recorded automatically using conventional electrodes or are they available due to the custom designed microelectrode? \n      o\t \"First, we obtained the electrochemical (EIS and VT) and spike metrics of the first recording session with that had a sortable unit for a particular channel (”First S.U.”).\"\n",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "Yes, Responsible research practice (e.g., human subjects, data release)"
            ],
            "details_of_ethics_concerns": "Authors need to state the necessary approvals that were obtained for the animal study.",
            "recommendation": "3: reject, not good enough"
        },
        "signatures": [
            "ICLR.cc/2023/Conference/Paper4988/Reviewer_9zRr"
        ],
        "readers": [
            "everyone"
        ],
        "nonreaders": [],
        "writers": [
            "ICLR.cc/2023/Conference",
            "ICLR.cc/2023/Conference/Paper4988/Reviewer_9zRr"
        ]
    }
]