[
    {
        "id": "EJuPfl3vaD",
        "forum": "0t1O8ziRZp",
        "replyto": "0t1O8ziRZp",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7821/Reviewer_pgL7"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7821/Reviewer_pgL7"
        ],
        "content": {
            "summary": {
                "value": "The authors proposed a new method for finding optimal synthesis recipes for unseen netlists. They proposed three methods, one based on MCTS and a trained policy on training netlist (MCTS+L) and the other, and more superior, is using MCTS and a trained policy with a variable to control the reliance on the trained policy or the online MCTS search (ABC-RL). The variable \\alpha is determined based on a nearest neighbor search to determine if the netlist is close to the training netlists or not. The authors split the dataset of netlists into train, validation, and test sets and used the train to train the policy and used the validation set to set the hyperparameter that controls \\alpha. The experimental results show that the ABC-RL can outperform the other methods and SOTA in most of the test netlists and can achieve the best goe-mean performance."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- Extensive experimental results.\n  - The authors provided comparisons with multiple baseline including Online-RL, Simulated Annealing, MCTS, and MCTS+L and MCTS+L+FT.\n  - The study on training the policy on specific benchmarks was helpful showing the effect of \\alpha and closeness of netlist to the training dataset.\n  - They perform an ablation study on the architecture of the policy to determine the impact of the transformer architecture on the performance.\n- The authors motivated the need for a variable that can control the effect of policy vs MCTS very well by an example in the Introduction Section.\n- The paper is well written and organized and can be followed easily by non-experts. \n- The related literature has been sufficiently reviewed and cited."
            },
            "weaknesses": {
                "value": "- The idea of using \\alpha was interesting and novel to the best of my knowledge, however it is a simple and small contribution."
            },
            "questions": {
                "value": "- It would be great if the authors can also provide the results for the rest of the benchmark netlists to ensure that the similar performance gains hold up for the training and validation sets.\n- In Section 2.4, in definition of \\sigma_{\\delta_{th}, T}(z), replace \\teta with \\delta_{th}."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7821/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698103846253,
        "cdate": 1698103846253,
        "tmdate": 1699636957743,
        "mdate": 1699636957743,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "U6r8NQ4aGi",
        "forum": "0t1O8ziRZp",
        "replyto": "0t1O8ziRZp",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7821/Reviewer_yxFf"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7821/Reviewer_yxFf"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a new logical synthesis optimization sequence method ABC-RL based on MCTS and pertained policy. Unlike previous works, ABC-RL can compute the similarity of the new circuit with previous circuits, thus determining how much experience will be used. Experiments show that ABC-RL achieves SOTA optimization results in most circuits."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The idea that the degree of retrieval is determined by the similarity function is interesting, and it shows the advanced performance in experiments.\n\n2. The experiments are extensive.\n\n3. The paper is well-organized and easy to read."
            },
            "weaknesses": {
                "value": "1. Some other ML method baselines are not included. For example, the DRiLLS [1] results are not included in the paper, but it is an important method recently.\n\n2. The retrieval performance is not well reported. For example, it should give us examples of each circuit’s nearest neighbor circuit and similarity factor. \n\n3. ChiPFormer [2]  is an RL placement method with a pretrained policy and should be included in related work.\n\n[1] Hosny, Abdelrahman, et al. \"DRiLLS: Deep reinforcement learning for logic synthesis.\" 2020 25th Asia and South Pacific Design Automation Conference (ASP-DAC). IEEE, 2020.\n\n[2] Lai, Yao, et al. \"ChiPFormer: Transferable Chip Placement via Offline Decision Transformer.\" (2023)."
            },
            "questions": {
                "value": "1. Could you compare ABC-RL and DRiLLS methods?\n\n2. As weakness 2, could you give each circuit’s nest neighbor circuit and similarity factor?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission7821/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7821/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7821/Reviewer_yxFf"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7821/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698332810574,
        "cdate": 1698332810574,
        "tmdate": 1699636957640,
        "mdate": 1699636957640,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "QBna1vIOAd",
        "forum": "0t1O8ziRZp",
        "replyto": "0t1O8ziRZp",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7821/Reviewer_qBwB"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7821/Reviewer_qBwB"
        ],
        "content": {
            "summary": {
                "value": "Summary:\n This papers proposes ABC-RL method to smoothly change the impact of learned policy in the search objective based on the graph similarity. Similar designs to training examples will have more bias from learned policy, while novel circuit will use more search. Compared to prior method, the propose one outperforms in various designs in terms of area-delay product."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "Strength: \n\n1.\tThe proposed method is based on good observation that the benchmark has a large diversity, and the learned policy sometimes is not helpful for novel circuits.\n\n2.\tThe proposed method smoothly controls the importance of learned policy using GNN-based graph embedding similarity scores. The variable heuristic synthesis solution from the learned policy is encoded with transformer blocks for better performance.\n\n3.\tIt also runs fast with runtime benefits."
            },
            "weaknesses": {
                "value": "Weakness:\n\n1.\tThe overall framework basically does test-time augmentation. It assumes pre-trained policy is not generalizable to novel circuits, and by comparing the test example with the training example, it dynamically selects among two search strategies, but in a smooth way. The circuit similarity is a performance proxy for pretrained agent and MCTS method, and use that proxy to predict the weights to ensemble two models. The novelty, in this sense, is limited. Is it possible to combine more synthesis strategies based on a more general performance predictor at test time?\n\n2.\tThe usage of BERT is not well justified. There are other simpler methods to encode variable-length sequences, e.g., RNN. The attention model is also data-hungry during training. Why BERT is the most suitable encoder?\n\n3.\tThe assumption that learned policy cannot generalize to diverse benchmarks is not well supported. If there is generalizable knowledge in circuit representation and synthesis strategies, it should try to improve the generalization of the learned policy by using more data/better algorithms. If this problem in nature is not generalizable or learnable, then it is not necessary to use an RL agent to learn the synthesis strategy at the beginning. The proposed method does not fundamentally explain or solve the learnability of circuit synthesis problems, but rather uses two model ensembles to just cover some in-distribution data with learned model and out-of-distribution examples by search."
            },
            "questions": {
                "value": "Basically, it is listed in the weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7821/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698635029659,
        "cdate": 1698635029659,
        "tmdate": 1699636957483,
        "mdate": 1699636957483,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "CtAotUn5rd",
        "forum": "0t1O8ziRZp",
        "replyto": "0t1O8ziRZp",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7821/Reviewer_3ENJ"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7821/Reviewer_3ENJ"
        ],
        "content": {
            "summary": {
                "value": "This paper presents ABC-RL, a retrieval-guided RL approach to generate an optimized synthesis recipe for logic synthesis. ABC-RL tunes a weight that adeptly adjusts recommendations from pre-trained agents during testing. Given a circuit with high similarity to the circuits in the training dataset, ABC-RL assigns high weight to the policy by the RL agent. Otherwise, ABC-RL tends to rely more on the default searching strategy."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1.\tThis paper introduces a retrieval-guided RL agent to search for an optimized synthesis recipe for logic synthesis. ABC-RL selectively leverages the knowledge obtained during training based on the similarity between training and testing samples. This approach can address the issue of RL performance decrease caused by different data distributions. \n\n2.\tThe authors claim that ABC-RL can achieve up to 24.8% QoR improvement and reduce runtime up to 9x."
            },
            "weaknesses": {
                "value": "1.\tABC-RL calculates the cosine similarity between the embeddings of training and testing samples to determine the similarity score. Therefore, the quality of AIG embeddings is the key to the entire methodology. Unfortunately, the authors do not explore this issue and simply use a 3-layer GCN to do it. It's hard to believe such an approach could work properly. A circuit graph is a lot more complicated than a plain graph, not only it's directed, but more importantly, it has unique functions associated with it. Two AIGs could be very similar in terms of structure but differ significantly in terms of functionalities. Consequently, they may require different synthesis recipes, isn't it?\n\n2.\tThe experiments are conducted with a very small dataset, which only includes 23 netlists for training. This is not convincing. The proposed agent should have seen sufficient circuit designs to come up with a good RL strategy."
            },
            "questions": {
                "value": "Please refer to the weakness part."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission7821/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7821/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7821/Reviewer_3ENJ"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7821/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698759895374,
        "cdate": 1698759895374,
        "tmdate": 1700389951501,
        "mdate": 1700389951501,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "LS2H9Lwt1Q",
        "forum": "0t1O8ziRZp",
        "replyto": "0t1O8ziRZp",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7821/Reviewer_Pwwd"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7821/Reviewer_Pwwd"
        ],
        "content": {
            "summary": {
                "value": "This work introduces, ABC-RL, an MCTS+Learning algorithm to optimize the transformation recipes in logic synthesis to minimize the area delay product (ADP).  It employs GCN for AIG features and a transformer for applied transformations. It introduces a hyperparameter to adjust recommendations from pre-trained agents during the search. The hyperparameter is determined by similarity computed from GNN features learned during training. The key observation it leverages from hardware designs is that they contain both familiar and entirely new components. The empirical results show ABC-RL improves synthesized circuit Quality-of-Result (QoR) by up to 24.8% over SOTA methods and provides an average runtime speed-up of 1.6× compared to baseline MCTS."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The policy network architecture for recipe encoding and AIG embedding is reasonably selected.\n2. The novel introduction of a similarity-score-based hyperparameter effectively enhances ABC-RL convergence, as observed in the results.\n3. The study provides a comprehensive evaluation, comparing various search algorithms for logic synthesis recipe optimization, including MCTS, online RL, and simulated annealing. It also includes comparisons with MCTS+Learning with fine-tuning."
            },
            "weaknesses": {
                "value": "1. It would be beneficial to provide an estimate of the number of gates in each benchmark circuit. One concern with this approach is whether GCN-based AIG embeddings can effectively scale to real-world circuit designs.\n2. With the integration of GNN + transformer features. It is likely that the compute complexity and runtime of each search iteration would be higher than the baseline MCTS."
            },
            "questions": {
                "value": "1. How is it compared to non-learning-based recipes? Is there an O3 flag for logic synthesis? \n2. How does its wall clock time (not iterations) compare to other algorithms such as MCTS and SA+Pred?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission7821/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7821/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7821/Reviewer_Pwwd"
                ]
            }
        },
        "number": 5,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7821/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698837735965,
        "cdate": 1698837735965,
        "tmdate": 1699636957262,
        "mdate": 1699636957262,
        "license": "CC BY 4.0",
        "version": 2
    }
]