[
    {
        "id": "22BNg2QNME",
        "forum": "1RE0H6mU7M",
        "replyto": "1RE0H6mU7M",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3780/Reviewer_tjN7"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3780/Reviewer_tjN7"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a model-based method for Meta-RL. The method is based on the Deamer-v3 algorithm, which is already good at solving POMDPs. They propose three changes to Dreamer-v3, that make it better suited to meta-RL style POMDPs specifically. The changes are training the model on full episodes, scheduling the training horizon length, and adding rewards and timesteps to the observations. They test the proposed model on meta-RL tasks and show that it works well. Additionally, a theoretical result is presented, which shows that decomposable task distributions can enable much lower sub-optimality than non-decomposable task distributions. Using that theoretical result they suggest a simple empirical modification applicable to VariBAD, which achieves better results in the decomposable task distributions. The proposed method naturally enjoys the same benefit."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "## Contribution\n- Dreamer-style model-based RL algorithms seem like a natural fit for meta-RL problems. This paper shows that with few simple modifications, Dreamer-v3 performs well in meta-RL POMDPs.\n- The theoretical result about decomposable task distributions is interesting and nicely supported by the experiments.\n- The empirical results support the design choices and the theoretical results\n\n## Presentation\n- The paper is well written for the most part."
            },
            "weaknesses": {
                "value": "## Benchmark selection\n- The environments used in the empirical section nicely illustrate the theoretical points and the advantage from the design choices, but they still feel a little limited considering the POMDPs dreamer-v3 is capable of solving. I would not want you to drop any of the domains already included, but it would make the paper stronger to run the algorithms on something more complex than reacher, which is from the easier end of mujoco tasks.\n- It would be good to run the algorithm on at least some common meta-RL environments to help people who are familiar with that literature to ground the performance. I have no doubt that this works well there but it would be reaffirming to see those results. Consider running this for example in Walker and Humanoid tasks.\n- In the theory section, it is discussed that the local reconstruction could be harmful in high dimensional non-decomposable task distributions. It would have been good to include a demonstration of such failure mode in the experimental section.\n\n## Presentation\n- I found it confusing that the results from the room experiments were discussed in 3.2.2. before the room experiments were described.\n- Figure 2 is very small and busy. Neither 3.2.2 nor the caption contains enough detail to understand what is going on in the figure.\n- The sentence in parenthesis in the first paragraph of 3.2.2 is hard to interpret. Maybe a typo?"
            },
            "questions": {
                "value": "- The proposed method seems quite close to [1]. It would be good to add this in the related work section and discuss how they differ.\n- What are some examples of task distributions where the task dimension is high?\n\n[1] Pasukonis et al., 2022, Evaluating Long-Term Memory in 3D Mazes"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3780/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3780/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3780/Reviewer_tjN7"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3780/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698006570635,
        "cdate": 1698006570635,
        "tmdate": 1699636334657,
        "mdate": 1699636334657,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "yI2WezKS2l",
        "forum": "1RE0H6mU7M",
        "replyto": "1RE0H6mU7M",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3780/Reviewer_X5No"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3780/Reviewer_X5No"
        ],
        "content": {
            "summary": {
                "value": "In this paper, the authors tackle the problem of meta-RL: learning across a range of tasks at the same time. They combine the sample efficiency of model-based RL with an existing meta-RL framework to produce a method (Mamba) which is more sample efficient and powerful than existing methods on a range of meta-RL tasks including a set of novel tasks which are benchmarked against other methods.\n\nThe authors provide theoretical results comparing VariBAD (a meta-RL algorithm) with Dreamer (a model-based algorithm) on decomposable tasks which gives grounds for why such tasks are hard for model-free meta-RL algorithms. They then provide experimental results over a number of meta-RL tasks providing evidence for the improvements that Mamba has over existing methods.\n\nThe appendix goes into more detail on the theoretical and technical details."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "Based on the evidence provided, it is clear that within the domains examined, Mamba is a stronger meta RL-algorithm than those tested against both in terms of returns and sample efficiency. The results are clearly presented and the explanations are generally sufficient."
            },
            "weaknesses": {
                "value": "While overall the paper is good, and provides good evidence within the context, it seems that there are a number of approaches within the literature which have not been covered. These include:\n\n1) Pinon et al, A model-based approach to meta-reinforcement learning:transformers and tree search, https://arxiv.org/pdf/2208.11535.pdf\n2) Wang and Hoof, Model-based meta reinforcement learning using graph structured surrogate models and amortized policy search, https://proceedings.mlr.press/v162/wang22z/wang22z.pdf\n3) Clavera et al, Model-Based Reinforcement Learning via Meta-Policy Optimization, https://arxiv.org/pdf/1809.05214v1.pdf\n4) Lee et al, Context-aware Dynamics Model for Generalization in Model-Based Reinforcement Learning, https://arxiv.org/abs/2005.06800\n\nWhile there is a short section with a few papers on model-based RL, it seems that there are some important pieces of research which have been missed out here. Given how much has been missed, it is not clear that the results are as persuasive as they at first seem.\n\nIn addition, there exists an extensive meta-RL benchmarking suite produced by Wang et al, Alchemy: A benchmark and analysis toolkit for meta-reinforcement learning agents, https://arxiv.org/abs/2102.02926. I believe that it is vital for the community to come together to standardise benchmarking, and so such a toolkit seems ideal to truly show the applicability and strengths of Mamba.\n\nOn a stylistic note, there are many typos throughout, particularly in the Appendix. These, along with points of clarity are explained here:\n\n1) Section 3.2: family task-> family of task\n2) Section 3.2.1 PAC not defined\n3) S 3.2.1: with high number->with a high number\n4) S 3.3: singnals->signals\n5) The plot in figure 2 is not clear given that the environment has not been clearly explained by this point.\n6) Sometimes Dreamer-tune is written and sometimes Dreamer-tuned\n7) In section 4, figure 1 is mentioned, which appears very close to the beginning of the paper, without context and is unclear at this point. It should be later in the paper when it is introduced.\n8) Figure 4: amd->and\n9) Table 1: Bold font on the 7 in 73.9±3.1\n10) As discussed above, I believe that a lot of model-based meta-RL work has been left-out.\n11) A1 folmulation->formulation\n12) Definition 1 \\forall 1<=i<=N_T should be written \\forall i \\in [1,N_T]\n13) A2: well known Regret->Regret\n14) Bayes optimal does not have consistent hyphenation or capitalisation\n15) Above theorem 2: boudns->bounds\n16) Theorem 2: polynomial with d->polynomial of order d\n17) assumption the estimator->assumption that the estimator\n18) Top of page 14: bounds in the private case-> ?\n19) First equation on page 14: C_d should be C_{d^full}\n20) guerntee-> guarantee\n21) Proof of Lema 3->Proof of Lemma 3\n22) Theorem 3: distriubtion->distribution\n23) Theorem 3: Something is wrong after alpha-Holder continuous\n24) polynomial with d_max should again be \"of order\"\n25) assumption the estimator->assumption that the estimator\n26) using the fact the->using the fact that\n27) much favourable->much more favourable\n28) this kind of tasks->these kinds of tasks\n29) same amount of DoF->same number of DoF\n30) we have estimate->we have estimated\n31) Appendix B: short L=64->short (L=64)\n32) Check consistency of hyphenation in world-model throughout\n33) short 100 timesteps -> short (L=100)\n34) Top of page 16: p_agent and p_goal not defined\n35) Appendix E: It's not clear if there should be more in this section. \n\nAs can be seen, there are a lot of typos in the appendix which have taken away time from more important aspects of the paper."
            },
            "questions": {
                "value": "The questions are all based on the weaknesses in the previous section."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "None"
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3780/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3780/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3780/Reviewer_X5No"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3780/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698572500347,
        "cdate": 1698572500347,
        "tmdate": 1700633037671,
        "mdate": 1700633037671,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "Bgtois6d2c",
        "forum": "1RE0H6mU7M",
        "replyto": "1RE0H6mU7M",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3780/Reviewer_fKkT"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3780/Reviewer_fKkT"
        ],
        "content": {
            "summary": {
                "value": "This work draws a connection between model-based RL and a common meta-RL approach, VariBAD. Specifically, both encode the trajectory history into a latent variable, which is then used to predict observations, e.g., the state and rewards. This work leverages this connection to propose a new meta-RL approach based on Dreamer called MAMBA. Compared to Dreamer, MAMBA differs in three ways:\n(1) Like many meta-RL algorithms, MAMBA augments the state with the current timestep and the reward.\n(2) Whereas Dreamer only computes the latent variable over the past 64 steps of the history, MAMBA computes it over the entire past history. This helps in the cases where important information was discovered more than 64 steps ago.\n(3) MAMBA introduces a curriculum where the horizon of the episode is increased over time to help combat the effect where long-range model predictions are inaccurate at the beginning of training.\n\nThis work evaluates MAMBA and finds that it performs favorably compared to VariBAD and Dreamer."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "*Clarity*\n- This work is well-written and easy to understand. The problem this paper is attempting to solve, and its proposed algorithm are clearly presented, which makes it easier to reproduce.\n\n*Originality and Significance*\n- The proposed changes appear to be fairly minor: augmenting the state with these additional observations is something that happens in a fair number of other papers; and increasing the history length for computing the context variable is akin to increasing a hyperparameter in Dreamer, which is reduced for computational reasons. However, they seem fairly sensible and result in fairly good performance gains.\n- Additionally, this work makes interesting connections between model-based RL and VariBAD, and shows that Dreamer can outperform existing meta-RL algorithms.\n\nOverall, this work unproblematically provides several contributions that are interesting to the meta-RL community, so I would be in favor of acceptance."
            },
            "weaknesses": {
                "value": "I think this work already provides valuable contributions, but can primarily be strengthened significantly by shedding more light on its results.\n- MAMBA proposes 3 changes over Dreamer. It would be very helpful to perform an ablation study on these 3 changes and understand which ones are most important and how they impact performance.\n- This work finds that Dreamer performs better than VariBAD and HyperX out-of-the-box on meta-RL tasks. I find the paper's claim that this performance gap probably results from architectural differences (VariBAD uses a very simple architecture, whereas Dreamer's is heavily tuned), but it would be interesting to ablate this and understand this better. At face value, non-meta-RL algorithms outperforming meta-RL algorithms on meta-RL tasks is somewhat surprising, and warrants further investigation. Further, it would be worth understanding in what ways these algorithms differ out-of-the-box. Does Dreamer result in better exploration? Or just exploitation? Computing the results in Figure 4 for VariBAD could be very helpful. Additionally, on what sorts of tasks do we expect Dreamer to be better than VariBAD? The tasks in this work take a very particular structure (they decompose nicely into iterated tasks). Is this a structure that clearly benefits one of the algorithms? What happens when this structure is violated?\n- Further analysis of when it's important to predict the whole past + future (as in VariBAD) vs. local reconstruction (as in Dreamer) would be helpful. It's quite believable that local reconstruction could result in better empirical performance due to optimization, though the reason why VariBAD predicts the whole trajectory is as a proxy for predicting a distribution over dynamics, which is intractable. Predicting long-past events could in principle be really important for learning a good representation if some observation explains the dynamics seen early on, though this structure is not present in the current tasks, which may contribute to the conclusions drawn in this work. Some experiments or discussion on this would be helpful.\n- Similarly, discussion about when it is necessary / possible to use the entire past to compute the context variable would be helpful. For really long horizon tasks, rolling out a recurrent policy is simply computationally intractable, so chunking is necessary, e.g., along the lines of R2D2 (https://openreview.net/pdf?id=r1lyTjAqYX)\n- DREAM (https://arxiv.org/abs/2008.02790) reports better exploration than VariBAD on tasks requiring more sophisticated exploration. It \nand subsequent papers (https://arxiv.org/pdf/2211.08802.pdf) also provide more complex tasks. Given the results of Dreamer outperforming VariBAD out-of-the-box, it would be interesting to consider discussion or comparison with DREAM or on these more complex tasks.\n- Despite meta-RL being core to this work, the related works section glosses over a rich literature on meta-RL, including model-based meta-RL e.g., see https://arxiv.org/abs/2301.08028, https://arxiv.org/abs/1905.06424, https://arxiv.org/abs/1803.11347, https://arxiv.org/abs/1809.05214\n\nThese open questions are what justify my score of a 6 over an 8."
            },
            "questions": {
                "value": "Please see previous section."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3780/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698796832667,
        "cdate": 1698796832667,
        "tmdate": 1699636334454,
        "mdate": 1699636334454,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "ffaTK8roUe",
        "forum": "1RE0H6mU7M",
        "replyto": "1RE0H6mU7M",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3780/Reviewer_cu12"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3780/Reviewer_cu12"
        ],
        "content": {
            "summary": {
                "value": "The authors introduce MAMBA (MetA-RL Model-Based Algorithm), a meta-reinforcement learning algorithm developed using the Dreamer framework. The authors extend the Dreamer framework which was designed for POMDPs to the general case of meta-reinforcement learning.  Additionally, the authors introduce two novel environments specifically for meta-reinforcement learning with high-dimensional task distributions, which can be decomposed into lower-dimensional sub-tasks. They demonstrate the performance of their algorithm on these new environments as well as standard meta-RL environments."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The algorithm is sample efficient when compared to other meta-RL algorithms. \n\n2. The authors conduct a good number of simulations to explain their algorithm, and evaluate its performance. \n\n3. The paper is generally well written and easy to follow."
            },
            "weaknesses": {
                "value": "**The assumption of task decomposability and task independence is strong, vague, and confusing**\n\nThe paper assumes scenarios of task decomposability, where each task is decomposed into independent tasks, I think this is a pretty strong assumption, and not many environments will satisfy this criteria. The example quoted for task decomposability by the authors is a little confusing, the authors  provide an example of a robot being required to solve several independent problems in a sequence.  Isn't the fact that they should be performed in a sequence make the tasks dependent, and thus not independently decomposable? Further, in the Appendix (section C multi-goal Reacher-N) the authors claim that the environment is decomposable into *nearly independent sub-tasks*, which is a little vague and confusing.\n\n**Algorithmic contribution is minimal**\n\nThe proposed algorithm is a minor modification over Dreamer, with the only significant change being sampling full-meta episodes instead of a smaller fixed length"
            },
            "questions": {
                "value": "1. What determines the number of sub-episodes for each environment? It appears that each environment has a different number of sub-episodes. How does altering the number of sub-episodes influence the algorithm's performance?\n\n2. The algorithms are tested in deterministic environments (although I could be mistaken). How do you anticipate the performance would be affected if the environments were stochastic? Could the introduction of randomness potentially complicate the task identification process?\n\n**Minor Clarifications**\n\n1. In Figure 1 (left most) Why isn't the agent exploring the right portion of the semi-circle during the first episode? \n\n2. To enhance understanding, it would be beneficial to have comprehensive descriptions of the new environments (Multi Goal Rooms and Multi Goal Reacher), including details about their state-space, action space, and reward structure.\n\n3. I would encourage the authors to add markers to all plots to enhance readability."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3780/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3780/Reviewer_cu12",
                    "ICLR.cc/2024/Conference/Submission3780/Senior_Area_Chairs"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3780/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698818179967,
        "cdate": 1698818179967,
        "tmdate": 1700599161902,
        "mdate": 1700599161902,
        "license": "CC BY 4.0",
        "version": 2
    }
]