[
    {
        "id": "9Z38euiwcZ",
        "forum": "258EqEA05w",
        "replyto": "258EqEA05w",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4875/Reviewer_9DEf"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4875/Reviewer_9DEf"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a new data augmentation method to improve the performance of FL under feature shift. This method can be combined with other existing augmentation methods. The experiments demonstrate that the proposed method achieves better performance."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- Addressing the skewed feature distribution problem from a data perspective is interesting and important.\n- The proposed method is simple yet seems to be effective in addressing the feature shift problem, while keeping rather high privacy and security of the local data.\n- The paper is generally well-written and easy to follow.\n- The proposed method can be easily combined with existing methods and elevate their performances."
            },
            "weaknesses": {
                "value": "- Several existing methods are not compared in the paper: e.g., FedBN [1] and FedWon [2], which also focuses on addressing the feature shift problem. It seems that FedBN achieves better performance than most of the baselines + FedRDN at least in certain domains.\n- Only AlexNet is used for evaluating classification tasks.\n- The scope of the paper in terms of FL scenario is not clearly explained. Does the method work under cross-silo FL, cross-device FL, or both?\n\n[1] Fedbn: Federated learning on non-iid features via local batch normalization\n\n[2] Is Normalization Indispensable for Multi-domain Federated Learning?"
            },
            "questions": {
                "value": "- How would the proposed method perform using other models, such as ResNet?\n- It seems that the reason why the FedRDN can improve performance is not well illustrated in the manuscript.\n- Figure 3 in the supplementary is not very intuitive to demonstrate the superiority of FedRDN. Can the author offer more explanation?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4875/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4875/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4875/Reviewer_9DEf"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4875/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698507310435,
        "cdate": 1698507310435,
        "tmdate": 1699636471642,
        "mdate": 1699636471642,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "IVVuNgtCMY",
        "forum": "258EqEA05w",
        "replyto": "258EqEA05w",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4875/Reviewer_rKgT"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4875/Reviewer_rKgT"
        ],
        "content": {
            "summary": {
                "value": "In this paper, a data augmentation approach is proposed to tackle the issue of feature distribution skew in FL. This technique involves the computation and sharing of the mean and standard deviation of data across local client devices. Throughout the training process, data samples are normalized using randomly selected mean and standard deviation values from these stored statistics. This mechanism injects global information, resulting in improved accuracy."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "**Clarity & Quality**: This paper presents its method in a straightforward manner, substantiated by a series of experiments. The experimental outcomes are presented through tables and figures, facilitating a clear assessment of the efficacy of their approach.\n\n**Originality & Significance**: This paper presents an innovative approach involving the direct application of data statistics to input data. This method proves to be effective in addressing feature distribution skew within FL, resulting in improved accuracy"
            },
            "weaknesses": {
                "value": "1. The paper lacks theoretical analysis and comprehensive explanation. The proposed method needs more elaboration and theoretical support. (Q1, Q2)\n\n2. This study exhibits certain resemblances to FedFA. The approach involving the calculation of mean and standard deviation bears similarity to FedFA, with the key distinction being that this work concentrates on normalizing the input data. In this context, the paper could lack novelty or benefit from more comprehensive comparisons with FedFA.\n\n4. This approach has the potential to cause privacy risks. For instance, if the training data consists of patient information vectors from a specific hospital, sharing the mean and std could compromise the confidentiality of this sensitive patient data.\n\n3. Some details of the experiments are missing. (Q3)"
            },
            "questions": {
                "value": "1. In section 3.2, the author claims that sharing aggregated statistics is like injecting global information. Is there any guarantee or analysis to support that normalizing data using randomly selected mean and standard deviation values is considered equivalent to injecting global information?\n\n2. This method chooses different schemes for training and testing since it says \"output results may differ due to the varied statistics chosen\". Is this difference significant with varied choices of statistics? Could it work if applying no normalization during the test time?\n\n3. What are the details of the involved datasets? For example, how many clients do they have, how many samples on each client, etc.?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4875/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4875/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4875/Reviewer_rKgT"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4875/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698518521008,
        "cdate": 1698518521008,
        "tmdate": 1699636471546,
        "mdate": 1699636471546,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "qMhgLkTKEA",
        "forum": "258EqEA05w",
        "replyto": "258EqEA05w",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4875/Reviewer_aJPJ"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4875/Reviewer_aJPJ"
        ],
        "content": {
            "summary": {
                "value": "This work aims at tackling feature distribution skewed in FL. To this end, the authors propose a simple yet effective method where the statistics of data are shared across clients to augment local data. Solid experiments are conducted to verify the effectiveness of the proposed method."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. The proposed method is simple yet effective, with relatively high privacy security.\n\n2. Many scenarios are considered for evaluating the proposed method, providing solid experimental evaluation. The experimental results, like performance gain, are promising."
            },
            "weaknesses": {
                "value": "1. The authors may overlook some related works. The authors claim “few studies pay attention to the data itself”, but many works pay attention to the data itself in FL, such as [1] [2] and [3].\n\n2. It is hard to figure out why “injects the statistics of the dataset from the entire federation into the client’s data” can cause “effectively improve the generalization of features, and thereby mitigate the feature shift problem.” This is the key contribution of this work, but the authors claim it without support. This significantly weakens the contribution of this work.\n\n[1] Federated learning with non-iid data. Zhao et al. 2018\n[2] Virtual Homogeneity Learning: Defending against Data Heterogeneity in Federated Learning. Tang et al. 2022\n[3] Federated learning via synthetic data. Goetz and Tewari. 2020"
            },
            "questions": {
                "value": "I have several suggestions that may make the work more attractive:\n\n1. I suggest the authors do careful proofreading so that the paper can be more rigorous. For instance, the authors claim that “its (FL model) performance inevitably degrades, while suffering from data heterogeneity”. However, if clients hold iid data, its performance is comparable to the scenario of centralized training.\n2. According to the authors’ explanation, it is hard to figure the difference in data heterogeneity and feature shit or feature distribution skewed. I suggest the authors do careful proofreading so that the paper is more readable.\n3. All experiments are conducted under the P(X) shifting scenarios. I suggest the authors report more results on the scenario of P(Y) shifts, which may make the work more attractive (do not have much stress, as it is just a suggestion).\n4. Detailed descriptions for Figure 3 will make the motivation and conclusion more clear."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "N/A"
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4875/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698655754751,
        "cdate": 1698655754751,
        "tmdate": 1699636471460,
        "mdate": 1699636471460,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "wsTatyvScQ",
        "forum": "258EqEA05w",
        "replyto": "258EqEA05w",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4875/Reviewer_BGPc"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4875/Reviewer_BGPc"
        ],
        "content": {
            "summary": {
                "value": "This paper discusses the problem of feature distribution skew in federated learning (FL) and proposes a data augmentation technique called FedRDN to mitigate this issue. The main challenge in FL is data heterogeneity, which leads to feature shift due to different underlying distributions of local datasets. While previous studies have focused on addressing this issue through model optimization or aggregation, few have paid attention to the data itself. FedRDN addresses this by randomly injecting the statistics of the dataset from the entire federation into the client's data, improving the generalization of features and mitigating feature shift. The method is simple, effective, and can be seamlessly integrated into the data augmentation flow. Experimental results demonstrate its scalability and generalizability. The document also provides a summary of related work in FL with statistical heterogeneity and data augmentation techniques."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. This approach is different from previous methods and focuses on mitigating the feature shift at the input-data level.\n\n2. The paper is generally well-written and clear in presenting the problem, proposed approach, and experimental results.\n\n3. Experiments are conducted on multiple datasets."
            },
            "weaknesses": {
                "value": "1. The literature review appears to be incomplete or lacks recent research contributions.\n\n2. Improved paragraph transitions and organization are required.\n\n3. The presentation needs improvement."
            },
            "questions": {
                "value": "1. I am not that familiar with the skewed FL scenario, could you explain more about it?\n2. In Section 1, the effectiveness of data augmentation for FL at the input level has been mentioned times, how to improve it in this paper?\n3. In term of data augmentation, what are the differences between previous methods and the proposed method?\n4. In Eq.(6), the obtained image are equipped with global information, but how to measure the contribution of multiple distributions?\n5. The paper will be more attractive if state-of-the-art methods are included in experiments for comparison.\n6. For the purpose of reproducibility, it would be better to provide the code and datasets."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4875/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698974881303,
        "cdate": 1698974881303,
        "tmdate": 1699636471382,
        "mdate": 1699636471382,
        "license": "CC BY 4.0",
        "version": 2
    }
]