[
    {
        "id": "yx7CVvXz2D",
        "forum": "2GJm8yT2jN",
        "replyto": "2GJm8yT2jN",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6611/Reviewer_qyGv"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6611/Reviewer_qyGv"
        ],
        "content": {
            "summary": {
                "value": "The paper introduces a framework for unsupervised representation learning that overcomes the limitations of stationarity and topology. It combines a learnable self-organizing layer, density adjusted spectral clustering, and masked autoencoders to learn representations from high-dimensional data without relying on stationarity or topology. The model is evaluated on various datasets, including simulated biological vision data, neural recordings from the primary visual cortex, and gene expression datasets. Results show that the proposed method works well. The approach demonstrates promise for building unsupervised representations across high-dimensional data modalities, including modalities in natural sciences like chemistry, biology, and neuroscience."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- The paper is well-written. A clear structure can enhance the readability and understanding of a paper. However, the decision to reuse a large Figure 1 from multiple papers raises questions about the originality and visual presentation of the work. Creating a unique figure would enhance the paper's credibility and make it more visually cohesive.\n\n- The underlying idea is recognized as interesting and well-motivated. The paper successfully conveys the rationale behind each stage of the proposed method.\n\n- The paper conducts various experiments on different datasets, including simulated biological vision data, neural recordings, and gene expression datasets. This demonstrates the versatility and applicability of the proposed method across different modalities."
            },
            "weaknesses": {
                "value": "- The combination of well-known techniques in a pipeline is noted as a potential limitation. The lack of an end-to-end deep learning architecture is highlighted, questioning the level of innovation in the proposed method.\n\n- The absence of information on seed-related results makes it challenging to fully interpret and reproduce the reported results. More comprehensive reporting of experimental methodologies would strengthen the paper's scientific rigor. More transparency in the experimental methodology and inclusion of uncertainty statistics would enhance the robustness of the reported results.\n\n- The real-world dataset results are currently unconvincing. The reported accuracy metrics are comparable, and the absence of uncertainty statistics diminishes the robustness of the claims. More detailed analysis and statistical measures are needed to support the performance claims on real-world datasets."
            },
            "questions": {
                "value": "Refer to the comments above."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission6611/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission6611/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission6611/Reviewer_qyGv"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6611/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698461163064,
        "cdate": 1698461163064,
        "tmdate": 1700706401755,
        "mdate": 1700706401755,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "kiWLbgRRCH",
        "forum": "2GJm8yT2jN",
        "replyto": "2GJm8yT2jN",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6611/Reviewer_JGWe"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6611/Reviewer_JGWe"
        ],
        "content": {
            "summary": {
                "value": "The paper introduces a novel method for unsupervised representation learning which can handle signals lacking an explicit topology. The method is then evaluated on synthetic biological vision datasets,"
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The problem considered by the author seems relevant and their method intriguing, but I do not have enough experience in the field to give a proper judgement of the strengths."
            },
            "weaknesses": {
                "value": "See above. Additionally, some concepts introduced in the text are poorly defined and impossible to understand for a non-expert.\n\n1. In section 2.2, what are the 'dimensions' i and j? What is the manifold M? How do you define a Laplacian based on A?\n2. After equation 1, what density does p(x) represent?\n3. Section 2.3, the intended meaning of alignment is not clear to me. The idea of directly solving the alignment problem with low-level statistics is completely obscure: What is the alignment problem?\n4. What are the metrics used for evaluation in Table 1?"
            },
            "questions": {
                "value": "see above."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "1: You are unable to assess this paper and have alerted the ACs to seek an opinion from different reviewers."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission6611/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission6611/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission6611/Reviewer_JGWe"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6611/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698744250110,
        "cdate": 1698744250110,
        "tmdate": 1699636753874,
        "mdate": 1699636753874,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "1nzuZoNz29",
        "forum": "2GJm8yT2jN",
        "replyto": "2GJm8yT2jN",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6611/Reviewer_EzDe"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6611/Reviewer_EzDe"
        ],
        "content": {
            "summary": {
                "value": "The authors propose to extend the utility of unsupervised representation learning under the relaxation of conventional assumptions related to stationarity and topology. They are inspired by biological visualization systems and assert that the existing ansatz are not sufficiently inclusive of general high-dimensional data."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "The authors ground their approach in a concrete example that is returned to throughout thereby helping the reader to build a stronger understanding and intuition for the work.\n\nMethod is demonstrated for multiple modalities suggesting its broader utility. The method seems to possess impactful new capabilities.\n\nFigures and result tables are clear with reasonably informative captions-- something that is not always the case and greatly appreciated."
            },
            "weaknesses": {
                "value": "The core findings and impact to the field are not clearly identified in the introduction. They include the questions they aim to answer and a high-level description of their approach but concrete claims or impact are omitted. While the reviewer was very intrigued by the paper, the primary weakness was the lack of a clear statement of the \"so what?\"\n\nWhile helpful for building intuition, the classification accuracy studies are less compelling as they feel more contrived yet they get the bulk of the attention. From this viewer's perspective, the presented method's potential to be able to infer the permutation or inform about the topology or stationarity of data is the more novel component. Although it may just be a personal preference, I think highlighting and demonstrating those unique abilities would emphasize the novelty and utility of the method. \n\nResults tables should include confidence intervals. \n\nIn this reviewer's estimation there is insufficient information available for reproducibility within the main body of the paper."
            },
            "questions": {
                "value": "What are the top three claims or novel contributions of the work from the authors' perspective? \n\nWhat can the proposed approach tell you about the stationarity and topology of the data it is provided?\n\nAre there connections between this work and encryption/decryption?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission6611/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission6611/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission6611/Reviewer_EzDe"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6611/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699149259093,
        "cdate": 1699149259093,
        "tmdate": 1699636753776,
        "mdate": 1699636753776,
        "license": "CC BY 4.0",
        "version": 2
    }
]