[
    {
        "id": "O32LiCTPJr",
        "forum": "2y8XnaIiB8",
        "replyto": "2y8XnaIiB8",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission437/Reviewer_Evkk"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission437/Reviewer_Evkk"
        ],
        "content": {
            "summary": {
                "value": "This might be the first work to condense images and text together. Based on the MTT from the domain of image condensation, this paper uses some engineering methods to build the basic framework. The experiments are extensively conducted on COCO and Flickr30K."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. Writing is clear and easy to understand.\n2. The problem is new to me.\n3. The experiments are extensive."
            },
            "weaknesses": {
                "value": "1. The baselines of three coreset methods are too weak. There are too many empirical studies without any theoretical analysis of why these coreset methods are good for this task. \n2. Why use Cosine similarity to evaluate the pairs? Any theoretical analysis?\n3. Why not freeze the image encoder backbone and just freeze the text encoder backbone?\n4. Why choose the retrieval task? A straightforward task that hit my mind is to use a subset of CLIP [a] training set to train the CLIP model with similar performance. Can the proposed method do this?\n5. Why use the NormalizerFree ResNet (NFNet) (Brock et al., 2021b; Wightman, 2019) as the image backbone? It looks like not the best backbone as shown in Table 9.\n6. What is the result if the ratio equals 50% in Table 2? If the proposed method can reach or close to the upper bound in Table 3, I would raise my score.\n\n[a] Learning Transferable Visual Models From Natural Language Supervision"
            },
            "questions": {
                "value": "See weakness"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission437/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698677448577,
        "cdate": 1698677448577,
        "tmdate": 1699635970312,
        "mdate": 1699635970312,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "jWosT8YNiT",
        "forum": "2y8XnaIiB8",
        "replyto": "2y8XnaIiB8",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission437/Reviewer_tXui"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission437/Reviewer_tXui"
        ],
        "content": {
            "summary": {
                "value": "The authors propose a multimodal dataset distillation method. Visual-language dataset distillation involves, first, training multiple models on the full dataset using bidirectional contrastive loss to obtain expert trajectories at various training epochs. Then, a set of student models is trained on a distilled dataset using the same bidirectional contrastive loss, and the dataset is updated based on a bi-trajectory matching loss that measures the alignment of student model parameter trajectories with the expert trajectories. The authors evaluate their method against the closest related work and show a significant improvement"
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- The paper is very well written and easy to understand. Authors clearly explain their method and provide an intuition behind their method selection\n\n - Results are significantly better than related methods with fewer examples. Ablation studies show that the multimodal distillation outperforms distillation with a single modality."
            },
            "weaknesses": {
                "value": "- Storing and training with the trajectory data seems like an expensive process. The addition of multimodal data requires even more resources, such as modality-specific encoders.  While I believe that these factors represent significant limitations to the work, I also recognize the substantial contribution it makes to advancing this field."
            },
            "questions": {
                "value": "- I believe that the sentences generated for the qualitative results are nearest neighbors for real sentences in the dataset. However, is it possible to get the nearest neighbor token from the distilled text dataset? If so, do these tokens actually form sentences that make sense?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission437/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission437/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission437/Reviewer_tXui"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission437/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698780760184,
        "cdate": 1698780760184,
        "tmdate": 1699635970232,
        "mdate": 1699635970232,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "BYYIsBgVDM",
        "forum": "2y8XnaIiB8",
        "replyto": "2y8XnaIiB8",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission437/Reviewer_MV4s"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission437/Reviewer_MV4s"
        ],
        "content": {
            "summary": {
                "value": "This paper explore a new problem: VL dataset distillation, which is not explored before, and the paper follows the existed dataset distillation approach to evaluate the performance. The results show that the distilled dataset can outperform the coreset algorithms significantly."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. This the first paper to perform dataset distillation on the vision-language dataset.\n2. Comprehensive experiments are conducted in the paper."
            },
            "weaknesses": {
                "value": "1. The underlying distillation process is the same to MTT, even though the expert model is trained with bi-direction contrastive loss\n\n2. In the bottom on page 1, the authors mention it is hard for text data but in the paper, the authors still distill in the continuous space and then simply find the closet embeddings."
            },
            "questions": {
                "value": "1. In the problem formulation, is there any restriction on K? Or fewer pairs is the only goal?\n\n2. The symbol notation is not clear, e.g. in eq. 2, what is * and hat of theta?, in eq. 3, what is the summation over y'? what is the set? all of y except itself?\n\n3. In Table 1, as the authors use BERT-pretrained models, how much contributes come from the text-pretrained model when comparing to conventional dataset distillation.\n\n4. As the pretrained models are used, what is dependency on the pretrained dataset (not the model), e.g. if the image and text encoders are pretrained with trained with the particular datasets, what is the performance of the model pretrained on other datasets training on the distilled dataset?\n5. I wonder do authors know why the distilled images still look like the original real image? In MTT paper, the distilled images are very different from the real image (at least visually). \n\n6. Regarding the distilled text showing in Fig. 3, it seems that the distilled text could provide vague description, e.g. the bottom right image, it changes \"two\" men to \"four\" football players, if this algorithm is applied to VQA, won't it provide wrong counting?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission437/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698801549422,
        "cdate": 1698801549422,
        "tmdate": 1699635970159,
        "mdate": 1699635970159,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "ZkJCahMvhK",
        "forum": "2y8XnaIiB8",
        "replyto": "2y8XnaIiB8",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission437/Reviewer_i1Lj"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission437/Reviewer_i1Lj"
        ],
        "content": {
            "summary": {
                "value": "The paper introduces a method for distilling vision-language datasets that consists of image-text (caption) pairs.\n\nThe method is based training an expert model on the original datasets and a student model on the distilled dataset (initialized as samples from the original dataset) for a number of epochs. After which the samples from the distilled dataset are updated by back-propagating the loss function that measures the difference in parameter value trajectories of the student and expert models, over those selected number of epochs.\n\nIn the distilled dataset, the images are updated in the pixel space, but text captions in the text encoder’s input embedding space.\n\nAs no prior dataset distillation methods for language-vision data exist, the paper compares the proposed approach to 3 coreset selection methods and show consistent and substantial improvement over all of them."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- (S1) The paper contains a good set of experiments. The authors find a way to compare their method against image-only dataset distillation methods (Table 1) which somewhat isolates the impact of the specific model proposed vs. the task of image-text dataset distillation, as opposed to image-label. Additionally, the authors also experiment by distilling only one modality (either only text or only image) (Table 4), which demonstrates the relative impact of each of the modalities and the combination of them on the performance. The results contain standard deviation values.\n    \n- (S2) The quantitative results demonstrate that the proposed approach is consistently and substantially outperforming alternative approaches of coreset selection\n    \n- (S3) The paper is very well-written, and the method well-explained"
            },
            "weaknesses": {
                "value": "- (W1) The distilled dataset samples shown in the qualitative results (Figure 3) are, in case of images, not very different from the original images - only augmented with some noisy high-frequency patterns, and in case of text, do not consistently appear to be better than the original captions. That raises a question of how robust those distilled datasets are and indicates that maybe the source of effectiveness of distilled datasets is somewhat different from what one would expect, that is, models constructing very informative and representative samples. Instead, the impact appears to come from some artifacts, like these high-frequency patterns discussed by the authors.\n    \n- (W2) If I understood correctly, the evaluation of the distilled datasets (image-to-text and text-to-image retrieval) is performed on of the same architecture as the dataset distillation models. The paper does not seem to evaluate if the distilled datasets are equally effective for models of architecture different than those used for distilling the datasets. Considering the point raised above (W1), there is a risk that they are not. Images from the distilled datasets could be easily evaluated on different architectures. However, for text, the approach of operating on the input embeddings might not be adaptable in a straightforward way to other models."
            },
            "questions": {
                "value": "-"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission437/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698840951228,
        "cdate": 1698840951228,
        "tmdate": 1699635970094,
        "mdate": 1699635970094,
        "license": "CC BY 4.0",
        "version": 2
    }
]