[
    {
        "id": "qFhBGddswr",
        "forum": "3ARfhjGfdF",
        "replyto": "3ARfhjGfdF",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2613/Reviewer_sEtP"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2613/Reviewer_sEtP"
        ],
        "content": {
            "summary": {
                "value": "The authors propose to improve the bisimulation principle methods in terms of (1) better latent dynamics prediction; (2) handle sparse reward environments. The authors propose ReBis, which combine bisimulation loss with a masked transformer model to learn the latent forward dynamics and latent reconstruction loss can prevent collapse from uninformative rewards."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The motivation is clear. The paper identifies the drawbacks of the existing bisimulation methods, and proposes corresponding algorithms to handle them. In general, the writing is clear and the paper is easy to follow."
            },
            "weaknesses": {
                "value": "1. The novelty remains concerned. It seems that the algorithm combines MLR + a bisimulation loss.\n\n2. The algorithm designs (using masked inputs, momentum encoder, etc.) need ablation studies to prove its effectiveness.\n\n3. Though the motivation is to improve the bisimulation method, the proposed algorithm seems to be something between model-based RL (as cited in “Highly Expressive Dynamics Model” part). So I think it is necessary to discuss / compare with these works."
            },
            "questions": {
                "value": "1. I find some notations might need more clarification:\n\na) By stacking 3 frames for each observation (derive $o_t ‘$ from $o_t$), do you stack 3 frames $(o_t, o_t, o_t)$ with different masking, stack $(o_t, o_{t+1}, o_{t+2})$, or other setting?\n\nb) Can you please explain the relative position embedding $\\tau_K^p$ in detail? Do you add this position embedding to the state / action tokens, or concatenate this position embedding as an independent input?\n\nc) As for the block masking, I think it will be better to introduce how the images are masked to make the paper self-contained.\n\n2. What are the modifications on the proposed methods w.r.t. MLR besides the behavior loss (bisimulation part)? Most of the merits of the proposed methods (e.g., better forward dynamics, learn asymmetric reconstruction to handle uninformative reward) seems to come from the MLR backbone.\n\n3. I’m also wondering why using the MLR as backbone to improve bisimulation and why not other methods (e.g., Dreamer, TransDreamer, Transformer world model) as cited in your related works."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission2613/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2613/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2613/Reviewer_sEtP"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2613/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698645141959,
        "cdate": 1698645141959,
        "tmdate": 1700545425160,
        "mdate": 1700545425160,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "Lwmb5qzB72",
        "forum": "3ARfhjGfdF",
        "replyto": "3ARfhjGfdF",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2613/Reviewer_6U7G"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2613/Reviewer_6U7G"
        ],
        "content": {
            "summary": {
                "value": "This paper builds on the idea of applying the bisimulation principle to shape the representation of deep RL with task-specific information. The authors first identify several limitations of prior work, for example, the expressiveness of the learned dynamics model and the ability to leverage reward-free control information when the reward is uninformative.\n\nThen, the authors propose ReBis which leverages spatiotemporal consistency and long-term behavior similarity. More specifically, they reduce spatio-temporal redundancy in observations via Siamese encoders with block-wise masking and use a transformer-based dynamics model to capture multi-modal behaviors.\n\nFinally, the authors demonstrate the superiority of ReBis on Atari and DeepMind control suites."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "This paper compares with many prior works on learning a good representation for policy learning, including CURL, SimSR, etc., and shows their proposed method, ReBis, outperforms them in most tasks. Moreover, their learned representation is more robust to different backgrounds as demonstrated in the DeepMind control suite with different background distractions.\n\nExperiments and ablations are comprehensive and well-designed. The ablation of different loss components justifies the design of ReBis and shows both reconstruction loss and bi-simulation loss contribute to the gain in ReBis.\n\nThe paper writing is easy to follow and has a nice overview of related work."
            },
            "weaknesses": {
                "value": "As pointed out by the author, the representation learning part adds non-trivial complexity to the RL algorithm. It would be interesting to experiment with different update frequencies of the representation learning part. For example, what’s the score if we update the representation encoder every 1, 10, 100, or 1000 environmental interactions?\n\nIs the method complementary to other representation learning methods, such as augmentation, video prediction, time contrastive learning, etc? Does combining with other methods lead to better results?\n\nThe representation learning part relies on a reward specification by design, which prevents it from being used as a general pre-training method with unknown tasks. The authors should consider discussing this in limitations."
            },
            "questions": {
                "value": "Do we need to update the encoder every RL update? Can we update it less frequently than the policy?\n\nIs the method complementary to other representation learning approaches?\n\nCan we use it for pre-training a representation without task specification?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission2613/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2613/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2613/Reviewer_6U7G"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2613/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698649462950,
        "cdate": 1698649462950,
        "tmdate": 1699636200211,
        "mdate": 1699636200211,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "d60oqK67fi",
        "forum": "3ARfhjGfdF",
        "replyto": "3ARfhjGfdF",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2613/Reviewer_TC9E"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2613/Reviewer_TC9E"
        ],
        "content": {
            "summary": {
                "value": "The paper deals with image-based reinforcement learning. Image-based RL requires the extraction of control-specific relevant information from the images while discarding the visual noise. The authors came up with a representation learning algorithm that uses the bisimulation metric to measure distances between states. Bisimulation suffers from issues such as possible collapse in sparse rewards and requiring dynamics modeling which the authors are able to alleviate. The produce competitive results on Atari and distracting dm control suite."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "(1) They correctly identify the issues in using the bisimulation metric for quantifying the distances between states. They take measures to solve these.\n\n(2) They use a transformer to implicitly learn the dynamics which improves the expressibility of the dynamics models.\n\n(3) Their reconstruction objective ensures that the representations do not collapse even in a sparse rewards regime.\n\n(4) They produce impressive results in the distracting dm control suite."
            },
            "weaknesses": {
                "value": "(1) Can this loss be used as a pretraining loss for learning an encoder? There should have been some experiment depicting this.\n\n(1) The method of representation learning seems way more complex than the RL algorithm itself. If this is an auxiliary loss, the transformer model capturing the dynamics is never used by the RL algorithm which seems a waste of resources."
            },
            "questions": {
                "value": "(1) What if the distracting images in distracting dm control are added during training as well? Can the model get distracted then?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission2613/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2613/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2613/Reviewer_TC9E"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2613/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698831230256,
        "cdate": 1698831230256,
        "tmdate": 1699636200043,
        "mdate": 1699636200043,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "O71GilBPCN",
        "forum": "3ARfhjGfdF",
        "replyto": "3ARfhjGfdF",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2613/Reviewer_hpbt"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2613/Reviewer_hpbt"
        ],
        "content": {
            "summary": {
                "value": "This paper presents ReBis, a new method for state representation learning in image-based RL, based on the bisimulation metric. It utilizes a transformer architecture with block-wise masking to capture dynamics and address issues inherent in environments with sparse rewards. The authors claim that ReBis prevents feature collapse where standard bisimulation metrics fail, showcasing performance gains on benchmark tasks such as Atari and DMC."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The paper makes a notable attempt to tackle the shortcomings of bisimulation metrics in sparse reward settings by integrating a transformer-based dynamics model. The adoption of block-wise masking as a strategy for sampling stochastic dynamics is an interesting approach. Empirically, the method appears to offer improvements over existing techniques, as demonstrated in the results section which features performance gains across Atari, DMC, and DMC with distraction."
            },
            "weaknesses": {
                "value": "The paper aims to address two challenges of bisimulation metrics: the reliance on Gaussian distribution for modeling and the issue of uninformative rewards. However, the justification for how the proposed ReBis method successfully overcomes these challenges remains unconvincing. The paper's method of using block-wise masking observation to simulate the sampling of stochastic dynamics is not fully explained. Various other techniques, such as random cropping as in DrQ, employing Dropout layers, or introducing noise to weights or latent features, could potentially serve a similar purpose. A detailed comparison of these methods within the experimental section would be beneficial for substantiating the need for block-wise masking.\nRegarding the challenge of sparse rewards, the explanation of how ReBis overcome this issue is not adequately addressed. The paper should provide a clearer rationale for why its methods would be more effective in such environments.\n\nThe paper’s claim to novelty largely rests on the application of a transformer dynamics model, but this alone does not present a compelling case for novelty. The absence of a thorough comparative analysis, especially in the ablation studies, against non-transformer or non-sequential architectures, diminishes the strength of the argument for the proposed method’s innovation. Furthermore, the paper borrows heavily from prior work for various aspects, such as the masked observation approach, the metric used, and the theoretical framework, which detracts from the original contribution.\n\nThe theoretical foundation of the paper also shows weaknesses. \n1. The Definition 1 provided is mislabeled as \"bisimulation-based\" since it lacks the Wasserstein distance. It defines metric like MICo or SimSR but misses an expectation operator in front of $\\bar{d}$. \n1. Theorem 2 and 3 for bisimulation metric, originated from (Kemertas & Aumentado-Armstrong, 2021), cannot be directly applied to the metric defined in the paper because their proofs rely on the Wasserstein distance, which is absent from the paper's metric. The authors need to develop new proofs that are pertinent to their specific metric definition.\n1. Theorem 4 does not seem intuitive if the metric includes an expectation operator. (Castro et al., 2021) mentioned it is Łukaszyk–Karmowski distance with non-zero distance. The transition from Equation (15) to Equation (16) in the proof is unclear and requires further clarification."
            },
            "questions": {
                "value": "1. Could the authors clarify the term \"multi-modals\" within the paper?\n1. In Tables 1 and 2, the blue color is not described. What does it represent in the context of these tables?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2613/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699197317452,
        "cdate": 1699197317452,
        "tmdate": 1699636199939,
        "mdate": 1699636199939,
        "license": "CC BY 4.0",
        "version": 2
    }
]