[
    {
        "id": "S5OvS3tfZm",
        "forum": "3ijmMNaSJk",
        "replyto": "3ijmMNaSJk",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1920/Reviewer_xu9z"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1920/Reviewer_xu9z"
        ],
        "content": {
            "summary": {
                "value": "This paper delves into the intricacies of Masked Distillation (MD), a specific variant of masked image modeling, and scrutinizes its inductive biases. The paper is heavily empirical and makes several key observations:\n1. MD mitigates attention homogenization, where the model's response is diffused across a broad and unrelated area for specific queries; 2. the features learned through MD exhibit lower frequency than those learned without MD;\n3. MD produces higher singular values for each hidden layer's activations;\n4. the entropy of the features learned through MD is higher;\n5. MD provides a smoother loss landscape for training."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. Despite the paper's structure needing significant improvement, it is relatively straightforward to comprehend the various analyses.\n2. The exploration of how MD shapes the model's learned representations is crucial.\n3. The authors provide detailed experimental procedures, enhancing reproducibility."
            },
            "weaknesses": {
                "value": "1. The paper lacks a comparison of the downstream performance of models trained with and without MD. While the authors demonstrate how the features differ, the impact of these differences on downstream performance remains unclear.\n2. The empirical results' distinction from previous analyses on regular MIM (as presented in 'Revealing the Dark Secrets of Masked Image Modeling') is unclear. Given the similarities between MIM and MD, I worry that the work, which shows MD performing similarly to MIM, may have limited impact.\n3. Several analyses (attention distance, entropy) appear to be borrowed from the aforementioned previous work.\n4. The introduction lacks structure. It disproportionately focuses on MIM, whereas I would expect a more detailed introduction and comparison between MIM and MD for a paper centered on MD."
            },
            "questions": {
                "value": "1. In Figure 10, the authors state that MD diversifies attention across various heads, but does a smaller entropy range necessarily imply similar attentions? Could visualizing the distance between different attention heads provide more clarity?\n2. The authors claim that MD amplifies the model’s preference for low-frequency features while enhancing the preference for high-frequency features in the lower layers. However, from my understanding of the figure, it seems that MD only promotes high-frequency features in the lower layers for SSL (blue). Could you clarify?\n3. I don't see the necessity of splitting section 3 and section 4 into two sections. Both sections compare different properties between MD and non-MD."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1920/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698595125233,
        "cdate": 1698595125233,
        "tmdate": 1699636122686,
        "mdate": 1699636122686,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "NDuhZ5bKGt",
        "forum": "3ijmMNaSJk",
        "replyto": "3ijmMNaSJk",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1920/Reviewer_2wDN"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1920/Reviewer_2wDN"
        ],
        "content": {
            "summary": {
                "value": "In this paper, the authors make a comprehensive understanding of masked distillation. This understanding includes some properties inherited from masked image modeling, and some unique properties of masked distillation. These investigations explain the behaviors under the strong performance of mask distillation models such as attention homogenization, representation folding and smooth loss landscapes."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The viewpoint of this paper is interesting. \n2. Some analysis of current technicals is valuable, such as the modality differences, and the gap between pre-training and downstream tasks.\n3. The unique feature of mask distillation is proposed that inspires modern training pipeline design."
            },
            "weaknesses": {
                "value": "1. In figure 2,3,4, some confused tags 'sl', 'ssl', 'clip' are not explained. These tags are not consist with the analysis in the paper with 'DINO', 'CLIP', 'supervised models' mentioned.\n2. This paper gives some new point of masked distillation and explains how it works. However, it remain unclear that how to design a better pipeline with these findings."
            },
            "questions": {
                "value": "1. Some legends without explanation make me confused on some details in the paper. It will be better that the authors fix it and re-review again for me."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "None"
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission1920/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1920/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1920/Reviewer_2wDN"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1920/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698760843436,
        "cdate": 1698760843436,
        "tmdate": 1700631045758,
        "mdate": 1700631045758,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "VfDCjmHTIH",
        "forum": "3ijmMNaSJk",
        "replyto": "3ijmMNaSJk",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1920/Reviewer_65e1"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1920/Reviewer_65e1"
        ],
        "content": {
            "summary": {
                "value": "This paper delves into the efficacy of masked distillation as a self-supervised learning approach for vision tasks, highlighting four key findings:\n\n\"Masked Distillation imparts the model with intrinsic mutual information attributes.\"\n\n\"Masked Distillation amplifies the expressive potential of the attention module.\"\n\n\"Masked Distillation alleviates the issue of representation folding in higher layers.\"\n\n\"Masked Distillation contributes to the smoothing of the loss landscape.\"\n\nAdditionally, the paper delves into the discussion of \"model design and decision preferences.\""
            },
            "soundness": {
                "value": "1 poor"
            },
            "presentation": {
                "value": "1 poor"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "Masked Distillation seems to be a promising self-supervised learning method that is not understood well. Investigation of this is an interesting research direction."
            },
            "weaknesses": {
                "value": "1. The paper often uses unscientific and unexplained language\ne.g. \"We propose a natural hypothesis: Masked Distillation imbues the model with attributes inherent to MI\". It's not clear how masked distillation imbues the model with them and how the experiments designed are helpful in validating this. \n\n\"Masked Distillation inherits the inductive bias of attention from MIM\": \"inductive bias of attention\", to the best of my knowledge, is not a well-defined term. Furthermore, the paragraph following this is full of sentences such as \"This phenomenon may be attributed to their extreme homogenization of background responses, suggesting that the degree of locality and diversity attained is contingent upon the original model\" which are not backed with evidence (or at least no evidence is referred to). \n\n2. No explanation is given for why the properties above help Masked Distillation. The connection of these claims e.g. \"prevents overfitting\" are not explained / proven using evidence. \n\n3. Explanation of experiments is hugely lacking. \nThe paper attempts to explain Masked Distillation through exploratory experiments, but the exact details of these experiments are not presented in the paper clearly. Moreover,"
            },
            "questions": {
                "value": "1. What exactly is the new analytical framework the authors mentioned they had created?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "1: strong reject"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1920/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698810318861,
        "cdate": 1698810318861,
        "tmdate": 1699636122514,
        "mdate": 1699636122514,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "CvfnVSBq9f",
        "forum": "3ijmMNaSJk",
        "replyto": "3ijmMNaSJk",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1920/Reviewer_hmEG"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1920/Reviewer_hmEG"
        ],
        "content": {
            "summary": {
                "value": "The paper analyzes masked distillation methods, which use a teacher model as a MIM target instead of raw pixels. The experiments are designed similarly to [A]. it shows that the model trained with masked distillation is different from SL, SSL, and CLIP-trained models, like the MIM-trained model.\n\n[A] WHAT DO SELF-SUPERVISED VISION TRANSFORMERS LEARN?, ICLR 2023"
            },
            "soundness": {
                "value": "1 poor"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "- The paper includes diverse analysis for masked distillation."
            },
            "weaknesses": {
                "value": "- I think the masked distillation is an improved version of MIM. Thus, it should be compared with MIM. However, the paper's experiments compare masked distillation with SL, SSL, and CLIP teacher models. The results show that masked distillation is similar to MIM. I'm hard to find the value of this experiment. I think masked distillation is naturally similar to MIM, and verifying it has a minimum contribution.\n\n- Experiment metrics and messages are significantly similar to [A]. The following metrics overlap with [A]: attention distance, frequency spectrum,  relative singular value (token-level, image-level), and normalized MI. This paper can be considered as a masked distillation version of [A], which significantly limits the novelty.\n  - [A] WHAT DO SELF-SUPERVISED VISION TRANSFORMERS LEARN?, ICLR 2023"
            },
            "questions": {
                "value": "- \"Masked distillation\" is used to represent many methods [B, C, D, E]. I recommend authors add a clear definition of masked distillation at the beginning of the paper.\n  - [B] Masked Generative Distillation, ECCV 2022\n  - [C] MASKED DISTILLATION WITH RECEPTIVE TOKENS, ICLR 2023\n  - [D] Supervised Masked Knowledge Distillation for Few-Shot Transformers, CVPR 2023\n  - [E] MaskedKD: Efficient Distillation of Vision Transformers with Masked Images, arxiv\n\n- I think the paper should compare masked distillation with MIM for diverse variants. Comparing masked distillation with SL, SSL is similar to [A]. Thus, it is hard to contribute to other researchers.\n\n- What masked distillation does the paper use for experiments? As described in Fig. 3 (c), there are diverse variants of masked distillation. Can the paper's implementation (*_MD) be enough to represent all variants of masked distillation?\n\n- I believe analysis metrics are strongly related to ImageNet-1k performance. What is the ImageNet-1k performance of SL, SSL, CLIP, SL_MD, SSL_MD, and CLIP_MD?\n\n- [F] is a pioneer work in masked distillation research and also strongly related to this paper. I recommend authors cite [F] and add discussion with it.\n  - [F] Exploring Target Representations for Masked Autoencoders, arxiv\n\n- Attention diversity and homogeneity can't be measured by entropy. They should be measured by the distance between probabilities, such as KL divergence or cross-entropy. Please use the correct metrics for them.\n\n- The main quantitative results for attention diversity and homogeneity (Figure 10) are in the appendix. I think the main results should be included in the main script. The current paper is the same with no quantitative results for attention diversity and homogeneity.\n\n- What is the meaning of frequency analysis in transformer architecture? I believe frequency is reasonable for ConvNet but meaningless for Transformer.\n\n- In Fig 6 (a), SL_MD has lower NMIs compared to SL, which is different from the explanation of the paper. \n\n- How does the loss landscape for SL and SL_MD look like? The loss landscape is a good tool for measuring over-fitting. Thus, I want to know why SL is excluded from the experiment.\n\n- Fu et al. 2023 [G] is a study on SGD. But, most of ViT uses AdamW optimizer. Can the relation between hessian and optimization stability be generalized to AdamW optimizer?\n  - [G] When and why momentum accelerates sgd:an empirical study, 2023"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1920/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698909270009,
        "cdate": 1698909270009,
        "tmdate": 1699636122369,
        "mdate": 1699636122369,
        "license": "CC BY 4.0",
        "version": 2
    }
]