[
    {
        "id": "GAczl5BBAo",
        "forum": "3IyC5lQTSi",
        "replyto": "3IyC5lQTSi",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4999/Reviewer_9FFn"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4999/Reviewer_9FFn"
        ],
        "content": {
            "summary": {
                "value": "The authors propose a refined group fairness regularization through matchings. Specifically, they introduce matched demographic parity, which treats individuals in the same demographic group more fairly."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "The authors present a novel method, which is interesting and performs well. In addition, they propose a sound and detailed theoretical analysis of the methods."
            },
            "weaknesses": {
                "value": "Two main limitations of the proposed work and presentation stand out:\n- Regarding the motivation. Subgroup discrimination is indeed a problem of Group-Fairness approaches. However, since you do not require any specific structure of the matching, it seems that you also enforce non-discrimination against features for which we want to discriminate. Take for example $X=[gender, race, skill]$ is a job application. If I apply matched group fairness on gender, then I agree that this should not lead to discrimination against e.g. african american woman. However, I am very happy with discriminating agains unskilled workers. Could you please explain how your approach would work in this case?\n- While motivated from the side of group fairness, your approach has many relations to individual fairness. Specifically, (Step 1) identifies \"similar\" individuals while (Step 2) requires the \"similar individuals\" to be treated similarly by the classifier. I see that the \"similar individuals\" in step 2 are synthetic, but I still believe that the relation to individual fairness ought to be discussed."
            },
            "questions": {
                "value": "Some questions and comments in the order they appear in the paper:\n- In the first paragraph of section 3.2, you use $\\|\\cdot\\|^2$ to find the OT map. Which distance do you choose, and how is the performance influenced by (a) the distance and (b) the preprocessing? (no need to run experiments, I would just like to understand it better)\n- Figure 4 is quite small. If you find some space increasing the size would be nice"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4999/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4999/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4999/Reviewer_9FFn"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4999/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698662779898,
        "cdate": 1698662779898,
        "tmdate": 1699636487591,
        "mdate": 1699636487591,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "zF7dCJEeKZ",
        "forum": "3IyC5lQTSi",
        "replyto": "3IyC5lQTSi",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4999/Reviewer_diD4"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4999/Reviewer_diD4"
        ],
        "content": {
            "summary": {
                "value": "The authors introduce an algorithm to find models which satisfy both group fairness and within-group fairness called FTM or fairness through matching. This algorithm uses a new group fairness measure called MDP or matched demographic parity. They provide theoretical justification as well as some empirical results."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The authors provide good theoretical justification for their algorithm.\nThe authors provide some empirical results that show better performance to other similar methods - with fewer outliers when looking at subset fairness (or group fairness)."
            },
            "weaknesses": {
                "value": "The language in the paper is hard to follow. Both grammatically as well as inconsistencies in terms used throughout the paper. The authors should be sure to update grammar throughout the paper (for example \"a group fair model that less discriminates subsets or individuals in the same sensitive group\" -> a group fairness model that discriminates less between subsets or individuals in the same sensitive group), as well as making sure their terminology throughout the paper is consistent (example: group fairness, subset fairness).\n\nUnless I missed it in the proofs of the appendix, it is not made clear why MDP is necessary, and why total variation, strong demographic parity, or 1-Wasserstein distances should not be used. The authors provide the similarity between the measures but do not clearly state why MDP is important.\n\nThe authors make the claim that one of their contributions is the new group fairness measure MDP, but state in section 3.4 that Black et al. (2020) employs the MDP constraint. Could the authors please clarify if and how their MDP definition is different from the earlier paper.\n\nThe plots in the paper are not at all readable with very small text.\n\nThis paper seems incremental in nature, being very close to FRL, Gorsaliza et al, and pulls together techniques from other areas.\n\nMinor nits:\nIt would be good to include the accuracy table in the main paper."
            },
            "questions": {
                "value": "Please see the questions associated with \"Weaknesses\" above."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4999/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4999/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4999/Reviewer_diD4"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4999/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698799049441,
        "cdate": 1698799049441,
        "tmdate": 1699636487485,
        "mdate": 1699636487485,
        "license": "CC BY 4.0",
        "version": 2
    }
]