[
    {
        "id": "DjwPGZ9Vbz",
        "forum": "3tjTJeXyA7",
        "replyto": "3tjTJeXyA7",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6166/Reviewer_MiY2"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6166/Reviewer_MiY2"
        ],
        "content": {
            "summary": {
                "value": "This paper investigate a new mechanism of the channel-dimension Fourier transform to enhance the discriminativity of the global information. Based on the core mechanism, the method design consists of several implementation formats. Extensive experiments over several image enhancement tasks and datasets demonstrates the effectiveness and versatility of the proposed method for image enhancement."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. This paper investigates a new mechanism of channel-dimension Fourier transform, which has not been discussed before as I know. As a new technique, its advantages and mechnism are well-been illustrated.\n2. This paper presents quantities of experiments to verify the effectiveness and general ability of the proposed method in both main body and appendix. Moreover, this paper also present quantities of analysis in appendix to exhibit the method’s mechanism, which is inspiring.\n3. This paper also provides several implementation formats, which are easy to implement and easy to follow."
            },
            "weaknesses": {
                "value": "1. This paper contains few visual results. As an image processing paper, the number of visual results are limited to some extent. \n2. This paper presents several implementation formats. However, the relationship between these formats are not provided. How to derive different implementation formats from the original one?\n3. The ablation studies are mainly conducted on exposure correction as shown in Table 5. However, as a main image enhancement task, this paper need to supplement ablation studies on the low-light image enhancement task to verify the effectiveness of the method’s design."
            },
            "questions": {
                "value": "Can authors provide more visual results? This is important to depict the effectiveness of the proposed method. Moreover, can authors discuss why the several implementation formats are designed in such manner?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission6166/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission6166/Reviewer_MiY2",
                    "ICLR.cc/2024/Conference/Submission6166/Senior_Area_Chairs"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6166/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698551868980,
        "cdate": 1698551868980,
        "tmdate": 1700627815642,
        "mdate": 1700627815642,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "qaWfZ8riI9",
        "forum": "3tjTJeXyA7",
        "replyto": "3tjTJeXyA7",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6166/Reviewer_Tiry"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6166/Reviewer_Tiry"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a new Fourier transform for image enhancement, consisting of three steps: applying Fourier transform to the channel dimension to obtain channel-wise Fourier domain features, performing a channel-wise transformation on both its amplitude and phase components, and then reverting back to the spatial domain. Based on these three steps, three strategies of channel transform are designed. Extensive experiments are conducted to show the effectiveness of the proposed method."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1.\tThe proposed method provides a perspective to formulate new Fourier transform for image enhancement, and has achieved SOTA performance on different tasks with efficient parameter number and flops. \n\n2.\tThe experiments are sufficient in both main paper and supp.\n\n3.\tThe writing and organization of this paper is great."
            },
            "weaknesses": {
                "value": "1.\tThe ablation studies in Table 5 can be conducted on more datasets to comprehensively show the effects of each component.\n\n2.\tMore visual comparisons should be provided as these of Fig. 6."
            },
            "questions": {
                "value": "Is the baseline and the baseline with CFTL trained with the same iteration, or is trained still to be converged?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "No Ethics Concerns."
            },
            "rating": {
                "value": "10: strong accept, should be highlighted at the conference"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6166/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698574440925,
        "cdate": 1698574440925,
        "tmdate": 1699636669543,
        "mdate": 1699636669543,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "zgrBEmFwkY",
        "forum": "3tjTJeXyA7",
        "replyto": "3tjTJeXyA7",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6166/Reviewer_WFwC"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6166/Reviewer_WFwC"
        ],
        "content": {
            "summary": {
                "value": "The authors introduces the channel-dimension Fourier transform for image enhancement. Its design is simple yet effective and comprise three straightforward steps.\nThe implementation formats is plug-and-play with previous image enhancement networks.\nThe authors experimentally evaluate the proposed model on various image enhancement tasks to depict its effectiveness."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "4 excellent"
            },
            "strengths": {
                "value": "(i) Overall, the idea is novel and interesting, and authors have clearly presented the motivation and algorithm with numerous figures and descriptions, making the principle of the algorithm easy to understand. \n(ii) The core module design is simple and easy to implement. One particularly inspiring view of this algorithm is that it provides a new perspective of understanding global information representation.  \n(iii) The authors have also performed various experiments to validate the motivation, the effectiveness and efficacy of the algorithm, and the extensive application usage of the algorithm."
            },
            "weaknesses": {
                "value": "(i) Authors have performed experiments on various architectures, but some of them are a bit-of-date. In this way, I suspect if I just apply some other operations such as channel attention or spatial attention, the performance could also be improved a lot.  \n(ii) If I understand correctly, the improvement comes from the global information modeling. Nevertheless, most of baselines are CNN-based. Therefore, I doubt whether the algorithm would work when the baseline is set as the architecture with large receptive field.   \n(iii) Since authors provide various formats of the algorithm, and most of the formats achieve comparable results. I doubt if it is necessary to design so many formats for the usage. \n(iv) The numerical results are improved with the algorithm, but the global information is easy to be affected. I doubt whether the improved version of the baseline has weak generalization ability than the baseline networks.\n\n------------------------After Rebuttal---------------------------\n\nThank you for your feedback. I appreciate your acknowledgment of the partial alleviation of concerns. However, certain issues persist, giving the impression of overclaimed contributions in the paper. Here are specific points:\n\n(i) The discussion on spatial and channel attention lacks comprehensiveness, omitting various attention mechanisms such as Fourier-based methods (e.g., GFNet). The application of standard spatial attention alone may not be sufficiently convincing.\n\n(ii) The proposed method shows limited performance gains on baselines with a large receptive field. In the SNRformer results, only PSNR sees a slight improvement, casting doubt on the method's applicability in certain scenarios.\n\nIn conclusion, despite the novelty of the method, the rebuttal materials fall short of significantly demonstrating its compatibility with diverse frameworks and operations. Therefore, I have decided to lower the score."
            },
            "questions": {
                "value": "(i) I strongly suggest to include more contemporary method as the baseline methods. \n(ii) I strongly suggest to discuss whether the generalization ability would be affected. \n(iii) I suggest more tasks that related to image enhancement can be included for discuss, such as shadow removal, image harmony and style transfer."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission6166/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission6166/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission6166/Reviewer_WFwC"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6166/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698587464749,
        "cdate": 1698587464749,
        "tmdate": 1700492732883,
        "mdate": 1700492732883,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "2Pi6gjucXg",
        "forum": "3tjTJeXyA7",
        "replyto": "3tjTJeXyA7",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6166/Reviewer_6DxW"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6166/Reviewer_6DxW"
        ],
        "content": {
            "summary": {
                "value": "1. A fresh perspective of Channel-dimension Fourier transform learning (CFTL) mechanism is proposed for image enhancement with three steps design. \n2. Based on the CFTL mechanism , several usage formats are derived, which are compatible with existing methods.\n3. The proposed approach showcases extensive ability across diverse image enhancement tasks with performance improvements over the baseline methods."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "This paper brings a novel idea of channel-dimension Fourier transform with some strengths:   \n1. The overall framework is simple but fresh with introducing negligible computation costs.\n2. The reasonableness of the approach’s design is presented with illustrations. \n3. The experiments are sufficient to showcase the effectiveness of the introduced approach. Intermediate results are comprehensive to depict how the approach works.\n4. The writing and organization are clear to follow."
            },
            "weaknesses": {
                "value": "However, there are several weakness/concerns need to be discussed, especially about some technique descriptions:\n1. As far as I know, there is another work [1] attempts to introduce frequency design into channel dimension attention. Although the design and motivation behind the two works are different,  the relevance between the two works are not illustrated.\n[1] FcaNet: Frequency Channel Attention Networks. ICCV 2021.\n2. As a core claim, “The primary objective of CFTL is to capture global discriminative\nrepresentations by modeling channel-dimension discrepancy ”. What would this property help improve image enhancement are not well-explained. \n3. As a core design space, the channel-dimension Fourier transform is applied in the global pooling-based space. The necessity of applying the core operation in this space are not fully discussed. What about using other spaces that possess global information properties? \n4. As the concrete implementation, the Eq.(6) introduces the attention operation without many explanations. \n5. Based on the above concerns, how to come up with the idea of the channel-dimension Fourier transform is not discussed, although its mechanism is illustrated.  \n6. Besides, more qualitative results are suggested to supplement in the appendix.\n\n================================\n1. The author's responses addressed my major concerns, however, the explanation of the \"channel-dimension discrepancy\" remains confusing. There is no explicit supporting evidence for this design. In fact, the implementations of \"channel-dimension discrepancy\" are diverse, such as feature orthogonalization [1][2], but these are not thoroughly discussed.\n\n2. The diversity in sub-sequential filter responses caused by \"channel-dimension discrepancy\" seems to be more crucial for generalization performance [3]. The references provided by the author are related to all-in-one image restoration, which is a task more closely associated with generalization, but it fails to interpret the correlation between performance improvement and filter response diversity. \n\n[1] Orthogonal Transformer: An Efficient Vision Transformer Backbone with Token Orthogonalization. NIPS 2022.\n\n[2] OrthoNets: Orthogonal Channel Attention Networks. Arxiv 2023\n\n[3] Reflash Dropout in Image Super-Resolution. CVPR 2022."
            },
            "questions": {
                "value": "Please see the above Weakness."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission6166/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission6166/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission6166/Reviewer_6DxW"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6166/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698661711801,
        "cdate": 1698661711801,
        "tmdate": 1700552255172,
        "mdate": 1700552255172,
        "license": "CC BY 4.0",
        "version": 2
    }
]