[
    {
        "id": "a9VIdkeDR1",
        "forum": "4g02l2N2Nx",
        "replyto": "4g02l2N2Nx",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8562/Reviewer_PsQx"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8562/Reviewer_PsQx"
        ],
        "content": {
            "summary": {
                "value": "The authors found that prior linear attentions miss two key properties of softmax attention that are crucial for good performance: having low-entropy (spiky) weights and maintaining dot-product monotonicity. A new learnable linear attention called Hedgehog was introduced. Hedgehog retains these crucial properties while keeping linear complexity. It uses trainable MLPs to produce attention weights similar to softmax attention. The results indicate that Hedgehog can achieve over 99% of the standard Transformer's performance, outdoing previous linear attentions in various settings."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "Technically sound well-written paper dealing with an important research task."
            },
            "weaknesses": {
                "value": "Table 3 is confusing since there are many more higher performing solutions for LRA: https://paperswithcode.com/sota/long-range-modeling-on-lra\nTaylor expansion in transformers is well-known approach: eg. https://arxiv.org/pdf/2206.08898.pdf\nWhile Hedgehog aims to retain the properties of softmax attention in a linear attention framework, this could introduce its own complexities in terms of implementation and optimization."
            },
            "questions": {
                "value": "Since the function mimicking softmax is learned how scalable it is to other modalities?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8562/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698834672634,
        "cdate": 1698834672634,
        "tmdate": 1699637070701,
        "mdate": 1699637070701,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "4M84HaQsnE",
        "forum": "4g02l2N2Nx",
        "replyto": "4g02l2N2Nx",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8562/Reviewer_y6Q1"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8562/Reviewer_y6Q1"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes *Hedgehog*, a new linear attention mechanism for Transformers. \n\nThe authors start by noting that previous linear attention mechanisms still lag considerable behind full quadratic attention. The authors then investigate why this is the case, by studing the properties of the attention maps produced by full attention and linear approximations. They find that two properties in full attention that previous linear attention methods seem to lack:\n\n- low-entropy \"spiky\" attention weights\n- monotonicity over query-key dot products\n\nThe authors then attempt to measure the importance of these two properties by inducing these properties in some test tasks, finding that these properties seem to correlate with performance of the trained model.\n\nFinally, the authors propose Hedgehog: the core idea being using linear map from the query/key space into a lower-dimensional feature space, but learning this linear map to *explicitly* approximate the final attention maps produced by dense attention. \n\nExperimental results are quite convincing: Hedgehog outperforms most other linear attention methods on multiple tasks (including LM perplexity and popular downstream tasks), both when training models from scratch and when “linearizing” models with dense attention."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- The paper provides a quite consistent story: they identified a problem (current linear-attention LLMs/transformers don’t work that well), studied potential reasons for their failure mode and verified their importance for the performance of models (the two properties of attention) and proposed and experimentally verify a fix to these problems that leads to linear-attention models that get closer to dense attention models)\n- The paper is well-written, and the problem studied very relevant: the quadratic complexity is one of the main bottlenecks preventing the scaling of transformers to longer contexts.\n- The identified properties of dense attention (and the subsequent analysis of their relation to downstream performance) are super interesting (and could be a contribution almost independently of the proposed method)\n- The proposed Hedgehog method seems to be effective for the model-size studied in this work, with Hedgehog leading to much less performance degradation than other linear-attention approaches (when compared to dense-attention model)"
            },
            "weaknesses": {
                "value": "- My main criticism of the study is that they only studied relatively small transformer models:  they only studied 125M decoder only models. Previous work [1] has shown that linear attention approach are less amenable to scaling than dense attention (meaning as models get larger, the gap between dense and linear attention increases) and so it’s unclear if this approach would still lead to such small gaps with dense attentions for 1B+ models (which IMO, is the main use case for this technique). While I already really liked the paper, I think this paper could be much stronger impact on the community if results were validated on larger LLMs.\n\n[1] https://arxiv.org/pdf/2207.10551.pdf"
            },
            "questions": {
                "value": "- In the train-from-scratch setting, how is the Hedgehog attention initialize?. From my understanding, Hedgehog requires an already-trained dense attention model to finetune the feature map. Does this imply that in this scenario we still need to train a dense attention model anyway?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8562/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698933811058,
        "cdate": 1698933811058,
        "tmdate": 1699637070552,
        "mdate": 1699637070552,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "Txr5iZ6dGK",
        "forum": "4g02l2N2Nx",
        "replyto": "4g02l2N2Nx",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8562/Reviewer_ZtxG"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8562/Reviewer_ZtxG"
        ],
        "content": {
            "summary": {
                "value": "This paper address the quadratic scaling of attention mechanism in transformers. There are 2 main contributions:\n\n1. Defining characteristics that make an attention mechanism work well: (a) low-entropy \"spikyness\" and (b) dot-product monotonicity\n\n2. Two new attention mechanisms to evaluate their claims. Taylor and Hedgehog\n\n They evaluate attention mechanisms in several scenarios (1) Training-from-scratch, (2) Finetuned-conversion, and (3) Pretrained-conversion."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "The exploration into \"spikyness\" and monotonicity is interesting and novel to me.\n\nThe regime for evaluating their attention mechanism is thorough and covers a wide variety of situations.\n\nThe ablations are well done and the experimental results on benchmarks and efficiency are strong."
            },
            "weaknesses": {
                "value": "I found the presentation a little confusing. In some figures and tables only Hedgehog is shown. In others only Taylor is shown. Should both be evaluated?\n\nIs the GPT-2 column in Table 6 unfair? It seems they should finetune with the full attention mechanism?"
            },
            "questions": {
                "value": "There doesn't seem to be much downside to this method except for training from scratch? Should everyone be finetuning and converting their pretrained models to Hedgehog?\n\nWas there any investigation into the learned weights of Hedgehog to gain intuition on how it's approximating softmax?\n\nHow does Hedgehog's softmax approximation do with length generalization (sequence length longer than training data) or data that is out of distribution?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8562/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698963624366,
        "cdate": 1698963624366,
        "tmdate": 1699637070439,
        "mdate": 1699637070439,
        "license": "CC BY 4.0",
        "version": 2
    }
]