[
    {
        "id": "fIMo8HxZ9u",
        "forum": "4IxtmklIym",
        "replyto": "4IxtmklIym",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission9289/Reviewer_bGzb"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission9289/Reviewer_bGzb"
        ],
        "content": {
            "summary": {
                "value": "This paper introduces a large-scale PickSim-based synthetic dataset FruitBin for 6D object pose estimation in fruit bin picking. The dataset features comprehensive challenges and devised benchmarks for scene and camera view generalization as well as occlusion."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "This is the first 6D object pose estimation dataset tailored for fruit bin picking although it is synthetic."
            },
            "weaknesses": {
                "value": "-- One drawback of Gazebo is that it can not do photorealistic rendering for objects and scenes with PBR textures. Although the generated dataset is large, without photorealistic textures, the transfer ability to real world is limited compared with other simulators such as BlenderProc and Kubric even the domain randomization techniques have been leveraged.\n\n-- For real-world fruits, the size and shape of different instances of the same category vary to different degrees. However, it seems for FruitBin, these factors are not taken into consideration.\n\n-- There is no real test set for the dataset, which is essential for sim2real and real-world applications.\n\n-- The benchmarking methods are a bit outdated. PVNet and DenseFusion are from 2018-2019, but it is 2023 now. \n\n-- It would be better to showcase some robotic applications like bin picking using this dataset, since it is targeted for fruit bin picking.\n\n-- It would be better to mark symmetric objects with \"*\" in Table 2.\n\n-- Table 1 is too wide. \n\n-- There are some minor issues in the writing, more thorough proofreading is required."
            },
            "questions": {
                "value": "1) In the experiments, does PVNet use GT bboxes for cropping the objects in order to handle multiple instances of the same object class?\n\n2) How does the diffusion generated backgrounds contribute to the performance?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission9289/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission9289/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission9289/Reviewer_bGzb"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission9289/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698075294291,
        "cdate": 1698075294291,
        "tmdate": 1699637170318,
        "mdate": 1699637170318,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "AQCFnL54QB",
        "forum": "4IxtmklIym",
        "replyto": "4IxtmklIym",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission9289/Reviewer_gFnj"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission9289/Reviewer_gFnj"
        ],
        "content": {
            "summary": {
                "value": "* This paper tackles novel research direction of fruits (or generalized any grocery item) using a robo-arm. \n* Dataset uses RGB and depth cameras for curating and annotatings the dataset."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "* This industry really needs a good dataset to further explore the problem, this paper just targeted that. \n* This paper generalizes scenes as well as camera position for wider acceptability of it. \n* Good reference to prior work on datasets."
            },
            "weaknesses": {
                "value": "* I would have preferred to see even more robust baselines."
            },
            "questions": {
                "value": "NA"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission9289/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698419715088,
        "cdate": 1698419715088,
        "tmdate": 1699637170210,
        "mdate": 1699637170210,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "POpqW93t2O",
        "forum": "4IxtmklIym",
        "replyto": "4IxtmklIym",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission9289/Reviewer_J2Gb"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission9289/Reviewer_J2Gb"
        ],
        "content": {
            "summary": {
                "value": "This paper presents FruitBin, a 6D pose estimation dataset for fruit bin picking with benchmarking over scene generalization, camera generalization and occlusion robustness. It contains over a million images and 40 million instance-level 6D poses."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "- This paper proposes a large-scale dataset, which may facilitate future research for bin-picking tasks.\n- The technical details are clearly presented."
            },
            "weaknesses": {
                "value": "- Limited Contribution\n    - It seems that the technical contributions of this paper is just replacing the assets in PickSim with fruits. I don't think this contribution is sufficient for an ICLR paper.\n    - All the data are collected in the simulator. It seems that no data is collected in the real world.\n- Inconvient Platform\n    - This paper uses ROS+Gazebo as its simulator platform, and claims it's for \"seamless robot learning\". However, I would think mujoco, PyBullet, or Isaac Gym are some more popular options in the robot learning community.\n- Format Issues\n    - Table 1 and the references are with format issues.\n    - The supplementary materials should not be attached to the main paper."
            },
            "questions": {
                "value": "- Will the dataset include more samples collected in the real world?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission9289/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission9289/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission9289/Reviewer_J2Gb"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission9289/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698567553527,
        "cdate": 1698567553527,
        "tmdate": 1699637170037,
        "mdate": 1699637170037,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "kLxVSQjN3B",
        "forum": "4IxtmklIym",
        "replyto": "4IxtmklIym",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission9289/Reviewer_Ksan"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission9289/Reviewer_Ksan"
        ],
        "content": {
            "summary": {
                "value": "The paper introduces a novel and extensive dataset designed for the task of fruit bin picking. This dataset is entirely synthetic and comprises 3D meshes of eight distinct fruits arranged in randomized configurations within bins, with varying lighting conditions and camera perspectives. The research employs this dataset to train two distinct models, one utilizing RGB data and the other incorporating RGB-D information, to serve as exemplary methods for 6-DOF pose estimation."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The paper is well-written and easy to understand. It explains its ideas clearly, making it accessible to a broad audience.\n2. The dataset is extensive regarding images, configurations, and annotations. \n3. The paper also offers detailed insights into the dataset, providing readers with a comprehensive understanding of its composition. This helps other researchers in utilizing the dataset effectively.\n4. The synthetic nature of the dataset allows for the extraction of highly detailed annotations, which can be challenging to obtain in real-world scenarios."
            },
            "weaknesses": {
                "value": "1. One primary concern regarding the paper pertains to its real-world applicability. While the synthetic dataset's ability to provide detailed annotations is a strength, it also raises questions about the practical utility of algorithms trained on it in real-world scenarios. The paper should delve into the broader implications and limitations of applying such models to real-world fruit-picking scenarios.\n\n2. A related concern is the limited variety of objects in the dataset. With only 8 types of fruits, and a significant majority of them being spherical (75%), the need for 6DOF pose estimation for these objects may be questionable. The paper should address the relevance of 6DOF pose estimation for objects that might not require such detailed positioning information.\n\n3. The paper should explore the broader question of whether 6DOF pose estimation is necessary for fruit picking, particularly when considering that many real-world fruit-picking applications rely on suction grippers, making pose estimation less critical.\n\n4. It is important to clarify the specific scenarios that the dataset targets. Random mixing of different fruits in bins may not represent common real-world scenarios, where fruits are typically harvested in monocultures and packed separately. The paper should outline the dataset's intended use cases and their alignment with real-world applications.\n\n5. While the paper claims diversity in the dataset, I would argue that diversity should be measured by the variety of objects rather than the sheer number of images and annotations. The paper should address these concerns and clarify how the dataset's diversity aligns with its practical usefulness.\n\n6. In my opinion, the representative images in the paper all look similar, and the lighting variations are synthetic without showing real-world visual phenomena (shadows, reflection). The paper should discuss how these factors affect the dataset's applicability to real-world scenarios and consider potential improvements.\n\n7. Some of the language choices throughout the paper, such as the use of \"comprehensive\" to describe the evaluation using two models, are overly grandiose, in my opinion. The paper should adopt more precise and measured language to accurately represent the extent of the evaluation and avoid overstating its findings.\n\n8. As this dataset targets robotic grasping of fruits, I would have liked to see a comparison of using the dataset on 6DOF grasping with a robotic gripper, not only pose estimation."
            },
            "questions": {
                "value": "1. In the intro, the paper mentions that the dataset contains delicate fruits like bananas and apricots that require haptic feedback for grasping, yet it is not mentioned how this is modeled and incorporated in the benchmark. Is this only in reference to exact pose estimation?\n2. In Table 1. how does the presented dataset compare to other 6DOF datasets regarding object diversity?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission9289/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698691264508,
        "cdate": 1698691264508,
        "tmdate": 1699637169923,
        "mdate": 1699637169923,
        "license": "CC BY 4.0",
        "version": 2
    }
]