[
    {
        "id": "Z9DUPDjgTl",
        "forum": "4Qz9BT4mpM",
        "replyto": "4Qz9BT4mpM",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8448/Reviewer_sUjj"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8448/Reviewer_sUjj"
        ],
        "content": {
            "summary": {
                "value": "This work explores how to accurately predict the out-of-distribution performance of foundation models in the case where one does not have access to labels for the OOD data. The authors rely on an intriguing observation made in earlier works: In order to predict OOD performance, it often suffices to determine to what degree different models agree on the in-distribution data, compared to the OOD data. While this phenomenon has been established for models trained from scratch, the strategy has not been extended to the case of pre-trained models. Such an extension comes with challenges: how can one ensure model diversity if the same foundation model is fine-tuned multiple times? The authors explore multiple methods to ensure diversity for linear probing for CLIP and demonstrate that accurate OOD prediction can be achieved if the linear heads are randomly initialised. The authors go one step further and demonstrate that reliable OOD prediction can even be achieved when employing several foundation models, that all are pre-trained on different data."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. Practitioners these days largely rely on fine-tuning foundation models instead of training models from scratch. Thus extending the techniques of Baek et al. to cover the case of fine-tuning is very valuable and might prove very useful to practice. I thus think the results in this work are a timely contribution.\n2. I think understanding how to induce diversity when dealing with a single foundation model is an interesting question on its own, especially when thinking of building ensembles based on multiple such training runs. The findings presented in this work are very surprising with that regard, e.g. using different initialisations for linear heads seems to play a very important role, which goes against my personal intuition. \n3. The method seems to work pretty well empirically across different modalities, if things are tuned correctly, which is very encouraging and makes the contributions more relevant also to practically-oriented people."
            },
            "weaknesses": {
                "value": "1. I think the authors use the word **diversity** without explaining too much what exactly they mean and what is needed in order to make the agreement-on-the-line method work. Clearly there needs to be some diversity (otherwise all models would agree everywhere as correctly pointed out by the authors) but can there be too much diversity? This is especially confusing because the authors find that introducing stochasticity solely by using different initialisations is actually the most performant choice. But clearly, this cannot be more diverse than further using different batch orderings or even subsampling the data? Linear probing should even be a convex problem, so all runs should actually converge to the same minimum even from different initialisations, given that optimisation is performed for long enough. Could you elaborate on the role of diversity, e.g. can there be too much diversity? I think explaining this better would really help the subsequent empirical exploration.\n2. In general, many empirical phenomena are observed but the authors do not really make an attempt at explaining them. Why does only using differently initialised random heads give the “right” amount of diversity? Why do you observe a way higher rate of agreement OOD compared to ID when using other techniques such as data shuffling and subletting etc? If anything, I would have expected more agreement in-distribution as all the models at least were optimised for this. What do you mean by strictly lying on the diagonal line y=x? Wouldn’t that suggest that in-distribution and out-of-distribution agreement are of the same magnitude? \u2028What happens if instead of linear probing, you perform full fine-tuning in case of CLIP? Does the additional diversity also hurt the predictive performance?\n3. It remains a bit unclear to me to what degree this method needs to be first validated before the results can be trusted. At least for linear probing with CLIP, getting the amount of diversity right seems to be very tricky as the method is highly unstable to small deviations. Moreover, in almost all cases, the experiments still show agreement-on-the-line, but don’t necessarily correlate with test accuracy (i.e. sharing the same slope and intercept). Thus observing agreement-on-the-line does not suffice to conclude that extrapolated accuracy values will actually be accurate. I would appreciate if the authors could discuss more how their observations regarding diversity relate to the prior work Baek et al. Is the method significantly more stable to changes in the training protocol when training from scratch?"
            },
            "questions": {
                "value": "1. What are the units of the x-axis and y-axis for Figure 1 and Figure 2? How is agreement measured? Is this a log-log scale? How are the linear fits obtained? \n2. What are the absolute test values in Table 1 and Table 2? Does the method tend to over-estimate or under-estimate the true test accuracy? It’s also not clear how significant a deviation of 5% is if the absolute values are not known. E.g. if test performance is 20%, then a deviation of 5% is clearly more significant than if test performance is 95%."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8448/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698750290028,
        "cdate": 1698750290028,
        "tmdate": 1699637053853,
        "mdate": 1699637053853,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "VE2UCVkSXb",
        "forum": "4Qz9BT4mpM",
        "replyto": "4Qz9BT4mpM",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8448/Reviewer_47Ds"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8448/Reviewer_47Ds"
        ],
        "content": {
            "summary": {
                "value": "This paper studies \"agreement on the line\" (AGL) phenomenon for the foundation model setting which can be used to predict out-of-distribution (OOD) accuracy without OOD labels. Roughly, AGL implies that for an appropriately chosen family of models, the in-distribution (ID) and OOD accuracies lie on a straight line (accuracy on line - ACL) and so does the ID and OOD agreements between pairs of models, and that these lines are the same. Since agreement for a family of models can be measured using ID and OOD unlabeled data, and ID accuracy can be measured using ID labeled data, one can predict OOD accuracy by estimating the AGL line. \n\nThis phenomenon has been previously studied and reported for the supervised learning setting. However the paper argues that AGL is challenging for foundation model setting:\n- For light fine-tuning from a single foundation model, it is hard to get a diverse set of models to observe AGL\n- For multiple foundation models, the set of models might be too diverse and AGL might fail\n\nThe paper puts AGL to test for (1) linear probe with CLIP on CIFAR & (2) fine-tuning with language model(s). It considers 4 different types of model families by varying (a) random head initialization, (b) hyperparameters, (c) data subsets, (d) data ordering. The main finding is that **\"random head initialization\" is the only setting that demonstrates AGL, for linear probe and finetuning.** Thus for this setting, careful selection of model family is necessary to observe AGL.\n\nFor the multiple foundation model setting, the paper finds that **AGL holds across a family of 41 language models** for QA finetuning, despite the LLMs being pretrained on different data sources. This contrasts earlier findings for pretrained models in vision setting. The presence of AGL allows better OOD accuracy prediction that other methods based on *confidence* based predictions."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- Originality of findings: It is an interesting finding that AGL also holds in fine-tuning setting, although with carefully selected model family. Also interesting to see that random head initialization is the best and only setting for which AGL holds. AGL across different pretrained LLMs is also interesting, given that the same doesn't hold for vision setting.\n\n- Clarity: The high level message and results are clearly presented. Some details could be presented better; see comments/questions below."
            },
            "weaknesses": {
                "value": "- Novelty: The paper evaluates an existing idea of AGL using existing metrics, but in a different (but relevant) setting of foundation model fine-tuning and linear probing. It does not propose a new technique or a new evaluation method or a drastically new perspective, to the best of my knowledge. The findings are new mostly because of the new setting that is being considered.\n\n- Clarity: Some details are either deferred to the appendix (definition of ALINE) or the reader is directed to prior work (methods that utilize model confidence in Section 4.2), which made it harder to follow some details. Figures captions could also use more details and be more self-contained (e.g.  Figure 3, Figure 4 -- which column is what method?). More comments/questions below\n\n- While the paper presents findings on when AGL holds in the fine-tuning setting, there is not much insight into why these findings might hold. E.g. is there any intuition for why random head initialization leads to AGL and others do not?\n\nOverall it seems like the results are \"good to know\", but do not necessarily provide a lot of new insights or food for thought. A deeper analysis of some of the findings could make the paper significantly stronger in my opinion. Given that I did not find any major flaws, I would assign a score of weak accept."
            },
            "questions": {
                "value": "- In Figure 4, which column corresponds to which method? Visually it seems like the second column is the best, and for no column does it seem like AGL always holds.\n\n- In Section 4.1 the phrase “ensemble of foundation models” is a bit confusing. Does it mean an ensemble in the machine learning sense or just a \"group\" of models?\n\n- In Section 4.2, how is temperature scaling relevant in this setting?\n\n- What is $\\Phi$ in Section 8.3?\n\n- Is there a specific reason to only do linear probing for the CLIP setting, and just 1 fine-tuning task of SQuAD for the LM setting?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8448/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698811048641,
        "cdate": 1698811048641,
        "tmdate": 1699637053737,
        "mdate": 1699637053737,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "oHQLxGCSdu",
        "forum": "4Qz9BT4mpM",
        "replyto": "4Qz9BT4mpM",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8448/Reviewer_BrfQ"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8448/Reviewer_BrfQ"
        ],
        "content": {
            "summary": {
                "value": "This paper focuses on the problem of predicting the performance of fine-tuned foundation models under distribution shifts. To do so, they extend ALine (Baek et al. 2022), a method that leverages accuracy-on-the-line and agreement-on-the-line phenomena. The main idea of this extension is to inject diversity in model performance of fine-tuned foundation models via random linear head initialization, or use multiple foundation models trained with different hyperparameters and on different datasets. The empirical findings demonstrate that this approach outperforms existing methods in terms of MAE (mean absolute error).\n\nUpdate: the rebuttal addresses my main concerns, so I am increasing my score."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- Shows that multiple foundation models in vision and LLM-based tasks exhibit accuracy-in-the-line and agreement-on-the-line phenomena.\n- Analysis on sources of diversity and its effect on ACL and AGL is thorough. This analysis results in a simple fix (random linear heads) to estimate OOD performance of a single foundation model fine-tuned on a downstream task. \n- Experiments show that ALine-D and Aline-D (Baek et al., 2022) outperform OOD prediction methods based on model confidence in predicting OOD performance of fine-tuned foundation models."
            },
            "weaknesses": {
                "value": "- Organization of the paper is quite confusing. It starts off with a single model regime, where ALine needs to be extended due to diversity issues. Then, it states (in text) that multiple foundation models may have too much diversity, but empirically this is not a problem and that ALine works directly. It may be better to start with S4 (show that multiple foundation models exhibit AGL) and then move to the single foundation model setup that requires modifications to AGL-based OOD error estimation.\n- The novelty of this work is limited. S5 applies ALine (Baek et al. 2022) to larger pre-trained (foundation) models. S4 extends ALine by training a single foundation models with multiple random linear head initializations.\n- A major limitation of {accuracy, agreement}-on-the-line phenomena is that it is primarily a dataset-level property. First, there exist multiple datasets wherein the  ID-OOD ACL trend is not well explained by a linear function (see https://arxiv.org/abs/2209.00613 and https://arxiv.org/abs/2305.02995). Second, it is unclear when the ACL and AGL trend (i.e., same slope and intercept) hold. As a result, one cannot reliably use this method to predict OOD error in practice.\n- Comparison to the ProjNorm method (https://arxiv.org/abs/2202.05834), which performs better than the baselines considered in this paper, is missing."
            },
            "questions": {
                "value": "It is unclear to me why injecting diversity via random linear heads works but not via other methods, e.g., data subsetting. Any intuition for what separates random linear heads from other interventions?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission8448/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission8448/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission8448/Reviewer_BrfQ"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8448/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698962737333,
        "cdate": 1698962737333,
        "tmdate": 1700854554998,
        "mdate": 1700854554998,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "ePvzpLQzhm",
        "forum": "4Qz9BT4mpM",
        "replyto": "4Qz9BT4mpM",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8448/Reviewer_vvH6"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8448/Reviewer_vvH6"
        ],
        "content": {
            "summary": {
                "value": "This paper explores various methodologies such as commonsense reasoning, medical image classification adaptation, and robust fine-tuning of zero-shot models. The paper contributes to the field by presenting a real-world dataset for medical image classification, discussing the challenges of model adaptation to out-of-distribution data, and evaluating the performance of fine-tuned models on new, unseen datasets. It also examines the correlation between in-distribution and out-of-distribution generalization, offering insights into the predictability of model performance across different domains. This work stands to impact the understanding of model robustness and the practical application of transfer learning in diverse machine learning tasks."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "The paper's approach to applying 'agreement-on-the-line' to foundation models is an original contribution that extends the utility of these models in novel ways. This method, as the paper suggests, could offer a fresh perspective on assessing and improving the performance of foundation models on out-of-distribution data. The authors' choice to explore this within the context of medical image classification and other domains also demonstrates an innovative application of machine learning techniques to real-world problems.\n\nThe authors' development and use of a real-world dataset for medical image classification suggest a commitment to grounding their findings in practical, applicable scenarios. The paper's methodological rigor is evident in the detailed descriptions of the experiments and the analytical techniques employed to assess model performance.\n\n\nDespite the complex nature of the subject matter, the paper maintains a level of clarity that is commendable. The authors have managed to explain their methodologies and findings in a way that is understandable, which is particularly important when addressing such advanced topics in AI. The clarity with which the paper discusses the implications of its findings for the field of machine learning is a notable strength.\n\nThe significance of the paper's contributions cannot be overstated. By addressing the challenge of model generalization and robustness, the paper tackles one of the most pressing issues in machine learning today. The potential impact of this research is broad, as it could influence a wide range of applications, from healthcare to autonomous systems, where the ability to perform well on out-of-distribution data is crucial.\n\nIn summary, the paper stands out for its original approach to a key problem in machine learning, its rigorous and quality research methodology, the clarity of its exposition, and the potential significance of its contributions to the field."
            },
            "weaknesses": {
                "value": "The paper's exploration of foundation models and their application to various domains is commendable; however, there are areas where the work could be strengthened:\n\nSpecificity of Contributions:\nThe paper's contributions could be articulated more clearly. While the authors propose the application of the 'agreement-on-the-line' method to foundation models, they do not sufficiently differentiate this approach from existing methods. For instance, the paper states, \"We consider a variety of foundation models: GPT2, GPT-Neo, OPT, Llama2, and CLIP,\" but does not elaborate on how 'agreement-on-the-line' enhances or differs from the current state-of-the-art. To improve, the authors should explicitly state the unique advantages and contributions of their method over existing approaches, possibly by providing a direct comparison to highlight the novelty.\n\nComparative Analysis:\nThe experimental section lacks a comprehensive comparative analysis. The authors present experiments validating their method, yet there is no benchmarking against existing Out-Of-Distribution (OOD) performance estimation methods. The paper could be significantly improved by including comparisons with established baselines, as this would demonstrate the efficacy of the 'agreement-on-the-line' method over others. For example, when discussing the fine-tuning procedures, the authors could compare the OOD performance estimation with other known approaches to establish the superiority of their method.\n\nData Diversity and Volume:\nThe volume and variety of datasets used for validation appear limited. The paper mentions, \"Fine-tuning... we have access to labeled data from some distribution DID,\" but does not provide extensive validation across a broad range of datasets. Expanding experiments to include a wider array of datasets, especially those with larger scales and varying types, would lend more credibility and generalizability to the findings.\n\nWriting Quality:\nThe clarity and organization of the paper could be improved. The logical flow and language precision are areas where the paper seems to fall short. For instance, the use of terms like \"foundation models\" and \"agreement-on-the-line\" could be more clearly defined to avoid ambiguity. The authors are encouraged to refine the language and structure of the paper to enhance readability and ensure that the arguments are presented coherently.\n\nReference Breadth:\nThe paper seems to have a narrow scope of references, primarily citing a few articles by the authors themselves. To establish the research within the broader context of the field, it would be beneficial to cite a wider range of high-quality, related studies. This would not only position the paper within the existing body of knowledge but also provide a more robust background for readers.\n\nIn summary, while the paper presents interesting ideas, it would benefit from clearer articulation of its unique contributions, more extensive comparative analysis, broader and more diverse data validation, improved writing quality, and a more comprehensive set of references."
            },
            "questions": {
                "value": "Methodological Clarification:  \nCould you elaborate on the theoretical underpinnings of the 'agreement-on-the-line' method? How does it theoretically and practically differ from existing methods for assessing model performance on out-of-distribution data?\n\nExperimental Comparisons:  \nThe paper would benefit from a direct comparison of your method with existing benchmarks. Could you include such a comparison to highlight the advantages of your approach?\n\nDataset Diversity and Volume:  \nYour experiments seem to be limited to a few datasets. Could you provide insights into how your method performs across a more diverse range of datasets, including those with larger scales?\n\nRobustness of Findings:  \nHow robust are your findings to changes in the model architecture or dataset characteristics? Are there any limitations to the applicability of the 'agreement-on-the-line' method?\n\nImpact of Fine-Tuning Procedures:  \nCan you discuss the impact of different fine-tuning procedures on the performance of foundation models using your method? How does the 'agreement-on-the-line' adapt to these variations?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "How were the datasets, especially those involving medical images, obtained? Were appropriate consents from the subjects obtained, and were the datasets de-identified to protect privacy?"
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission8448/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission8448/Reviewer_vvH6",
                    "ICLR.cc/2024/Conference/Submission8448/Senior_Area_Chairs"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8448/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699462328598,
        "cdate": 1699462328598,
        "tmdate": 1700633070678,
        "mdate": 1700633070678,
        "license": "CC BY 4.0",
        "version": 2
    }
]