[
    {
        "id": "y24Z8IMSnB",
        "forum": "4Zz5UELkIt",
        "replyto": "4Zz5UELkIt",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1014/Reviewer_QTvC"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1014/Reviewer_QTvC"
        ],
        "content": {
            "summary": {
                "value": "The paper introduces the computational procedure DIA to increase the sample efficiency for indirect experiments for CATE estimation.  Specifically, the procedure leverages influence functions for iteratively optimizing the data collection policy through adaptive instrument selection.  Optimality is defined through a minimal mean-squared error of the estimator.  The paper emphasizes the applicability of the theoretical procedure through experiments conducted on two synthetic datasets and an extended version of the semi-synthetic TripAdvisor dataset."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1) To the best of my knowledge, the presented problem statement is novel and of high interest for CATE estimation in scenarios in which direct interventions are impractical, costly or unethical.\n2) The authors provide theory for the proposed method DIA."
            },
            "weaknesses": {
                "value": "1) The paper suffers from impreciseness and multiple open questions (see below).\n2) The results are not reproducible: The experimental setting (e.g., the employed datasets) are not described, neither is code provided. Besides the reproducibility aspects, this also hinders understanding and interpretation of the presented figures and results.\n3) The paper does not employ the required format of citations in the text, i.e. reference number instead of author name + year. \n4) The motivation could be much improved by elaborating more exactly where the method is relevant and providing a real-world case study."
            },
            "questions": {
                "value": "The paper would benefit from additional details on the following questions:\n\n1) Why is the MSE a good metric of choice? What is the benefit above other objectives (e.g., minimizing regret)?\n2) What would be the general form of the k-th order influence function?\n3) What is meant by the perturbation of the distribution function induced by Dn? In which sense are the samples perturbed?\n4) Why can the estimator theta(Dn) be considered symmetric? A short mathematical statement would benefit the flow of reading.\n5) What is the formulation of the importance ratio on the entire data? (page 6 might be difficult to follow for non-expert readers).\n6) Similarly, a short introduction/theory of the acceptance-rejection method would be beneficial. I am not convinced that the average reader is familiar with the concept.\n7) The authors mention the flexibility of their approach multiple times. Nevertheless, it is unclear what precisely is meant by flexibility/ which properties make the approach flexible.\n9) How does the performance of DIA-X for different X relate to the data generating mechanism? Can the optimal X be deducted from the data for the presented experiments?\n10) Figure 3: The funnel (standard dev.?) is only plotted for the IV-bias. Why is it not visible for the other cases or the variance plot?\n11) TripAdvisor data: Why was it necessary to synthetically enhance the data? Could you also provide a comparison of the results of the method on the original real-world dataset and the enhanced semi-synthetic dataset? It would also be interesting for the reader if the authors could state the optimal instruments for the real-world dataset.\n\nThe paper has multiple imprecise parts:\n\n1) Background: The theoretical background/ problem setting of the paper is taken from reference 23. In contrast to the original work, the paper lacks motivation for and explanation of the specific problem setting.\n2) Control Variates: The choice of the control variate (section 3.1) should be justified mathematically (possibly in the appendix).\n3) Figure 4: According to the text, one should observe an exponentially increasing variance for IS in the number of samples. However, the figure does not support this statement.\n4) Experiments: The synthetic data generation is not properly described. Furthermore, no details on the networks employed for estimation are stated.\n5) It would be nice to formalize \\pi in Sec 2 upon first experience. \n6) References: Multiple references are incomplete.\n\nThings to improve the paper that did not impact the score:\n\n1) Structure: The structure of the paper can be optimized to facilitate reading. A constant reminder of what will follow later (e.g., Section 4) might confuse the reader more than it aids the flow of the paper. Furthermore, key contributions (e.g. Theorem 2) are referred to the appendix. It would aid the understanding of the theory to have the main results presented as such in the main part of the paper.\n2) Consistency in wording, e.g., importance weighting vs. importance sampling\n3) Multiple times it is unclear if a certain aspect is only assumed or proven. Clarification emphasizes the contribution of the paper.\n\nMinor comments:\n\n1) There are some minor typos and grammar errors in the text."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission1014/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1014/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1014/Reviewer_QTvC"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1014/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1697629764012,
        "cdate": 1697629764012,
        "tmdate": 1699636027487,
        "mdate": 1699636027487,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "kJChAuS4mz",
        "forum": "4Zz5UELkIt",
        "replyto": "4Zz5UELkIt",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1014/Reviewer_7XxM"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1014/Reviewer_7XxM"
        ],
        "content": {
            "summary": {
                "value": "The paper investigates enhancing sample efficiency for indirect experiments by adaptively designing a data collection policy over instrumental variables. The authors propose a practical computational procedure that utilizes influence functions to search for an optimal data collection policy, together with the idea of rejection sampling. By many experiments in various domains, the authors showcase the significant improvement of the sample efficiency in indirect experiments."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1.\tThe problem considered in this paper, from my perspective, is important and interesting from both a theoretical and practical perspective.\n2.\tThe ideas of generalizing the influence functions and adopting rejection sampling are quite inspiring. Although the core concepts are standard, the generalization is still novel, in my opinion.\n3.\tThe paper is well written and relatively easy to follow, considering it is a quite theoretical one."
            },
            "weaknesses": {
                "value": "1.\tAdaptivity can bring us a lot of benefits like the improvement of sample efficiency. However, the technical challenge is that adaptivity usually harms the independence among the data. The adaptively collected data is usually challenging to analysis, even for the basic M-estimator (see, e.g., [A]). The authors do not seem to cover any points along this line. It will be beneficial to present whether the adaptivity in this paper affects the independence structure and how the authors handle such difficulties.\n2.\tFor the multi-rejection sampling, if $\\pi’$ and $\\pi_i$ are very different, the algorithm might reject many samples before getting a useful one, which can be very inefficient and impractical. Things become even worse when the dimensions of the problem get larger, for example, as the authors mentioned, when the natural language serves as instruments Additionally, it would be good to know how to choose the value of \"k\" in practice.\n3.\tIn the introduction, when summarizing the contributions, I didn't notice a clear mention of the technical challenges and novel aspects of the work. I found several such points in the main text. It would be beneficial, in my opinion, to include them in the introduction, especially since many of the ideas are quite traditional.\n4.\tOne minor point is that the writing can be further improved.\tWhen referring to an equation, it is better to put the equation number in parentheses. The phrase to define $D_{n\\i}$ ($D_n$ except the one in the $log \\pi (Z_i | X_i)$ term) is a little confusing.\n\n\nReference:\n[A] Zhang, K., Janson, L., & Murphy, S. (2021). Statistical inference with m-estimators on adaptively collected data. Advances in neural information processing systems, 34, 7460-7471."
            },
            "questions": {
                "value": "See above."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1014/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698898145727,
        "cdate": 1698898145727,
        "tmdate": 1699636027407,
        "mdate": 1699636027407,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "TC4VC6CbFx",
        "forum": "4Zz5UELkIt",
        "replyto": "4Zz5UELkIt",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1014/Reviewer_SUta"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1014/Reviewer_SUta"
        ],
        "content": {
            "summary": {
                "value": "Authors present a current and well motivated problem, execute the ideas well, communicate results clearly and as such make a relevant contribution the literature.\n\nThe problem statement is delivered at different levels of intuition and formality which helps exposition (i.e. “consider how to automatically learn data-efficient adaptive instrument-selection decision policies, in order to quickly estimate conditional average treatment effects” and “aim to develop an adaptive data collection policy π(·|x) ∈ ∆(Z) over the instruments Z for all x ∈ X that can improve sample-efficiency of the estimate of the counterfactual prediction f. Importantly, we aim to develop an algorithmic framework that can work with general (non)-linear two-stage estimators.”)\n\nTheir “general framework for adaptive indirect experiments” is well placed with a reasonable long-term perspective and careful analysis of limitations. They also maturely accommodate natural limitations by presenting a framework that is “designed to minimize the need for expert knowledge and can readily scale with computational capabilities”.\n\nI am unable to comment on the correctness of the theorems, though it seems the authors heavily rely on previously shown results and plug and play those, which, given the empirical results, suggests they are successful.\n\nEmpirical examples substantiated the theoretical claims well, though the final discussion has significant potential for development. It is possibly a bit underdeveloped with a weak conclusion of the impact of reallocation. \n\nThe conclusion of a ‘Unshaped’ trade off between number of instruments and number of reallocations might oversimplify deeper issues, though for the given work is perfectly adequate.\n\nOverall, the paper makes a relevant contribution to the literature, tackling an important problem with skilful navigation of theoretical tools (influence functions and multi-rejection importance sampling) resulting in convincing results and arguments for using DIA."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "4 excellent"
            },
            "strengths": {
                "value": "- [ ] The background is curated at the right level of depth and supports exposition very well. They navigate the page limit well with a carefully formulated and rich appendix.\n- [ ] The conceptual development throughout the paper is very consistent and easy to follow.\n- [ ] Identifiability conditions are present effectively for the given task.\n- [ ] Figure 3 is incredibly effective to demonstrate the improvements, the last sentence could be boldened/underlined/emphasised more. (“Observe the scale on the y-axes.”)\n- [ ] The exposition of a linear example in the example is very much appreciated."
            },
            "weaknesses": {
                "value": "- [ ] I was able to understand “Indirect experiments” on an intuitive level from the problem statement and the given examples, but a less informed reader might struggle and benefit from a more thorough/formal definition, though I am aware authors can’t cater to all levels and the current introduction of the term is just fine for the usual causa ICLR reader.\n- [ ] The conclusion is possibly a bit underdeveloped with a weak conclusion of the impact of reallocation, e.g. Figure 5.\n- [ ] The conclusion of a ‘Unshaped’ trade off between number of instruments and number of reallocations might oversimplify deeper issues, though for the given work is perfectly adequate."
            },
            "questions": {
                "value": "- [ ] Do you have more empirical or theoretical evidence to enrich the discussion on the ‘U-shaped’ trade off between number of instruments and number of reallocations? It seem like you might be running out of space, but if camera-ready allows another page, please enrich.\n- [ ] Figure 2: I am not sure what the dotted red lines indicate. I assume they are related to special conditions and assumptions on the SCM, but these are not connected to the text as far as I can see. Did I miss it?\n- [ ] Typo: Page 5 bottom: “multi-rejection important sampling” should be importance I assume."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission1014/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1014/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1014/Reviewer_SUta"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1014/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699372494074,
        "cdate": 1699372494074,
        "tmdate": 1699636027345,
        "mdate": 1699636027345,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "lM9sc107rb",
        "forum": "4Zz5UELkIt",
        "replyto": "4Zz5UELkIt",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1014/Reviewer_ST2k"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1014/Reviewer_ST2k"
        ],
        "content": {
            "summary": {
                "value": "This paper discusses how to design an adaptive data collection process over the instruments that can improve the sample-efficiency of the estimation of the counterfactual prediction. The previous works mitigate the bias in estimation of the predictor $f$, but they are often subject to high variance problem. This paper mitigates the high variance problem of the gradient estimator by using influence functions and multi-rejection importance sampling and provides theoretical analysis of the bias and variance of the proposed gradient estimator. Specifically, although there exists a slight estimation error, this paper proposes $∇^{IF}L(π)$ estimator based on influence functions to solve the time-consuming problem caused by re-training and the high variance problem. Meanwhile, this paper proposes a multi-rejection important sampling approach, which has lower variance compared to the traditional importance sampling approach. In addition, this paper proposes an algorithm that is able to design instruments adaptively. Moreover, experiments are conducted on three regimes to demonstrate the effectiveness of the proposed method."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "S1: The motivation is clear. How to design indirect experiments when direct assign interventions is impractical is a important problem.\n\nS2: The techniques adopted in this paper are sound, and are supported by solid theoretical analysis. \n\nS3: The proposed algorithm is novel and demonstrates good performance.\n\nS4: The experimental results on the three datasets are convincing."
            },
            "weaknesses": {
                "value": "W1: The paper uses uniform data collection method as the baseline, however, I think evaluating some more RL algorithms and comparing their performance will make the paper more convincing.\n\nW2:  In practice, the max mutli-importance ratio may not be known, so this paper use the empirical supremum instead. May $\\bar{ρ}(S_{i})$ also be unknown?\n\nW3: Is there some clear pattern for DIA-X with different X in Figure 1, 5 and 6? For example, the U-trend is not obvious in Figure 1.\n\nW4: Is Figure 3 showing the result with K=1 in $∇^{IF}L(π)$? Providing more results with varying K may helpful."
            },
            "questions": {
                "value": "Please refer to the weaknesses part.\n\n***\n\nAfter rebuttal: Thank you very much to the authors for their answers to our reviews and for improving the paper during the rebuttal period. The modifications bring valuable content. I read also carefully the other reviews and the corresponding answers. My (positive) recommendation remains unchanged."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "N/A"
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission1014/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1014/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1014/Reviewer_ST2k"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1014/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699463586357,
        "cdate": 1699463586357,
        "tmdate": 1700780939022,
        "mdate": 1700780939022,
        "license": "CC BY 4.0",
        "version": 2
    }
]