[
    {
        "id": "nxauXgEcUM",
        "forum": "6PmJoRfdaK",
        "replyto": "6PmJoRfdaK",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1602/Reviewer_WV76"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1602/Reviewer_WV76"
        ],
        "content": {
            "summary": {
                "value": "this paper proposes some computationally efficient methods to continue finetuning a pretrained model to support longer context. The paper proposed a modification for localized attention to support longer context by shifting the subgroups during finetuning. The paper also experimented with LoRA for long-context adaptation."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. the paper is well written and easy to follow. the proposed approach is a simple method that can adapt LLM for longer context without too much compute.\n2. the paper has good ablation to show that LoRA on embedding and normalization is important for long-context adaptation."
            },
            "weaknesses": {
                "value": "1. the paper only evaluated on retrieval and perplexity. It would be good to evaluate on other generative tasks that require longer context.\n2. the improvement on perplexity doesn't seem super consistent in Table. 4"
            },
            "questions": {
                "value": "1. Have you tried evaluating on any generative tasks?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1602/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698421222287,
        "cdate": 1698421222287,
        "tmdate": 1699636088576,
        "mdate": 1699636088576,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "Ke4BKU68Fr",
        "forum": "6PmJoRfdaK",
        "replyto": "6PmJoRfdaK",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1602/Reviewer_Sw6W"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1602/Reviewer_Sw6W"
        ],
        "content": {
            "summary": {
                "value": "This paper presents a method to perform LLM context extension with less memory and wall-clock time than existing methods. Their main modifications to improve efficiency are (1) training on local rather than global attention using the shift-short attention pattern, (2) using LoRA, and (3) modifying the norm and embedding layers in addition to the self-attention and feed-forward layers. The resulting method performs similarly to full fine-tuning."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "4 excellent"
            },
            "strengths": {
                "value": "(1) The method seems useful and impactful, and the evaluation is thorough with strong results.\n\n(2) The authors perform very thorough ablations and isolate key design decisions (attention shift, modifying the norm & embedding layers) that enable the method to match full fine-tuning.\n\n(3) The paper is well-written."
            },
            "weaknesses": {
                "value": "No major weaknesses."
            },
            "questions": {
                "value": "(1) While this is somewhat outside the scope of this paper, I would be curious about comparisons to methods that involve training a long-context LM from scratch.\n\n(2) I am a bit confused why regular LoRA and LoRA+ (Table 11) use the same amount of memory. Does S^2-Attn reduce memory usage as well, or only flops?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission1602/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1602/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1602/Reviewer_Sw6W"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1602/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698806894993,
        "cdate": 1698806894993,
        "tmdate": 1699636088481,
        "mdate": 1699636088481,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "LhmjbCk8CO",
        "forum": "6PmJoRfdaK",
        "replyto": "6PmJoRfdaK",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1602/Reviewer_FsJg"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1602/Reviewer_FsJg"
        ],
        "content": {
            "summary": {
                "value": "This paper introduces a novel approach to extend the context length of transformer-based language models. The approach consists of two main ideas: 1) split the context into smaller subgroups and conduct attention in each group individually; 2) adapt the model to make use of this new attention approach via parameter-efficient fine-tuning with LoRA.\n\nThe authors conduct experiments with the Llama2 model family using models with 7B, 13B, and 70B parameters and compare their newly proposed approach to several baselines. In terms of perplexity, their proposed approach is able to maintain performance even when extending the context size by a factor of 16. \n\nBeyond language modelling, the authors evaluate their method in a retrieval setup (finding a hidden key in a long sequence of text), demonstrating its improved performance over baselines."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- The proposed method builds on previous work and shows strong empirical results on long lange language modelling and a retrieval task\n- The proposed approach is conceptually simple and can be implemented in a few lines of code (as demonstrated by the authors)\n- The proposed approach can be combined with existing approaches for context extension such as positional interpolation \n- The authors provide a detailed discussion of related work"
            },
            "weaknesses": {
                "value": "- The efficiency aspect of the could could be more prominently discussed in the main body of the paper\n- The presentation of the work could be improved. See below for suggestions"
            },
            "questions": {
                "value": "**Presentation**\n\n- I had difficulties understanding Figure 3. It would help if you add indices and annotations to the matrices in this plot. Additionally, it could be helpful to draw a (visual) connection between the blue matrices on the left and the attention patterns on the right. \n- Be more consistent about the usage of $S^2$, shift short attention, LoRA+, and LongLoRA. Make it more explicit that LongLoRA = $S^2$ attention + LoRA.\n- Table 7 is a great candidate for a line plot. \n- When pointing to results in the Appendix, make sure to reference a specific section in the Appendix. \n- The \"attention patterns\" ablation feels repetitive. How is it different from the \"consistency to full attention\" discussion in Section 3.2?\n- In the section on retrieval-based evaluation you mention that your model is \"somehow\" able to handle longer context. What does this mean?\n\n**Experiments**\n\n- You mention several times that the original standard self-attention can be retained at inference time. It would be helpful to provide more details on that. Also, Table 2 is mentioned as evidence for that. It would be helpful to elaborate more about the results in this table. \n- Table 3: What about an additional baseline that trains LoRA + embeddings?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission1602/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1602/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1602/Reviewer_FsJg"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1602/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698841716709,
        "cdate": 1698841716709,
        "tmdate": 1700657825452,
        "mdate": 1700657825452,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "yHUD09zCLP",
        "forum": "6PmJoRfdaK",
        "replyto": "6PmJoRfdaK",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1602/Reviewer_7K1u"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1602/Reviewer_7K1u"
        ],
        "content": {
            "summary": {
                "value": "The authors propose a new method for adapting pretrained large language models (LLMs) to longer sequence lengths with a focus on efficiency. Prior works are either costly, due to requiring full fine-tuning of the language model or loose performance. The authors show that combining Low Rank Adaptation (LoRA) with sparse local attention provides improves efficiency while preserving performance. For LoRA, the authors note that a simple and cheap modification to LoRA, un-freezing embedding and normalization layer parameters, can prevent LoRA from loosing performance as sequence lengths increases. For sparse local attention, they employ a simple heuristic of splitting attention into independent groups of 2048 tokens. By overlapping groups within each layer at different attention heads, they ensure information flow between groups and are able to preserve performance at a level close to the much costlier full attention."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- The authors propose an extremely simple method, that performs well and is applicable to existing pretrained models"
            },
            "weaknesses": {
                "value": "- The authors only evaluate perplexity and retrieval setting"
            },
            "questions": {
                "value": "- Have you done experiments / ablation on optimal group size for different target sequence lengths? It seems you have derived that setting the group size to 25% of target sequence length is reasonable for 8192 sequence length, but it is unclear whether this 25% heuristic or a constant group size translates to longer sequence lengths.\n- There are multiple ways to estimate model flops. Please provide the method / formula you used for Table 10."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission1602/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1602/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1602/Reviewer_7K1u"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1602/-/Official_Review"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699714310194,
        "cdate": 1699714310194,
        "tmdate": 1699714310194,
        "mdate": 1699714310194,
        "license": "CC BY 4.0",
        "version": 2
    }
]