[
    {
        "id": "uanUmFFYnf",
        "forum": "7essnmWOK5",
        "replyto": "7essnmWOK5",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3207/Reviewer_MDiL"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3207/Reviewer_MDiL"
        ],
        "content": {
            "summary": {
                "value": "The paper introduces HSDGNN, a neural network architecture for multivariate time series forecasting. HSDGNN propagates representations along both nodes and features using dynamic adjacency matrices, which can be considered analogous to spatial attention scores. The model uses static learnable embeddings for both time steps and nodes and other operators to condition the forecasts. Empirical results show performance competitive w.r.t. the state of the art."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "* Decent empirical results.\n* The ablation study is appreciated.\n* Figures do a good job of clarifying aspects of the method."
            },
            "weaknesses": {
                "value": "The methodological novelty of the paper is quite limited and the selected datasets appear inappropriate.\n\n* The main novelty of the paper consists of combining intra and inter-node graph convolutions on a dynamically learned adjacency matrix (with no constraint on the sparsity), which can be seen as a matrix of dynamic attention coefficients. However, several methods perform attention across different dimensions (e.g., [1]) and there's little novelty in the mechanism used to learn such matrices end-to-end.\n* The architecture appears overly complicated compared to alternatives from the literature and such complexity is poorly justified (see minor comments).\n* The considered datasets have at most 3 channels which does not justify modeling intra-channel dependencies with a graph. As shown by the ablation study in Tab. 2, removing the intra-dependency learning module results in a decrease in performance that is not statistically significant by considering the reported standard deviations.\n* Empirical results on the existing traffic datasets are worse than those of much simpler baselines such as [2], which consists of a simple MLP with spatial and temporal embeddings.\n\nMinor comments:\n\n* Several claims are not supported by appropriate evidence. For example, in the introduction: \"These methods can provide acceptable results depending on circumstances, but they may also introduce a higher degree of uncertainty, which can impact the reliability of predictions\"; it is not clear what uncertainty the sentence is referring to and, at same time, how the introduced method should reduce uncertainty.\n* \"Even so, the temporal correlations regarding the changing spatial dependencies are not well-considered, which makes these methods ineffective in learning from dynamic graph topologies.\" There are a few papers that learn dynamic adjacency matrices using a mechanism similar to the one used here (e.g., [3]), but it is not clear how HSDGNN should be better than the current approaches.\n\nGiven the above, I cannot recommend acceptance.\n\n\n[1] Ma et al. \"CDSA: Cross-Dimensional Self-Attention for Multivariate, Geo-tagged Time Series Imputation\" arxiv 2019\\\n[2] Shao et al. \"Spatial-Temporal Identity: A Simple yet Effective Baseline for Multivariate Time Series Forecasting\" CIKM 2022\\\n[3] Liu et al. \"Multivariate Time-Series Forecasting with Temporal Polynomial Graph Neural Networks\" NeurIPS 2022\\"
            },
            "questions": {
                "value": "Please clarify the novelty of the proposed method and justify this choice of benchmarks."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3207/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3207/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3207/Reviewer_MDiL"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3207/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698413974121,
        "cdate": 1698413974121,
        "tmdate": 1699636268966,
        "mdate": 1699636268966,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "9DXGmrv2my",
        "forum": "7essnmWOK5",
        "replyto": "7essnmWOK5",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3207/Reviewer_7UwB"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3207/Reviewer_7UwB"
        ],
        "content": {
            "summary": {
                "value": "This paper primarily improves two main shortcomings of previous STGNN models: 1) the lack of consideration of dependencies among attributes of variables. 2) insufficient consideration of the temporal correlations in dynamic spatial dependencies.\nTo address these two shortcomings, this paper proposes a model called HSDGNN for multivariate time-series forecasting problems. HSDGNN captures the spatiotemporal dependencies among variables at two levels: attribute and variable. It also utilizes an additional temporal learning module to capture the temporal correlations among dynamic graph topologies.\nExperiments demonstrate that the proposed model achieves performance improvement compared to the state-of-the-art STGNN models, without increasing the model size."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1.\tOriginality:\nThis paper explicitly establishes dependencies for each attribute of the variable, which is a departure from previous work that either combines multiple attributes together or does not consider the dependencies between attributes. This paper provides a valuable reference for future research in this area.\n2.\tQuality:\n2.1\tThe paper's experiments are thorough and comprehensive. It demonstrates superior performance compared to the state-of-the-art STGNN models. Furthermore, the experiments confirm that while improving performance, the proposed model does not significantly increase training and testing time, as well as the model size.\n2.2\tThe ablation experiments are well-executed, demonstrating the necessity of each module and providing reasonable explanations for the experiment results.\n2.3\tIn the ablation experiments, HSDGNN_w/o_MF outperformed DDGCRN, showcasing the superiority of the model framework. Furthermore, incorporating the remaining attributes resulted in even higher performance, underscoring the importance of establishing attribute dependencies.\n2.4\tThe model exhibits remarkable stability, as its performance does not significantly fluctuate with parameter variations.\n3.\tClarity:\nOverall, the paper is clearly written and well organized. Figure 2 clearly illustrates the overall workflow and the functions of each module in the model.\n4.\tSignificance:\nIn my view, the major contribution of this paper is the modeling of attribute dependencies among variables, which introduces a fresh perspective and a good direction for future research. Future work can conduct more in-depth research on how to better explore the dependencies between attributes."
            },
            "weaknesses": {
                "value": "1.\tIn this paper, only the main attribute (traffic flow) is predicted, and the other attributes served as auxiliary attributes for the prediction of the main attribute. If only the main attribute is predicted, the other attributes can be considered as providing additional useful information for the prediction of the main attribute. However, this does not necessarily reflect the presence of inherent dependencies between attributes, as each attribute can be treated as the main attribute. \n2.\tIn Figure 2, the Intra-dependency Tensor (I) should be a 3x3 grid instead of a 4x4 grid.\n3.\tIn Appendix A.2, HSDGNN is incorrectly written as MSDGNN."
            },
            "questions": {
                "value": "1.\tFor weakness1. Although the ablation experiments suggest that considering only the performance of the main attribute can surpass that of DDGCRN, this only demonstrates the superiority of the model architecture. Therefore, I hope the authors can provide the prediction results and ablation experiments for the other attributes (occupancy, speed).\n2.\tIn long-term prediction, is the horizon of input also 12? If the horizon of input is 12, why are the values of PEMSD8 in Figure7 and Figure6 slightly different under the first 12 timestamps? If the horizon of input is not 12, can author indicate horizon of input of HSDGNN and DDGCRN for long-term prediction performance in the paper? \n3.\tI am not sure whether the horizon of input of HSDGNN and DDGCRN is the same in long-term prediction. If not, can the author modify the experiment to compare the performance of HSDGNN and DDGCRN under the same horizon of input?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3207/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698768394393,
        "cdate": 1698768394393,
        "tmdate": 1699636268853,
        "mdate": 1699636268853,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "px404Uieg9",
        "forum": "7essnmWOK5",
        "replyto": "7essnmWOK5",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3207/Reviewer_MTEy"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3207/Reviewer_MTEy"
        ],
        "content": {
            "summary": {
                "value": "This paper introduces a hierarchical spatial-temporal dependency graph neural networks (HSDGNN) for multi-variate time series forecasting. The proposed HSDGNN has two levels. At the first level, for each multi-variate time series collected at a sensory station, HSDGNN learns the dependencies (graph) of different variates, and then use a GRU to model temporal dynamics of each station. At the second level, HSDGNN learns a dynamic spatial-temporal graph among different sensory stations and then use another GRU to model the temporal dynamics of the entire graph. The model is evaluated on several benchmark datasets and the proposed method could outperform baselines."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The proposed model is technically sound. The graph learning, spatial modeling and temporal modeling are based on prior works, and thus the proposed HSDGNN should have a good performance.\n2. The writing of the paper is clear and easy to follow.\n3. The code is provided."
            },
            "weaknesses": {
                "value": "1. The contribution of this paper is somewhat incremental. The proposed method is kind of simple combination of existing methods [1][2][3].\n2. According to the results of ablation study (Table 3), it seems that IDLM (the intra graph) is less effective. The performance of the full model HSDGNN and the ablated version HSDGNN_w/o_IDLM does not have a significant difference.\n3. How will your model perform if you simply replace IDML with some other simple static graphs (e.g., the graph constructed by Pearson Correlation or other prior knowledge)?\n\n[1] Han, Liangzhe, et al. \"Dynamic and multi-faceted spatio-temporal deep learning for traffic speed forecasting.\" Proceedings of the 27th ACM SIGKDD conference on knowledge discovery & data mining. 2021.\n\n[2] Yaguang Li, Rose Yu, Cyrus Shahabi, and Yan Liu. Diffusion convolutional recurrent neural network: Data-driven traffic forecasting. In International Conference on Learning Representations (ICLR ’18), 2018.\n\n[3] Lei Bai, Lina Yao, Can Li, Xianzhi Wang, and Can Wang. Adaptive graph convolutional recurrent network for traffic forecasting. Advances in neural information processing systems, 2020."
            },
            "questions": {
                "value": "Please refer to weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3207/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698834528859,
        "cdate": 1698834528859,
        "tmdate": 1699636268740,
        "mdate": 1699636268740,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "BhmRySFtD5",
        "forum": "7essnmWOK5",
        "replyto": "7essnmWOK5",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3207/Reviewer_kfob"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3207/Reviewer_kfob"
        ],
        "content": {
            "summary": {
                "value": "The paper introduces a GNN-based architecture for multivariate time series forecasting where the relational information among the time series - the graph used by the GNN - is not given, but learned from data. In particular, the proposed method is designed for learning a dynamic graph which is structured into two levels to overcome limitations of previous work."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "1 poor"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "The ideas of constructing a hierarchical and dynamic graph are interesting and worth exploring. The empirical analysis reports improved performance with respect to the considered baselines."
            },
            "weaknesses": {
                "value": "My major concerns are the following:\n- Several claims appear unsubstantiated, especially in the fourth paragraph of the introduction. References and/or pieces of evidence to support such claims should be provided.  \n- The technical contribution is limited. The proposed method appears as a minor modification of existing works (e.g., Bai et al., 2020, Han et al., 2021, Weng et al., 2023)."
            },
            "questions": {
                "value": "I am not fully convinced by the experimental setting. What is the relevance of learning a hierarchical graph in the considered setting where each location (variable in the paper terminology) has only three components? Fig 9a shows that the graph of attributes is a fully connected one, with all edge weights ~1. Could you clarify what is used to replace the IDLM in `HSDGNN_w/o_IDLM` and the dynamic graph in `HSDGNN_w/o_DG`?\n\nConfusing notation\n- Sets and tensors appear to be used interchangeably, the tensor dimensionality is rarely provided.\n- Sec. 3.1 defines $\\mathcal G_s$ as both a set and a graph.\n- Eq. 6: $\\mathbf W_{G_1}$ appear undefined, \n- Eq. 6: notation $\\mid \\mathbf W_{G_1}$ is undefined\n- Before Eq. 7: notation $\\boldsymbol T_e(\\mathbf X)$ is undefined"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3207/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698838610753,
        "cdate": 1698838610753,
        "tmdate": 1699636268672,
        "mdate": 1699636268672,
        "license": "CC BY 4.0",
        "version": 2
    }
]