[
    {
        "id": "rULkKWUfle",
        "forum": "85gNpcUhmx",
        "replyto": "85gNpcUhmx",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1720/Reviewer_cVkk"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1720/Reviewer_cVkk"
        ],
        "content": {
            "summary": {
                "value": "The paper presents an unsupervised domain adaptive approach for the lane detection task by utilizing a teacher-student framework and contrastive learning paradigm. Firstly, the method utilizes a positive sample memory module to retain domain-related lane features. Next, unlike existing methods, the authors propose cross-domain contrastive learning to improve feature discrimination. Additionally, a domain-level feature aggregation method is introduced to combine domain-level features with pixel-level features. The proposed unsupervised domain adaptive algorithm achieves the state-of-the-art performance on the TuLane, MuLane, and MoLane datasets."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. Idea seems fundamentally sound, paper is well written.\n2. Pixel-level feature aggregation module considers highly uncertain pixel of background class, which makes sense for me.\n3. Experiementation results are provided to support the proposed method."
            },
            "weaknesses": {
                "value": "1. The experimentation settings in the paper are confusing as it is unclear which dataset is used as the source domain and which one is used as the target domain. This lack of clarity hinders proper understanding and evaluation of the proposed approach.\n2. The paper fails to fully explore publicly available datasets from different domains. It lacks experimentation on datasets such as CuLane and OpenLane, which limits the generalizability and thoroughness of the findings.\n3. The algorithm presented in the paper is only applicable to segmentation-based lane detection methods. This limitation reduces its potential contribution since most of today's algorithms tend to be either transformer-based or keypoint-based, making the proposed approach less relevant to current state-of-the-art techniques."
            },
            "questions": {
                "value": "While incorporating UBP into the feature aggregation module seems reasonable, the extent to which it contributes to the overall performance remains unclear."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission1720/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1720/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1720/Reviewer_cVkk"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1720/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698049321543,
        "cdate": 1698049321543,
        "tmdate": 1699636100900,
        "mdate": 1699636100900,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "U2gLpxnCdA",
        "forum": "85gNpcUhmx",
        "replyto": "85gNpcUhmx",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1720/Reviewer_1nVJ"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1720/Reviewer_1nVJ"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a Context-aware Unsupervised Domain-Adaptive Lane Detection (CUDALD) to improve feature discrimination and cross-domain knowledge transferring in the domain-adaptive lane detection field. To this end, the authors introduce two key components: cross-domain contrastive loss and domain-level feature aggregation. The former aims to effectively distinguish feature representations among categories while the latter combines domain-level and pixel-level features to enhance cross-domain context dependency. Extensive experiments on TuLane, MuLane and MoLane datasets verify the effectiveness of the proposed method."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- Aggregating the contextual information from the whole domain for pixel feature enhancement is logically sound and interesting. Despite its simplicity, this concept yields significant performance improvements compared to current state-of-the-art baselines.\n- The authors conducted comprehensive comparison and ablation experiments on a wide range of benchmark datasets, confirming the effectiveness of their proposed approach.\n- This paper is well-structured and well-explained. The method is accompanied by sufficient details and illustrative diagrams, such as Figures 1 and 2. \n- Extensive visualization results and qualitative comparisons, e.g. Figures 4 and 5, further highlight the advantages of the proposed approach."
            },
            "weaknesses": {
                "value": "- Limited originality in cross-domain contrastive learning. This component heavily relies on the previous work (Wang et al., 2021; 2023) and provides an increment improvement (a positive sample selection). It doesn’t strike me as particularly novel. \n\n- Combinatorial contribution. Each contribution addresses a specific issue in the unsupervised domain-adaptive field. The entire paper lacks content coherence. \n\n- The title fails to effectively represent the contributions of the paper. 'Context' is a broad concept.\nHere, the authors primarily propose aggregating domain-level context for pixel-level feature enhancement. Therefore, it is best to highlight this aspect."
            },
            "questions": {
                "value": "Please see the weakness."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1720/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698762788291,
        "cdate": 1698762788291,
        "tmdate": 1699636100811,
        "mdate": 1699636100811,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "jJX2oVdp4E",
        "forum": "85gNpcUhmx",
        "replyto": "85gNpcUhmx",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1720/Reviewer_YuT7"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1720/Reviewer_YuT7"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes that ineffectively learning discriminative features and transferring knowledge across domains are two crucial issues in domain-adaptive lane detection task, and introduces a method named context-aware unsupervised domain-adaptive lane detection which is consisted of cross-domain contrastive loss and domain-level feature aggregation to tackle these issues."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1.\tThe incorporation of contrastive loss and feature aggregation strategies, as evidenced by the experimental results, appears to be a valuable addition to the paper.\n2.\tThe experiment is sufficient."
            },
            "weaknesses": {
                "value": "1.\tLack of inspiration. While the article focuses on unsupervised domain-adaptive lane detection, it makes me confused whether its proposed issues, i.e., ineffectively learning discriminative features and transferring knowledge across domains could be applied to all unsupervised domain-adaptive segmentation tasks. It prompts consideration of whether the issues discussed are universal or specific to this particular domain. Additionally, the introduction of contrastive loss and feature aggregation, while useful, may not fully justify the article's contribution, as these methods are well-established in domain-adaptation field.\n2.\tThe quality of writing and diagrams in the paper requires improvement. Several definitions provided in the article lack clarity, hindering reader comprehension. For instance, in section 3.2, the term 'anchor' is introduced without a precise definition. Additionally, the role of modules is not adequately explained, such as how the introduction of PSMM ensures the appropriate assignment of positive samples. Furthermore, the figures lack detail and refinement, and the overall layout, as seen in Figure 2, does not appear to be carefully designed.\n3.\tSome conclusions of the article are exaggerated. For example, in section 4.3, the authors claim that their method performs significantly better than other methods when using ERFNet as the detection model, but choosing PyCDA (Accuracy/%: 86.73) and MLDA(Accuracy/%: 88.43) to compare instead of SGPCS with the accuracy of 89.28%."
            },
            "questions": {
                "value": "See the Weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1720/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699029261339,
        "cdate": 1699029261339,
        "tmdate": 1699636100721,
        "mdate": 1699636100721,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "cGYJN3cTiv",
        "forum": "85gNpcUhmx",
        "replyto": "85gNpcUhmx",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1720/Reviewer_ZmgM"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1720/Reviewer_ZmgM"
        ],
        "content": {
            "summary": {
                "value": "In this work, author target the domain adaption in lane line detection, identifying two specific problems in prior work and proposes corresponding solutions. Firstly, prior work only focus on pixel level feature and ignore inter-lane feature presentation. Secondly, prior work don’t adopt cross domain representation for adoption. Authors propose Context-aware Unsupervised Domain-Adaptive Lane Detection (CUDALD) framework, including a contrastive learning function by redesign the sampling method, and a pixel-domain feature aggregation model to enrich representation. Authors shows that the proposed method achieved SOTA on multiple dataset."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. Author have targeted a very specific, often ignored problem, domain adaption for lane line detection, which is a critical problem in modern ADAS. \n2. Author identify two problems in prior work adopting solution from a general domain(eg, domain adaption for segmentation), and propose solution specific designed for laneline domain adaption, showing improvement over prior art."
            },
            "weaknesses": {
                "value": "1. There’s limited discussion, comparison and analysis over prior work that also target specifically on laneline domain adaption, for instance, MLDA(Li et al., 2022). The statement in introduction that 'Unfortunately, achieving cross-domain context dependency in domain-adaptive lane detection remains unexplored.' is also less accurate as prior works like MLDA already explored this domain.\n2. Author only conduct experiment on TuLane, MuLane, and MoLane, three simulated lane datasets proposed from one single work, the result would be more convincing if authors could conduct domain transfer experiments between Tusimple and Culane, which are more commonly used dataset for the community. \n3. This work is a bit hard to follow, for instance, in 3.3, author use ‘features from a whole domain is more beneficial’ as a core argument over prior work, without clearly pointing to ‘what is whole domain and how does the method align with whole domain’ in the following implementation. The implementation is also hard to follow without clearly define ‘lane feature and domain feature’ in the first place. \n4. The conclusion of ‘with more advanced lane detection methods, e.g., anchor-based methods’ is also lack of context. Firstly, in the related work, author stated that ‘In this paper, we consider segmentation-based domain-adaptive lane detection.’, which contradict with the conclusion. Secondly, author hasn’t provide why context why ‘author based’ method is superiority over other method’. \n5. Author mentioned the term PSMMs for multiple time in the introduction and related work, without explicitly explain its functionality. It would be easier to follow if author could briefly explain its functionality earlier in the paper. \n6. Please also include proper citation of work for table4/5, and the last two page of the paper."
            },
            "questions": {
                "value": "it's still less clear to me what the motivation and implementation of cross-domain contrastive loss. It seems like the only change author proposed is a novel sampling method, please make this clear."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission1720/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1720/Reviewer_ZmgM",
                    "ICLR.cc/2024/Conference/Submission1720/Senior_Area_Chairs"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1720/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699145484536,
        "cdate": 1699145484536,
        "tmdate": 1700691788964,
        "mdate": 1700691788964,
        "license": "CC BY 4.0",
        "version": 2
    }
]