[
    {
        "id": "sAxjLGS1aD",
        "forum": "8jKuUHsndT",
        "replyto": "8jKuUHsndT",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6538/Reviewer_JYEf"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6538/Reviewer_JYEf"
        ],
        "content": {
            "summary": {
                "value": "This paper analyzed pitfalls and best practices for evaluating retrosynthesis programs and a software package SYNTHESEUS to help researchers benchmark their methods following these best practices. SYNTHESEUS provides a standardized evaluation pipeline. The authors further re-evaluated many existing models and algorithms using SYNTHESEUS to correctly and fairly compare these methods and found the ranking of state-of-the-art models changes when evaluated carefully."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. This paper is well-motivated and presents strong significance. It provides a working end-to-end retrosynthesis pipeline that implements best practices by default. It is true that many existing methods handle evaluation pipelines themselves, and inconsistencies in the evaluation pipelines make the comparison of different methods unreliable. For example, as the authors pointed out, LocalRetro measured a relaxed notion of accuracy where a prediction can be deemed correct even if its stereochemistry is different from the dataset, while the baseline methods do not. This makes the comparison of LocalRetro and baseline methods unfair and unreliable. The contribution is significant since the community indeed needs a well-established evaluation pipeline for a fair evaluation. \n\n2. The authors examined the previous retrosynthesis works carefully and pointed out the shortcomings of different methods in this practice. They also suggest the best evaluation practices via the Python package SYNTHESEUS which supports consistent evaluation of single-step and multi-step retrosynthesis algorithms, with best practices enforced by default.\n\n3.  The authors further re-evaluate existing methods, both single-step and multi-step retrosynthesis, with the proposed SYNTHESEUS pipeline and show the real effectiveness of different methods."
            },
            "weaknesses": {
                "value": "1. Some important baseline methods are not included in Figure 1, such as [1, 2] which show strong performance and also provide source code at https://github.com/uta-smile/RetroComposer and https://github.com/Jamson-Zhong/Graph2Edits, respectively.\n\n2. Suggest careful considerations on the suggested post-processing procedures. Is it true the best practice should be to only consider valid molecules when computing top-k accuracy? I agree with the authors that invalid molecules can be removed easily. However, the ability to generate valid molecules is also important. Otherwise, the model might need to generate multiple invalid molecules before a valid molecule, which consumes more time compared to the case where the first generated molecule is valid. Same as the duplicated outputs.\n\n\n[1] Yan, Chaochao, et al. \"RetroComposer: Composing Templates for Template-Based Retrosynthesis Prediction.\" Biomolecules 12.9 (2022): 1325.\n\n[2] Zhong, Weihe, Ziduo Yang, and Calvin Yu-Chian Chen. \"Retrosynthesis prediction using an end-to-end graph generative architecture for molecular graph editing.\" Nature Communications 14.1 (2023): 3009."
            },
            "questions": {
                "value": "The motivation and significance of this paper are good. The only question would be the quality and ease of the Python package SYNTHESEUS. While some suggested practices are indeed important and help to remove unfair evaluation, I would suggest keeping some practices optional and configurable, such as removing invalid or duplicate outputs."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6538/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698913306270,
        "cdate": 1698913306270,
        "tmdate": 1699636736577,
        "mdate": 1699636736577,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "4byxzeF6oV",
        "forum": "8jKuUHsndT",
        "replyto": "8jKuUHsndT",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6538/Reviewer_cznK"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6538/Reviewer_cznK"
        ],
        "content": {
            "summary": {
                "value": "This paper introduces SYNTHE-SEUS, a benchmarking library created to evaluate the performance of both single-step and multi-step retrosynthesis algorithms. A number of previous retrosynthesis algorithms were re-evaluated on SYNTHE-SEUS. The motivation was to address the lack of standards for evaluating and comparing AI-based retrosynthesis algorithms. The experimental results reveal that when these previous algorithms are assessed on SYNTHE-SEUS under uniform conditions—identical pipelines, post-processing settings, and metrics—there are notable performance discrepancies compared to the outcomes reported in their original publications. Nevertheless, as the authors have indicated, this comparative analysis is not meant to endorse any algorithm as superior; it is still not yet a complete view of the performance of these models."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The strengths of this work include\n1)\tIt provides a valuable discussion of evaluation issues associated with retrosynthesis algorithms, for both single-step and multi-step algorithms. In an era where an increasing number of AI-driven algorithms are being developed for this critical area in chemistry, the establishment of a consistent and meaningful set of metrics  is essential.     \n2)\tThe creation of a benchmarking library represents a pivotal initial move toward fostering the creation of more robust and credible AI algorithms for retrosynthesis."
            },
            "weaknesses": {
                "value": "The weaknesses include \n1)\tThe provided GitHub link is inactive (github.com/anonymous/anonymous), preventing access to SYNTHE-SEUS's operational details and validation of its efficacy in algorithm evaluation.\n2)\tThe SYNTHE-SEUS library falls short in addressing the core evaluation challenges within retrosynthesis. It continues to rely on top-k accuracy without incorporating other significant metrics such as precision and recall, which may offer a more comprehensive evaluation about algorithm performance.\n3)\tAlthough the authors purport that SYNTHE-SEUS is intended to serve as a resource for researchers developing retrosynthetic methods, there is a lack of clarity in Section 3 on how the platform will facilitate the flexible incorporation of different feature definitions, such as functional groups and molecular fingerprints."
            },
            "questions": {
                "value": "The link to doesn’t work: github.com/anonymous/anonymous.  Is it possible to check how SYNTHESEUS works and support the evaluation of different algorithms?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6538/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699011981518,
        "cdate": 1699011981518,
        "tmdate": 1699636736472,
        "mdate": 1699636736472,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "0B24gtSGuz",
        "forum": "8jKuUHsndT",
        "replyto": "8jKuUHsndT",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6538/Reviewer_WK4y"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6538/Reviewer_WK4y"
        ],
        "content": {
            "summary": {
                "value": "This paper aims to re-evaluate existing single-step and multi-step retrosynthesis algorithms in a fair basis, with resolving their inconsistent settings and practices. The authors first discussed the evaluation methods adopted in previous works and pointed out their shortcomings, then presented the best meaningful practices. A benchmarking library SYNTHESEUS is then provided to uniform the evaluation practice and re-evaluate existing algorithms."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. The reflection on existing evaluation is important and desired for this community. This paper provides a broad and in-depth discussion on the current progresses, their pitfalls and suggested better practice;\n2. The benchmarking library has practical significance for the practitioners to proceed from the same basis, without worrying possible setting inconsistencies;\n3. Several existing algorithms are re-evaluated using the standardized protocol to reveal a more faithful comparison."
            },
            "weaknesses": {
                "value": "1. For existing multi-step planning methods, important related work [1] is not discussed and evaluated. This work also provides a “set-wise exact match” metric, which is related to the discussion of how to evaluate the success of planning. I would like to see the authors’ discussion on this work.\n2. While I can see the clear contribution in standardized evaluation, this work could be further strengthened to provide novel metrics or protocols.\n\n[1] Liu, Songtao, et al. \"FusionRetro: molecule representation fusion via in-context learning for retrosynthetic planning.\" International Conference on Machine Learning. PMLR, 2023."
            },
            "questions": {
                "value": "1. Can the authors discuss the multi-step planning method FusionRetro [1] and its proposed evaluation metric? If it makes sense, can the authors evaluate it and include its metric in the experiment or library?\n2. Can the authors provide an overview of the library, e.g., supported single-step models, search algorithms, evaluation metrics etc?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6538/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699040275451,
        "cdate": 1699040275451,
        "tmdate": 1699636736367,
        "mdate": 1699636736367,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "aJQ5sWAIM9",
        "forum": "8jKuUHsndT",
        "replyto": "8jKuUHsndT",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6538/Reviewer_eNX2"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6538/Reviewer_eNX2"
        ],
        "content": {
            "summary": {
                "value": "The paper discusses the evaluation of maching learning-based retrosynthesis algorithms. The authors argue that existing evaluation practices have shortcomings and inconsistencies, leading to inaccurate comparisons between methods. To address this, they introduce a benchmarking library called SYNTHESEUS, which enables consistent evaluation of single-step and multi-step retrosynthesis algorithms. The authors use SYNTHESEUS to re-evaluate previous algorithms and the ranking of state-of-the-art models changes. The paper highlights several pitfalls in the evaluation of single-step models and suggests best practices, including measuring precision instead of recall, using consistent and realistic post-processing, reporting inference time, and focusing on prediction with unknown reaction types."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "+ The paper would contribute to the community. The consistency of evaluating retrosynthesis algorithms is an issue and the paper proposes a fair approach.\n+ The paper introduces SYNTHESEUS and re-evaluates state-of-the-art models for retrosynthesis.\n+ The paper lists possible pitfalls of previous algorithms including post-processing and measurement, etc.\n+ The paper gives the best practices for evaluating single-step models and multi-step models."
            },
            "weaknesses": {
                "value": "+ The methods included in the re-evaluation are not enough as a benchmarking library. Some common baselines like vanilla LSTM, and vanilla Transformer should be included. Also, more state-of-the-art methods are welcome.\n+ It would be better if some case studies were shown to explain and compare corresponding pitfalls and best practices."
            },
            "questions": {
                "value": "1. What are the criteria for selecting state-of-the-art methods?\n\n2. What are the advantages of Pistachio over USPTO-FULL? It would be better if this issue is discussed in the main\npaper."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6538/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699285616364,
        "cdate": 1699285616364,
        "tmdate": 1699636736249,
        "mdate": 1699636736249,
        "license": "CC BY 4.0",
        "version": 2
    }
]