[
    {
        "id": "HOLho7uiFq",
        "forum": "8oZf2SlXEY",
        "replyto": "8oZf2SlXEY",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6645/Reviewer_czxy"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6645/Reviewer_czxy"
        ],
        "content": {
            "summary": {
                "value": "This paper aimed to solve few-shot learning by generating feature embeddings for the minority classes based on their relations with the majority classes. The author proposed a method based on the so-called \"Bayesian relation inference\" and tested the proposed method on a dermatological image dataset."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "1 poor"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "- Modeling the relationship between classes is a nice approach to few-shot learning\n- It is nice to evaluate the proposed method on real data."
            },
            "weaknesses": {
                "value": "- Due to the unclear mathematical notation, I was unable to fully understand the proposed method. For example:\n  - What is the definition of the relation graph? What are the nodes and edges?\n  - What is the range of the mean in Eq. (1)?\n  - What is a \"splicing\" of two node embeddings?\n  - What are $n$ and $\\lambda$?\n  - The domains and codomains of $L$ were not clearly stated.\n- I do not have any knowledge of the so-called \"Bayesian relation inference\" and cannot find any references.\n- Figure 1 is dense but not so informative.\n- There is no theoretical guarantee or analysis of the proposed method."
            },
            "questions": {
                "value": "Please clarify the notation and the proposed method."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6645/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698767421815,
        "cdate": 1698767421815,
        "tmdate": 1699636759106,
        "mdate": 1699636759106,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "FujnrjYTKH",
        "forum": "8oZf2SlXEY",
        "replyto": "8oZf2SlXEY",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6645/Reviewer_MVEs"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6645/Reviewer_MVEs"
        ],
        "content": {
            "summary": {
                "value": "This paper considers the Bayesian graph relation inference for a few-shot learning, addressing the problem of distance base methodologies lacking in redundant information about the relationships between classes. The ultimate goal is to makes a multi relation graphs for few-shot learning. They used conventional and well-known variational inferences, also shows the success in the skin-cancer datasets in the prediction accuracy and interpretation in some sense. Overall, the contribution is incremental, and experiments are limited to skin-cancer datasets. Obviously, the proposed algorithm can have advantages in a few shot and imbalanced datasets cooperated with Bayesian approaches."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The use of variation inference is relatively simple cooperated with simple graphs. The use of multi view graphs can be attractive approach such as the idea of many filters or multi-heads. The interpretabilty plays an important role to validate the proposed algorithm. Experiments follows the standard routine in machine learning, compared to base-line algorithms. Baes-line algorithms seem appropriate in the scope of distance-based few-shot learning. The algorithm provides gains in the performance and interpretability."
            },
            "weaknesses": {
                "value": "The main weakness is limited experiments. The task of skin-cancer classification is famous and important. However, there are other datasets concerning imageNet, Food-101 and so on. If required, we can generate the imbalanced datasets from the original dataset. More generalization and advantages are widely explored in the various fields, and if possible, the conventional algorithms for few-show learning can be added to baseline algorithms (cannot be fair, but it can provide some implications). The presentation is not kind for the reader, especially not familiar with few-shot learning and mathematical formulation of variation inference (maybe there are many omissions in the math expression)."
            },
            "questions": {
                "value": "Q1: Please clarify the notation $ \\mathcal{B}(n, \\tilde{\\lambda}_i)$ in the equation (16) since there is no definition. \n\nQ2: In equation (15), I cannot understand the $\\\\sum_{i=1}^M$ since there is not explicit $i$ in arguments of $p$ and $q.$ Please clarify this issue.\n\nQ3: Can you clarify the combination strategy of multi-view graphs? Are the strategies different between training and test steps? Can you have other strategies for the combination of multi-vie graphs?\n\n\nQ4: Considered graphs are limited since there is no connections between baseline classes. What’s your arguments about this problem."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "None."
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6645/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698807394240,
        "cdate": 1698807394240,
        "tmdate": 1699636758981,
        "mdate": 1699636758981,
        "license": "CC BY 4.0",
        "version": 2
    }
]