[
    {
        "id": "rKrfqXnA7u",
        "forum": "8utTlmhw8v",
        "replyto": "8utTlmhw8v",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2481/Reviewer_LH17"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2481/Reviewer_LH17"
        ],
        "content": {
            "summary": {
                "value": "The authors consider the problem of approximating the Nash equilibrium (NE) of a rank-one two-player game where the sum of the payoff matrices is of rank one. They prove that a modification of the optimistic mirror descent converges, used to learn a NE in zeros-sum (rank-0) games, to an \\epsilon-approximate NE after O(1/\\epsilon^2\\log(1/\\epsilon)) iterations. They achieves this by leveraging a reduction of rank-1 games to rank-0 games building on the results by Adsul et al. (2021)."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "I think the proposed algorithm and associated analysis is a natural and valuable contribution. The proofs seem correct and are easy to read as far as I checked."
            },
            "weaknesses": {
                "value": "The general presentation could be improved, see specific and general comments. The literature review could also be improved in particular it is not clear what is the exact contribution of this work   in comparison to the one by Adsul et al. (2021)."
            },
            "questions": {
                "value": "#General comments:\n\n- Do you have a concrete/practical example of a rank-one game?\n\n- It would be interesting to provide some preliminary experiments on some toy games to compare the proposed algorithm to vanilla OMWU.\n\n- The intuition at the end of Section 1 is not very clear in particular about the fundamental connections between rank-one and rank-zero games.\n\n- It would be clearer to introduce  definitions on the equivalence of games since many technical points rely on jumping from on formulation to another.\n\n- How do your algorithm compare with the one of Adsul et al. (2021) in terms of rates, complexity; since both algorithms seem to solve the same problems with similar techniques.\n\n- What can we say about rank-two games?\n\n#Specific comments:\n\n- P1, introduction: it is not clear what is the MVI property. And \"games, We\".\n\n- P2, top: It is still not clear what is the Minty property. Maybe you can compare the rate you obtain with the rate one can obtain in a rank-0 game. Is \\lambda a real parameter or also a vector? Do we really have that extra gradient and optimistic mirror descent fails to converge if the Minty property is not verified or we can just say we cannot provide any guaranties in this case?\n\n- P3, Lemma 2.6:  what do you mean exactly by a game \"can be written\" in a certain form ?\n\n- P3, end: \"In the what follows\"\n\n- P5, end of Section 2.3.1: It is still not clear what is the Minty criterion.  The link between (MVI) and (VI) and when it is possible to solve (VI) with extra-gradient of optimistic mirror descent is also not clear, e.g. what do you mean by \"the Minty variational inequality is satisfied'. You also talk at some point about saddle point in the context of VI. Maybe you could specialized the results for saddle point without introducing the setting of variationnal inequalities.\n\n- P7, Algorithm 1: How do you initialize \\lambda?\n\n- P9, before Lemma 3.6: How do you initialize  \\lambda, and maybe you should precise in\nwhich interval \\lambda lies.\n\n- P13, before (8): Can you detail the second inequality. I think  you should work with the difference \\lambda-xa and upper bound this difference after applying Cauchy-Schwartz inequality."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2481/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698675448413,
        "cdate": 1698675448413,
        "tmdate": 1699636184555,
        "mdate": 1699636184555,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "KtplKWa3oe",
        "forum": "8utTlmhw8v",
        "replyto": "8utTlmhw8v",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2481/Reviewer_r4eu"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2481/Reviewer_r4eu"
        ],
        "content": {
            "summary": {
                "value": "This paper studies the problem of learning Nash equilibrium in two-player rank-1 games, which does not satisfies the Minty condition. The main contribution of the paper is an efficient algorithm for learning Nash equilibrium in two-player zero-sum games. The main technical insights that enables the result are structural results of rank-1 games. Specifically, it is shown that the set of Nash equilibria of a rank-1 game is equivalent to the set of Nash equilibria of a two-player zero-sum game (with additional constraints, so can be seen as a saddle-point problem). The proposed algorithm is double-loop in the sense that the inner loop runs OWMU on the parameterized zero-sum, finds an approximate Nash equilibrium and the outer loop updates the parameter."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "This paper is fairly well-written and easy-to-follow. I really appreciate the authors for providing very detailed high-level iades and proofs for every technical results, which makes the paper very clear."
            },
            "weaknesses": {
                "value": "Several concerns about the technical contributions.\n\n1. There is no lower bound results and it is not know if the provided convergence rate is optimal. \n2. The authors show that there exists a rank-1 game that does not satisfies the Minty condition, so previous results on efficient convergence does not apply directly to rank-1 games. However, recent results have shown efficient convergence under a weaker condition than the Minty condition, called *weak Minty* [1, 2, 3].  [1] proposed the notion of weak MVI, while [2,3] generalized the notion to the constrained setting.\n3. I am not sure whether Algorithm 1 is a decentralized algorithm since it is a double-loop algorithm and requires some coordination between the two players. Thus Algorithm 1 is more like an algorithm that computes the Nash equilibrium, not a decentralized learning dynmics that converges to Nash equilibrium\n\n[1] Efficient Methods for Structured Nonconvex-Nonconcave Min-Max Optimization, Diakonikolas et al., AISTATS 2021\n\n[2] Escaping limit cycles: Global convergence for constrained nonconvex-nonconcave minimax problems, Pethick et al., ICLR 2022\n\n[3] Accelerated Single-Call Methods for Constrained Min-Max Optimization, Cai and Zheng, ICLR 2023"
            },
            "questions": {
                "value": "1. Does rank-1 games satisfy the weak Minty condition?\n2. Can the authors comment more on Algorithm 1? Is it possible to get a single-loop and decentralized algorithm?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission2481/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2481/Reviewer_r4eu",
                    "ICLR.cc/2024/Conference/Submission2481/Senior_Area_Chairs"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2481/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698787621054,
        "cdate": 1698787621054,
        "tmdate": 1700584105192,
        "mdate": 1700584105192,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "0nX7YCVWBk",
        "forum": "8utTlmhw8v",
        "replyto": "8utTlmhw8v",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2481/Reviewer_TKWX"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2481/Reviewer_TKWX"
        ],
        "content": {
            "summary": {
                "value": "The authors study the problem of finding Nash equilibria for bimatrix rank-1 games. They propose a novel decentralized algorithm for finding approximate Nash equilibria of rank-1 games. Their approach works by reducing the problem to a sequence of parametric zero sum games where the parameter changes for each step of the sequence. Approximately solving the zero sum game and then adapting the game parameter repeatedly leads to an approximate Nash equilibrium for the original game. This decomposition allows the authors to bypass the fact that the original game does not satisfy the Minty variational inequality."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "To the best of my knowledge, this work is the first to propose gradient based decentralized algorithms for approximate Nash equilibria of rank one games. Even though the general solution framework is the same as in Adsul et al. 2021, as they both reduce the problem to a sequence of parametric zero sum games, the way each zero sum game is tackled in this work is different and novel. Handling the additional constraint to the zero sum game was non-trivial. In addition, showcasing new  decentralized learning algorithms for games that go beyond the MVI property may be of independent interest."
            },
            "weaknesses": {
                "value": "The algorithm proposed is decentralized in a somewhat limited sense. For example, the two players need to coordinate to solve the same parametric game zero sum in each iteration."
            },
            "questions": {
                "value": "I think some more explanation about how we computed the bound on K would help. I guess I am missing the argument about why we only need to know $\\lambda$ up to $O(\\epsilon)$ accuracy or at least some similar argument for the binary search termination."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2481/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698841912206,
        "cdate": 1698841912206,
        "tmdate": 1699636184393,
        "mdate": 1699636184393,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "D1gbjIMUVa",
        "forum": "8utTlmhw8v",
        "replyto": "8utTlmhw8v",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2481/Reviewer_cjaZ"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2481/Reviewer_cjaZ"
        ],
        "content": {
            "summary": {
                "value": "The paper focuses on learning (approximate) Nash Equilibria of rank-1 bimatrix game, which can comprise a potentially large number of disconnected components, and may lack convexity in general.\nThe rank-1 bimatrix games, which have been shown by Adsul et al., 2021  to have polynomial-time algorithms, are especially interesting, as k>=3 are PPAD-hard, and the complexity of k=2 games are left as an open question.\n\nThe authors build upon the reparameterization approach of Adsul et al., 2021, which establishes a link between rank-1 games and parameterized zero-sum games. \n\n- In Section 3.1, the authors illustrates that naively solving an approximate NE of parameterized zero-sum games does not necessarily results in the approximate NE of the original rank-1 games.\n- In Section 3.2, the authors sequentially connects the approximate NE of rank-1 games to (constrained) approximate NE of parameterized zero-sum games, and (constrained) approximate NE of the parameterized zero-sum-games to the approximate stationary points of an energy function.\n- Finally, the authors propose an algorithm that combines binary search and OMWU that provably learns the approximate NE of the rank-1 game."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "- The related works are well-studied and well-presented\n- Theoretical claims are well-backed with easy-to-follow proofs"
            },
            "weaknesses": {
                "value": "# Technical Novelty \nIt seems most of the technical heavy-lifting (the reparameterization approach, Lemma 3.3, and the usage of binary search) builds upon  Adsul et al., 2021, and lacks original technical contribution & viewpoint that could be useful for the other researchers in the future. \n\n# Broader Context\nI think it would better if the authors could put their theoretical results in a broader context of current literature, and explain why this rank-1 game is an important subclass of differential games."
            },
            "questions": {
                "value": "# Technical Novelty\nI would appreciate if the authors could clarify the the main technical novelties of this work over Adsul et al., 2021 that could contribute (either directly or indirectly) to the future work in this field (differential games, robust optimization, multi-agent RL, etc)."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2481/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699598600521,
        "cdate": 1699598600521,
        "tmdate": 1699636184314,
        "mdate": 1699636184314,
        "license": "CC BY 4.0",
        "version": 2
    }
]