[
    {
        "id": "Y08wFpgFTp",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1623/Reviewer_84GA"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1623/Reviewer_84GA"
        ],
        "forum": "8vKknbgXxf",
        "replyto": "8vKknbgXxf",
        "content": {
            "summary": {
                "value": "### Edit after rebutal: \nI updated my score and my assessement of the paper after reading authors response. \n\nThis is an important topic which oughts to be discussed. The authors claim original results on correctness of automatic differentiation in a nonsmooth context based on the existence of bias parameters for each layer."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "The results are among the only positive ones available in the litterature regarding soundness of AD for nonsmooth neural networks."
            },
            "weaknesses": {
                "value": "### Edit after rebutal: \nthe authors responded in a satisfactory way to the concerns raised below. \n\n- Theorem 1 is a minor extension of Theorem 3.6 in Lee et al. (2023). \n- Lemma 2 and Lemma 3 are complicated formulations of essentially known facts\n- Lemma 3 and Theorem 4 are contradictory\n- I suspect that Theorem 4 is flase, as well as theorem 6.\n- Conditions 1 and 2 are very complicated without an intuitive explaination of what they mean.\n- Theorem 8 lacks discussion on the rate of positive outcomes and complexity."
            },
            "questions": {
                "value": "Lemma 2 and Lemma 3:  the example in Lemma 2 is explicitely mentioned in Kakade and Lee 2018 and the mechanism in Lemma 3 is exaclty the same, namely \"incompatibility with addition\". A similar comment holds for Lemma 7. Is there anything else beyond these lemmas? Why not refering to the fact that this is a known issue?\n\nLemma 3 and Theorem 4 are contradictory. D- and D+ are never explicitely defined, so I assume that for a piecewise analytic function it corresponds to the derivative of the function on the left and on the right at a piece change point. In this case, the Bouligand derivative is {D-,D+} and the clarke is its convex hull. So in Theorem 4, choosing all lambda = 0, one is in the setting of Lemma 3. I suspect that Theorem 4 is false for this reason. Is my reasoning correct?\n\nI really have troubles to understand the difference between Condition 1 and Condition 2 with \"trivial max-pool\". This is very complicated and I believe there should be a qualitative description of what these conditions mean. For example I cannot tell: is one of the condition more general than the other? Similarly: is there is a difference between Theorem 4 and Theorem 6? Lastly, due to the same concern as above, I suspect that Theorem 6 is false.\n\nTheorem 8 is of little use without a discussion on:\n- When does the algorithm stop with Pl non empty? Does it occur often? Does it always occur?\n- What is the complexity of the algorithm? How much overhead does it represent compared to AD?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission1623/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1623/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1623/Reviewer_84GA"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1623/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1697185128705,
        "cdate": 1697185128705,
        "tmdate": 1700045142748,
        "mdate": 1700045142748,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "s3uju5Fxiz",
        "forum": "8vKknbgXxf",
        "replyto": "8vKknbgXxf",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1623/Reviewer_XRNZ"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1623/Reviewer_XRNZ"
        ],
        "content": {
            "summary": {
                "value": "This article provides an important step in the direction of providing a theoretical backbone to the behemoth topic of neural networks -- in particular, showing Clarke stationarity is the gold standard for this class of optimization problems, and they provide (modest, but appreciable) steps in this direction. The contribution does not appear to be huge, but the importance of the problem itself and the quality if the writing and results (if they are true) is worthy of publication.\n\nDue to a medical emergency, I unfortunately did not have the time to check the mathematical details and proofs of this article. To\naccount for this lack of availability, I am providing a low-confidence review with my impressions based on the results and impact to the research community."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "In my opinion, the question studied in this article is one of the\nmost fundamental and pressing questions to modern-day theoretical\nmachine learning. I am happy to see work in this direction."
            },
            "weaknesses": {
                "value": "Of course, this is also a very challenging problem.\nAppropriately, this article appears to be a modest step in the\nright direction, with nothing particularly groundbreaking.\nNonetheless, the impact of this work would still be quite relevant. \n\nSubdifferential analysis is a very technical and detailed topic,\nand I must express my lack of confidence in the validity of the results.\nIt also appears that the authors have mixed up a Bouligand (directional) subdifferential\nand a Mordukhovich (sequential) subdifferential on page 3 of their\narticle. \nFurthermore -- and this not a qualm with the article specifically -- \nI have doubts about the ability of an ML\nconference (where reviewers have essentially two weeks to review 3+\narticles) to appropriately verify the correctness of the proofs\nin the 10+ pages of the (often un-reviewed or under-reviewed)\nappendices. I am hopeful that other referees have sufficient time to\nverify the proofs here, because if these results *are* indeed\naccurate, it is my opinion that this article would absolutely be\nworthy of publication."
            },
            "questions": {
                "value": "Due to a medical emergency, I unfortunately do not have the time to properly vet this article. I offer my deep apologies."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "1: You are unable to assess this paper and have alerted the ACs to seek an opinion from different reviewers."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission1623/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1623/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1623/Reviewer_XRNZ"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1623/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698694411094,
        "cdate": 1698694411094,
        "tmdate": 1699636091008,
        "mdate": 1699636091008,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "lQvXeroLsy",
        "forum": "8vKknbgXxf",
        "replyto": "8vKknbgXxf",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1623/Reviewer_uFDP"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1623/Reviewer_uFDP"
        ],
        "content": {
            "summary": {
                "value": "The paper studies the important problem of what is computed by automatic differentiation (AD) when the activation functions are not continuously differentiable, which is the most common case in practice with activations like the ReLU or its variants.\n\n---\n\nThe main results are several theorems (Thm 1, Thm 4, Thm 5, Thm 6, and Thm 8) that give sufficient conditions on a broad class of neural network architectures and training regimes (batch sizes) to ensure that AD always produces an element of the clarke subdifferential. Besides these sufficient conditions, there are several results showing how tight these results are, by proving that relaxing some of the sufficient conditions will result in AD producing something that is not an element of the clarke subdifferential.\n\nThere are two conditions considered to ensure that AD produces a clarke subgradient and both of them are centered on bias parameters. In the fist condition, the bias parameters must be distinct and the activations are applied componentwise. In the second condition, the bias parameters can be shared and more general activations (e.g., maxpooling, maxpool2d) are considered.\n\nThe strategy for showing that these conditions guarantee AD computes a clarke subgradient is to construct a sequence of points converging to the current point, on which the neural network is actually differentiable, and showing that the limits of the gradient on this set are converging to what is computed by AD, i.e., directly showing the definition of the Clarke subgradient is satisfied for what is computed by AD.\n\n---\n\nThe ultimate goal of the paper is theoretical but it does include some empirical validations of the theoretical claims made. The claims are tested by running sgd on fully connected networks and convolutional networks, both with activations that are not continuously differentiable.\n\nIn the fully connected case (they use 2 hidden layers with dimensions 256 and 64 respectively, trained on MNIST with batchsize 128), they check whether or not the sufficient condition to ensure AD computes a clarke subgradient is satisfied, and indeed it always is using three different activations (ReLU6, HardTanh, and HardSigmoid). They also confirm that the points where the activations are not continuously differentiable are seen by the algorithm (0 times for ReLU6, 9.8 times for HardTanh, and 13.8 times for HardSigmoid; all averaged over 5 runs).\n\nIn the convolutional case, they use the ordinary ReLU activation but combine with maxpools (they test 3 architectures - VGG11, VGG11-BN (batchnorm), and ResNet18 all on CIFAR10). They observe that their sufficient condition to ensure that AD computes a clarke subgradient is always satisfied here.\n\n---\n\nSmall comment: I find the usage of the word safe in the paper to be a bit weird. Whether or not AD computes a clarke subgradient doesn't make it safe or unsafe, even if it does not compute subgradients AD might still converge to a clarke-stationary point (see Bolte-Pauwels 2020). I also found this sentence “These correctness results show that AD computes the standard derivative at most inputs, yet provide no information about what it computes at the remaining inputs” to be incorrect, Bolte-Pauwels 2020 *does* provide information about what is computed at the remaining inputs - an element of the conservative field is computed and this object can still be used to show convergence of sgd-like algorithms."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "The paper studies an important problem and gives strong theoretical results that apply to a broad class of neural network architectures and training regimes. Despite being theoretical in nature, the results are quite practical since many of the sufficient conditions are checkable in practice, as demonstrated in secion 4 with experiments on some realistic architectures."
            },
            "weaknesses": {
                "value": "I feel that the empirical validation section is missing something; it's always checked that the sufficient conditions derived in the paper are holding but it's never empiricaly validated that these sufficient conditions are actually sufficient for guaranteeing that AD computes a clarke subgradient. That being said, I still found the experiments are convincing."
            },
            "questions": {
                "value": "Something that I didn't understand regarding the notion of distinct bias parameters - is it ever an issue that some bias parameters might be equal during training?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1623/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698752245817,
        "cdate": 1698752245817,
        "tmdate": 1699636090908,
        "mdate": 1699636090908,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "Y7FzJBhIIc",
        "forum": "8vKknbgXxf",
        "replyto": "8vKknbgXxf",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1623/Reviewer_DHhS"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1623/Reviewer_DHhS"
        ],
        "content": {
            "summary": {
                "value": "This paper extends the previous results on the characteristics of auto-differentiation (AD) in modern neural networks. Existing methods were limited in cases where the ADs of individual operations are limited to Bouligand subdifferentials, which is extended to Clarke subdifferentials in this paper. The paper shows that if biases are distinct and the batch size is one, then the overall gradient of a fully connected network using AD is always correct (is an instance of Clarke subdifferentials). If the batch size is larger than one, ADs of individual operations should be a convex combination of left-side and right-side derivatives to have a correct gradient. If there are no distinct biases, then having linearly independent features whenever non-differential boundaries are touched. The paper also provides conditions for CNN (presence of max-pool,  shared bias). Experiments demonstrate that the conditions provided in the paper are empirically correct."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "Even though auto-differentiations are widely used in practice, it is not well-known how it behaves on non-differentiable regions. These are usually ignored in practice. However, since most modern deep learning is usually performed numerically, these regions can sometimes be problematic. In this respect, accurate knowledge regarding the actual behavior can be beneficial.\n\nThis paper extends the existing results to wider conditions with more practical settings, i.e., Clarke subdifferentials, general fully-connected networks, and CNN as well. This significantly improves the usability of such knowledge in real situations (such as defining the individual gradient operation so that the overall gradient can be a Clarke subdifferential.)\n\nI did not check the proofs in detail, but they seem correct."
            },
            "weaknesses": {
                "value": "There are a wide variety of recent network structures and they go beyond the conditions assumed in this paper. However, considering the nature of incremental improvement in this kind of theoretical work, I believe it is a sufficient contribution.\n\nOn page 6, it is said that the input and the hidden dimension are typically larger than the batch size. However, this can be somewhat controversial. There are indeed cases where large batch sizes are used (e.g., early self-supervised learning) for several reasons, e.g., training stability, training time/speed, etc."
            },
            "questions": {
                "value": "On page 6, when batch size is larger than one, a convex combination of the left-side and right-side derivatives is required. Here, the equation seems to suggest that any element that touches the boundary must have the same combination weights. Is this correct?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1623/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698830365133,
        "cdate": 1698830365133,
        "tmdate": 1699636090835,
        "mdate": 1699636090835,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "sKtlHyOb3w",
        "forum": "8vKknbgXxf",
        "replyto": "8vKknbgXxf",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1623/Reviewer_FQtB"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1623/Reviewer_FQtB"
        ],
        "content": {
            "summary": {
                "value": "The paper studies the problem of automatic differentiation of neural networks with non-smooth operations such as ReLu activation and max-pooling. It provides some theoretical results."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The theoretical results are rich.\n2. The numerical results are consistent with the theoretical results to some extent."
            },
            "weaknesses": {
                "value": "1. The results in the theorems are not intuitive and are difficult to follow.\n2. It is not clear how the numerical or theoretical result given by gradient descent differs from that given by subgradient descent."
            },
            "questions": {
                "value": "1. Are the results in Table 2 given by gradient descent, subgradient descent, or Clarke subgradient descent?\n2. Are the theoretical results applicable to other nonsmooth activation functions such as step function?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 5,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1623/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698892306406,
        "cdate": 1698892306406,
        "tmdate": 1699636090760,
        "mdate": 1699636090760,
        "license": "CC BY 4.0",
        "version": 2
    }
]