[
    {
        "id": "hfgucU843q",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5400/Reviewer_t6Z1"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5400/Reviewer_t6Z1"
        ],
        "forum": "9o7KuFcsps",
        "replyto": "9o7KuFcsps",
        "content": {
            "summary": {
                "value": "The paper presents a solution to address the challenges of one-class anomaly detection and the outlier-exposure scenario, where labeled anomalies are scarce in the training dataset. The authors introduce a method that incorporates a memory module, employing Hopfield layers, which is integrated with contrastive learning techniques. The approach allows for the memorization of multi-scale normal class prototypes during training, but also facilitates the learning of informative representations. This innovation significantly enhances the model's ability to capture subtle features of normal data while adapting to varying levels of anomaly complexity."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The authors provide a well-structured and clear motivation for their proposed method. Moreover, the introduction of Hopfield layers for anomaly detection represents a novel concept. This innovative utilization adds efficiency to the model's memory capabilities."
            },
            "weaknesses": {
                "value": "The paper demonstrates several areas where it could be improved. \n\n1. While the authors assert that their model outperforms state-of-the-art approaches across a wide range of anomalies, it is notable that the paper lacks evaluation on widely-accepted benchmark datasets such as MVTec [1] and VisA [2]. These datasets contain texture anomalies, which are crucial for a comprehensive evaluation. Although CIFAR-10/100 and CUB are important, their evaluation should be complemented by assessments on these texture-oriented datasets.\n\n2. The paper mentions superior performance over existing methods, but Table 2 reveals that AnoMem, at best, achieves comparable results in out-of-distribution (OOD) detection. It's important to ensure that the claims made align with the empirical findings.\n\n3. While it may be justifiable not to compare with state-of-the-art pretrained approaches like [3], given their exposure to external datasets, it remains important to include these comparisons in the evaluation. CIFAR and CUB datasets share similarities with ImageNet-pretrained data, but the FPAD dataset exhibits a significant distribution shift, which calls for a comparative analysis. Additionally, it's worth noting that AnoMem's performance benefits significantly from exposure to anomaly types, which pretrained methods do not rely on.\n\n4. Several crucial components of the proposed method are not examined by the authors. For example, while the authors briefly mention the potential substitution of the NTX objective with alternative contrastive frameworks like Barlow-Twins, which are known for their efficiency and ability to operate effectively with smaller batch sizes, this proposition lacks empirical demonstration. The absence of a comparative analysis or experimental results to support this claim leaves a gap in the evaluation of the method's adaptability and robustness across different contrastive learning frameworks. \n\n[1] MVTec AD — A Comprehensive Real-World Dataset for Unsupervised Anomaly Detection, Bergmann et. al, CVPR 2019.\n\n[2] SPot-the-Difference Self-Supervised Pre-training for Anomaly Detection and Segmentation, Zou et. al, ECCV 2022.\n\n[3] Mean-shifted contrastive loss for anomaly detection, Reiss & Hoshen, AAAI 2023."
            },
            "questions": {
                "value": "1. In FPAD, the CSI method is not included in performance metrics. What are the CSI results?\n\n2. The explanation of the linear evaluation protocol, while briefly described, lacks depth. It would be valuable to have a more detailed elaboration on the rationale behind employing this protocol and why it is considered an important metric in the context of anomaly detection. Moreover, given that this protocol may not be standard within the AD community, it raises curiosity about how other existing methods perform under this evaluation criterion. Could the authors shed light on the performance of competing methods using this protocol for comparison and context? This information would further enrich the assessment of the proposed approach."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5400/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5400/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5400/Reviewer_t6Z1"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5400/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1697382553176,
        "cdate": 1697382553176,
        "tmdate": 1699636547035,
        "mdate": 1699636547035,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "6XOAOjzyt9",
        "forum": "9o7KuFcsps",
        "replyto": "9o7KuFcsps",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5400/Reviewer_xRL9"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5400/Reviewer_xRL9"
        ],
        "content": {
            "summary": {
                "value": "The paper analyzes the two most common problems in anomaly detection - the one-class problem and the out-of-distribution problem. It proposes a multi-scale contrastive learning framework for anomaly detection to address these two problems. Regarding the one-class problem and the out-of-distribution problem, the authors believe that the main difference between the two is the scale of the anomaly, and using memory to store normal features at different scales can solve both problems simultaneously. To enhance the detection ability of the model, the paper also introduces a contrastive learning framework to train a feature extractor from scratch to obtain class-sensitive features."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "+ The paper summarizes the differences between the one-class problem and the out-of-distribution problem, and proposes to combine features at different scales for anomaly detection accordingly.\n+ The paper introduces a contrastive learning framework to enhance the model's perception ability for anomalies at different scales.\n+ The paper validates its effectiveness on a one-class classification dataset for the one-class problem and a fake detection dataset for the out-of-distribution problem."
            },
            "weaknesses": {
                "value": "+ The motivation behind the paper is very direct, but the authors do not further discuss the benefits of unifying the one-class problem and out-of-distribution problem.\n+ Although the framework of the paper for the one-class problem and out-of-distribution problem is consistent, the paper adds a classifier for the out-of-distribution problem. This may be due to the different evaluation metrics of the two problems, but it makes the two problems slightly disconnected."
            },
            "questions": {
                "value": "+ Essentially, the authors weight different scales of features to unify the one-class problem and out-of-distribution problem. However, the parameter selection for weighting seems somewhat arbitrary.\n+ The authors mention at the end of the paper that their method can be used for anomaly localization, and the model design does seem to support this. It is possible that the authors did not consider further experiments on this due to unsatisfactory experimental results."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5400/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5400/Reviewer_xRL9",
                    "ICLR.cc/2024/Conference/Submission5400/Senior_Area_Chairs"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5400/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698481586948,
        "cdate": 1698481586948,
        "tmdate": 1700731412258,
        "mdate": 1700731412258,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "dokygmiF35",
        "forum": "9o7KuFcsps",
        "replyto": "9o7KuFcsps",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5400/Reviewer_9JQe"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5400/Reviewer_9JQe"
        ],
        "content": {
            "summary": {
                "value": "This work introduces an approach for contrastive learning of multi-scale memory units for anomaly detection. It applies the idea of contrastive representation learning to prototype-based feature representations for learning multiple memory layers at various intermediate feature layers, and the resulting feature representations can then be used to learn either unsupervised one-class detection models or semi-supervised detection models with some anomaly examples. The approach is evaluated on three one-vs-all one-class classification datasets, one face representation attack detection dataset, and one OOD detection setting using CIFAR-10 as the ID dataset."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- The idea of unifying unsupervised one-class anomaly detection and semi-supervised anomaly detection approaches into one framework is interesting. Most methods are focused on the unsupervised case, while some recent studies attempt to tackle a semi-supervised case. I'm not aware of an approach that works well under both cases.\n- I appreciate the efforts of bringing ideas from several research lines (contrastive learning, memory learning, OOD detection, and anomaly detection) together to create an effective anomaly detection method.\n- The method is evaluated using three different tasks and shows effective performance.\n- The method demonstrates good performance on face representation attack detection datasets."
            },
            "weaknesses": {
                "value": "- It is unclear how much difference it makes by bringing multi-scale learning into the memory learning-based anomaly detection approaches. No appropriate ablation study or empirical comparison is presented there. The baseline in table 4 may be changed to a memory learning method that involves multiple normal prototypes to serve this purpose.\n- As demonstrated in table 4, the multi-scale learning has very limited contribution to the overall detection performance.\n- It mentions at page 4 about the issue of overfitting in existing methods that use a pre-trained encoder on large-scale image datasets, but this issue should be easily fixed by tuning on the target normal data. I cannot find convincing reasons for not using such well pre-trained encoders, and not comparing with such methods. Additionally, in this work, there is the extensive fitting of the multi-scale memory units to the limited normal data in the target data, which could easily lead to overfitting to the normal data, and so the proposed method could perform poorly on datasets with distribution shift. I wonder whether the authors could perform experiments on datasets with distribution shift to justify their argument.\n- The clarity is bad in several aspects. **1)** The memory learning in eqs. 2-4 involves ground truth $y_k$ that could be either $0$ for anomaly or $1$ for normal sample, but in sec. 3.2 there is a one-class AD objective, i.e., eq. 6, where no training anomaly examples are supposed to be available, so I'm confused that how the one-class AD model can be trained together with eqs. 2-4. **2)** The concept of outlier exposure (OE) is defined and used in OOD detection for using external datasets as pseudo OOD examples to train OOD detection models, but in this work it seems it treats real anomaly examples as OE examples. This is very confusing. Rather than using the so-called AD-OE concept, it may be clearer to use semi-supervised AD or open-set AD as in *\"Deep semi-supervised anomaly detection. arXiv preprint arXiv:1906.02694.\"*, *\"Catching both gray and black swans: Open-set supervised anomaly detection. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (pp. 7388-7398).\"*, or *\"Ubnormal: New benchmark for supervised open-set video anomaly detection. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (pp. 20143-20153).\"* **3)** It is also unclear why we need a method that works well for both anomaly detection and OOD detection, given the fact that the two tasks have quite different application settings.\n- Following up the above point, since anomaly examples are used in the training stage, recent SOTA semi-supervised/open-set anomaly detection methods should be used in the experiment comparison to justify the advantages the work has, e.g., see *\"Catching both gray and black swans: Open-set supervised anomaly detection. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (pp. 7388-7398).\"* for some of such methods.\n- Experiments on large-scale high-resolution image datasets, e.g., the popular setting that uses ImageNet-1k as the ID dataset, are missing for the OOD detection task."
            },
            "questions": {
                "value": "Pls see the above Weaknesses section for detail."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5400/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698828693669,
        "cdate": 1698828693669,
        "tmdate": 1699636546807,
        "mdate": 1699636546807,
        "license": "CC BY 4.0",
        "version": 2
    }
]