[
    {
        "id": "ty95moL913",
        "forum": "AialDkY6y3",
        "replyto": "AialDkY6y3",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4015/Reviewer_3z7c"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4015/Reviewer_3z7c"
        ],
        "content": {
            "summary": {
                "value": "Edit: I have increased my score in light of your responses.\n\nIt is has been noted that the message passing operations in standard GNNS are essentially equivalent to heat propagation over the network. This can lead to desirable smoothing on relatively shallow networks. However, letting heat propagation proceed for too long leads to oversmoothing and loss of information. Therefore, the authors instead proposed an alternative approach based on the Dirac-Biaconi equation.\n\nThe authors cite as an example GNNs aiming to predict the stability of power grids. In this setting 13 layers are needed. It is also to treat nodes and edges as equally important.\n\nThe author utilized the Dirac-Bianconi operator which was previously introduced (in the graph setting) by Bianconi in 2021. They derive message passing type operators which pass information from edges to nodes and vice versa. From there they derive graph dynamics and a layerwise update rule which discretizes the time domain and adds in learnable weight matrices.\n\nNetwork architecture consists of linear layer, then use DB layers with skip connections followed by a final MLP. They demonstrate good results compared to a couple of baselines in limited experiments."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "Going beyond the vanilla MPNN approach and avoiding related oversmoothing problems is important and the authors provide an interesting setting, optimizing power grids, for needing to go deeper than standard DNNs. The approach is both well motivated from physics and novel in the context of GNNs.\n\nThe paper is generally well-written and well-explained."
            },
            "weaknesses": {
                "value": "The alternating procedure of DB and linear layers could be more clearly explained.  What does a linear layer mean in this context and why are they needed\n\nNeither of the datasets considered inlcude non-trivial edge features. Perhaps you could have flux along an edge in a powergrid or something?\n\nNot clear how the baseline methods where chosen? Are these also methods meant to address oversmoothing and long range dependencies? Are they at or near s-o-t-a?\n\nx' and e'_{i,j} are not defined in equations 6 and 7. I am assuming they mean the output of delta_{DB}(x, e), but this should be made more clear\n\nThe setup assumes a symmetry on the edge features e_{j,i} = e_{i,j}\n\nThe leap from 8 to 9 should be made more clear. This appears to solving \\partial_t - \\partial_{DB} \\pm \\beta =0, or something but this should be made explicit. \n\nTable 2 is interesting, that one DBGNN layer = 3 GCN layers, but it would be more convincing if you also showed results with DBGNN outpeforming GCN in addition to other baselines"
            },
            "questions": {
                "value": "Is there any connection by the DB equation and the wave equation?\n\nIs there any way to use the DB operator to define Riesz transforms ($\\partial_{x_i}\\Delta^{-1/2}$ in the Euclidean setting)?\n\nWhere does the network include non-linearitiees? Why do these not induce loss of energy? \n\nWhat is the computational complexity of DBGNN vs other methods?\n\nPaper could be improved via more thorough experimentation and also analysis of / references too the theoretical properties of the DB operator."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4015/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4015/Reviewer_3z7c",
                    "ICLR.cc/2024/Conference/Submission4015/Senior_Area_Chairs"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4015/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698344403566,
        "cdate": 1698344403566,
        "tmdate": 1700334630035,
        "mdate": 1700334630035,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "z1iZveUml5",
        "forum": "AialDkY6y3",
        "replyto": "AialDkY6y3",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4015/Reviewer_NtG7"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4015/Reviewer_NtG7"
        ],
        "content": {
            "summary": {
                "value": "Summary:\nThe paper presents a new graph neural network layer called the Dirac-Bianconi Graph Neural Network (DBGNN). The layer is inspired by the topological Dirac equation on graphs proposed by Bianconi (2021). In DBGNN, the edges and nodes are treated on an equal footing, with features attached to both and the Dirac operator mixes edge and node features. Additionally, DBGNN avoids over-smoothing problem that affects traditional GNNs like GCNs. \n\nThe DBGNN layer implements a discretized, generalized version of the Dirac-Bianconi equation. Multiple DBGNN layers with shared weights are stacked to enable propagation across longer distances in the graph.\n\nThe DBGNN is evaluated on two tasks: i) Predicting power grid stability. (ii) Predicting protein-ligand binding affinity \nIn (i) it outperforms previous approaches, especially for out-of-distribution generalization. While in (ii), DBGNN achieves par with deeper GCNs.\n\nIn summary, this work presents a new GNN layer that can be helpful for long range tasks in graphs with some demonstration shown in the paper."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "Strengths:  \n(i) well motivated combination of ideas from physics and GNNs. The Dirac equation is a natural model for directional propagation on graphs.  \n(ii) good empirical results on two relevant graph tasks. Outperforms prior models on power grids.   \n(iii) experiments analyzing model dynamics and over-smoothing."
            },
            "weaknesses": {
                "value": "Weaknesses and questions:  \ni) Limited ablation studies. It can be made further clear for how much performance gain comes from Dirac structure vs other enhancements.  \nii) the paper does not exploit edge features on binding affinity task. It may be unsure if Dirac structure helps here.  \niii) although one of the experimental task is related to long range dependency, it is not sure for the second task. A robust study on some long range dataset benchmark would be required to verify holistically the claims of the model on long range tasks as is mentioned in multiple instances in the paper. The paper would be strengthened by a more in-depth analysis of what long-range effects the model is capturing in this domain.  \niv) For binding affinity task, did you try using edge features? Does the Dirac structure help in that case?"
            },
            "questions": {
                "value": "above"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4015/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698492982789,
        "cdate": 1698492982789,
        "tmdate": 1699636363999,
        "mdate": 1699636363999,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "xiwwizZDCd",
        "forum": "AialDkY6y3",
        "replyto": "AialDkY6y3",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4015/Reviewer_VKy2"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4015/Reviewer_VKy2"
        ],
        "content": {
            "summary": {
                "value": "The paper introduces the Dirac-Bianconi Graph Neural Network (DBGNN) based on Bianconi's topological Dirac equation for graph-based network dynamics. DBGNN preserves long-range information propagation and treats edges and nodes equally. This approach is beneficial when edges convey physical properties. The paper demonstrates competitive performance in molecular property prediction and superior performance in predicting the dynamic stability of power grids. In the case of power grids, DBGNN exhibits robust out-of-distribution generalization, indicating learned structural relations."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The development of the Dirac-Bianconi Graph Neural Network (DBGNN) based on a modified generalized Dirac-Bianconi equation represents an innovative approach. The incorporation of learnable weights, nonlinearity, and multiple time steps for evolving features offers a unique solution to address long-range dependencies in graph neural networks. The integration of fundamental quantum equations into GNN research is relatively rare, demonstrating a level of innovation. The paper upholds a high standard of quality in its methodology, showcasing the effectiveness of the DBGNN architecture in challenging tasks, including power grid analysis and molecular property prediction. The model's performance underscores its robustness and practicality. The competitive performance and out-of-distribution generalization observed in power grid tasks, along with enhanced molecular property prediction, demonstrate the practical relevance of this work."
            },
            "weaknesses": {
                "value": "The theoretical part of this paper lacks an analysis of the time complexity of the Dirac-Bianconi Equation. The paper does not provide a detailed theoretical explanation of the integration of the Dirac-Bianconi equation with Graph Neural Networks (GNNs). It focuses on the properties of the Dirac-Bianconi equation itself, dedicating substantial space to this, but does not elaborate on the theoretical foundation for its fusion with GNNs. \nThe paper applies the DBGNN model to two vastly different tasks, power grid analysis and molecular property prediction, without tailoring the model for the specifics of each task. This lack of task-specific optimization could limit the model's performance and applicability. The experimental setup in section 4.1.2 appears to have some shortcomings in terms of training parameters and code implementation. This raises concerns about the reproducibility and robustness of the experiments, which are essential in scientific research.\nThe paper's comparison with other models, particularly using only GCN with three layers, is not comprehensive and may not represent a fair benchmark. Comparing models with varying numbers of layers and different architectural complexities would provide a more meaningful evaluation. Lack of clear improvement in accuracy with the use of the Dirac-Bianconi equation within GNNs could be seen as a weakness in the paper's claims regarding its advantages."
            },
            "questions": {
                "value": "Can a more detailed theoretical explanation be provided regarding why the Dirac-Bianconi equation was chosen for integration with GNNs and how they are combined to enhance graph representation capabilities?\nGiven the vastly different nature of power grid analysis and molecular property prediction, is there a plan to introduce task-specific optimizations within the model to leverage the unique characteristics of each task?\nCould more detailed experimental settings and parameter choices be provided to ensure experiment reproducibility while also considering the robustness of the model?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4015/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698672530999,
        "cdate": 1698672530999,
        "tmdate": 1699636363918,
        "mdate": 1699636363918,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "TuGifTUf0Q",
        "forum": "AialDkY6y3",
        "replyto": "AialDkY6y3",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4015/Reviewer_Bj5J"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4015/Reviewer_Bj5J"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a new Graph Neural Network, the Dirac-Bianconi Graph Neural Network, derived from an Euler discretization of the generalized Dirac-Bianci equation on a network. While the graph Laplacian operator-based GNNs cause over-smoothing, the proposed method is designed to capture long-range interactions between nodes. This paper confirms that the proposed method does not cause over-smoothing evaluated using Dirichlet Energy. Also, this paper applies the proposed method to estimating power grid stability and predicting binding affinity and compares its prediction accuracy with existing methods."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "* The proposed method improves the accuracy of power grid stability prediction compared to existing methods, especially for the out-of-distribution problem setting.\n* Numerical results show that the over-smoothing evaluated using Dirichlet Energy can be alleviated for the model trained on real data.\n* The paper is well-written, and the derivation of the proposed model is carefully described, making it accessible to readers unfamiliar with the Dirac-Bianconi operator."
            },
            "weaknesses": {
                "value": "* If I understand correctly, the Dirac-Bianci operator is called the boundary and co-boundary operators in the simplicial complex theory on graphs. Existing studies propose GNNs that use or extend them (e.g., [1--4]. Also, [5] does not use (co-)boundary operators but extends GNNs on simplicial complexes.) Therefore, it is debatable whether the proposed method has (theoretical and experimental) novelty and significance in terms of using the Dirac-Bianci operator.\n* This paper claimed that one of the advantages of the proposed method is that it solves over-smoothing. However, since there exist models that tackle over-smoothing, such as GCNII [6] and DRew [7], I have a question about whether the proposed method is superior to them.\n* In the task of binding affinity prediction, this paper argues that the proposed method with ten steps is comparable with 3-layer GCN. However, the deeper the model is the greater the computational complexity and memory usage. Since existing models overcome the over-smoothing, as I mentioned above, more is needed for a deep model to be comparable in performance to a shallow GNN.\n* One of the advantages of the proposed method is that both node and edge features can be used equally. However, in the numerical experiments on real data, only node features are available to GNNs (in the binding affinity prediction task, edge features are used for graph construction but not as features). Therefore, it is unclear whether the proposed method can take advantage of this feature in real data.\n\n- [1] https://openreview.net/forum?id=vbPsD-BhOZ\n- [2] https://proceedings.mlr.press/v139/bodnar21a\n- [3] https://openreview.net/forum?id=ScfRNWkpec\n- [4] https://proceedings.mlr.press/v139/roddenberry21a.html\n- [5] https://openreview.net/forum?id=nPCt39DVIfk\n- [6] https://proceedings.mlr.press/v119/chen20v.html\n- [7] https://openreview.net/forum?id=WEgjbJ6IDN"
            },
            "questions": {
                "value": "* How were the hyperparameters chosen? In particular, the numerical experiments use networks with 48 and 10 steps in total, respectively. However, it is yet to be known whether these hyperparameters are optimal. That is, a model with fewer steps might be sufficient. I suggest conducting ablation studies to see the sensitivity of performances to the number of steps.\n* In Figure 5(a), the Dirichlet energy of untrained DBGNN is almost constant regardless of the number of steps. Is this expected from the theory?\n\nMinor Comments\n- P4, Section 2: $\\partial_{db}$ -> $\\partial_{DB}$\n- Section A.3: pyTorch -> PyTorch"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "N.A."
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4015/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698745993278,
        "cdate": 1698745993278,
        "tmdate": 1699636363812,
        "mdate": 1699636363812,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "EDy8S9zkFd",
        "forum": "AialDkY6y3",
        "replyto": "AialDkY6y3",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4015/Reviewer_YvSy"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4015/Reviewer_YvSy"
        ],
        "content": {
            "summary": {
                "value": "Deviating from the traditional Laplacian based GNNs, on this paper the authors propose Dirac-Bianconi Graph Neural Network (DBGNN) which are based on the topological Dirac equation on the graph. The major advantage of the proposed method is that it does not lead to over-smoothing of the node features when a large number of layers are stacked.\n\n\nThe paper is difficult to read at times. Especially for readers not having a background in topological data analysis. The paper is well motivated but lacks insights when using Dirac-Bianconi operators. Although Figure 5 demonstrate that the proposed method enabling heterogeneous representations even after 500 layers, giving more insights will help improving the paper."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The work is well motivated and the main advantage seems to avoid over-smoothing and also use input edge features in learning representations.\n\n2. Figure 5 is a good demonstration of avoiding over-smoothing.\n\n3. Slight performance improvement on power grid data."
            },
            "weaknesses": {
                "value": "1. In abstract, you mention \"we expect DBGNN to be useful in contexts where edges encode more than mere logical connectivity, but have physical properties as well\". Also the introduction motivates for the same. However, the datasets used in the evaluation do not consider any useful edge information. Including datasets with useful input edge features will enrich the paper.\n\n2. In Table 2, it is shown that only 1 layer of DBGNN suffices. This is deviating from the story that stacking more layers helps in complex (hard) datasets.\n\nI am willing to raise my score significantly if the story of the paper is in line with the findings and more insights with toy examples are presented."
            },
            "questions": {
                "value": "1. Why do we need at least 13 layer GNNs for power grids? Is it true for all type of GNNs? Some powerful GNNs might need fewer than 13 layers.\n\n2. Please clarify using the notation $e_{ij}$ = $ - e_{ji}$.\n\n3. What is the performance of the proposed method on node classification tasks on citation networks such as Cora, Pubmed, etc?\n\n4. The Dirichlet energy is constant over 500 steps in Figure 5? Why? Is it just for this experiment? It does not seem to change a t all.."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 5,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4015/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699036830901,
        "cdate": 1699036830901,
        "tmdate": 1699636363734,
        "mdate": 1699636363734,
        "license": "CC BY 4.0",
        "version": 2
    }
]