[
    {
        "id": "xW2cvV20U7",
        "forum": "apA6SSXx2e",
        "replyto": "apA6SSXx2e",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5889/Reviewer_QpHH"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5889/Reviewer_QpHH"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a novel metric called Topological Concentration (TC) to demythify the varying performance of Graph Neural Networks (GNNs) in link prediction across different nodes. The authors demonstrate that TC has a higher correlation with link prediction performance than other node-level topological metrics like degree and subgraph density. They also uncover a novel Topological Distribution Shift (TDS) issue and propose an Approximated Topological Concentration (ATC) to address the computational complexity of TC. The paper concludes by exploring the potential of boosting link prediction performance via enhancing TC."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- The paper introduces a new metric, Topological Concentration (TC), which provides a better characterization of node link prediction performance in GNNs than traditional metrics like degree and subgraph density.\n- The authors uncover a novel Topological Distribution Shift (TDS) issue and demonstrate its negative impact on link prediction performance at the node and graph levels.\n- The paper proposes an Approximated Topological Concentration (ATC) to address the computational complexity of TC, while maintaining high correlations to link prediction performance.\n- The authors explore the potential of boosting link prediction performance by enhancing TC through edge reweighting in message-passing and discuss its efficacy and limitations."
            },
            "weaknesses": {
                "value": "- The paper could benefit from a more comprehensive evaluation of the proposed methods on a wider range of datasets and benchmark tasks. This would help to establish the generalizability and robustness of the proposed techniques across different domains and problem settings.\n\n- The theoretical analysis of the relationship between TC and link prediction performance could be further strengthened with additional mathematical proofs or rigorous analysis. Providing a more solid theoretical foundation would increase the credibility and impact of the proposed methods.\n\n- The paper could discuss the limitations and potential biases of the proposed evaluation metrics, such as TC and ATC. Addressing these concerns would help to ensure that the results are reliable and that the methods are not overly sensitive to specific aspects of the data.\n\n- The paper could provide a more in-depth analysis of the cold-start problem and its relationship with the proposed metrics, as well as discuss potential strategies for addressing this issue. This would help to better understand the practical implications of the proposed methods and their potential to improve link prediction performance in real-world scenarios."
            },
            "questions": {
                "value": "- Could you please provide more details on the implementation of the Approximated Topological Concentration (ATC) and its theoretical justification for approximating TC? This would help to better understand the rationale behind the proposed method and its potential advantages over other approaches.\n\n- How do the proposed methods compare to other state-of-the-art link prediction techniques in terms of performance and computational efficiency? \n\n- What does the \"cold-start\" nodes mean? Please clarify the definition and implications of cold-start nodes in the context of link prediction. This would help to better understand the relevance and importance of addressing the cold-start problem in the proposed methods."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5889/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5889/Reviewer_QpHH",
                    "ICLR.cc/2024/Conference/Submission5889/Senior_Area_Chairs"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5889/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698753146606,
        "cdate": 1698753146606,
        "tmdate": 1700713236242,
        "mdate": 1700713236242,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "MecSV7NFif",
        "forum": "apA6SSXx2e",
        "replyto": "apA6SSXx2e",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5889/Reviewer_f1PG"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5889/Reviewer_f1PG"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a metric \"Topological Concentration\" (TC) as a new measure for Link Prediction (LP) in GNNs.\nTP is basically the intersection of the subgraphs of extremal nodes $i$ ans $j$ of an edge $(i,j)$. A concept very similar\nto the common-neighbors heuristic. The authors claim \"With TC, newly joined neighbors of a node tend to become less \ninteractive with that node’s existing neighbors, compromising the generalizability of node embeddings for LP at the testing time\". \n\nThere is empirical evidence that GNNs perform better on high-degree nodes than on low-degree nodes. However, the authors \nobserve that this is not the case in LP. TC seems to find better correlations with LP performance (again, as common neighbors). \nTC also inspires a new message-passing strategy considering well-connected neighbors. \n\nThe authors highlight the good properties of their measure and propose how to compute it efficiently. ATC (approximated topological \nconcentration) relies on powers-hops of the transition matrix. This is $O(Kd(|E| + |V|))$, where $K$ is the maximum hop. \n\nThe experiments show that TC boosts the performance of LP in several basic baselines. No comparisons with subgraph-based baselines."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "* Formalization of an intuition (common neighbors and subgraph-based methods for LP). \n* Nice empirical study on the properties of TC. \n* ATC is efficient."
            },
            "weaknesses": {
                "value": "* No comparison with state-of-the-art subgraph-based methods (e.g. subgraph sketching)."
            },
            "questions": {
                "value": "* The ATC heavily depends on the powers of the transition matrix. In this regard, how do you fix $K$? Large values of $K$ lead to a matrix with constant rows (ergodicity theorem). \n* What are the computational advantages wrt subgraph-sketching, if any? \n* What is the expected gain in performance wrt to state-of-the-art LP methods beyond the common-neighbors heuristic?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "None"
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5889/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5889/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5889/Reviewer_f1PG"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5889/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698755509929,
        "cdate": 1698755509929,
        "tmdate": 1700558602361,
        "mdate": 1700558602361,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "xyIlnZvApl",
        "forum": "apA6SSXx2e",
        "replyto": "apA6SSXx2e",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5889/Reviewer_6TYH"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5889/Reviewer_6TYH"
        ],
        "content": {
            "summary": {
                "value": "The authors identify a gap in understanding how different nodes in a graph achieve varying LP performance. They propose the Topological Concentration (TC) and its scalable version, Approximated Topological Concentration (ATC) metrics, which offer a more accurate measurement of the correlation between local subgraph structure and LP performance compared to traditional node degrees. Surprisingly, the paper reveals a counterintuitive observation that LP performance does not consistently increase with node degree, challenging conventional wisdom. Additionally, the paper uncovers a Topological Distribution Shift (TDS) issue, which impacts LP generalizability and highlights the importance of TC in understanding node-level LP performance. The authors propose TC-inspired message-passing techniques to enhance LP performance by focusing on well-connected neighbors within a node's computational tree. Overall, this research contributes valuable insights into LP performance variation and cold-start issues in GNNs, with potential implications for improving network dynamics and LP strategies."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "* The paper's introduction of the Topological Concentration (TC) and Approximated Topological Concentration (ATC) metrics provides a new and innovative approach to addressing the variation in Link Prediction (LP) performance within Graph Neural Networks (GNNs). \n\n* The paper's observation that LP performance does not consistently increase with node degree challenges existing assumptions in the field. This counterintuitive finding sparks curiosity and adds an element of novelty to the research.\n\n* The paper proposed a new method to improve model's link prediction performances based on their TC and show empirical results."
            },
            "weaknesses": {
                "value": "* Discussion of the time complexity is not so good. The adjacent matrix are based on each layer's embedding, so the time consumption will be larger. Experiments on this are needed.\n* Subgraph-based methods as baselines are not so complete."
            },
            "questions": {
                "value": "* Can you measure the time complexity through experiments? I guess the time consumption will not be so close to the original method.\n\n* NCN already explicitly accounts for this common neighbor signal in its decoder, the performance gains from our strategy are relatively modest. So why don't you choose another subgraph-based method because I'm curious what's your strategy's effect on subgraph-based methods that don't explicitly use common neighbor signals. \n\n* How to get the performances of link prediction of nodes with different TC? I mean one link has two nodes. For example for the results for nodes'TC in \\[0,0.2\\), does every link includes two nodes in that domain or just one node is enough?\n\n\n* Have you tried to make TC^{Tr} closer to TC^{VAL}, if wanting to make model more generalizing to prediciting test links. Because we may assume validation set has the same distribution of test set.\n* In Figure 7(a), why the curve of training original graph has several fast down of performances?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5889/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5889/Reviewer_6TYH",
                    "ICLR.cc/2024/Conference/Submission5889/Senior_Area_Chairs"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5889/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698758014519,
        "cdate": 1698758014519,
        "tmdate": 1700565344317,
        "mdate": 1700565344317,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "CDcOpnTfsH",
        "forum": "apA6SSXx2e",
        "replyto": "apA6SSXx2e",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5889/Reviewer_1hhc"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5889/Reviewer_1hhc"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a new metric called Topological Concentration (TC) for GNN-based link prediction. The authors also discover a novel topological distribution shift issue and use TC to quantify this shift and its negative impact. They design a message-passing scheme that reweights the edges based on the contribution of the neighbors. They show that this scheme can enhance TC and boost link prediction performance to some extent."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "1 poor"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "- The paper proposes a novel metric, Topological Concentration (TC), to measure the varying link prediction performance across different nodes.\n- It demonstrates the superiority of TC over other node topological properties, such as degree and subgraph density.\n- It explores the potential of boosting GNNs’ LP performance by enhancing TC via re-weighting edges in message-passing."
            },
            "weaknesses": {
                "value": "- The writing is unclear and hard to follow. The notations are confusing. The paper uses similar symbols for some concepts, such as ${TC}^{TR}$, ${TC}^{Tr}$, ${Tc}^{Tr}$, which are hard to distinguish. The paper also uses uncommon abbreviations for training and testing sets, such as Tr and Te.\n- The motivation of probing the node characteristic for LP is questionable. The paper does not explain why this is a meaningful problem, given that [1] has proven that LP cannot be reduced to two node problems.\n- The definition of Topological Concentration is complicated and the rationality is not obvious. The paper uses a complex formula to find the intersection of subgraphs at different hops, but does not justify its choice, such as the exponential decaying coefficients. Why don't you define $\\mathcal{H}_i^k$ as $k$-hop neighbors, which is more clear and straightforward?\n- The organization is confusing. The paper switches between different topics without clear transitions. For example, it introduces TC in section 3.2, then discusses cold-start nodes and distribution shift in section 3.3, and then returns to TC in section 3.4.\n- Obs.2 and Obs. 3 in section 3.3 seem irrelevant for the proposed model and discussion. The paper does not explain how these observations inform the design or evaluation of the edge reweighting strategy.\n- The technical novelty is limited. The paper only proposes edge reweighting as a strategy to enhance LP performance, which is a common technique in LP [2][3]. The paper does not compare or contrast its strategy with existing methods.\n- The experiment in this paper is weak. You only show the relative gain of GCN/SAGE/NCN with reweighting, but you do not compare with the SOTA LP methods like BUDDY [4]. Your result is not competitive, as you only achieve 54% Hits@50 on Collab. Why do you not include experiments on other OGB datasets like ogbl-ddi and ogbl-ppa?\n- The paper lacks ablation studies or case studies to demonstrate the effectiveness of the reweighting strategy. You could also provide some qualitative analysis or visualization to show how the reweighting strategy affects the prediction results.\n- The font in every figure is too small to read, and the figures are not well-designed.\n\n[1] Zhang, M., Li, P., Xia, Y., Wang, K., & Jin, L. (2021). Labeling trick: A theory of using graph neural networks for multi-node representation learning. In NeurIPS.\n\n[2] Huang, Z., Kosan, M., Silva, A., & Singh, A. (2023). Link Prediction without Graph Neural Networks. arXiv preprint arXiv:2305.13656.\n\n[3] Pan, L., Shi, C., & Dokmanić, I. (2022). Neural link prediction with walk pooling. In ICLR.\n\n[4] Chamberlain, B. P., Shirobokov, S., Rossi, E., Frasca, F., Markovich, T., Hammerla, N., … & Hansmire, M. (2023). Graph neural networks for link prediction with subgraph sketching. In ICLR."
            },
            "questions": {
                "value": "See Weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5889/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5889/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5889/Reviewer_1hhc"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5889/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699521618524,
        "cdate": 1699521618524,
        "tmdate": 1699636624155,
        "mdate": 1699636624155,
        "license": "CC BY 4.0",
        "version": 2
    }
]