[
    {
        "id": "eQFW4FNlgg",
        "forum": "b3Cu426njo",
        "replyto": "b3Cu426njo",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4443/Reviewer_YbkU"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4443/Reviewer_YbkU"
        ],
        "content": {
            "summary": {
                "value": "The paper considers optimization-based meta-learning algorithms, i.e., algorithms that employ a bi-level optimization strategy to optimize task-specific and task-global parameters. This approach can be interpreted as the task-specific parameters being regularized towards a task-global prior optimized in the outer loop. The authors propose a novel method to induce more general/expressive priors in comparison to related work, by learning proximal operators for proximal gradient descent using unrolled NNs. The authors motivate a piecewise linear parametrization of this proximal operator, derive an algorithm to optimize the corresponding parameters, and analyze error bounds. They compare their approach against a range of optimization-based meta-learning algorithms."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "The paper is well-written and both the theoretical exposition as well as the experimental evaluation seem to be well fleshed out. Algorithmic choices such as using piecewise linear approximations for the proximal operator appear well-motivated. The experiments contain comparisons to a wide range of optimization-based meta-learning algorithms, demonstrating superior performance of the proposed method on the miniImageNet benchmark. Further ablations underline the effectiveness of algorithmic design choices. In summary, the paper appears as an interesting and effective approach to derive priors for optimization-based meta-learning. \n\nTherefore, I vote for acceptance. However, my recommendation is with low confidence, so I might decrease my score during the rebuttal period."
            },
            "weaknesses": {
                "value": "The paper could be further strengthend by providing experimental results on benchmarks other than miniImageNet. Furthermore, I would appreciate a discussion of how the method relates to and/or could be extended to fully Bayesian approaches like Probabilistic MAML [1] or Bayesian MAML [2].\n\n[1] Kim et al., Bayesian Model-Agnostic Meta-Learning, NeurIPS 2018\n\n[2] Finn et al., Probabilistic Model-Agnostic Meta-Learning, NeurIPS 2018"
            },
            "questions": {
                "value": "cf. weaknesses"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4443/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698401736926,
        "cdate": 1698401736926,
        "tmdate": 1699636419326,
        "mdate": 1699636419326,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "40Yj77v0Mm",
        "forum": "b3Cu426njo",
        "replyto": "b3Cu426njo",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4443/Reviewer_W1mq"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4443/Reviewer_W1mq"
        ],
        "content": {
            "summary": {
                "value": "This work presents a novel approach to meta-learning dubbed MetaProx, which leverages unrolled proximal neural networks to learn flexible and interpretable priors. The core concepts of MetaProx involve decompose the proximal gradient descent algorithm into a multi-block neural network, with each block comprising a data consistency module and a trainable piecewise linear function that approximates the proximal operator. \n\nTheoretical analysis of this approximation demonstrates its capability to effectively model smooth and non-smooth proximal functions. Empirical evaluations of MetaProx in the context of few-shot classification tasks reveal its superior performance compared to other SOTA meta-learning techniques employing either RNN-base or handcrafted priors."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. The idea of learning priors through unrolled PGD is a novel and intriguing approach. This method facilitate the model to learn a broader range of complex and adaptable priors in a data-driven manner, thanks to the inclusion of non-smooth and even discontinuous functions in the regularization term of the proximal operator. Furthermore, it enhances both model expressiveness and interpretability when compared to traditional meta-learning approaches that rely on predefined priors. For example, in optimization-based meta-learning methods like LEO and ANIL, an explicit Gaussian or Laplace prior is imposed on model parameters during inner-loop adaptation. To maintain computational efficiency and feasibility, the authors employ piecewise linear functions to approximate the proximal operator. Additionally, they further reduce costs by employing fixed discretization points for the piecewise linear functions instead of simultaneous learning them. \n2. The paper provides a rigorous theoretical analysis bounding the approximation errors, offering valuable practical guidelines for hyper-parameter tuning, like C.\n3. Comprehensive empirical evaluation on benchmark datasets and comparisons with state-of-the-art meta-learning methods. The consistent performance gains validate the effectiveness of MetaProx."
            },
            "weaknesses": {
                "value": "While this paper presents a solid contribution with rigorous analysis and experimental validation on few-shot classification, the scope of applications could be expanded to further demonstrate the generality of the proposed MetaProx method. In particular, the current empirical evaluation is limited to few-shot classification tasks. To reveal the full merits of MetaProx and its ability to learn flexible priors, additional experiments on other few-shot learning domains would make the work stronger. For example, further testing MetaProx on few-shot regression tasks, few-shot policy learning in reinforcement learning, or few-shot time series forecasting would verify its effectiveness beyond classification.\n\nThe paper currently visualizes the learned proximal operators averaged across iterations. An insightful extension would be to visualize the evolution of the learned priors at each unrolled PGD step, if possible. Analyzing how the proximal functions adapt over the course of optimization could provide deeper understanding into the dynamics of MetaProx and the induced priors.\n\nFurthermore, the work by [1] on proximal layers for deep regularization is relevant, as it shares the high-level idea of encoding priors into optimization-based neural network training. A key difference is that [1] transforms hidden representations to comply with preset priors, while this work learns proximal operators over model parameters. Comparing and contrasting with [1] could potentially help situate the contributions of this paper.\n\n[1]. Mao Li, Yingyi Ma, and Xinhua Zhang. Proximal mapping for deep regularization. Advances in Neural Information Processing Systems 2020."
            },
            "questions": {
                "value": "1. How do you anticipate the performance of MetaProx on few-shot regression or reinforcement learning tasks? Is it ready to be extend to these domains? Are there any challenges to be addressed?\n2. Do you have any ideas to help interpret the high-dimensional learned prior, beyond visualizing the 1D components? Would it be possible to visual the evolution of learned prior after each unrolled PGD steps?\n3. Does MetaProx require careful initialization or scheduling of $\\lambda$ to avoid instability during training? \n4. The method mainly evaluated on 5-way 1/5-shot classification benchmarks. How do you expect MetaProx to perform on more challenging few-shot settings, like 20-way 1/5-shot?\n5. Is there trade-off between the regularization term and the loss function in eq (1b)?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4443/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698561059068,
        "cdate": 1698561059068,
        "tmdate": 1699636419218,
        "mdate": 1699636419218,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "OvYaWuUQ8I",
        "forum": "b3Cu426njo",
        "replyto": "b3Cu426njo",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4443/Reviewer_Da9s"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4443/Reviewer_Da9s"
        ],
        "content": {
            "summary": {
                "value": "This paper presents a meta learning algorithm called MetaProx. When addressing meta learning algorithm with so-called proximal gradient descent, a central idea of this paper is to apply algorithmic unrolling. Algorithmic unrolling solves iterative optimization method by learning a deep neural network by cascading the steps of the iterative process. By applying algorithmic unrolling to proximal gradient descent, the paper attempts to enhance expressiveness and interpretability of the prior. Piecewise linear functions are chosen as proximal operators, for which, the paper provides error bounds theortically. In few-shot learning benchmarks, the paper shows advantages of the proposed method."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "I noted the following strenghts:\n\n1. The idea of bringing algorithmic unrolling to proximal gradient descent is new and interesting.\n\n2. The paper derives theoretic error bounds for both smooth and non-smooth proximal operator, which makes the approach theoretically sound with certain level of technical depth.\n\n3. The proposed method seems to perform well in the few shot benchmark. Improvements are consistent."
            },
            "weaknesses": {
                "value": "I thought following points could improve the paper.\n\n1. I wonder if the dervied theoretic bounds can be validated empirically and the results appear in appendix.\n\nIn toy settings, it is often possible to compute the error bounds. Numerical examination could validate the bounds and further show how tight the error bound can be. Specifically, the paper claims that the derived bounds are tight. It could help if this claim is verified through experiments.\n\n2. There are rooms to improve the presentation.\n\nIntroduction: Only few sentences are devoted to describe the contribution of the paper, while four paragraphs are devoted to motivation for this work. Within the descriptions of the contributions, most of the words are spent in giving benefits of the approach. I think this should appear after explaining what the actual approach is, e.g., explain what algorithm unrolling technique is, etc.\n\nRelated work: The paper misses related work section. Therefore, it was difficult to locate the contributions of the paper within the state of the art. \n\nSection 3.1: I had to read other papers to understand algorithmic unrolling. Looking back, the provided explanations seem rather difficult and this paragraph might be throughly revised.\n\n- The part on explainability may not be clear.\n\nYes, algorithmic unrolling can add interpretability by examining each layer mapping. But, the results look rather vague and I wasnt sure how this explainable prior can be useful in practice.\n\n----------------------------------------------\n\nOverall, the paper has many ideas and I am leaning towards recommending accept. I hope that my concerns are addressed during rebuttal."
            },
            "questions": {
                "value": "Questions and suggestions have been addressed in the section above."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4443/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4443/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4443/Reviewer_Da9s"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4443/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698741066389,
        "cdate": 1698741066389,
        "tmdate": 1699636419123,
        "mdate": 1699636419123,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "KvuLVOYsKw",
        "forum": "b3Cu426njo",
        "replyto": "b3Cu426njo",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4443/Reviewer_5m7L"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4443/Reviewer_5m7L"
        ],
        "content": {
            "summary": {
                "value": "The authors present an approach for meta-learning that estimates per-task model\nparameters with an unrolled neural network. The neural network is derived from\nproximal gradient descent on a regularized ERM problem (per-task); the\nregularization term is learned by representing its proximal operator, which is\nparameterized as a piecewise linear function that separates over its\ncoordinates. A theorem is given that bounds approximation error between\npiecewise linear operators of this type and general $C^1$ maps asymptotically in\nterms of the number of discretization points. Experimental results demonstrate\nimproved performance over certain meta-learning benchmarks on few-shot image\nclassification, and visualize the proximal operators learned in these tasks."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- The paper presents a clear and robust overview of background and prior work on\n  meta-learning, making the authors' contributions easy to understand and\n  appreciate in-context.\n\n- The paper features a mixture of theory, justifying the approach, and\n  experiment.\n\n- Experimental results demonstrate the approach performs favorably on few-shot\n  image classification with standard meta-learning datasets against standard\n  benchmarks.\n\n- The results on learned nonlinearities in section 4.4 are an interesting\n  consequence of the authors' method. In interpreting these results, it would be\n  helpful to know how the $\\zeta$ parameters are initialized."
            },
            "weaknesses": {
                "value": "- The conceptual contribution is not exactly made clear. Maybe the clearest\n  manifestation of this is that the presentation of the\n  methodology does not make it clear why the authors' approach should be\n  superior to other approaches to meta learning (say, to solving the formulation\n  in equation (1)). The methodological discussion emphasizes that several\n  commonly-used meta learning priors (under a common assumption on the \"optimal\n  regularizer\") can be associated to proximal operators that can be represented\n  as coordinatewise-applied piecewise linear functions. However, it does not\n  connect back to specific tasks of interest in practice mentioned in the intro\n  (robotics, say) and argue that the parametrized piecewise-linear proximal\n  operators (essentially learnable nonlinearities in a neural network that\n  implements the base-learner) are useful given specific structures the model\n  parameters $\\boldsymbol{\\theta}_t$ have in these tasks. I think this is\n  important to be able to support the authors claims of \"expressivity\" and\n  \"interpretability\" made in (i) of the claimed contributions.\n\n- Labeling the algorithm \"MetaProx\" seems like it might be a slight misnomer --\n  based on the discussion on page 5 (after Assumption 3.1), it seems that what\n  the authors are implementing is rather an amalgamation of one-dimensional\n  picewise linear functions, which need not correspond to the prox of any\n  function. In one dimension, it should be sufficient and necessary here to\n  constrain the piecewise linear function to be monotone.\n\n- It is not completely clear how the authors' eventual MetaProx algorithm\n  differs from other meta learning approaches; most of the authors' discussion\n  emphasizing the novelty of their approach seems to focus on contrasting with\n  prior works on algorithm unrolling. For example, is this the first work that\n  has made a connection between the problem in equation (1) and proximal\n  gradient descent? A small section discussing this after the method has been\n  presented would be helpful.\n\n\n### Minor Issues\n\n- Page 3: \"...the optimization-based approaches solve (2b) ...\" -- should this\n  be (1b)? The rest of this setence discusses $\\mathcal{R}$, which does not\n  appear in equation (2).\n- Text before equation (11) on page 7: seems to be a dangling clause, \"...has\n  gained attention in various PGD-guided a [sic?].\"\n- Notation for continuously differentiable functions: as I understand it, using\n  $\\mathbb{C}^k$ for this class is nonstandard (and clashes with the usual\n  notation for $k$-tuples of complex numbers in a jarring way). I guess this is\n  an attempt to avoid a conflict with the parameter $C$ in the authors'\n  algorithm; what about using $\\mathcal{C}^k$ or $\\mathsf{C}^k$ for this class?\n- Is it correct that Theorem 3.2 involves Assumption 3.1? If so, it would be\n  good style to reference this in the theorem statement."
            },
            "questions": {
                "value": "- The authors motivate their method at the start of section 3.1 by contrasting\n  their method, which learns a prior over model parameters\n  $\\boldsymbol{\\theta}_t$, with prior work on algorithm unrolling, where the focus\n  is to learn a prior over signals $\\mathbf{x}_t$ for one fixed task. It would\n  be helpful in supporting this point if the authors presented a concrete\n  example of a class of tasks where this difference can be appreciated. For\n  example, what form does this distinction take in a family of Gaussian\n  denoising tasks -- a typical setting for algorithm unrolling? I think this\n  would be helpful, as the presentation of the computational methodology in the\n  rest of the section tends towards abstraction.\n\n- The notion of an \"optimal\" regularizer $\\mathcal{R}^*$ is introduced on page\n  4, and plays a role in the authors' methodology. In what sense is this\n  regularizer \"optimal\"? I could not find any discussion of this notion in the\n  background section.\n\n- Is the content of Theorem 3.2 mainly an application of results on\n  one-dimensional piecewise linear function approximation (with uniform\n  discretization) of $C^1$ functions?\n\n- What is the \"apples-to-apples\" comparison mentioned when discussing the\n  experimental results on page 8? Are there SotA meta-learning methods that have\n  been excluded from this table? It seems natural that the MetaProx approach\n  might perform better than methods that use less computation, since Algorithm 2\n  could be interpreted for natural losses $\\mathcal{L}$ as a multilayer residual\n  network (with some per-task conditioning) with learnable nonlinearities, if\n  I'm not mistaken."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4443/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4443/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4443/Reviewer_5m7L"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4443/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698861752082,
        "cdate": 1698861752082,
        "tmdate": 1700681238926,
        "mdate": 1700681238926,
        "license": "CC BY 4.0",
        "version": 2
    }
]