[
    {
        "id": "bOaPeX8mkB",
        "forum": "b3kDP3IytM",
        "replyto": "b3kDP3IytM",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1731/Reviewer_dWav"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1731/Reviewer_dWav"
        ],
        "content": {
            "summary": {
                "value": "This paper develops a dataset and associated dataset construction framework for the evaluation of LLMs on _constraint satisfaction information retrieval_ tasks (eg, \"celebrities who died in 2022\"). This problem is interesting because many it covers many important and useful factual query tasks, but LLMs have significant accuracy difficulties. The authors experiment against existing LLMs (GPT-3.5 and GPT-4) while varying key dimensions of the task, and conduct performance and error analyses on the results."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "4 excellent"
            },
            "strengths": {
                "value": "A crisp task definition and associated evaluation dataset can be a high-leverage research contribution that enables and accelerates other work, so this is a worthwhile goal. It's also quite promising that the task seems to be intuitively straightforward yet is still challenging for state-of-the-art proprietary models like GPT-4.\n\nThe citations and engagement with IR research going back to 1989, 1999, 2009, etc is good to see and contextualizes the work well. \n\nThe exploration of problem setting parameters (task settings, author popularity, selectivity) is systematic and illuminating. The research questions are clearly defined and answered. The explanations of the dataset development and scoring are clear and thorough. The \"extensible\" nature of the methodology for dataset construction is useful to \"future proof\" the work.\n\nSome of the detailed error analysis was intriguing and suggestive of mechanisms behind the failure modes which is very exciting for future work:\n* ends-with vs starts-with constraints\n* \"sharp phase transition\" for failure rate vs author popularity\n* fabrication for \"list all books by author\""
            },
            "weaknesses": {
                "value": "For the open datasets (Open Library and WikiData), is there some precautions taken to \"snapshot\" these to a specific point in time for reproducibility purposes? Also, the procedures uses a few proprietary tools to develop the dataset: Azure Cognitive Services NER and Language API, Geonames in the dataset preparation. If the framework code release is open-sourced, future developers could substitute open or more reproducible components in these places, but this means that it would be difficult to create a new version of the dataset \"out of the box\". Likewise for GPT-3.5 and -4: are all the queries and responses captured somehow for reproducibility of the experiments and analysis? Some of these reproducibility concerns potentially undercut the usefulness and extensibility of the framework.\n\nFor controlled experimentation purposes it is useful to focus on a single domain such as book  authorship. However, it seems like there is some risk that the findings or behaviors may not transfer to other constrained IR tasks. How easy or difficult would it be to adapt the framework to generate similar dataset-task pairings in other domains as mentioned in the paper (movies, restaurants, etc)? \n\nCan fine-tuned LLMs do well on KITAB? The results and dataset would be more compelling with another FINE-TUNED setting, even if it had to be done with an OSS model."
            },
            "questions": {
                "value": "What does KITAB stand for? I couldn't find a definition. \n\nTable 3: why are some numbers red?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1731/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698675713707,
        "cdate": 1698675713707,
        "tmdate": 1699636101962,
        "mdate": 1699636101962,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "SaCDhHD8rw",
        "forum": "b3kDP3IytM",
        "replyto": "b3kDP3IytM",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1731/Reviewer_XGyb"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1731/Reviewer_XGyb"
        ],
        "content": {
            "summary": {
                "value": "This paper introduces a new dataset, KITAB that evaluates how well LLMs  perform in answering constraint satisfaction queries for information retrieval."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "Overall I think this new dataset is a well posed and timely work.\n\n* The dataset seems well constructed and reasonable\n* Incorporating constraint satisfaction for LLMs appears to be somewhat understudied, and this dataset will fit nicely into the existing LLM evaluation framework\n* The choice of model evaluation on the data (ChatGPTs) is reasonable\n* The differing frames for the data (with context, without, etc) makes sense\n* The dataset construction is well documented, with design choices explicitly described\n* The metrics and evaluations are well constructed"
            },
            "weaknesses": {
                "value": "The dataset is somewhat limited, being about books, years and authors. I would prefer if the dataset included a wider portfolio of constraint tasks, perhaps around geography or movies.\n\nIt would also be nice if at least one opensource LLM was used in evaluation (i.e. LLAMA or LLAMA 2).\n\nSome of the constraints seem a little artificial: authors born in a specific year. Some of the constraint questions are out of scope of the design of current LLM's tokenization, \"Book title starts with the letter v\". These constraints don't accurately reflect user interaction with a LLM, I feel."
            },
            "questions": {
                "value": "Can you enumerate all the constraints? It's not clear from the text what exactly the single and double constraints general architecture is."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1731/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698872312131,
        "cdate": 1698872312131,
        "tmdate": 1699636101879,
        "mdate": 1699636101879,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "TMf6AeI5Iy",
        "forum": "b3kDP3IytM",
        "replyto": "b3kDP3IytM",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1731/Reviewer_ZHUe"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1731/Reviewer_ZHUe"
        ],
        "content": {
            "summary": {
                "value": "The paper proposes KITAB, a dataset for evaluating how large language models perform on information retrieval tasks with constraint satisfaction. The author(s) describe the dataset constructions and settings in detail. Evaluated on the proposed dataset, observations from different perspectives indicate that KITAB is still a challenging task for LLMs."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. Timely study of LLMs on constraint satisfaction for information retrieval.\n2. The overall paper is well-written and easy to follow.\n3. Detailed descriptions of the data construction are provided.\n4. The author(s) also promise to release the dataset, as well as code to the community.\n5. The author(s) comprehensively analyzed the results to draw several interesting observations."
            },
            "weaknesses": {
                "value": "1. Concerns of the submission being out-of-scope. The paper undoubtedly stands out as a great resource that makes contributions through its new dataset and the accompanying empirical studies. It certainly serves as a valuable asset for the research community. However, I'm concerned about its suitability as a full paper for ICLR, given the conference's typical focus.\n\n2. The author(s) have indeed conducted a thorough consideration of multiple facets in constructing the dataset, such as the number of constraints, the variety of constraints, and unsatisfiability. Nevertheless, the scope of the proposed dataset is fundamentally narrow, being confined to the domain of books. This domain-specific focus could limit its applicability to a broader range of IR research. It could be better if data from a variety of domains can be included.\n\n3. The evaluations presented are primarily focused on the LLM services provided by OpenAI. While these are undoubtedly among the leading services in the field, the inclusion of open-source LLMs, such as LLaMA 2 chat, in the evaluation process could provide a more comprehensive view of the landscape."
            },
            "questions": {
                "value": "Please refer to \"Weaknesses\"."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission1731/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1731/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1731/Reviewer_ZHUe"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1731/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699083594479,
        "cdate": 1699083594479,
        "tmdate": 1699636101805,
        "mdate": 1699636101805,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "mBtigrMBzl",
        "forum": "b3kDP3IytM",
        "replyto": "b3kDP3IytM",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1731/Reviewer_pbw5"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1731/Reviewer_pbw5"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a dataset KITAB for testing on how LLMs can satisfy constraints in IR. A set of books are collected. Constraints can be set on authors, titles, dates, etc. and can be combined. The evaluation of the results by GPT-3.5 and GPT-4 are evaluated in terms of irrelevance, completeness, etc. Three test conditions are set using different prompts: no-context, self-context and context, providing (or not) the list of books written by an author.\nThe paper examines how GPT-3.5 and GPT-4 perform on different queries. A wide range of experimental results are reported."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The problem examined - constraint satisfaction - is not a widely studied problem. To some extent, this investigation extends the traditional IR to a special type of IR.\nThe data collection and experimental setting are well described.\nThe results may reveal that GPT models are not able to process this type of queries very well, and in particular, those with some constraints.\nThe authors will release the dataset."
            },
            "weaknesses": {
                "value": "The targeted problem is very special. The authors consider it as an IR problem. It resemble more database querying problem. Indeed, once the book references are transformed into structured database, the problem may be much simpler. Howere, as I understand, the intent of the author is not to examine how GPT models can handle such a search problem, but try to use this to test the ability of LLMs to handle queries containing constraints. While I appreciate this effort, I still question on the appropriateness of thFor e task. Instead of expression general constraints in a language, the constraints examined are very specific, and sometimes special. For example, constraints asking a title to end with a letter `v', or titles to be of 4 words, seem very particular. It is expected that a general LLM may not perform the task well because they have not been trained for the task. The main concern about the work is whether the types of constraints used can really test the ability of LLMs to satisfy constraints, or if the tests are on LLMs ability to understand the constraints and to execute filterings of books accordingly in this very special case. Even if LLMs are able to do the job well, would one be able to draw interesting conclusions? The experiments shown in the paper may not allow to draw general conclusions on LLM's ability to satisfy constraints.\nGiven the very special characteristics of the dataset, I question about the value of the KITAB dataset for the purpose of examining LLM's capability of constraint satisfaction in search.\nWhile the ground truth is determined correctly, there may be some problem in the measure of irrelevance and completeness, as some fuzzy matches are allows. As the authors admit, there may be some overestimation of the performance. So the experimental results are only indicative, with some possible rate of errors."
            },
            "questions": {
                "value": "For the estimation of irrelevance or partial satisfaction, one case of match is when one is a string subset of another: For each ki, we check if there exists a book in the ground truth set of books by that author which is either a string subset match for ki (in both directions),... Do you also apply a threshold on the percentage of the substring, or a substring of any length is accepted?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1731/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699421819962,
        "cdate": 1699421819962,
        "tmdate": 1699636101736,
        "mdate": 1699636101736,
        "license": "CC BY 4.0",
        "version": 2
    }
]