[
    {
        "id": "WSd599eN3T",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5702/Reviewer_Bffg"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5702/Reviewer_Bffg"
        ],
        "forum": "bdJaYLiOxi",
        "replyto": "bdJaYLiOxi",
        "content": {
            "summary": {
                "value": "This paper presents a study to investigate vision-language models for scene understanding in automotive scenes. To this end, a benchmark is created. For autonomous driving scene understanding, the benefits for downstream object detection and free space estimation are discussed. Ablation studies are well conducted and the paper is well structured."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "1. The presented work is one of the first to train a radar-language model for autonomous driving scene understanding.\n2. The paper is overall well structured."
            },
            "weaknesses": {
                "value": "1. Please consider comparing your proposed model against some existing adapted language models for driving scene understanding.\n2. Please consider directly comparing your proposed model against some object detection and segmentation models to verify the superiority of your proposed model.\n3. Most of the components from the proposed framework are from existing works. It is hard to find any novel technical designs in the presented framework. Please better clarify the technical novelty and theoretical contributions of the presented work.\n4. Would you consider giving an overview of your proposed framework at the beginning of the methodology section, which can help the readers better understand the work?\n5. The computation efficiency should be discussed, which is critical in automotive scene understanding.\n6. The writing style and presentation quality could be further enhanced. In the introduction, the space between different paragraphs should be enlarged.\n\nSincerely,"
            },
            "questions": {
                "value": "Would you consider presenting some visualization results of object detection and free space segmentation to qualitatively verify the effectiveness of your proposed method?\n\nWhile there are not many works on radar-language models, there are extensive works on adapting large-language models for driving scene understanding. Would you consider discussing the relations and differences between your work and existing works in the related work section? \n\nSincerely,"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5702/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5702/Reviewer_Bffg",
                    "ICLR.cc/2024/Conference/Submission5702/Senior_Area_Chairs"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5702/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1697372727166,
        "cdate": 1697372727166,
        "tmdate": 1700630746677,
        "mdate": 1700630746677,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "TCJgPXrsvj",
        "forum": "bdJaYLiOxi",
        "replyto": "bdJaYLiOxi",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5702/Reviewer_9UPS"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5702/Reviewer_9UPS"
        ],
        "content": {
            "summary": {
                "value": "In this paper, the authors propose a radar spectra-language model (RSLM). The RSLM is built upon CLIP with image as a bridge between radar and text. The RSLM is evaluated by a retrieval task and two downstream tasks. Experiments show that the RSLM has good zero-shot retrieval ability and can boost the performance of two downstream tasks."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. To the best of my knowledge, this is the first paper trying to build a radar spectra-language model.\n2. The fine-tuned VLM for autonomous driving scenes works much better than the off-the-shell CLIP.\n3. The zero-shot retrieval ability of RSLM is impressive, especially for the small objects such as pedestrian and cyclist."
            },
            "weaknesses": {
                "value": "1. The author seems to lack paper writing skills. All the figures are unaesthetic bitmaps with low resolution and some of the figures are not necessary. For Figure 4a, it is better to use formulation instead of python code to describe the loss functions. For Figure 4b, such a simple architecture may be put in the supplement material. \n2. Changing the position encoding without finetuning may cause performance drop, and splitting the image may break some objects on the edge. A better and more common way is to pad black pixels to the top and bottom of the image. \n3. For the detection and segmentation downstream tasks, it is better to show some cases that the pretrained model helps improve the performance, not just numbers.\n4. For autonomous driving tasks, the localization abilitiy is more important than the classification. Could you provide some visualizations such as attention map or GradCAM to see if the retrieved objects are corresponding to the right location?\n\nOther issues:\n1. For Equation 4, a period should be added in the end of the formula. \n2. All the quotation marks are single quotes. Please use backquote in front of the quoted phrases. \n3. Some of the RADIal is mistaken by RADiaL.\n\nOverall, the proposed model is novel and the zero-shot results are interesting and impressive. However, the writing and lack of discussion lowered the final score. I would like to increase my score if the authors would polish the paper and redraw all the figures using vectorgraph."
            },
            "questions": {
                "value": "See above"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5702/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5702/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5702/Reviewer_9UPS"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5702/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698804203541,
        "cdate": 1698804203541,
        "tmdate": 1700730105227,
        "mdate": 1700730105227,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "EdxILrAmab",
        "forum": "bdJaYLiOxi",
        "replyto": "bdJaYLiOxi",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5702/Reviewer_H2ZX"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5702/Reviewer_H2ZX"
        ],
        "content": {
            "summary": {
                "value": "The author proposes Radar-Spectra Language Model (RSLM) to help interpret the difficult modality (by humans).\nIn addition, the modality also does not have many datasets. Thus the approach is to leverage the expressive power Vision Language Model (VLM), and train a radar encoder to mimic the features produced by VLM.\n\nRSLM first fine-tunes CLIP image encoder to road scenes (from self-driving car research). \nThe best image encoder for the task is OpenCLIP.\nTo connect radar spectra to the resulting CLIP features, RSLM trains a radar encoder to output features that are as similar as possible to the CLIP features.\nThe best radar encoder network is Feature Pyramid Network (FPN), and it is trained using MSE loss on retrieval tasks.\nThe resulting features then are inputted to a network that is trained on two downstream tasks: object detection and free-space estimation.\nThe object detection losses are focal and smooth-L1 loss, while free-space estimation is trained using BCE loss.\n\nRSLM is tested to find the optimal components, e.g. usage of OpenCLIP, FPN.\nIn addition, it also analyzes the performance of RSLM on object detection and free-space estimation.\nRSLM is able to surpass the baseline, FFT-RadNet, these two tasks."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "The radar spectrum pre-training to optimize on similarity to fine-tuned OpenCLIP is novel. It allows for pre-training without a need for explicit Radar-spectra dataset."
            },
            "weaknesses": {
                "value": "No discussion on what is still hard to do or not reliable.\nAlso analysis of the varying the difficulty of the input scenes would help answer the previous question."
            },
            "questions": {
                "value": "What self-driving related take would Radar-spectra be able to do well, while other modality cannot or struggle with?\n\nTypos:\nPg. 3, \"Prompt Generation\" section: (e.g. a photo of a {}) -- {} symbol should be replaced."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5702/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698830954375,
        "cdate": 1698830954375,
        "tmdate": 1699636596241,
        "mdate": 1699636596241,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "cCaNTKN8n0",
        "forum": "bdJaYLiOxi",
        "replyto": "bdJaYLiOxi",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5702/Reviewer_RqMG"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5702/Reviewer_RqMG"
        ],
        "content": {
            "summary": {
                "value": "Radar sensors are integral to driver assistance systems and the future of autonomous driving due to their cost-effectiveness, long-range capabilities, and resilience to adverse weather. Typically, radar data is processed in point cloud format, but raw radar spectra contain more detailed information, though they are harder to interpret. This research focuses on enhancing radar spectra interpretability in the automotive context. It introduces a radar spectra-language model that enables natural language queries about scene elements within radar spectra. To address data scarcity, the study aligns the embedding space of a vision-language model. By fine-tuning for automotive scenes, it improves performance. This learned representation benefits scene parsing, enhancing free space segmentation and object detection when integrated into a baseline model."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "This paper introduces the text information into feature fusion for radar spectra interpretability."
            },
            "weaknesses": {
                "value": "1.\tThe framework seems to be a simple combination of existing methods. I didn’t see the specific design for the radar spectra language model. \n2.\tThe experiment of detection is not compared with SOTA methods such as RODNet.\n3.\tWhat is [20] in Table 3?\n4.\tIf the description includes multiple object information, how do you align the text information with the corresponding object?"
            },
            "questions": {
                "value": "If the description is not accurate will the information mislead the model?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "No concerns."
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5702/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5702/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5702/Reviewer_RqMG"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5702/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698837472279,
        "cdate": 1698837472279,
        "tmdate": 1699636596076,
        "mdate": 1699636596076,
        "license": "CC BY 4.0",
        "version": 2
    }
]