[
    {
        "id": "yUPtlJ2pfI",
        "forum": "BIveOmD1Nh",
        "replyto": "BIveOmD1Nh",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5404/Reviewer_9kCY"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5404/Reviewer_9kCY"
        ],
        "content": {
            "summary": {
                "value": "The paper discusses a machine learning approach to speed up molecular docking in virtual screening. The authors introduce a scoring function using fast Fourier transforms and cross-correlation of ligand and protein scalar fields, proving more efficient on benchmark tasks than prior methods. It performs quicker on crystal structures and more reliably on computationally predicted structures."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "4 excellent"
            },
            "strengths": {
                "value": "- The speedup mainly comes from factorization and amortization. Factorizing the interaction into two scalar fields is a novel and effective idea. By computing cross-correlation, the cost of pre-computations can be amortized over a group of operators.\n- The manuscript is well organized, clearly written and easy to follow.\n- The experimental results are impressive."
            },
            "weaknesses": {
                "value": "- The selection of hyper-parameters seems opaque in this document. There's no clear indication of most hyper-parameters being fine-tuned, or it's not showcased, leaving readers unsure about which hyper-parameter has the most substantial influence on the final outcome. For instance, how were decisions made regarding the number of channels or the quantity of spherical harmonics?"
            },
            "questions": {
                "value": "- Could you please clarify what type of information is captured by the different channels?\n- Is the method predominantly dependent on geometric data, such as shape complementarity? Is the chemical data thoroughly utilized?\n- Ellen (cryoDRGN2) lays out a coarse-to-fine approach that subdivides the grid into finer segments. Would it be feasible to incorporate such a technique into this project?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5404/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698731032199,
        "cdate": 1698731032199,
        "tmdate": 1699636547697,
        "mdate": 1699636547697,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "SdDBQ9HbRw",
        "forum": "BIveOmD1Nh",
        "replyto": "BIveOmD1Nh",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5404/Reviewer_BpA5"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5404/Reviewer_BpA5"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes learning scalar fields for proteins and ligands using equivariant neural networks. The fields are cross-correlated to define a scoring function that enables rapid optimization over rigid-body degrees of freedom with fast Fourier transforms (FFTs)."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The idea of learning cross-correlation based scoring functions to enable FFT optimization is interesting.\n2. The experiments demonstrate the speed advantage over traditional tools"
            },
            "weaknesses": {
                "value": "1. Too many model settings to choose from in practice.\n2. The method is only evaluated on simplified tasks, not a complete docking benchmark. Performance in a full virtual screening workflow remains to be tested.\n3. Lack of baselines."
            },
            "questions": {
                "value": "1. Are there any ablation experiments on FFT？\n2. Why is there no significant improvement in the scoring of crystal structures?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5404/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5404/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5404/Reviewer_BpA5"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5404/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698774874738,
        "cdate": 1698774874738,
        "tmdate": 1699636547603,
        "mdate": 1699636547603,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "NGQbyr0EOF",
        "forum": "BIveOmD1Nh",
        "replyto": "BIveOmD1Nh",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5404/Reviewer_ncny"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5404/Reviewer_ncny"
        ],
        "content": {
            "summary": {
                "value": "This paper explores the use of machine learning to accelerate the process of molecular docking, specifically by learning a scoring function that allows for more rapid optimization over rigid-body degrees of freedom using fast Fourier transforms. The scoring function is defined as the cross-correlation of multi-channel ligand and protein scalar fields, and is parameterized by equivariant graph neural networks. The method is benchmarked on two simplified docking-related tasks: decoy pose scoring and rigid conformer docking. The authors demonstrate that their method achieves similar performance to existing scoring functions but with faster runtime. They also highlight the advantages of runtime amortization in virtual screening settings with a common binding pocket."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- The paper proposes a novel approach for learning protein-ligand scoring functions based on cross-correlations of scalar fields. This approach enables the use of Fast Fourier Transforms (FFTs) for rapid search and optimization, which can significantly accelerate pose optimization in molecular docking.\n\n- The paper introduces runtime amortization techniques that lead to significant speed improvements in the scoring function. By precomputing certain coefficients and leveraging the common pocket structure in docking, the total runtime of the method is accelerated, making it more efficient for large-scale docking tasks.\n\n- The proposed scoring function shows comparable performance to existing scoring functions on two simplified docking-related tasks: decoy pose scoring and rigid conformer docking. In some cases, the proposed method even outperforms existing scoring functions, particularly on ESMFold structures."
            },
            "weaknesses": {
                "value": "- Lack of Detailed Hyperparameter Analysis: The paper mentions that hyperparameters are detailed in Appendix D, but the specific hyperparameters used in the experiments are not provided in the extracted content. Without this information, it is difficult to understand the impact of different hyperparameter settings on the performance of the proposed method.\n\n- Limited Discussion on Runtime Amortization: The paper mentions the benefits of runtime amortization with the proposed method, but there is limited discussion on the practical implications and potential limitations of this approach. Further analysis and discussion on the tradeoff between runtime improvements and accuracy would provide a more comprehensive understanding of the method's performance."
            },
            "questions": {
                "value": "- The evaluation of the proposed method is limited to simplified docking-related tasks, such as decoy pose scoring and rigid conformer docking. While the results on these tasks are promising, it is unclear how the method would perform in more complex and realistic docking scenarios.\n\n- The paper compares against Vina and Gnina scoring functions in experiments. I would like to know how this method compares with other SOTA methods/scoring functions [1, 2, 3, 4].\n\n[1] Corso, Gabriele, et al. \"Diffdock: Diffusion steps, twists, and turns for molecular docking.\" arXiv preprint arXiv:2210.01776 (2022).\n\n[2] Stärk, Hannes, et al. \"Equibind: Geometric deep learning for drug binding structure prediction.\" International conference on machine learning. PMLR, 2022.\n\n[3] Koes, David Ryan, Matthew P. Baumgartner, and Carlos J. Camacho. \"Lessons learned in empirical scoring with smina from the CSAR 2011 benchmarking exercise.\" Journal of chemical information and modeling 53.8 (2013): 1893-1904.\n\n[4] Lu, Wei, et al. \"Tankbind: Trigonometry-aware neural networks for drug-protein binding structure prediction.\" Advances in neural information processing systems 35 (2022): 7236-7249."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5404/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699141468680,
        "cdate": 1699141468680,
        "tmdate": 1699636547516,
        "mdate": 1699636547516,
        "license": "CC BY 4.0",
        "version": 2
    }
]