[
    {
        "id": "iuXEhxR3zs",
        "forum": "bP1cZIsAh1",
        "replyto": "bP1cZIsAh1",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6657/Reviewer_cg48"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6657/Reviewer_cg48"
        ],
        "content": {
            "summary": {
                "value": "In this study, the authors tackle the issue of link prediction in edge-incomplete graphs. They introduce PULL, a novel method that applies positive-unlabeled (PU) learning, considering observed links as positive and non-observed ones as unlabeled. PULL iteratively labels \nnew edges with current link predictor. Extensive testing on real-world datasets confirms PULL's superiority over existing methods, marking a significant advancement in practical applications such as social media friend recommendations or academic citation analysis."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The authors study an important and practical problem as the fundamental assumption is that the un-present edges are not ALL negative.\n2. The proposed method is simple and practical to implement on top of any link predictor.\n3. The authors carry out empirical evaluation on five real-world dataset with comparison to several state-of-art methods."
            },
            "weaknesses": {
                "value": "1. Though the authors frame the problem and solution as PU learning, the proposed algorithm is an iterative method to carry out label augmentation. The technique have already been applied to several domains like CV and information retrieval.\n2. The proposed hidden-variable framework is not necessary for the task if no edge potential on the link is assumed. It degenerates to a simple label augmentation with the current link predictor.\n3. The empirical evaluation can be improved in following aspects: (1) As the proposed can be applied on top of any link predictor, it would be interesting to see whether the method can boost the performance of the baselines method; (2) Given the error bar, the proposed method is not statistical significant compared to baselines. Moreover, AUPRC would be a more sensitive metric under imbalanced labels. (3) All the graphs used in the experiments are small with ten of thousand of nodes. It would be interesting to see results on larger graphs."
            },
            "questions": {
                "value": "Please see weaknesses section."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "N/A"
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission6657/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission6657/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission6657/Reviewer_cg48"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6657/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698303961432,
        "cdate": 1698303961432,
        "tmdate": 1700726734711,
        "mdate": 1700726734711,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "dmhS84fHF6",
        "forum": "bP1cZIsAh1",
        "replyto": "bP1cZIsAh1",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6657/Reviewer_qtfB"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6657/Reviewer_qtfB"
        ],
        "content": {
            "summary": {
                "value": "The paper introduces a novel method called PULL, which leverages Positive-Unlabeled Learning (PU learning) to train link predictors more effectively. The approach is backed by both theoretical analysis and empirical tests. The article's experimentation encompasses five real-world datasets, and the results indicate that PULL significantly outperforms existing link prediction methods, achieving state-of-the-art performance. By addressing the inherent limitations of conventional techniques, the PULL method offers a more robust and accurate solution for link prediction in edge-incomplete graphs."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1．The PULL method employs latent variables to account for hidden relationships between unconnected node pairs, thereby effectively addressing the inherent uncertainty in edge-incomplete graphs. This is particularly advantageous as missing links are prevalent in real-world network environments.\n2. The article demonstrates that the PULL method achieves state-of-the-art performance on five different real-world datasets, outperforming existing link prediction algorithms. \n3. The inclusion of a theoretical analysis adds a layer of interpretability to the PULL method, enhancing its credibility and making it easier to understand its underlying mechanisms."
            },
            "weaknesses": {
                "value": "1. The PULL method incorporates latent variables and necessitates the construction of an expectation graph, potentially leading to high computational complexity. This could limit the method's scalability and applicability to large-scale datasets, requiring more computational power and time.\n\n2. The selection of baselines for comparison could be broadened to include more recent methods, thereby providing a more comprehensive evaluation."
            },
            "questions": {
                "value": "Previous link prediction methods have relied too heavily on a given edge-incomplete graph and assumed that the edges of a given graph are all fully observed, without considering unobserved missing links. This approach causes the link predictor to overfit a given edge-incomplete graph, which reduces the accuracy of the prediction."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission6657/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission6657/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission6657/Reviewer_qtfB"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6657/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698723505679,
        "cdate": 1698723505679,
        "tmdate": 1699636761431,
        "mdate": 1699636761431,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "gbcZWlFdwc",
        "forum": "bP1cZIsAh1",
        "replyto": "bP1cZIsAh1",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6657/Reviewer_SEg5"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6657/Reviewer_SEg5"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes PULL (PU-LEARNING-BASED LINK PREDICTOR), an accurate method for link prediction in edge-incomplete graphs. The PULL proposed with the thought that in real-world scenarios the presence of missing edges is frequently observed. Under this assumption, without the consideration of edge-incomplete graph, it may degrade the link prediction performance. Thus, it is important to consider the uncertainties of the given graph to obtain accurate linking probabilities between nodes. Expecting to propose PULL, this paper conducts a theoretical analysis of PULL, studying its relationship with the EM algorithm. The PULL achieves state-of-the-art link prediction performance. In summary, the contributions of this paper are as follows:\n\tProposing PULL, an accurate method for link prediction in graphs\n\tConduct a theoretical analysis of PULL, studying its relationship with the EM algorithm.\n\tThrough the experiments on five datasets, PULL achieves state-of-the-art link prediction performance\nThe manuscript demonstrates notable originality with the introduction of a new method named PULL. This method has potential implications in the domain of graph data mining, which could be of considerable significance. In terms of linguistic presentation, the article is well-composed. The flow between sentences appears logical, making the content coherent and accessible to the reader. The authors have taken care to provide a structured proof of PULL, which strengthens the paper's theoretical grounding. Regarding the experimental section, the authors have provided a detailed description of their experiments, followed by an in-depth analysis of the data. \nOverall, this paper could be a significant algorithmic contribution, I would be willing to increase the score."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "Introduce the consideration of edge-incomplete graph, which has a significant contribution\nThe theoretical analysis and extensive experiments support the claims of the paper\nThe authors provide the code and datasets, enhancing the reproducibility of the results"
            },
            "weaknesses": {
                "value": "The paper could provide more detailed explanations of the experimental setup, such as the hyperparameter settings and the choice of evaluation metrics."
            },
            "questions": {
                "value": "How does the proposed method handle large-scale graphs？ Are there any scalability issues？\nAre there any limitations or potential drawbacks of the proposed method that need to be considered？\nCan the proposed method be extended to handle multi-relational graphs？"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6657/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698847597712,
        "cdate": 1698847597712,
        "tmdate": 1699636761272,
        "mdate": 1699636761272,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "HRCrGN89Go",
        "forum": "bP1cZIsAh1",
        "replyto": "bP1cZIsAh1",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6657/Reviewer_LBxh"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6657/Reviewer_LBxh"
        ],
        "content": {
            "summary": {
                "value": "The authors propose the PULL method for link prediction using positive-unlabeled (PU) learning. The basic idea is to treat all edges as positive samples while treating all non-edges as unlabeled rather than negative samples. They then use a graph convolutional network (GCN) as a link predictor to predict edge probabilities for all the non-edges (unlabeled samples) and turn the ones with the highest probabilities into edges for the next iteration of learning. (In this sense, it shares some similarities with self learning, where predictions are used as labels to re-train a classifier.) The authors further demonstrate an equivalence between their learning algorithm and the well-known expectation-maximization (EM) algorithm under an independence assumption. They show improved link prediction accuracy on several real data sets and demonstrate that they typically achieve maximum accuracy at around the true number of edges in a graph.\n\n*After author rebuttal:* The authors have done a thorough job of answering the reviewers' questions and addressing their concerns with a much improved revision. I have raised my score to 8 to reflect the improvement in quality."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- Creative approach using PU learning for link prediction, a task that seems to be an ideal fit for the assumptions of PU learning.\n- Detailed empirical investigation of several research questions that go beyond improvement in accuracy. I found the analysis of accuracy both with and without the $\\mathcal{L}_C$ term as a function of the number of iterations to be very insightful.\n- Well written paper that was easy to understand and explains the PULL method with an appropriate level of detail."
            },
            "weaknesses": {
                "value": "- While the overall framework is quite principled, some ad-hoc tweaks seem to be necessary to get it working well, such as the way the number of selected edges $K$ is increased or the need for the additional loss function $\\mathcal{L}_C$.\n- ~~There is some other related work on PU learning for link prediction that is not cited (Gan et al., 2022; chapter 4 of Hao, 2021). While they also use PU learning, the approaches seem to be different from what the authors propose, so I don't think it limits the novelty of this paper and find it to be only a minor weakness.~~ This weakness was addressed by the authors in their revision during the discussion phase and no longer applies.\n\nReferences:\n- Gan, S., Alshahrani, M., & Liu, S. (2022). Positive-Unlabeled Learning for Network Link Prediction. Mathematics, 10(18), 3345.\n- Hao, Y. (2021). Learning node embedding from graph structure and node attributes (Doctoral dissertation, UNSW Sydney)."
            },
            "questions": {
                "value": "1. Hao (2021) present their PU learning-based link predictor as a wrapper that could be applied to a variety of different GNNs. Could your proposed PULL approach generalize beyond the GCN that you use in this paper? If so, I think that would be a better comparison--apply your PU learning approach to each GNN and then compare the accuracy of your PU-based model with the normally trained model.\n2. Why keep the top $K$ with the highest predicted probabilities? It seems like taking some sort of random sample based on the probabilities might be a better approach to avoid too much self reinforcement, which could lead to oversmoothing. Taking a random sample could eliminate the need for the $\\mathcal{L}_C$ term."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission6657/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission6657/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission6657/Reviewer_LBxh"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6657/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699057124908,
        "cdate": 1699057124908,
        "tmdate": 1700703528746,
        "mdate": 1700703528746,
        "license": "CC BY 4.0",
        "version": 2
    }
]