[
    {
        "id": "kYCyBTg3ee",
        "forum": "BuFNoKBiMs",
        "replyto": "BuFNoKBiMs",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4790/Reviewer_yduQ"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4790/Reviewer_yduQ"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a new Dec-ODE model to learn marked temporal point processes (MTPPs). The Dec-ODE model takes into account the individual events' influence on the underlying dynamics of the whole process and models it as a neural-ODE. Since the model is decoupled into ground intensity and conditional mark distribution, the new approach can compute the integrals for different parts in parallel, making the training faster. The experiment shows the effectiveness of the new model."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. The proposed approach is novel. The paper takes into account the events' influence on the underlying dynamics of the later process, which is a significant factor but under-explored before.\n2. The decoupled model facilitates parallel computing of the costly integrals that occur in the neural MTPP formulations. \n3. The influence model gives Dec-ODE some extent of explainability as a model of MTPP."
            },
            "weaknesses": {
                "value": "1. There is a lack of comparison in computation time across different models. The parallel computing scheme is shown to reduce the computation time of neural ODE, but it is unclear whether Dec-ODE runs faster than baseline models like THP."
            },
            "questions": {
                "value": "1. I could not find the reference Yang el al., 2020 for the THP baseline. Is the correct one be [1]?\n\n[1] Zuo, S., Jiang, H., Li, Z., Zhao, T., & Zha, H. (2020, November). Transformer hawkes process. In International conference on machine learning (pp. 11692-11702). PMLR."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4790/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4790/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4790/Reviewer_yduQ"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4790/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698641952275,
        "cdate": 1698641952275,
        "tmdate": 1699636461370,
        "mdate": 1699636461370,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "SXF2OkUWN9",
        "forum": "BuFNoKBiMs",
        "replyto": "BuFNoKBiMs",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4790/Reviewer_Ux3F"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4790/Reviewer_Ux3F"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a new neural ODE-based framework for modeling marked Hawkes/mutually-exciting point processes. The framework models the intensity function (of time) as a summation of event-triggered trajectories, each of which solves a neural ODE with an initial state that depends on the time of each event and its mark. The additivity of event-triggered trajectories on the intensity function allows us for the efficient parallel computation for model training and the explainable analysis of the dependence between events, which is the advantage over previous neural network-based Hawkes processes."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- The idea of using neural ODEs to model the effect of an event on the subsequent events (essentially, triggering kernel) in temporal point processes is novel and promising.\n- The parallel computing scheme of fitting in the proposed model is beneficial for practical purposes.\n- The validity of the proposed model was evaluated on various real-world data."
            },
            "weaknesses": {
                "value": "- The authors insist that an advantage of the proposed method (Dec-ODE) over conventional methods (e.g., Yang et al., 2020) is that Dec-ODE can compute multiple integrations simultaneously [Section 3.2]. But Dec-ODE demands to solve ODEs to compute integrations, which is generally more time-consuming than Monte Carlo integrations needed in conventional methods. In Experiment, there are no comparative analysis about computation time (sec/iter), and the authors’ insistence about computation efficiency remains to be verified. \n- The authors insist that an advantage of Dec-ODE over conventional methods (e.g., Yang et al., 2020) is the explainability due to the decoupled structure. But the decoupled structure has been adopted intensively in the literature, which were not in the benchmark models in Experiment. To verify the insistence, the authors need to compare Dec-ODE with references with the decoupled structure, which would make the pros/cons of the proposed model clearer.\n- RMTPP is a standard benchmark model in the literature, and should be included in comparative experiments. Otherwise, the authors need to mention the reason for not including it. \n- The explanation of the experiment setup seems to be inadequate for reproducibility. The details of neural networks (e.g., activation functions) and the machine spec used in the experiments should be shown.\n- The detailed equation about how to compute the derivative of the likelihood regarding model parameter is not shown.\n- Discussions about the limitation of the proposed model are not in the paper.\n- To the best of my knowledge, there are sentences that seem technically inaccurate as follows, which raises a question about the paper’s quality:\n\t- [3rd paragraph in Section 1] the authors introduce neural Hawkes process (Omi et al., 2019) as a marked temporal point process (MTPP), but the Omi’s paper did not consider the marks of each event. Also, there are two Omi’s papers (2019a and 2019b), but they look identical.\n\t- [2nd paragraph  in Section 2] the authors explains that the modeling of intensity function is preferred over the pdf $f^*(t)$ due to the complex dynamics of $f^*(t)$, but the complex dynamics depending on the past events is not limited to $f^*(t)$.\n\t- [2nd paragraph in Section 2] $\\\\int_0^{\\\\infty} f^*(s) ds = 0$ is correctly $\\\\int_0^{\\\\infty} f^*(s) ds = 1$.\n\t- [3rd paragraph in Section 2] the sentence “$\\\\mathcal{N}_g = \\\\{ t_i \\\\}$ is a temporal point process” seems to fail to explain the definition of $\\\\mathcal{N}_g (t_N)$ in Eq. (2). Do the authors mean that $\\mathcal{N}_g (t)$ is a counting process?\n\t- [Eq. (9)] the definition of $f_{\\theta}(h,t)$ is not found.\n\t- [References] The authors of Transformer Hawkes process are not Yang et al., but Zuo et al."
            },
            "questions": {
                "value": "See Weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4790/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4790/Reviewer_Ux3F",
                    "ICLR.cc/2024/Conference/Submission4790/Senior_Area_Chairs"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4790/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698703374404,
        "cdate": 1698703374404,
        "tmdate": 1700153919844,
        "mdate": 1700153919844,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "odbbSEXBP0",
        "forum": "BuFNoKBiMs",
        "replyto": "BuFNoKBiMs",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4790/Reviewer_A48s"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4790/Reviewer_A48s"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a new modeling framework for marked point processes, where the mark distribution and the conditional intensity function are treated as two separate modeling objectives. These two objectives are assumed to depend on a common latent process that is evolved through a neural ODE model. The proposed algorithm is more computationally efficient than existing methods and provides more interpretable model estimates. The effectiveness of the algorithm is demonstrated by comparisons of five benchmark data sets to state-of-art methods."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "The paper is well-written and the presentation is clear. The proposed idea is sound and may have a large potential impact."
            },
            "weaknesses": {
                "value": "No simulation studies are conducted to demonstrate the estimation accuracy of the proposed algorithm when the data-generating process is assumed in the paper."
            },
            "questions": {
                "value": "The paper is quite well written, so I don't have many questions. My major concern is that no simulation studies are conducted to demonstrate the estimation accuracy of the proposed algorithm when the data-generating process is assumed in the paper. Some comparisons with existing methods are desirable as well. That way, one can have better ideas of the advantages and limitations of the proposed method, in terms of estimation accuracy, predictive accuracy, and computing times."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4790/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699377076416,
        "cdate": 1699377076416,
        "tmdate": 1699636461182,
        "mdate": 1699636461182,
        "license": "CC BY 4.0",
        "version": 2
    }
]