[
    {
        "id": "4csVRJijH3",
        "forum": "BxPqibGUPR",
        "replyto": "BxPqibGUPR",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6456/Reviewer_zjbm"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6456/Reviewer_zjbm"
        ],
        "content": {
            "summary": {
                "value": "This paper presents a method of prompt engineering for automatic vector embedding creation via LLM.\nHowever, this method is oversimple and there is lack of solid experiments to test the methods.\n\nWe suggest the authors:\n1. Some incremental work cannot be present in top conference. There shall be insights into problems for top papers.\n2. Address more your work because the background that we all know shall not be present more than one sentence.\n3. Various experiments are necessary top access your work. You can enhance your experiment design."
            },
            "soundness": {
                "value": "1 poor"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "No"
            },
            "weaknesses": {
                "value": "An oversimple model presenting no insight."
            },
            "questions": {
                "value": "No"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "1: strong reject"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6456/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698639389448,
        "cdate": 1698639389448,
        "tmdate": 1699636721944,
        "mdate": 1699636721944,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "LOFbBGqGhm",
        "forum": "BxPqibGUPR",
        "replyto": "BxPqibGUPR",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6456/Reviewer_irAu"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6456/Reviewer_irAu"
        ],
        "content": {
            "summary": {
                "value": "This paper presents VibeSpace, a technique that utilizes large language models to automatically generate vector embedding spaces for any domain in an unsupervised way. VibeSpace enables the evaluation of entity similarity and the creation of intelligent mappings between vector spaces of non-overlapping domains. The study includes experimental results that assess the quality of the generated datasets, the interpretability of the embedding spaces and the production of cross-domain mapping based on LLM."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The data acquisition process is fully automated with LLMs, achieving good quality as validated in Section 4.1."
            },
            "weaknesses": {
                "value": "1. Section 3.3 lacks clarity. How the mappings are constructed is not clearly elaborated\n2. Whether the embeddings generated by VibeSpace can really help the cold-start problem in recommender system as claimed in the paper remains to be validated. \n3. Section 4.1 did a comparison of the proposed LLM-based dataset with non-LLM-based one, while Section 4.2 doesn't. How much would the embedding spaces built upon the LLM-based be better than non-LLM based ones?"
            },
            "questions": {
                "value": "1. In Figure 2, we can see that the points with the same label (e.g. thrilling) actually scatters around with other labels stepped in (instead of concentrating in one area). Does this mean that the embedding spaces are not quite ideal to support the claim of \"meaningful and interpretable positioning within vector spaces\"?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6456/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698721137005,
        "cdate": 1698721137005,
        "tmdate": 1699636721813,
        "mdate": 1699636721813,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "PnQGdUYWbM",
        "forum": "BxPqibGUPR",
        "replyto": "BxPqibGUPR",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6456/Reviewer_jsQn"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6456/Reviewer_jsQn"
        ],
        "content": {
            "summary": {
                "value": "The paper, titled \"VibeSpace: Automatic Vector Embeddings for Multimedia Data\", presents a novel approach to automatically generate vector embeddings for multi-domain data. The authors claimed VibeSpace can collect or extract extensive relevant datasets for an arbitrary domain, and it can address the cold-start problem in recommender systems. \n\nVibeSpace first collect relevant datasets in terms of sentences consisting of lists of similar entities of the same domain. And then use Word2Vec to learn entity embeddings. Finally, it utilized autoencoder to perform domain mapping."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "1. The idea of collecting relevant or similar entities to enrich the context is intuitive.\n2. The author provided an actionable pipeline to extract embeddings based on the access to the knowledge rich LLM.\n3. The author provided visualizations for the embedding space that VibeSpace provided which help the audience to understand."
            },
            "weaknesses": {
                "value": "1. Lack of novelty, the idea of extracting similar text/entity to enrich the context has been studied with [1]. The example reference extracts data from a given corpus and this work extract from LLM.\n2. Unclear description about Sec 3.3. A lot of details are missing with respect to vector space mapping.\n3. Lack of comparison in the design. The author uses Word2Vec to learn the embedding. However, there is no discussion on why this method is chosen and if there are any alternatives and why Word2Vec is superior to its competitors.\n4. Datasets chosen does not consist with the claim. The author claims that in Sec 3.1 movies, books, and songs are non-overlapping domains, which is not convincing. For example, a lot of movies are originated from books.\n5. Unclear metrics in Sec 4.2. In Table 2-4, a lot of figures are presented but without further explanation.\n\n[1] Meng, Yu, et al. \"Weakly-supervised neural text classification.\" proceedings of the 27th ACM International Conference on information and knowledge management. 2018."
            },
            "questions": {
                "value": "1. Why do you use Word2Vec, are there any alternatives?\n2. What did you do for Sec 3.3? More details are urgently needed in this section.\n3. What is your purpose by putting Figure 1 here? What are those figures for?\n4. For Table 2-4, how can we interperate those tables? How to measure the quality of the separation? Some of the F1 scores are 0.00.\n5. One of your contributions is about cold-start problem. Is there any empirical result that can support your claim?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6456/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698727926738,
        "cdate": 1698727926738,
        "tmdate": 1699636721698,
        "mdate": 1699636721698,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "uFNLJBvY7N",
        "forum": "BxPqibGUPR",
        "replyto": "BxPqibGUPR",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6456/Reviewer_8jfG"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6456/Reviewer_8jfG"
        ],
        "content": {
            "summary": {
                "value": "The paper presents VibeSpace, which extracts entities and relations of entities (mainly in the domains of movies, songs, and books), both in-domain and cross-domain. The author(s) then trains a variant of Word2Vec to get the synthetic vector space. Experiments on label classification, visualization, and mapping consistency are conducted."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The idea is interesting, i.e., synthesizing vector space via prompting LLMs to generate entities and relations of entities, especially those cross-domain relations.\n2. Timely study on how well can LLMs generate entities and relations of entities.\n3. The paper is well-written and easy to follow."
            },
            "weaknesses": {
                "value": "1. Over-claiming.\n    1. In the Abstract, the author(s) said \"These representations provide a solid foundation upon which we can develop ... and initialise recommender systems, demonstrating our methods utility as a data-free solution to the cold-start problem\".\n    2. In the Instruction, the author(s) said that \"our approach addresses a long-standing challenge within the realm of recommender systems\".\n    3. However, no experiment is conducted on how well the proposed vector space actually alleviates cold-start problem. As the author(s) said in Conclusion: \"we feel our approach could have distinct value as a solution to the cold-start problem for recommender systems\", the statements in Abstract and Introduction are more like what the author(s) will do in their future work, misleading the audience about how far the state has reached.\n2. The author(s) said that \"This removes the need for costly data acquisition\". However, compared to traditional data engineering, whether calling large language models hundreds of thousands of times really makes the cost lower is a problem.\n3. The paper only examines one large language model, i.e., via calling ChatGPT API. It could be better if more LLMs like LLaMA, Vicuna are evaluated.\n4. Experiments in Figure 3 show that the proposed VibeSpace has good mapping consistency. However, we still do not know how existing methods perform on the consistency of mapping. It could be better if experiments that compare VibeSpace with other baselines were conducted.\n5. Code, datasets, or even samples of extracted entities, are not available.\n6. \"our dataset also contains 12571 titles which are not in the MovieLens dataset, highlighting our methods ability to uncover niche entities by following chains of 'similar entities' until we arrive at the obscure\". In my opinion, the statement is biased because MovieLens dataset (e.g., depending on the used version, if is MovieLens-1M, the movies are all before 2003) can be not so up-to-date compared to LLMs (e.g., 2019 for ChatGPT)."
            },
            "questions": {
                "value": "There has been evidences that LLMs tend to generate popular entities. Whether the proposed method will suffer from popularity bias?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission6456/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission6456/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission6456/Reviewer_8jfG"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6456/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699068251659,
        "cdate": 1699068251659,
        "tmdate": 1699636721557,
        "mdate": 1699636721557,
        "license": "CC BY 4.0",
        "version": 2
    }
]