[
    {
        "id": "iF9t7VoowD",
        "forum": "BydD1vNMCV",
        "replyto": "BydD1vNMCV",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2868/Reviewer_GYhy"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2868/Reviewer_GYhy"
        ],
        "content": {
            "summary": {
                "value": "In this paper, authors show how the sparse learning theory with Lasso penalty can be adapted to deep neural networks (StoNet) from linear models, and provide a recursive method named post-StoNet to quantify the prediction uncertainty for StoNet.\n\nThe numerical results suggest that the StoNet significantly improves prediction uncertainty quantification for deep learning models compared to the conformal method and other post processing calibration methods."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The work is a combination of existing methods including StoNet, IRO, ASGMCMC and Lasso penalty.\n2. The background introduction, problem definition and theoretical derivation are well-described."
            },
            "weaknesses": {
                "value": "1. The main issues of this paper including **novelty and soundness of the results**.\n2. Abstract description is not clear, and writing needs to be improved.\n3. Comparision with other method is too few and experiment performance improvement is marginal."
            },
            "questions": {
                "value": "1. In Figure 2, there is slight difference with regard to overall distribution between StoNet and DNN. The variance of StoNet is larger than DNN, which seems like that vanilla DNN performs better than StoNet. The result is confusing.\n2. Figure 3 lacks legend, what does lines of different color represent?\n3. In Table 2, the ACC results (mean and std.) of 'No Post Calibration' method and 'Temp. Scaling' method are exactly the same, which is counter-intuitive and is of low probability, what is the reason.\n4. As for result in Table 3, the compared method (Vovk et al., 2005) is proposed too long ago. To be more convincing, further ablation study should be done, for example, compare with vanilla StoNet or other related works.\n5. In Table 1 and 2 of Liang et al. (2022), results of massive datasets and methods are listed, which is not discussed in this paper."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission2868/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2868/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2868/Reviewer_GYhy"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2868/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698664983414,
        "cdate": 1698664983414,
        "tmdate": 1699636230374,
        "mdate": 1699636230374,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "ccuNjGFuuC",
        "forum": "BydD1vNMCV",
        "replyto": "BydD1vNMCV",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2868/Reviewer_HASS"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2868/Reviewer_HASS"
        ],
        "content": {
            "summary": {
                "value": "The paper is based on StoNet, a stochastic version of a deep neural network where in each layer, (Gaussian) noise is injected into the latent predictions. The authors study how sparsity regularization influences results obtained from StoNet and suggest to propagate uncertainty through the network to obtain prediction uncertainty."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- [S1] Originality: As far as I can tell, the authors are the first to study sparsity regularization in StoNet\n- [S2] Clarity: The paper is well written and easy to read"
            },
            "weaknesses": {
                "value": "- [W1] Soundness: \n    + Some assumptions (already in StoNet) seem to be not realistic (see C1) \n    + It's unclear, how the algorithm actually enforces sparsity (see C2)\n    + The empirical experiments are limited (see C3)\n    + Theoretical guarantees for selection and subsequent inference are not perfectly clear (see Q1, Q2)\n- [W2] Originality / Novelty: It often does not get clear what the additional contribution is when compared to StoNet; see also first point on experiments in C3\n- [W3] Quality / Presentation: quality of some graphics is really bad (Fig 2 and 3 almost not possible to read)\n\n\n### Comments:\n\n- [C1]: There is no one \"true parameter\" in deep neural networks given their [overparametrization-induced and hidden symmetries](https://openreview.net/pdf?id=FOSBQuXgAq) and I don't see how Assumption A2 holds in practice. While the authors recognize this, writing \"Given nonidentifiability of the neural network model, Assumption A2 has implicitly assumed that each $\\theta$ is unique up to the loss-invariant transformations, e.g., reordering the hidden neurons of the same hidden layer and simultaneously changing the signs of some weights and biases\", it does not get clear what this restriction of the Assumption implies and does certainly not account for scaling symmetries present in ReLU networks or hidden symmetries as mentioned above.\n- [C2]: How is the model optimized with a Lasso penalty given that this penalty is [non-smooth and stochastic variants hence do not yield exact-zero solutions](https://arxiv.org/pdf/2307.03571.pdf)?\n- [C3]: the experiments \n    + mainly present coverage rates and calibration results and it is unclear how much of this performance comes from StoNet itself (missing ablation study)\n    + only contain one simulation study with a fixed setup (restrictive)\n    + do not elaborate on the selection quality except for the small simulation study (missing empirical evidence)"
            },
            "questions": {
                "value": "- [Q1] what seems a bit like magic to me: the paper proves consistent structure selection but without any requirements on the feature matrix (writing \"almost any training data\"). Afaik it requires rather restrictive assumptions [e.g., here](https://arxiv.org/pdf/1603.06177.pdf) even in much simpler cases such as $l_1$-regularized linear models. Maybe I overlooked that in all the assumptions in the Appendix. Would be great if authors could elloborate on this.\n- [Q2] further: how comes that it requires special techniques -- again even in the linear Lasso model -- to obtain valid inference after selection (post-selection inference) and this is not a problem in this much more complicated network?\n- [Q3] See C2"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2868/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698829498506,
        "cdate": 1698829498506,
        "tmdate": 1699636230274,
        "mdate": 1699636230274,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "ar2fUG8CkR",
        "forum": "BydD1vNMCV",
        "replyto": "BydD1vNMCV",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2868/Reviewer_9U3v"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2868/Reviewer_9U3v"
        ],
        "content": {
            "summary": {
                "value": "The authors present a follow up on the work on StoNet, a model where the intermediate outputs of the layer are treated as latent variables.\n\nThe authors provide several results helping to understand the behaviour of StoNet and empirical simulations showing its performance on real-world data."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The paper involves an interesting idea of StoNet, but this appears to be heavily based on the previous work."
            },
            "weaknesses": {
                "value": "The differences in Table 1 look very small and I wonder if they are statistically significant at all?\n\nI think more empirical evidence would make the paper stronger. The authors discuss scalability, but there's only one experiment with bigger networks (Table 2) where the gains are very marginal?\n\nI don't think overparametrisation of the NNs is necessarily a bad thing, it seems more like an open research question?\n\nThe proposed MAP learning does not really utilise the power of the probabilistic model.\n\nThe authors should compare in more detail to existing approaches introducing noise to the network, e.g. Gaussian dropout. Overall, I think the work should be more linked to the existing research.\n\nThere are works considering similar treatment as section 4 that should be at least cited, e.g. [1].\n\nThe developed theory mostly relies on the convergence of MAP/MLE, which happens to be very slow in practice.\n\n[1] Anqi Wu, Sebastian Nowozin, Edward Meeds, Richard E. Turner, José Miguel Hernández-Lobato, Alexander L. Gaunt Deterministic Variational Inference for Robust Bayesian Neural Networks"
            },
            "questions": {
                "value": "See weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission2868/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2868/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2868/Reviewer_9U3v"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2868/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699226113160,
        "cdate": 1699226113160,
        "tmdate": 1699636230203,
        "mdate": 1699636230203,
        "license": "CC BY 4.0",
        "version": 2
    }
]