[
    {
        "id": "oz4IzJItZl",
        "forum": "bZHz9WYs9z",
        "replyto": "bZHz9WYs9z",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5318/Reviewer_VenB"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5318/Reviewer_VenB"
        ],
        "content": {
            "summary": {
                "value": "This paper introduces a new framework called Heterophilous Triple Flows (HTFlows) for generating molecules with desired properties. It discusses the limitations of existing approaches, such as graph neural networks with heterophily, and proposes HTFlows as a solution to address these issues and improve performance on chemoinformatics benchmarks."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "The presentation is clear.\n\nThe contribution is good if more evidence is provided"
            },
            "weaknesses": {
                "value": "See below"
            },
            "questions": {
                "value": "1. Researchers already find that heterophily is not always harmful and homophily assumption is not always necessary for GNNs [1,2,3,4]. How does this paper align with these works?\n\n2. Heterophily was usually studied in node classification tasks when graph-aware models underperform graph-agnostic models. I'm not sure if heterophily will also cause performance degradation of graph-aware models in generative tasks. Do you have any evidence or references? If the answer is yes, it would be a good contribution.\n\n3. In equation (2), what is S?\n\n4. Ablation study is missing. How does each component in heterophilious message passing contribute to the performance gain?\n\nIf the authors can answer the above questions well, I will raise my score.\n\n\n[1] Is Homophily a Necessity for Graph Neural Networks?. In International Conference on Learning Representations 2022.\n\n[2] Revisiting heterophily for graph neural networks. Advances in neural information processing systems, 35, 1362-1375.\n\n[3] When do graph neural networks help with node classification: Investigating the homophily principle on node distinguishability. arXiv preprint arXiv:2304.14274.\n\n[4] Demystifying Structural Disparity in Graph Neural Networks: Can One Size Fit All?. arXiv preprint arXiv:2306.01323."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5318/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5318/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5318/Reviewer_VenB"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5318/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698532945465,
        "cdate": 1698532945465,
        "tmdate": 1700691000853,
        "mdate": 1700691000853,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "hpQ4QLqJ9A",
        "forum": "bZHz9WYs9z",
        "replyto": "bZHz9WYs9z",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5318/Reviewer_LyRR"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5318/Reviewer_LyRR"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes the heterophyllous triple flow model to handle the heterogeneity of molecular graph generation. Its key idea is to introduce multiple interactive flows which \"capture\" heterophily patterns in the molecular space."
            },
            "soundness": {
                "value": "1 poor"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "This paper tackles the problem of generating heterophilious molecular graphs, where vertices may have different features (e.g., atom types) even when they are adjacent to each other."
            },
            "weaknesses": {
                "value": "### Weak experiments\n\nMy main criticism is that the experiments are not enough to verify the practical relevance of the proposed work. \n\nThe authors seem to consider the baselines proposed by Verma et al., 2022 as state-of-the-art. However, there exists a plethora of molecular generative models since the work of Verma et al., 2022. Just to list a few examples, one could consider STGG (Ahn et al., 2022), GDSS (Jo et al., 2022), Digress (Vignac et al., 2022), and GraphARM (Kong et al., 2023). The authors could even consider SMILES-LSTM (which demonstrates surprisingly good performance) for more comprehensive baselines. \n\n### Lack of justification \n\nI was unable to find a good justification for why the proposed flow network better generates heterophilious graphs. The only explanation I got was that \"binary masking ensures that only part of the input is transformed, allowing the model to retain certain features while altering others, enabling the flow to capture intricate data distribution characteristics\". I do not understand why retaining certain features is related to \"capturing intricate data distribution characteristics\"."
            },
            "questions": {
                "value": "I think one could easily incorporate the heterophilious nature by parameterizing molecular generative models with GNNs specifically designed to mitigate over smoothing and better recognize heterophilious graphs. Could the authors provide explanation on why simply using such heterophilic GNNs cannot resolve the considered issue?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5318/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698729117383,
        "cdate": 1698729117383,
        "tmdate": 1699636533477,
        "mdate": 1699636533477,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "Pr9nlChcsC",
        "forum": "bZHz9WYs9z",
        "replyto": "bZHz9WYs9z",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5318/Reviewer_AKoh"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5318/Reviewer_AKoh"
        ],
        "content": {
            "summary": {
                "value": "This paper aims to tackle the problems of using GNNs for molecule generalization under the heterophilious input setting, where some conventional GNNs could fail on this setting due to their strong homophilious assumption. Specifically, the paper designs a new GNN model with three interactive flows to capture heterphiliy patterns in the molecular space. The effectiveness of the proposed model are validated by the experiments on several benchmark datasets for molecule generation and modelling."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The paper is clear and well-structured.\n \n 2. The proposed ACL blocks in the model are shown to be inherently inversable."
            },
            "weaknesses": {
                "value": "1. The level of homophily in a graph is defined based on node labels in GNN literature, where high homophily is observed when neighboring nodes share the same labels, and vice versa. However, In the design of the paper’s heterophilious message passing layer, i.e., equation (6), they define the homophily of nodes as the cosine similarity between pair node embeddings. This could be problematic since the cosine similarity between pair node embeddings might not align with their labels. As a result, the proposed model may inherently fail to work well in the cases that the cosine similarity between pair node embeddings is not aligned with their labels.\n\n 2. Numerous GNN architectures have been developed for heterophilic graphs, where they have been demonstrated their effectiveness for heterophilious graphs comes from their ability to work as high-pass filters. However, there is no solid justification indicating that the proposed heterophilic flows can effectively handle heterophilic graphs. Additionally, it is also not clear that the benefits of the designed heterophilic flows, as compared to directly adapting existing heterophilic GNN structures for molecular generalization. More discussion here would be helpful.\n\n 3. Lack of ablation studies on different components. The proposed model consists of several components, including bond flow and heterophilious atom flow. Moreover, the heterophilic atom flow encompasses three interacting flows: the central, homophilic, and heterophilic flows. It remains unclear which component is most crucial or how each contributes to the model's overall performance. A detailed breakdown and analysis would provide greater clarity.\n\n 4. The paper claims that existing GNN models for molecule generalization have overlooked the repulsions between dissimilar atoms and are vulnerable to oversmoothing. However, it is not evident that the proposed model effectively addresses the oversmoothing issue. It would be better to provide more explanations on this and conduct experiments to validate the oversmoothing claim.\n \n 5. Given that this study seeks to address the challenges of heterophily and oversmoothing in GNNs for molecular generalization, it would be beneficial to delve deeper into papers on GNNs concerning heterophilious graphs and oversmoothing problems in the related work section."
            },
            "questions": {
                "value": "Please refer to the weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5318/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698824769381,
        "cdate": 1698824769381,
        "tmdate": 1699636533334,
        "mdate": 1699636533334,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "fbpdipZWes",
        "forum": "bZHz9WYs9z",
        "replyto": "bZHz9WYs9z",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5318/Reviewer_x2it"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5318/Reviewer_x2it"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes HTFlows, a flow-based method for molecular graph generation. It addresses heterophily in molecules while existing molecular graph generation methods using graph neural networks make a homophily assumption that neighboring nodes have similar features. HTFlows uses multiple interactive normalizing flows to model homophilic, heterophilic, and central node patterns to capture nuanced molecular dependencies. Extensive experiments benchmark performance on QM9 and ZINC-250K datasets in molecule generation and property optimization tasks. Key results show HTFlows achieves high validity without extra checks, optimizes target properties well, and generates high-quality diverse molecules."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "This paper effectively addresses the challenge of modeling heterophily in molecular graphs, a problem that challenges conventional homophily-based approaches. The proposed interactive multi-flow architecture enables the capture of nuanced molecular patterns across varying homophily-heterophily levels, enhancing versatility in representation. The paper rigorously evaluates the proposed method across various metrics on standard molecule datasets. The performance of HTFlows is comprehensively demonstrated by comparing it to state-of-the-art baselines like GraphDF and MoFlow."
            },
            "weaknesses": {
                "value": "The proposed HTFlows only brings improvements on limited metrics when compared to state-of-the-art baselines (as listed in Table A4, A5, and Table 3), which constrains its contribution and impact. Besides, it is unclear about the connections between the improved metrics and the introduced heterophilious triple flows. It would be more convincing to bring theoretical analysis and ablation study to demonstrate the effect of emphasizing heterophily."
            },
            "questions": {
                "value": "1. Why the mixing of ACL in the heterophilous atom flow are performed one by one for each atom type rather than in parallel?\n2. It seems that the histograms in Fig. 6 and 7 do not match the results in Table A4 and A5. For example, why the molecular weights in Fig.6 are mainly 75~175, but the mean molecular weights in Table A4 are much smaller? Besides, as shown in Figure 7, the molecular weights of GraphDF seem to have a significantly lower mean value than MoFlow and HTFlows based on their histograms, but HTFlows has the lowest mean molecular weight as listed in Table A5."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5318/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5318/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5318/Reviewer_x2it"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5318/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699234535811,
        "cdate": 1699234535811,
        "tmdate": 1700716836044,
        "mdate": 1700716836044,
        "license": "CC BY 4.0",
        "version": 2
    }
]