[
    {
        "id": "5pj9K7Spgh",
        "forum": "cJs4oE4m9Q",
        "replyto": "cJs4oE4m9Q",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7228/Reviewer_5jY6"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7228/Reviewer_5jY6"
        ],
        "content": {
            "summary": {
                "value": "The paper suggests a new technique of hypersphere learning via a particular decision boundary to tackle the problem of Anomaly Detection. The boundary in this case is an orthogonal projection layer and the training data distribution is aligned with this geometry, a fact that encourages the correct prediction. The suggested methods seem to be ubiquitous in the data modalities, with emphasis on the graph data, and this is supported by numerical experiments."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- The paper is well written and the propositions seem sound.\n\n- The paper solves the optimization problem (1) and this choice seems novel. The existing literature presented the following restrictions: (i) the decision surface inferred is not a standard hypersphere but at times a hyperellipsoid, leading to insufficient accuracy, (ii) the 'regular' data are located far from the hypersphere center, thus spoiling the normality of the predicted region and allowing anomalous data to fall into the sphere, (iii) the hypersphere is shows high sparsity leading to misclassification of the anomalous points.\nThe paper suggests (i) DOHC that employs an orthogonal projection layer that limits the evaluation errors, and (ii) DO2HSC that faces the second issue above using two co-centered hyperspheres. \nThe use of a regularization term in the objective function (1) avoids the correlation of the features and the problem of different variances. \n\n- The authors provide extensive experiments in three different cases of datasets. Each case contains several datasets. The comparison to SOTA methods seems superior for the DOHSC and DO2HSC proposed model. \n\n- The proposed architecture is applicable in graph data based on the optimization of (16) function."
            },
            "weaknesses": {
                "value": "Minimal weaknesses. \nA weakness that can be pointed out is the use of one class in total for the anomaly detection problem, but this is clarified by the authors.\nGood paper overall."
            },
            "questions": {
                "value": "- Can the authors offer some details about the averaging of scores (table 1)? Did they conduct repeatedly the same experiment like in tables 2,3?\n- In the tabular data-based experiments, can the authors say why they chose F1 and not AUC ROC again, like in the graph data? \n- For the visualization of the data, the paper pictures it 'by setting the projection dimension to 3'. Thus, was any further processing of the output applied? E.g. a dimensionality reduction technique? If yes, the AUC ROC score after this outcome may have changed from the table 3 score."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7228/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698115463133,
        "cdate": 1698115463133,
        "tmdate": 1699636860886,
        "mdate": 1699636860886,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "TSDqshrzLo",
        "forum": "cJs4oE4m9Q",
        "replyto": "cJs4oE4m9Q",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7228/Reviewer_7Ufo"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7228/Reviewer_7Ufo"
        ],
        "content": {
            "summary": {
                "value": "This study centers on hypersphere-based anomaly detection challenges, presenting the orthogonal projection layer as an enhancement for deep SVDD. Additionally, the authors introduce the concept of bi-hypersphere anomaly detection. The effectiveness of these proposed modules is rigorously validated through a series of comprehensive experiments and insightful visualizations. Furthermore, the application of the two algorithms is extended to address graph-level anomaly detection, showcasing their versatility and potential impact in various contexts."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "+ The paper's content is grounded in sound research, with a particularly innovative contribution in the form of the bi-hypersphere concept.\n\n+ The research is substantiated by a comprehensive and diverse set of experiments, encompassing three distinct data types. The visualizations effectively convey the superiority of the proposed method.\n\n+ The visualization results pertaining to anomaly detection are distinctive and intuitive, enhancing the paper's overall quality. The improvement over the previous baselines is remarkable."
            },
            "weaknesses": {
                "value": "- Why can the orthogonal projection layer ensure a standard hypersphere?\n\n- The occurrence of the \"soap bubble phenomenon\" needs further clarification. Does it mean incompletely optimized?\n\n- We know that Deep SVDD compels normal data close to the center of the decision boundary, why do anomalies appear within this decision boundary? What are the main differences and similarities between normal data and these anomaly data?\n\n- Authors claimed that DO2HSC is to control training data to be more compact. I think the complete optimization of DOHSC can also reach this target, so what advantages does DO2HSC have about data compactness?\n\n- Some details need to be double-checked, such as the bolding of three results in Table 13, Class 1 of MUTAG result, while the caption specifies marking only the best two results."
            },
            "questions": {
                "value": "See Strengths and Weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7228/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698426107947,
        "cdate": 1698426107947,
        "tmdate": 1699636860776,
        "mdate": 1699636860776,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "fURYMKaWtx",
        "forum": "cJs4oE4m9Q",
        "replyto": "cJs4oE4m9Q",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7228/Reviewer_mQBk"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7228/Reviewer_mQBk"
        ],
        "content": {
            "summary": {
                "value": "The paper studies the problem of unsupervised anomaly detection. The authors proposed a deep orthogonal hypersphere compression method, which has two variants. The authors also provided theoretical analysis. The experiments on images, tabular data, and graphs showed that the proposed methods are more effective than the competitors."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "4 excellent"
            },
            "strengths": {
                "value": "* The motivations and technique details of the proposed methods are clearly illustrated. The visualizations (e.g. Figures 1-4, 12 and 13) are very impressive.\n* The ideas especially the two concentric hyperspheres for anomaly detection are novel and interesting. They provide new insights into anomaly detection.\n* The theoretical analysis such as Propositions 1, 2, and 3 make the paper solid.\n* The experiments are extensive. There are image datasets (e.g. CIFAR10), tabular datasets, and six graph datasets.\n* More importantly, in the experiments, the proposed methods significantly outperformed state-of-the-art anomaly detection methods such as DROCC (2020), PLAD (2022), and GLocalKD (2022) and OCGTL (2022)."
            },
            "weaknesses": {
                "value": "A minor weakness is that some points haven’t been sufficiently explained. Please refer to my questions."
            },
            "questions": {
                "value": "1. Figure 2 shows that the orthogonal projection improves the performance of anomaly detection. What is the fundamental reason? I suggest the authors provide further analysis as well as some references if possible. \n2. A typo or grammar issue in the first paragraph of Section 2.1.2: ‘cannot be avoided by solving equation 1’, it is not an equation. It is an optimization problem.\n3. Does Proposition 2 mean the distance (to the original or hypersphere center) based anomaly score in high-dimensional space are not reliable? If yes, the authors may add a few words to the last paragraph in Section 2.2.1 to provide a hint or motivation for the new anomaly score defined by (9).\n4. Given Proposition 2, in the high-dimensional space, the normal data are already far away from the origin. Why do we need to further push them to the outer hypersphere, namely, performing the hypersphere compression to reduce the thickness of the shell?\n5. Are $r_{max}$ and $r_{min}$ fixed or adjusted adaptively?\n6. In Proposition 3, when $r_{min}=r_{max}$, $\\kappa$ is infinity. Does this still make sense?\n7. What make graph anomaly detection special compared to image and tabular data anomaly detection? \n8. In Section 3.1, the authors mentioned a comparison method FCDD, but Table 2 doesn’t include the corresponding result.\n9. In Appendix K, the authors showed the results of imbalanced experiments of graph data. Does it mean the results on graph data in the main paper are from balanced experiments? What is the difference between these two settings?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission7228/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7228/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7228/Reviewer_mQBk"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7228/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698637550288,
        "cdate": 1698637550288,
        "tmdate": 1700731271655,
        "mdate": 1700731271655,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "jllxFhL8SI",
        "forum": "cJs4oE4m9Q",
        "replyto": "cJs4oE4m9Q",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7228/Reviewer_wkqC"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7228/Reviewer_wkqC"
        ],
        "content": {
            "summary": {
                "value": "The paper introduces an innovative approach to anomaly detection, enhancing traditional hypersphere learning with an orthogonal projection layer. This improves accuracy and reduces false negatives. The paper also introduces a more compact decision region, a \"hyperspherical shell,\" and extends the methods to graph-level anomaly detection. The experimental results demonstrate the effectiveness of these methods in comparison to existing approaches. The contributions include enhanced anomaly detection techniques, particularly beneficial for high-dimensional and graph-based data."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "The paper stands out in the following aspects:\n1.\tOriginality: The paper presents a problem that may lead to suboptimal performance in the field of anomaly detection and provides a solution, offering a novel approach to enhance the performance of anomaly detection algorithms.\n2.\tQuality: The research is of high quality, marked by a well-structured approach, rigorous validation, and superior performance compared to existing methods. The use of benchmark datasets adds to the credibility.\n3.\tClarity: The paper is well written, ensuring clear communication of the research. It offers a logical flow.\n4.\tSignificance: The paper addresses a novel anomaly detection issue, offering potential improvements for high-dimensional and graph-based data. The practical applicability and broad relevance make it highly valuable."
            },
            "weaknesses": {
                "value": "1.\tThis article mentions the concept of hyperspheres but doesn't provide a more rigorous theoretical explanation for why standard hyperspheres are superior to boundaries formed by ellipsoids. Adding mathematical proofs or a deeper theoretical foundation would strengthen the paper.\n2.\tHigh-dimensional data and large datasets pose scalability challenges. The paper could address the scalability of the proposed methods and discuss their efficiency and computational requirements in dealing with big data."
            },
            "questions": {
                "value": "1. The proof of Proposition 2 in section C of supplementary materials should be make more clear.\n\n2. In equation 3, how to guarantee the projected embeddings is orthogonal via  singular value decomposition?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7228/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698676734147,
        "cdate": 1698676734147,
        "tmdate": 1699636860562,
        "mdate": 1699636860562,
        "license": "CC BY 4.0",
        "version": 2
    }
]