[
    {
        "id": "zOZXKAnGNF",
        "forum": "CTlUHIKF71",
        "replyto": "CTlUHIKF71",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8866/Reviewer_2gN6"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8866/Reviewer_2gN6"
        ],
        "content": {
            "summary": {
                "value": "The paper attempts to utilize human feedback to synchronize visual representation with the end-user's priorities for the task at hand. The authors present the Representation-Aligned Preference-based Learning (RAPL) method to tackle challenges in visual representation alignment and visual reward learning. Trials conducted in XMAGICAL and robotic manipulation demonstrate that RAPL consistently produces desired robot behaviors with notable sample efficiency and robust zero-shot generalization."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The paper pioneers the formalization of the visual representation alignment challenge in robotics, framing it as metric learning within the human representation space. Their proposed RAPL targets resolving the alignment issue and facilitates learning visual robot rewards through optimal transport. Experimental results further demonstrate that RAPL consistently yields desired robot behaviors, maintaining high sample efficiency. Lastly, they also show zero-shot generalization across embodiments."
            },
            "weaknesses": {
                "value": "1. The task complexity may not adequately highlight the significance of human feedback in robot learning.\n2. While the approach captures human-like preferences, there's no concrete evidence to validate its representation of genuine human preferences in real-world tasks. Enhancing the complexity of preference-based feedback might better align pre-trained visual models with user preferences.\n3. The author should elaborate in the main paper on their method of utilizing privileged access to state information for dataset generation.\n4. While the efficacy of this approach is demonstrated with the X-Magical and ISACCGym robots, it would be beneficial to see its applicability in other robotic embodiment or real-world scenarios."
            },
            "questions": {
                "value": "All listed in the weakness section. I would consider changing my rating, if the author could address my questions."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "No"
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission8866/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission8866/Reviewer_2gN6",
                    "ICLR.cc/2024/Conference/Submission8866/Senior_Area_Chairs"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8866/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698624184189,
        "cdate": 1698624184189,
        "tmdate": 1700683453851,
        "mdate": 1700683453851,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "1STPeDvoKD",
        "forum": "CTlUHIKF71",
        "replyto": "CTlUHIKF71",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8866/Reviewer_vWH8"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8866/Reviewer_vWH8"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes Representation-Aligned Preference-based Learning (RAPL), a method which leverages human feedback to align visual representations with the end-user. Preference-based learning and optimal transport are used for this alignment and for the policy learning. Experimental results in two different environments reveal that RAPL outperforms prior work by learning a policy which both leads to higher rewards and has better sample efficiency."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- Well-written. The paper is very well-written and easy to follow. The figures very much aid in understanding the paper.\n- Experiments. The experiments reveal that the proposed methodology outperforms baseline methods by non-trivial margins. The experiments are done across a number of environments, and evaluate the proposed methodology in a number of different ways.\n- Ablations and Visualizations. Ablations are conducted and visualizations are included to better understand how and why the proposed methodology performs better than the baselines."
            },
            "weaknesses": {
                "value": "- Missing / weak baselines.\n  - Zhang et al (2020) is described to be the most similar to the proposed methodology. Why is this not compared to?\n  - The main baseline appears to be TCC (Zakka et al., 2022; Kumar et al., 2023). Which of these (Zakka et al., 2022 vs Kumar et al., 2023) is used as the baseline? Furthermore, both Zakka et al., 2022 and Kumar et al., 2023 report results on {long-stick, medium-stick, short-stick, gripper} tasks -- why are these tasks not used to report results, for a completely fair comparison? This would be the most revealing comparison to the baselines.\n  - A comparison to other pre-training work is made by comparing to MVP-OT, which is revealing. MVP is trained on Ego4D, so there is a massive distribution shift, perhaps explaining the poor performance. For a fairer comparison, could Masked Visual Pre-training be performed on data from the environments directly (e.g. using the trajectories)? \n  - While the visual backbone models are initialized with ImageNet pre-trained weights, may be revealing to include this (without any further training) as another baseline.\n- Data is simulated. A simulated human model is used, rather than learning from real end-user feedback. \n- Figure 3 qualitatively shows the reward correlation -- quantification of such correlation using e.g. Spearman's correlation coefficient, compared to baselines, would be revealing."
            },
            "questions": {
                "value": "- How is the proposed approach better than GT for \"Avoiding\"?\n- There seem to be error bars on many of the plots -- how many trials is this over?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission8866/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission8866/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission8866/Reviewer_vWH8"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8866/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698783973020,
        "cdate": 1698783973020,
        "tmdate": 1699637115619,
        "mdate": 1699637115619,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "VpFASnzk5D",
        "forum": "CTlUHIKF71",
        "replyto": "CTlUHIKF71",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8866/Reviewer_sCYJ"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8866/Reviewer_sCYJ"
        ],
        "content": {
            "summary": {
                "value": "The paper proposes a new method called Representation-Aligned Preference-based Learning (RAPL) to align robot’s visual representation using human preferences. The paper formally defines visual representation alignment problem for robotics as minimizing divergence between human’s latent preference and robot’s representation space. RAPL uses human preference rankings over video triplets to learn representations aligned with preferences of humans and it then uses optimal transport to map the aligned representation to the reward for training. Authors present results in simulation on table top manipulation and 2 block rearrangement tasks. They demonstrate RAPL outperforms and is sample efficient compared to RLHF and temporal consistency based methods in all environments. In addition, they also show RAPL enables zero-shot generalization of rewards to new embodiments for both tasks."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. Idea of aligning visual representations to human preferences and using that to extract preference based rewards is interesting and novel\n2. Experiments are well designed and demonstrate RAPL outperforms vanilla RLHF in the studied simpler manipulation and block movement tasks is promising.\n3. Results demonstrating zero-shot generalization to new embodiements and sample efficiency gains further strengthen benefits of using RAPL.\n4. Paper is well written and easy to follow"
            },
            "weaknesses": {
                "value": "1. Experimental setup is promising but the evaluation is done on simpler tasks. With just 150 triplet dataset used for both the tasks to learn preferences the tasks being studied brings up a question about how well this approach works on more complex tasks? For example, the block movement task in x-magical environment only requires agent to avoid the blue box in the environment. This can essentially be treated as a simple obstacle to avoid in the environment which is simple to learn in general. Some example tasks authors could use for evaluation are: block stacking task with constraints where a user prefers stacking blocks based on size i.e. largest block is at lowest followed by smaller blocks irrespective of the color of boxes. This setup tests generalization ability of the policy to different colors and ability to reason about object size based on preferences. My point being preference-based learning needs to be evaluated with tasks that have distractors that are difficult to pick up. It’d be nice if authors can add more experiments on different manipulation tasks with such properties\n2. One baseline I’d like to see in addition to RAPL is how well does a simple contrastive pretrained visual representation as reward with same optimal transport logic performs in comparison to RAPL. It is unclear how beneficial RAPL’s triplet sampling is for the current set of tasks being considered. \n3. For the cross-embodiment experiments the simple tasks of block movement doesn’t necessarily highlight how well the proposed approach is performing. I’d be interested in seeing similar results in simple object pick and place task similar to one asked in W1.\n4. Human preferences are multi-modal in nature i.e. different people have different preferences. The current setup doesn’t consider multi-modal preferences and show experiments comparing different methods in such a setup which seems like a big flaw in current experimental setup. I’d like authors to consider adding experiments that’d demonstrate effectiveness of RAPL under such setting"
            },
            "questions": {
                "value": "1. In Figure 6. the RLHF results are quite poor. Have authors tried scaling training for RLHF for the same experiment to figure out how long does it take to reach RAPL/GT performance?\n\nMy major concern is evaluation on simple object movement tasks and no evaluation on tasks with multi-modal preferences if authors add more experiments that'd address my concerns I’d be happy to update the rating"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission8866/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission8866/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission8866/Reviewer_sCYJ"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8866/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698810413838,
        "cdate": 1698810413838,
        "tmdate": 1699637115498,
        "mdate": 1699637115498,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "Y4Jwrtlk1x",
        "forum": "CTlUHIKF71",
        "replyto": "CTlUHIKF71",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8866/Reviewer_NUZE"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8866/Reviewer_NUZE"
        ],
        "content": {
            "summary": {
                "value": "The authors proposes Representation Aligned Preference-based Learning (RAPL).\nIt is a video-only tractable method to use human feedback preferences between three trajectories to align visual representations with what matter to the tasks.\n\nRAPL first asks humans to rate preferences over a set of video triplets.\n\nIt then uses the Bradley-Terry model to interpret and leverage the preferences, but not directly to reward prediction.\nInstead, it focuses all the data on representation alignment on the video pre-trained visual features (ResNet18).\nIt uses the optimal transport method, which transports one video embedding distribution to another, with minimal cost.\nGiven the aligned representation RAPL then uses optimal transport to design a visual reward for the robot policy.\n\nRAPL is then tested against ground truth policy, TCC, and vanilla RLHF. \nWe first tested the same embodiment for both training and testing.\nThis first test is done on a toy X-MAGICAL environment, and then a realistic IsaacGym simulator.\nFor the former, the task is kitchen top cleaning, with avoiding off-limits zone. \nWith the triplet training size of 150, RAPL is able not only to make spatial progress, but to be close to human preference. \nThis results in a higher overall binary success rate on the task.\n\nThe IsaacGym simulator also shows similar results, where the RAPL features are aligned with GT on preferred videos, and no alignment on dislikes.\nFurther analysis shows that RAPL focuses on task-relevant objects and regions is the reason for the significantly higher final task success rate.\n\nRAPL is then tested on zero-shot generalization setup, where the testing robot embodiment is different from that of training.\nThis second test is also done in X_MAGICAL, and then the robot simulator. For both RAPL is the best, closest to the ground truth performance.\nIn fact, on some combination (X-MAGICAL train on short stick, test on medium stick), RAPL improves its performance of the previous non-cross modal setup."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "The paper presented a novel preference-based representation alignment and robot policy learning techniques.\n\nThe testing section is quite thorough and goes in-depth on the various nuances of what is being learned and accomplished in the actual robot task."
            },
            "weaknesses": {
                "value": "No discussion on what is still hard to do or not reliable.\nAlso, evaluation based on difficulty level of the configuration, shape, number of objects needed to be cleared would help toward answering the previous question.\nAnother is to compare with a second, very different, task."
            },
            "questions": {
                "value": "How does the visual attention map (figure 11, supplementary material) computed?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8866/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698817644754,
        "cdate": 1698817644754,
        "tmdate": 1699637115365,
        "mdate": 1699637115365,
        "license": "CC BY 4.0",
        "version": 2
    }
]