[
    {
        "id": "w0wUJadFpl",
        "forum": "ctXZJLBbyb",
        "replyto": "ctXZJLBbyb",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7775/Reviewer_sSgQ"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7775/Reviewer_sSgQ"
        ],
        "content": {
            "summary": {
                "value": "This paper focuses on heterophily in Graph Neural Networks (GNNs) and its impact on node classification. It proposes the Heterophilous Stochastic Block Models (HSBM) to incorporate different heterophily patterns in GNNs. The authors present theoretical analyses of the effects of heterophily patterns on GNNs, considering graph convolution operations. They reveal that the separability gains in GNNs depend on the Euclidean distance of neighborhood distributions and the averaged node degree. The paper also discusses the impact of topological noise on separability and the influence of stacking multiple graph convolution operations. The theoretical results are supported by experiments on synthetic and real-world data."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "The authors provide sufficient theoretical analysis."
            },
            "weaknesses": {
                "value": "See below."
            },
            "questions": {
                "value": "1. Two related works need to be discussed [1,2].\n\n2. \"Its primary objective is to accurately categorize samples into their respective classes while distinguishing them from samples belonging to other classes.\" I think this is the same as the statement about intra- and inter-class node distinguishability in [1]. What is the difference and advantage of your \"ideal Bayes classifier\" over the optimal Bayes classifier in [1]?\n\nAlthough this paper gets some similar conclusions as the previous paper about heterophily, I don't think it reduce a lot about is contribution. Thus, I'll give it a 6.\n\n\n\n[1] When do graph neural networks help with node classification: Investigating the homophily principle on node distinguishability. arXiv preprint arXiv:2304.14274.\n\n[2] Demystifying Structural Disparity in Graph Neural Networks: Can One Size Fit All?. arXiv preprint arXiv:2306.01323."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7775/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698567869032,
        "cdate": 1698567869032,
        "tmdate": 1699636950361,
        "mdate": 1699636950361,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "pNvr4Exh60",
        "forum": "ctXZJLBbyb",
        "replyto": "ctXZJLBbyb",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7775/Reviewer_Ngh1"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7775/Reviewer_Ngh1"
        ],
        "content": {
            "summary": {
                "value": "This paper aims to provide a theoretical understanding of the effects of different heterophily patterns on GNNs. The novel Heterophilous Stochastic Block Models (HSBM) is introduced to integrate graph convolution (GC) operations into fully connected networks. The paper offers insights into the factors determining the separability gains when applying GC operations and the influence of topological noise. The study validates the theory with experiments on synthetic and real-world data."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "* The paper provides solid theoretical insights into the interplay of heterophily patterns and GNNs. It addresses the challenge of understanding the impacts of heterophily on classification tasks.\n\n* The HSBM is a unique proposition that can accommodate a variety of heterophily patterns. This is likely to be beneficial to the research community aiming to handle diverse graph structures.\n\n* The authors present an in-depth analysis of the separability gains in the context of GC operations, shedding light on factors like Euclidean distance of the neighborhood distributions and averaged node degree."
            },
            "weaknesses": {
                "value": "* While the authors have acknowledged the limitations of their model and analysis, they are significant. The assumptions on which the theory is based, especially Gaussian node features and independence among node features and edges, might not hold true in many real-world scenarios. The future directions suggested by the authors, including extending the analysis to other feature distributions and considering dependencies among nodes and edges, are crucial for the model's broader applicability.\n\n* Discussion on potential real-world applications or case studies where HSBM could be applied would enhance the paper's relevance and appeal to a broader audience."
            },
            "questions": {
                "value": "*  It would be beneficial for the authors to delve deeper into the implications of the assumptions they have made, providing justifications or scenarios where these assumptions are most likely to hold true.\n\n*  The authors should consider elaborating on the experimental section, providing more detailed results, methodologies, and potential pitfalls or challenges. The benchmarks used in https://arxiv.org/abs/2302.11640 are suggested."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7775/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698736696894,
        "cdate": 1698736696894,
        "tmdate": 1699636950236,
        "mdate": 1699636950236,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "paOrut8jLp",
        "forum": "ctXZJLBbyb",
        "replyto": "ctXZJLBbyb",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7775/Reviewer_Wh1i"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7775/Reviewer_Wh1i"
        ],
        "content": {
            "summary": {
                "value": "This paper delves into the theoretical effects of various heterophily patterns on GNNs by integrating graph convolution (GC) operations into fully connected networks using the newly proposed Heterophilous Stochastic Block Models (HSBM). The study reveals three key findings: \n1) Applying a GC operation results in separability gains determined by the Euclidean distance of neighborhood distributions and the square root of node degree. \n2) Topological noise negatively affects separability. \n3) Using multiple GC operations reveals that separability gains are linked to the normalized distance of l-powered neighborhood distributions, suggesting sustained node separability as l approaches infinity across different conditions."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "Theoretical Insight into Heterophily Patterns: A significant strength of this work lies in its analytical treatment of the heterophily pattern. By dissecting and delving into the theoretical facets of heterophily, the paper offers an elevated understanding of datasets characterized by this pattern. This examination provides a foundational framework for future investigations into heterophily-rich datasets."
            },
            "weaknesses": {
                "value": "Limited Novelty: While the paper takes steps toward analyzing the heterophily problem, the extent of innovation remains somewhat constrained. I found that the conclusions and the main method they use are very similar to this ICML 21 paper: Graph Convolution for Semi-Supervised Classification: Improved Linear Separability and Out-of-Distribution Generalization. In that paper, they also analyze the SBM model and show that graph convolution extends the regime in which the data is linearly separable by a factor of roughly 1/sqrt(D), where D is the expected degree of a node, which was rediscovered by this paper. Besides, the paper Two Sides of the Same Coin: Heterophily and Oversmoothing in Graph Convolutional Neural Networks also mentions that the node degrees play an important role in the heterophily and oversmoothing problem.\n\nRegarding Assumption 1: I noticed that the conclusion derived for Assumption 1 is predominantly based on statistical information from a small subset of datasets. Could you elucidate how you might validate this assumption? Alternatively, is there a possibility to derive this conclusion from a broader statistical perspective or from an extended range of datasets?\n\nEmpirical Validation with Real-World Data: In the presented real-world experiments, it seems that only a limited number of datasets were employed to validate the proposed heterophily pattern concepts. Considering the importance of comprehensive empirical validation, would it be feasible to provide additional experiments across a wider range of datasets to reinforce your conclusions?"
            },
            "questions": {
                "value": "See the weakness above."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7775/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698794211537,
        "cdate": 1698794211537,
        "tmdate": 1699636950108,
        "mdate": 1699636950108,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "zUZKZsUNX2",
        "forum": "ctXZJLBbyb",
        "replyto": "ctXZJLBbyb",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7775/Reviewer_fZmP"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7775/Reviewer_fZmP"
        ],
        "content": {
            "summary": {
                "value": "This paper focuses on understanding the heterophily patterns for Graph Neural Networks (GNNs). It proposes an HSBM graph generation model to generate diverse heterophilious patterns and then analyzes the relationship with the performance of GNN and MLPs."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "The paper provides a detailed analysis of GNNs using the HSBM graph generation model. The theoretical analysis and empirical evaluations demonstrate the effectiveness of the analysis."
            },
            "weaknesses": {
                "value": "1. The paper lacks comparisons with existing methods. Previous methods [1,2] have provided analysis on heterophily from the perspective of node degree and neighborhood distribution. It would be beneficial to include discussions and comparisons from the standpoint of assumptions, graph generation, and results.\n\n2. The paper does not provide suggestions for learning on heterophilous graphs. The analysis of heterophilous patterns in relation to model performance is provided, but it would be helpful to offer some guidance on model design when dealing with these graphs. Alternatively, the paper could explain why existing methods succeed on these graphs. \n\n3. The paper could benefit from evaluations on larger-scale graphs. In section 5, the evaluations on the HSBM model are too simplistic to demonstrate its effectiveness, and it would be advantageous to increase the graph size.\n\n[1] Two Sides of the Same Coin: Heterophily and Oversmoothing in Graph Convolutional Neural Networks. ICDM 2022\n[2] Is Heterophily A Real Nightmare For Graph Neural Networks To Do Node Classification?"
            },
            "questions": {
                "value": "No more"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7775/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698892704937,
        "cdate": 1698892704937,
        "tmdate": 1699636949979,
        "mdate": 1699636949979,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "jZlPRIRvpj",
        "forum": "ctXZJLBbyb",
        "replyto": "ctXZJLBbyb",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7775/Reviewer_SYCa"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7775/Reviewer_SYCa"
        ],
        "content": {
            "summary": {
                "value": "This paper presents theoretical understandings of the impacts of different heterophily patterns for GNNs by incorporating the graph convolution (GC) operations into fully connected networks via the proposed Heterophilous Stochastic Block Models (HSBM)."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "Good paper with high originality and high quality. The paper is well-written and makes some new contributions to the relevant field."
            },
            "weaknesses": {
                "value": "More large-scale datasets are suggested to be added."
            },
            "questions": {
                "value": "I do not have any questions."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission7775/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7775/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7775/Reviewer_SYCa"
                ]
            }
        },
        "number": 5,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7775/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699452716235,
        "cdate": 1699452716235,
        "tmdate": 1699636949875,
        "mdate": 1699636949875,
        "license": "CC BY 4.0",
        "version": 2
    }
]