[
    {
        "id": "APQaNjJnP7",
        "forum": "DZyhUXpEee",
        "replyto": "DZyhUXpEee",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6217/Reviewer_Kuri"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6217/Reviewer_Kuri"
        ],
        "content": {
            "summary": {
                "value": "The large communication overhead of FL is one of the main challenges. This work proposes SpaFL to optimize both personalized model parameters and sparse model structures. SpaFL defines a trainable threshold for each neuron/filter for pruning. Both model parameters and thresholds are jointly optimized, thus those prematurely pruned parameters during training can be recovered. Only thresholds are communicated between a server and clients instead of parameters, thereby enabling the clients to learn how to prune and reducing communication costs. Global thresholds are used to update model parameters by extracting aggregated parameter importance."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. Only communicating thresholds is novel, and reducing communication costs of both up-link and down-link a lot.\n2. Equation (8) provides a good connection between the importance and the thresholds.\n3. There is convergence analysis of the SpaFL.\n4. Experiment results show significant improvements of SpaFL."
            },
            "weaknesses": {
                "value": "1. Section 3.2.2 needs to be written more clear. During local training with e < E, does the thresholds not be updated? Equation (5) and (6) only work for the e=E? And how the equation (6) is derived?\n2. Comparing equation (10) and (11), authors concludes the relationship between the gradient direction and the $\\Delta \\tau$ when $w >0$ or $w < 0$. However, Equation (9) is about the global $\\tau$, while equation (10) is talking about local $\\tau$. Could authos explain this in more details?\n3. Experiment settings are not clear enough. The training dataset is split using Dirichlet samplg. For personalized FL, how are test datasets split and how the models are tested? Why all methods use the same learning rates? Maybe different methods have different best learning rates.\n4. The theoretical proof does not consider the data heterogeneity. Will the thresholds still converge under the data heterogeneity?"
            },
            "questions": {
                "value": "1. See weakness 1, During local training with e < E, does the thresholds not be updated? Equation (5) and (6) only work for the e=E? And how the equation (6) is derived?\n2. See weakness 2.\n3. See weakness 3.\n4. See weakness 4.\n5. In experiments, E = 3 means local iterations = 3, or local epochs = 3? local iteration = 3 seems to be too small. Could you find other references to support this setting? Because many FL works set this as epochs [1]. \n\n\n[1] Communication-Efficient Learning of Deep Networks from Decentralized Data.\n[2] SCAFFOLD: Stochastic Controlled Averaging for Federated Learning.\n[3] Adaptive Federated Optimization."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission6217/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission6217/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission6217/Reviewer_Kuri"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6217/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698511992030,
        "cdate": 1698511992030,
        "tmdate": 1700654055036,
        "mdate": 1700654055036,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "qybGQI9cNG",
        "forum": "DZyhUXpEee",
        "replyto": "DZyhUXpEee",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6217/Reviewer_R775"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6217/Reviewer_R775"
        ],
        "content": {
            "summary": {
                "value": "This paper introduces a method to mitigate the communication and computation overhead in FL. It employs a threshold-based approach to simultaneously optimize sparse masks and model parameters, resulting in reduced communication costs and the attainment of better personalized models. The paper offers a theoretical analysis regarding the convergence of the proposed method, while empirical results further confirm its efficacy."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The proposed approach employs a straightforward method based on transmitting threshold to effectively reduce communication bandwidth while surpassing the accuracy of personalized models over baseline methods.\n\n2. The paper substantiates the effectiveness of the proposed method through comprehensive empirical evaluations and theoretical analysis.\n\n3. The paper is well-written and easy to read."
            },
            "weaknesses": {
                "value": "1. Some implementation details need further clarification. (Q1)\n\n2. The intuition from the theory needs more elaboration. (Q2)\n\n3. This study primarily concentrates on personalized federated learning, where no global model is trained. It would enhance clarity if the authors could differentiate between personalized federated learning (pFL) and federated learning (FL), as the paper references FL multiple times, which typically involves a global model."
            },
            "questions": {
                "value": "1. During the local training for parameters and thresholds, if the gradients are calculated for every weight and applied with the binary mask, then how does it help save the computation overhead? Or if the gradients are calculated w.r.t. the sparse weights, how is it achieved in practice?\n\n2. The interpretation of the third term in Theorem 1 is not straightforward. The loss function $F_k$ is not bounded in the paper, and it can potentially assume arbitrarily large values, rendering the third term of Theorem 1 indeterminate. How to understand Theorem 1 as a valid convergence bound?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission6217/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission6217/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission6217/Reviewer_R775"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6217/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698725987701,
        "cdate": 1698725987701,
        "tmdate": 1699636678375,
        "mdate": 1699636678375,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "uxn2QIRu24",
        "forum": "DZyhUXpEee",
        "replyto": "DZyhUXpEee",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6217/Reviewer_HLPa"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6217/Reviewer_HLPa"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes SpaFL to tackle the communication cost problem in federated learning. To find the sparse mask for the model, authors introduce a new parameter called threshold ($\\tau$). This parameter indicates if a weight in the model is active or nonactive, hence can reduce the density of the model. In each round, the clients find the current mask based on $\\tau$, then update their local weight, and finally update the local $\\tau$. After the local step, the server aggregates the client's $\\tau$ and transmits the new value to all the clients. Then, all the clients update their weights accordingly."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "* The problem is well-motivated.\n* Authors provides theoretical proof for the convergence of their method.\n* The method is novel and saves uplink communication costs for the clients.\n* The solution is novel."
            },
            "weaknesses": {
                "value": "* What happens if clients do not receive the server update due to unavailability? It is specifically important as the solutions is designed  for resource-constrained cross-device FL, where clients are only sometimes available. \n* How do non-participant clients update their model?\n* Is there any global model available?\n* The author should include a comparison with prior works that adapt sparse learning in FL, such as [8,9,22,24,25,26] (references are from this paper). Some of these methods can reach high sparsities comparable to the 1% communication cost of SpaFL.\n* How does the server or clients control the density of the models.\n* How does SpaFL perform when the global model is denser (for example ResNet18)?"
            },
            "questions": {
                "value": "* The questions can be found in weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission6217/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission6217/Reviewer_HLPa",
                    "ICLR.cc/2024/Conference/Submission6217/Senior_Area_Chairs"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6217/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698726560728,
        "cdate": 1698726560728,
        "tmdate": 1700649170234,
        "mdate": 1700649170234,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "i5mdmQLoec",
        "forum": "DZyhUXpEee",
        "replyto": "DZyhUXpEee",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6217/Reviewer_Ggae"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6217/Reviewer_Ggae"
        ],
        "content": {
            "summary": {
                "value": "The authors propose a novel federated learning approach with sparse personalized client models. The main technical contribution is the reduction of communication overhead by only communicating the thresholds used to determine non-zero parameters and the reduction of computation cost by joint optimization of thresholds and sparse client models. The convergence of the approach is theoretically analyzed and experiments on a range of datasets demonstrate improvements over several prior works."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. The proposed approach will significantly reduce communication cost since it only involves communicating one threshold per neuron and number of neurons is much less than the number of parameters.\n\n2. The empirical results also show a significant reduction in FLOPs due to the sparsity of the models being optimized on the clients."
            },
            "weaknesses": {
                "value": "1. Some aspects of the algorithm are not clearly explained. It is not clear why the regularizer in (4) is chosen over other options. It is also not clear why the second update of the client models in 3.2.4 is necessary because technically it should be possible to continue training the model with the new global thresholds as described in 3.2.2.\n\n2.The sparsification is unstructured and thus may not actually lead to reduction in computation cost or latency due to inefficient utilization of the hardware. Since there are already several works on sparse FL I believe it is important to now start considering hardware performance etc to truly differentiate from prior work."
            },
            "questions": {
                "value": "1. In addition to an intuitive justification for the regularizer in (4) and the second update in 3.2.4 can you also provide an empirical comparison with alternate regularizers?\n\n2. Likewise can you also provide a comparison with a baseline which does not use the update in 3.2.4 but instead just directly continues training the model with the new global thresholds?\n\n3. Can you provide a derivation for (6) and (11)?\n\n4. From (10) and (11) if the gradient direction of $w$ is opposite to that of its connected threshold if $w>0$ then shouldn't the gradient direction of $w$ and $\\Delta \\tau$ be the opposite if $w>0$ and not same as is claimed in the paragraph after 11? Please clarify.\n\n5. What is the model density of the baselines in Table 1? I do not see it presented in the table.\n \n6. Do you have any thoughts on how the sparsification approach described herein could be made structured and thus more hardware efficient?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "N/A"
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission6217/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission6217/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission6217/Reviewer_Ggae"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6217/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699372822615,
        "cdate": 1699372822615,
        "tmdate": 1700714953849,
        "mdate": 1700714953849,
        "license": "CC BY 4.0",
        "version": 2
    }
]