[
    {
        "id": "NNMAChChY9",
        "forum": "E3jq8f8t3d",
        "replyto": "E3jq8f8t3d",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3988/Reviewer_2Umy"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3988/Reviewer_2Umy"
        ],
        "content": {
            "summary": {
                "value": "The paper provides an improved analysis of the actor-critic algorithm. It introduces compatible function approximation to compute the value function, which eliminates the critic approximation error, while keeping the state-of-the-art rate in the sample complexity."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "The paper is easy to follow. The main idea is clearly stated and makes sense. The paper delivers interesting results, which justify the novelty of the work."
            },
            "weaknesses": {
                "value": "1. Since the compatible function approximation (5) is not a straightforward fact, it's better to restate this conclusion in the form of a proposition. It could also be helpful if a quick proof can be attached in the appendix. \n\n2. A high-level roadmap of the proof is appreciated. It could make it easier to follow the proof as it's already notation heavy."
            },
            "questions": {
                "value": "I didn't read the proof in detail. But intuitively, in the previous works, the source of $\\varepsilon_{\\textrm{critic}}$ is the previous proof needs to bound a term like $\\Vert\\nabla_\\omega J(\\pi_\\omega) - \\mathbb{E}[Q_\\theta^{\\pi_\\omega}\\nabla_\\omega\\log\\pi_\\omega(a\\vert s)]\\Vert^2$, which is the difference between the true gradient and the estimated gradient using the value function class. However, due to the authors' setting, this term automatically becomes 0. In this case, why can't one reuse the previous proofs, just replacing this term by 0? Does the introduction of compatible function approximation leads to new difficulties that need additional theoretical novelty to overcome them?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3988/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698292246100,
        "cdate": 1698292246100,
        "tmdate": 1699636360875,
        "mdate": 1699636360875,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "uzEEl72Fzw",
        "forum": "E3jq8f8t3d",
        "replyto": "E3jq8f8t3d",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3988/Reviewer_XG7r"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3988/Reviewer_XG7r"
        ],
        "content": {
            "summary": {
                "value": "The authors develop tightest non-asymptotic convergence bounds for both Actor-critic (AC) and natural AC (NAC) algorithms with compatible function approximation. The major technical novelty lies in analyzing the stochastic bias due to policy-dependent and time-varying compatible function approximation in the critic, and handling the non-ergodicity of the MDP due to the single Markovian sample trajectory. This is a nice theoretical contribution for the area of reinforcement learning."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "The authors develop tightest non-asymptotic convergence bounds for both Actor-critic (AC) and natural AC (NAC) algorithms with compatible function approximation. The major technical novelty lies in analyzing the stochastic bias due to policy-dependent and time-varying compatible function approximation in the critic, and handling the non-ergodicity of the MDP due to the single Markovian sample trajectory. This is a nice theoretical contribution for the area of reinforcement learning."
            },
            "weaknesses": {
                "value": "There is no discussion on the weakness or limitation of theoretical results, even in the conclusion part."
            },
            "questions": {
                "value": "What are the limitations of the analysis presented in this paper? How to verify the assumptions made in practice?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "N/A"
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3988/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3988/Reviewer_XG7r",
                    "ICLR.cc/2024/Conference/Submission3988/Senior_Area_Chairs"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3988/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698781912045,
        "cdate": 1698781912045,
        "tmdate": 1700655156061,
        "mdate": 1700655156061,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "ny7bSVKKnl",
        "forum": "E3jq8f8t3d",
        "replyto": "E3jq8f8t3d",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3988/Reviewer_VajU"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3988/Reviewer_VajU"
        ],
        "content": {
            "summary": {
                "value": "This paper provides tight analyses for non-asymptotic convergence bounds of actor-critic and natural actor-critic algorithms on single-trajectory single-loop online RL problems."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "1 poor"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "I think this work really pushes the RL community research efforts further by answering:\n\n> can we give tight analyses for non-asymptotic convergence bounds of actor-critic and natural actor-critic algorithms on single-trajectory single-loop online RL problems?\n\nThe main contribution of improvement of results is worthy for publication."
            },
            "weaknesses": {
                "value": "Firstly, I only took a closer look at AC sample complexity analyses (Lemma 7, 8, 10, and Proposition 6) and everything seemed alright. \n\nI have only a few weakness for this work as follows:\n\n- The main paper writing needs to be improved. Yes, the soundness of this paper is excellent. But right from Section 1.2, it's just about \"getting sota results compared to other works\". The main analyses idea in this work compared to others which helps improve the bounds are missing. To be honest, I am only familiar with high level analyses of (Chen et al 2022) and few generic two-timescale algorithms, which shares the AC analyses in this work. But I am totally missing the improvement bounds provided here! Just providing one line (below quote) as the core idea for the whole 50 pages analyses paper, does not provide any useful information.\n> In this paper, we design a novel approach to explicitly bound this error. The central idea is to construct an auxiliary eligibility trace with fixed feature to approximate the eligibility trace with time-varying feature (in the critic, we use k-step TD with compatible function approximation).\n\nSo please write more discussions and details for the main results and proof ideas. I understand this is presentation is limited by page restriction, but it can be done through a thorough writing process. For example, AC results can be pushed to appendix looking at the generality of NAC, or the other way around.\n\n- This paper considers average MDP formulation. Most of the comparisons in Table 1 and 2 are in the discounted setting. Please mention these important differences and make fair comparisons by arguing the connection between the two settings. I am not sure if this distinction is what is helping to reach current bounds. Thus my point above is super critical for the quality.\n\nI am open to discussions with the authors and reviewers to make sure the work quality matches the score, which I believe so at this point, but a potential reach to 8 definitely exists. All the best for future decisions!"
            },
            "questions": {
                "value": "-na-"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3988/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698816856411,
        "cdate": 1698816856411,
        "tmdate": 1699636360703,
        "mdate": 1699636360703,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "4FqVvdjcjk",
        "forum": "E3jq8f8t3d",
        "replyto": "E3jq8f8t3d",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3988/Reviewer_CZ8K"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3988/Reviewer_CZ8K"
        ],
        "content": {
            "summary": {
                "value": "This paper presents a non-asymptotic analysis for single-loop Actor-Critic (AC) and Natural Actor-Critic (NAC) algorithms with compatible function approximation. The authors provide tight convergence bounds for both AC and NAC algorithms, eliminating the non-diminishing constant term $\\varepsilon_{critic}$ from the error bounds while maintaining the best known sample complexities. The paper focuses on the challenging single-loop setting with a single Markovian sample trajectory and analyzes the stochastic bias due to policy-dependent and time-varying compatible function approximation in the critic."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "The paper is well-structured and presents a clear analysis of the convergence properties of AC and NAC algorithms with compatible function approximation. The authors develop the tightest non-asymptotic convergence bounds for both AC and NAC algorithms with compatible function approximation. For the AC algorithm, they achieve the best sample complexity of $O(\\varepsilon^{-2})$ with a reduced error from $\\varepsilon + \\varepsilon_{critic}$ to $\\varepsilon$. For the NAC algorithm, they achieve the best known sample complexity of $O(\\varepsilon^{-3})$ with a reduced error of $\\varepsilon+\\sqrt{\\varepsilon_{actor}}$."
            },
            "weaknesses": {
                "value": "1. It is unclear how the result in the paper compared with other non-asymptotic analyses with compatible function approximation. Also, it would be nice to demonstrate the technical challenges in combining (natural) actor-critic with compatible function approximation in a more detailed way. \n\n2. $\\varepsilon_{critic}$ can be small when using a neural function approximator, so it is unclear how important it is to eliminate such an error in real-world scenarios. While this is a theoretical work, it would be nice to include some experiments demonstrating the importance of eliminating $\\varepsilon_{critic}$."
            },
            "questions": {
                "value": "See the weakness section above."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3988/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3988/Reviewer_CZ8K",
                    "ICLR.cc/2024/Conference/Submission3988/Senior_Area_Chairs"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3988/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698834184599,
        "cdate": 1698834184599,
        "tmdate": 1700723228816,
        "mdate": 1700723228816,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "IHEdVlvOcc",
        "forum": "E3jq8f8t3d",
        "replyto": "E3jq8f8t3d",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3988/Reviewer_mPQr"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3988/Reviewer_mPQr"
        ],
        "content": {
            "summary": {
                "value": "This paper provides the tightest non-asymptotic convergence bounds for both the AC and natural AC (NAC) algorithms. Specifically, existing studies show that AC converges to an $\\epsilon+\\epsilon_{critic}$ neighborhood of stationary points with the best known sample complexity of $O(\\epsilon^{-2})$, and NAC converges to an $\\epsilon+\\epsilon_{critic}+\\sqrt{\\epsilon_{actor}}}$ neighborhood of the global optimum with the best known sample complexity of $O(\\epsilon^{-3})$, where $\\epsilon$-critic is the approximation error of the critic and εactor is the approximation error induced by the insufficient expressive power of the parameterized policy class. This paper analyzes the convergence of both AC and NAC algorithms with compatible function approximation. The major technical novelty lies in analyzing the stochastic bias due to policy-dependent and time-varying compatible function approximation in the critic, and handling the non-ergodicity of the MDP due to the single Markovian sample trajectory."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "This paper focuses on the challenging single-loop setting with a single Markovian sample trajectory. To develop the tightest bound, this paper develops a novel approach that bounds the tracking error as a function of the policy gradient norm (for AC) and the optimality gap (for NAC). Their analysis for NAC does not need the smoothness assumption on the parameterized policy, which is typically required in existing NAC and AC analyses."
            },
            "weaknesses": {
                "value": "1. I don't understand the second equal sign of equation (5), why it holds true? Do you need to assume $Q^{\\pi_w}=\\phi^\\top_w\\bar{\\theta}^*_w$? Also, given equation (5), it is unclear why \"This implies that as long as we can solve the finite dimensional problem Equation (4), linear function approximation with the compatible feature and parameter does not induce any function approximation error.\" could you elaborate on that?\n\n2. why $\\phi^\\top\\phi$ is a matrix in eqn(8)? in this case $\\phi^\\top \\theta$ is also a matrix instead of a scalar?\n\n3. For NAC analysis, you need an additional Assumption 3. Could you explain why this is needed for NAC but not for AC? Also, how is this related to the single concentrability coefficient defined for offline RL (def1 of [1], assumption3 in [2])?\n\n[1] Bridging offline reinforcement learning and imitation learning: A tale of pessimism, NeurIPS21,\n[2] Towards Instance-Optimal Offline Reinforcement Learning with Pessimism, NeurIPS21.\n\n4. You mentioned \"Our major technical novelty lies in analyzing the stochastic bias due to policy-dependent and time-varying compatible function approximation in the critic, and handling the non-ergodicity of the MDP due to the single Markovian sample trajectory.\" Where can I find the detail of this novelty in the paper?"
            },
            "questions": {
                "value": "Please answer the questions above."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 5,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3988/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698863399907,
        "cdate": 1698863399907,
        "tmdate": 1699636360566,
        "mdate": 1699636360566,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "7UYKAXKNto",
        "forum": "E3jq8f8t3d",
        "replyto": "E3jq8f8t3d",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3988/Reviewer_k8iS"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3988/Reviewer_k8iS"
        ],
        "content": {
            "summary": {
                "value": "This paper conducts a convergence analysis of actor-critic and natural actor-critic algorithms with compatible function approximation, under the single-loop setting that uses onse sample trajectory. The paper presents the tightest convergence bound in both cases."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- The paper presents the tightest non-asymptotic bound for the covergenace of AC and NAC algorithms, compared to existing work. The results show that compatible function approximation \n- To obtain the tightes bound, paper presents novel technical contributions to analyze the single-trajectory setting and avoid decoupling of the actor and critic updates. The setting considered in this paper is closer to practice."
            },
            "weaknesses": {
                "value": "- The main contributions of the paper are limited to novel techniques in the analysis of well-known algorthms and theoretical evidence on why compatible function approximation might be advantageous. I am uncertain about potential impact of this work either on practice or theory."
            },
            "questions": {
                "value": "Could you please clarify whether/how the techniques or results presented in this paper could be useful in practice, for instance, through the development of new algorithmic ideas, or in theory, such as analysis techniques being potentially useful to analyze other algorithms?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 6,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3988/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698909240594,
        "cdate": 1698909240594,
        "tmdate": 1699636360495,
        "mdate": 1699636360495,
        "license": "CC BY 4.0",
        "version": 2
    }
]