[
    {
        "id": "mzihAVfCN9",
        "forum": "EE75tyB5Ay",
        "replyto": "EE75tyB5Ay",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6093/Reviewer_vcVF"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6093/Reviewer_vcVF"
        ],
        "content": {
            "summary": {
                "value": "This paper presents an empirical evaluation on existing training-based \"ChatGPT detection\" methods. It has created a dataset which includes generated content prompted from ChatGPT and human written content. Analysis includes in-distribution evaluation, as well as OOD evaluation involving length-shift, topic- and domain-shift. Experiments show limited generalizability of training-based detection methods, and tend to overfit simplistic features. Meanwhile, it also suggests that these methods help with extracting transferable features that help generalize across domains."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "This work studies an important and timely problem for detecting LLM-generated content. Experiments have conducted for in-distributed settings as well as OOD settings involving content length shift and topic/domain shift.\nThe feature attribution analysis is an interesting and novel angle of study in the context of LLM-generated content detection."
            },
            "weaknesses": {
                "value": "The study seeks for detecting content generated by ChatGPT, which is just an interface where the backend model keeps evolving. Hence, it is hard to say if the experimental results and analysis are reproducible and sustainable. In my opinion, this type of study should be conducted for a static LLM.  \nLength shift and domain/topic shift represent limited types of distribution shift that is easily detectable. The authors could have considered more implicit shift where content is paraphrased with syntax-controlled paraphrasing or style transfer, like those used in recent approaches for data pollution attack / defense.\n\nTypos:\n\n3.1:\ndon't -> do not"
            },
            "questions": {
                "value": "It is common for training-based methods to have more limited generalizability since they somewhat overfit a specific data distribution. From another perspective, would any unsupervised OOD detection methods [1,2] apply to detecting LLM-generated content?\n\n[1] Zhou, et al. Contrastive Out-of-Distribution Detection for Pretrained Transformers. EMNLP 2021\n[2] Xu, et al. Contrastive Novelty-Augmented Learning: Anticipating Outliers with Large Language Models. ACL 2023"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6093/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1697777351378,
        "cdate": 1697777351378,
        "tmdate": 1699636657008,
        "mdate": 1699636657008,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "KUMpz1d3yx",
        "forum": "EE75tyB5Ay",
        "replyto": "EE75tyB5Ay",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6093/Reviewer_uBbK"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6093/Reviewer_uBbK"
        ],
        "content": {
            "summary": {
                "value": "The paper proposes a solution for detecting texts generated by ChatGPT. \n\nSpecifically, the authors focus on understanding the generalization behaviors of training-based detection methods under distribution shifts caused by various factors including prompts, text lengths, topics, and language tasks. \n\nThey also collect a new data set and present findings to guide future methodologies and data collection strategies for ChatGPT detection."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "* The authors present a novel data set.\n* The analysis is detailed and comprehensive.\n* They provide insights on the data collection and domain adaption strategy."
            },
            "weaknesses": {
                "value": "* ChatGPT Direction seems to be not well motivated. It needs a why, not just a  what and a how.\n* This work exclusively discusses the train-based methods, which are smaller in scope."
            },
            "questions": {
                "value": "Could you elaborate on ChatGPT Direction? How is it motivated?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6093/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698808817316,
        "cdate": 1698808817316,
        "tmdate": 1699636656889,
        "mdate": 1699636656889,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "SZhaUPcWsw",
        "forum": "EE75tyB5Ay",
        "replyto": "EE75tyB5Ay",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6093/Reviewer_FWZZ"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6093/Reviewer_FWZZ"
        ],
        "content": {
            "summary": {
                "value": "This paper investigates the challenges in distinguishing between human-written and ChatGPT-generated texts. The paper makes significant contributions to the field by offering a detailed analysis of ChatGPT detection methods under various distribution shifts. But I think most of findings seem obvious and it is more technical than scientific."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- **Comprehensive Investigation**: The paper conducts a thorough analysis of the generalization behaviors of existing methods under distribution shifts caused by various factors like prompts, text lengths, topics, and language tasks.\n\n- **New Dataset**: The authors contribute to the field by collecting a new dataset containing both human and ChatGPT-generated texts, facilitating in-depth studies on the detection methods.\n\n- **Insightful Findings**: The research uncovers insightful findings, providing valuable guidance for the development of future methodologies and data collection strategies for ChatGPT detection."
            },
            "weaknesses": {
                "value": "- The authors used three prompts in Figure 1; but in general, users might use various prompts. This is not aligned with real user usage,\n- The experiments are limited to CHATGPT, we do not know whether these conclusions still hold in GPT4 or other open-source LLMs.\n- Most findinds seem obvious."
            },
            "questions": {
                "value": "- Can we have a setting to mix various prompts, for example in Figure 1. This could be aligned with the real user usage\n- How are these findings valid to other LLMs?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6093/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699090661517,
        "cdate": 1699090661517,
        "tmdate": 1699636656799,
        "mdate": 1699636656799,
        "license": "CC BY 4.0",
        "version": 2
    }
]