[
    {
        "id": "Mj8A8hds2f",
        "forum": "eRAXvtP0gA",
        "replyto": "eRAXvtP0gA",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3689/Reviewer_pCke"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3689/Reviewer_pCke"
        ],
        "content": {
            "summary": {
                "value": "The paper introduces a novel unsupervised learning approach inspired by cognition models, which constructs a distributed hierarchical structure in the input space without relying on specific data types. The proposed method outperforms current state-of-the-art techniques like K-Means for tabular data and IIC for image data, demonstrating better average performance and exhibiting cognition-like properties that even supervised learning methods lack."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "Main contribution: Proposed algorithm can say \"I don't know\" about novel input. It doesn't assign novel inputs to the existed cluster."
            },
            "weaknesses": {
                "value": "1. Explain more detail about translating grey image to SDR. I can't understand how normalized input values are separated to bins. For example, MNIST dataset has 1 and 0 value. So, I can't understand how you divide input into bins.\nAlso, this translation to SDR looks like manual and specified to specific dataset such as MNIST. It seems difficult to extend your algorithm to high-resolution and diverse dataset even about CIFAR-10. \nThis leads to the question of what the performance of the proposed method will be in situations where it is difficult to create an SDR.\n\n2. Not only about a huge number of SDRs, non optimized iterative algorithm seems to require too much time and cost.  Your experiment dataset was MNIST, so optimization may have seemed easy.\n\n3. Rather than using your algorithm, DINO [1] uses classwise clustering, and CAUSE [2] does semantic segmentation with unsupervised. I don't know the advantage of your algorithm when compared.\n\n4. You tested proposed method on cognition capability task. But, raising such a problem does not seem persuasive.  I don't think it's enough to make readers understand why the problem is important in the field of deep learning. I think it would be good to give some examples. \n\n---\n\nMinor\n1. In the Figure 3 graph, y-axis boundary setting should consider reader convenience.\n\n---\n\nReferences\n\n[1] Caron, Mathilde, et al. \"Emerging properties in self-supervised vision transformers.\" Proceedings of the IEEE/CVF international conference on computer vision. 2021.\n\n[2] Kim, Junho, Byung-Kwan Lee, and Yong Man Ro. \"Causal Unsupervised Semantic Segmentation.\" arXiv preprint arXiv:2310.07379 (2023).\n\n\n---\n\n**Post Rebuttal**\n\nAlthough the authors performed rebuttal, the reviewer would like to strongly recommend this paper be modified due to the following reasons:\n\n(1) Only possible to Grey Image. Cannot validate ImageNet with Color-version. Therefore, high-dimensional feature naturally cannot be performed.\n\n(2) In revision, there is a description of XX.X%.\n\n(3) The author of DINO paper equal to be that of DeepSpectral. In other words, recent clustering method has been growing to Self-Supervised Learning since long days ago. (Previous Clustering: K-Means, Spectral, Recent Clustering Method: Self-Supervised Model (DINO, MAE, iBOT))\n\nFrom these reasons, the authors of this paper should change the way introducing and holding a problem. I think the proposed method only performs in grey image, then it may be possible to conduct a task of only dealing with grey image such as medical task."
            },
            "questions": {
                "value": "Refer to Weaknesses"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "1: strong reject"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3689/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3689/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3689/Reviewer_pCke"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3689/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698212260199,
        "cdate": 1698212260199,
        "tmdate": 1700553711255,
        "mdate": 1700553711255,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "GWhbVNKz96",
        "forum": "eRAXvtP0gA",
        "replyto": "eRAXvtP0gA",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3689/Reviewer_GGEd"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3689/Reviewer_GGEd"
        ],
        "content": {
            "summary": {
                "value": "This paper discusses unsupervised learning for building cognition models. The proposed method consists of an embodiment, a primitive and a spatial attention modulator. The method is evaluated on three datasets: Wisconsin Breast Cancer, Pima Indians Diabetes, and MNIST."
            },
            "soundness": {
                "value": "1 poor"
            },
            "presentation": {
                "value": "1 poor"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "- Unfortunately, I do not see any value in this submission."
            },
            "weaknesses": {
                "value": "- The paper is mostly incomprehensible. It fails to convey the central parts of the paper. Necessary background information is missing. It needs a major rewrite before it can be considered for publication.\n- The experimental evaluation is insufficient: only three datasets where MNIST is the most challenging one. \n- Overall, the paper is of low quality (especially the figures are not helpful)."
            },
            "questions": {
                "value": "Unfortunately, I cannot ask any questions as I did not understand what the authors were doing in this paper."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "1: strong reject"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3689/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698307093668,
        "cdate": 1698307093668,
        "tmdate": 1699636325454,
        "mdate": 1699636325454,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "hQtCvcH71Z",
        "forum": "eRAXvtP0gA",
        "replyto": "eRAXvtP0gA",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3689/Reviewer_GwDC"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3689/Reviewer_GwDC"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes an unsupervised learning algorithm inspired by cognition models. The algorithm focuses on generating constructive representations of the input space using Sparse Distributed Representations (SDRs). The authors compare their approach with K-Means and Invariant Information Clustering (IIC) algorithms and demonstrate its superior performance in both tabular and image datasets. They also evaluate the algorithm's cognition-like properties, showing its advantage over other clustering algorithms."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "This paper introduces a representation-centric unsupervised learning algorithm that generates constructive representations."
            },
            "weaknesses": {
                "value": "1.\tLack of comparison with other state-of-the-art algorithms.\nThis paper only compares with K-Means and IIC. I suggest the authors to include comparisons with other recent unsupervised learning algorithms [cite1-7].\n\n[cite1] He K, Chen X, Xie S, et al. Masked autoencoders are scalable vision learners[C]//Proceedings of the IEEE/CVF conference on computer vision and pattern recognition. 2022: 16000-16009.  \n[cite2] Carl Doersch, Abhinav Gupta, and Alexei A Efros. Unsupervised visual representation learning by context prediction. In ICCV 2015.  \n[cite3] Mehdi Noroozi and Paolo Favaro. Unsupervised learning of visual representations by solving jigsaw puzzles. In ECCV, 2016.  \n[cite4] Richard Zhang, Phillip Isola, and Alexei A Efros. Colorful image colorization. In ECCV, 2016.  \n[cite5] Zhirong Wu, Yuanjun Xiong, Stella Yu, and Dahua Lin. Unsupervised feature learning via non-parametric instance discrimination. In CVPR, 2018.  \n[cite6] Aaron van den Oord, Yazhe Li, and Oriol Vinyals. Representation learning with contrastive predictive coding. arXiv:1807.03748, 2018.  \n[cite7] Ting Chen, Simon Kornblith, Mohammad Norouzi, and Geoffrey Hinton. A simple framework for contrastive learning of visual representations. In ICML, 2020\n\n\n2.\tLimited experimental evaluation. The experiments are conducted on a small number of datasets, and the evaluation could be expanded to include more diverse and challenging datasets.\n\n3.\tMemory requirements. The high memory costs associated with the algorithm need to be mitigated.\n\n4.\tThe presentation quality needs to be improved. For example, writing needs to be polished and figures need to be more clearly."
            },
            "questions": {
                "value": "Please see the Weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3689/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698504523768,
        "cdate": 1698504523768,
        "tmdate": 1699636325377,
        "mdate": 1699636325377,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "lrUZZtVcrS",
        "forum": "eRAXvtP0gA",
        "replyto": "eRAXvtP0gA",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3689/Reviewer_cK2J"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3689/Reviewer_cK2J"
        ],
        "content": {
            "summary": {
                "value": "Unsupervised learning methods that focus on clustering samples in a mathematical space can have limitations when it comes to capturing cognitive relationships between data. In this paper, the authors propose a representation-centric unsupervised learning approach that generates constructive representations of the input space. The approach transforms inputs into Sparse Distributed Representations (SDRs) and models the input space by organizing these SDRs in a hierarchical structure. The authors compared their approach with K-Means and Invariant Information Clustering (IIC) algorithms and found that their proposal performs better on average. They also evaluated the cognition-like properties of their proposal and found that it outperformed other clustering algorithms, including K-NN. The authors conclude that their proposal is a disruptive unsupervised learning algorithm with promising properties."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- Proposal of a novel representation-centric unsupervised learning algorithm: The paper introduces a new approach that focuses on generating constructive representations of the input space. This algorithm transforms inputs into Sparse Distributed Representations (SDRs) and organizes them hierarchically.\n- Evaluation on multiple datasets: The paper evaluates the proposed algorithm on three different datasets: Wisconsin Breast Cancer, Pima Indians Diabetes, and MNIST. This demonstrates the algorithm's versatility and its ability to handle both tabular and image data.\n- Empirical evaluation and analysis: The authors conduct thorough experiments to evaluate the performance of their proposal. They analyze the effect of different parameters and compare the algorithm's behavior with other alternatives. The results provide insights into the strengths and limitations of the proposed algorithm.\n- Transparency and explainability: The algorithm's internal hierarchical organization of SDRs allows for transparency and explainability. The decision-making process can be traced back to the seed cell and the activation of specific footprints, providing interpretability to the algorithm's predictions.\n- Capability to say \"I do not know\": The algorithm has the ability to recognize inputs that do not match any existing footprints and respond with an \"I do not know\" answer. This feature ensures that the algorithm does not provide false or hallucinated predictions for unfamiliar patterns.\n- The paper is organized and provides a clear structure. The abstract provides a concise summary of the paper's content"
            },
            "weaknesses": {
                "value": "- High memory costs: The main limitation mentioned in the paper is the high memory costs associated with storing a large number of Sparse Distributed Representations (SDRs). This can limit the scalability and applicability of the algorithm, particularly for very large datasets.\n- Limited exploration of alternative functions: While the paper mentions that alternative similarity and spatial attention functions could potentially improve the results, it does not extensively explore or provide a detailed analysis of these alternative functions, especially when the difference in results is minimal \n- Lack of comparison with state-of-the-art methods: The paper does not compare the proposed algorithm with the current state-of-the-art unsupervised learning methods. While it demonstrates competitive performance against K-Means and IIC, it would be valuable to compare the proposed approach with other cutting-edge algorithms to assess its relative strengths and weaknesses.\n- Limited analysis of parameter effects: The paper briefly mentions the effect of different parameters, such as the overlap in the Embodiment and the similarity and spatial attention functions. However, it does not provide an in-depth analysis or exploration of the impact of these parameters on the algorithm's performance.\n\n**Additional Feedback and Future Experiments:**\n\n- Evaluation on additional datasets\n\n- Comparison with more unsupervised learning algorithms\n\n- Parameter sensitivity analysis\n\n- Scalability and efficiency analysis"
            },
            "questions": {
                "value": "Please see weaknesses above."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3689/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3689/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3689/Reviewer_cK2J"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3689/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698837283062,
        "cdate": 1698837283062,
        "tmdate": 1699636325299,
        "mdate": 1699636325299,
        "license": "CC BY 4.0",
        "version": 2
    }
]