[
    {
        "id": "DxjwRhZDNd",
        "forum": "FAO4VS9QRV",
        "replyto": "FAO4VS9QRV",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission671/Reviewer_SSSB"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission671/Reviewer_SSSB"
        ],
        "content": {
            "summary": {
                "value": "This paper introduces a new efficient fine-tuning method for large language models. Compared to LoRA, Delta-LoRA will fine-tune both the adapter and the original weight of the model."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The writing of this paper is good, making the paper easy to follow. \nThe method is reasonable and easy to reproduce, and the experiments demonstrate the efficiency of the method.\nThe challenge with directly fine-tuning a large language model is the memory cost. This method provides a way to update LoRA to fine-tune the backbone. In this case, the model can train the backbone directly without incurring a significant GPU memory cost."
            },
            "weaknesses": {
                "value": "Since LoRA is a framework, it would be beneficial if the author could apply Delta-LoRA to more large language models.\nThe paper doesn't clearly explain why Delta-LoRA works.\nIn terms of novelty and significance, I believe it is borderline."
            },
            "questions": {
                "value": "Can the author apply Delta-LoRA to llama2 and provide the experimental results?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission671/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission671/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission671/Reviewer_SSSB"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission671/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698296491978,
        "cdate": 1698296491978,
        "tmdate": 1699635994294,
        "mdate": 1699635994294,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "SF1cgqgOzG",
        "forum": "FAO4VS9QRV",
        "replyto": "FAO4VS9QRV",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission671/Reviewer_e3re"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission671/Reviewer_e3re"
        ],
        "content": {
            "summary": {
                "value": "This paper aims to improve LoRA by also updating the pretrained weights $W$ in addition to the low-rank adapters $A$ and $B$: $W^{(t+1)} = W^{(t)} + \\text{coefficient} \\cdot (A^{(t+1) B^{(t+1)} - A^{(t) B^{(t)}})$. Experiments are conducted to compare the proposed method (Delta-LoRA) and other baselines including LoRA, DyLoRA, and AdaLoRA"
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The idea is very simple but seems to be effective as shown in the experiments.\n2. The paper is easy to follow."
            },
            "weaknesses": {
                "value": "1. [Major] **Delta-LoRA seems to be fundamentally equivalent to LoRA.** I am very unclear about the fundamental difference between updating the pretrained weights using Delta-LoRA and LoRA. Basically, **both of them are performing low-rank updates**. Updating the pretrained weights does not seem to have any benefits, and if we treat W+AB as a whole $\\hat{W}$, then, what you are doing can be viewed as LoRA but applied with a different learning rate. Please correct me if I am wrong. \n2. [Major] **Many experiment details are not justified.**\n    1. Neither DyLoRA nor AdaLoRA outperforms LoRA as they claimed in their paper. I noticed that the authors chose different settings with the AdaLoRA, this might be the reason for the bad performance. However, the authors do not provide any explanation on why they chose this different setting. This makes the outperformance of Delta-LoRA reported in the tables less convincing. \n    2. Why does the author only try the experiments with cases with rank = 8? How about other cases? \n    3. Why is the learning rate fixed? In my intuition, the only difference between the Delta-LoRA seems to be the resulting learning rate as I explained in the first bullet point. Therefore, it is unclear whether the reported performance of Delta-LoRA happen to outperform LoRA in this learning rate. \n    4. Why are the trainable parameters of Delta-LoRA set to be higher than LoRA in multiple experiments? (Table 1, 4). It is very unclear whether the improvement comes from the additional trainable parameters or extra updatable parameters (or dropouts). \n3. [Medium] The improvements look not significant. \n4. [Medium] The code is not publically available thus I cannot verify the reproducibility of the experiment results. \n5.  [Minor] Listing extra updatable parameters as a column in the tables looks very confusing. For example, Table 4 made me think that Delta-LoRA uses 72M updatable parameters but achieves worse results than Fine-Tuning in the third row."
            },
            "questions": {
                "value": "See the weakness section."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "NA"
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission671/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission671/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission671/Reviewer_e3re"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission671/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698705970391,
        "cdate": 1698705970391,
        "tmdate": 1700678545636,
        "mdate": 1700678545636,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "fZjs6VLvpv",
        "forum": "FAO4VS9QRV",
        "replyto": "FAO4VS9QRV",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission671/Reviewer_rQDs"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission671/Reviewer_rQDs"
        ],
        "content": {
            "summary": {
                "value": "The paper proposes DeltaLORA, a novel variant of the popular PEFT technique LoRA, which updates not only the low rank adapter matrices, but also propagates updates to the underlying pretrained matrix $W$. Their strategy helps alleviate the problem of the being limited to low rank representations which may be insufficient to adapt to downstream tasks while maintaining computational parity with LoRA."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- The paper is well-organized and easy to follow.\n- Extensive evaluation on NLU, NLG tasks as well as ablation studies to emphasize the efficacy of their formulation. \n- The proposed algorithm is well-motivated, it builds very naturally upon the baseline LORA and differentiates itself against the baseline (Section 5.3) to answer a natural question - \"Does the performance stem from the additional parameters or the updates applied to the underlying weight matrix?\"\n- It accomplishes it's goals without sacrificing the key advantages of LORA - low memory consumption"
            },
            "weaknesses": {
                "value": "## Major\n\n- The only major drawback seems to be that the differences in empirical results do not seem statistically significant (and do not have any errors provided). Given the incremental increase, it is not clear whether the performance of the algorithm stems from real gains or is noise from insufficient tuning.\n## Minor \n\n- The whole idea is pretty much a heuristic which works very well in practice (but the same can be said of LoRA)\n- The overt emphasis on the fact that $g_W = g_{AB}$ seems unnecessary (specifically Section 4.1) since the results stems from fairly straightforward linear algebra and calculus. It might be better to reduce that section, and allocate space to more impactful discussion/experiments.\n\nIt is certainly true that the work's novelty is primarily in engineering a practical method, rather than introducing a new direction of research. The advantage of method is clearly empirical in nature. \n\nI am very divided on accepting this paper simply due to the fact that all algorithms seem very close to each other in empirical results, the differences being marginal in most cases. However, due to the fact that this method does provide positive gains across the board, I vote to accept \nthe paper."
            },
            "questions": {
                "value": "- Can you provide standard errors on some of your empirical results?\n- It would help to incorporate some experiments in Section 7 of the LoRA paper to help understand the kind of updates induced by DeltaLoRA"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission671/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission671/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission671/Reviewer_rQDs"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission671/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698936416846,
        "cdate": 1698936416846,
        "tmdate": 1699635994111,
        "mdate": 1699635994111,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "iNcl6OL6a2",
        "forum": "FAO4VS9QRV",
        "replyto": "FAO4VS9QRV",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission671/Reviewer_p8Lv"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission671/Reviewer_p8Lv"
        ],
        "content": {
            "summary": {
                "value": "This paper introduces Delta-LoRA. Unlike other low-rank adaptation techniques, it updates both low-rank matrices and pre-trained weights. The authors claim this approach tackles the issue of inadequate learning representations and matches LoRA in terms of memory and computational costs."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The paper is clear and easy to read with straightforward derivations. The proposed method, Delta-LoRA, is original in its approach to update both the low-rank matrices and the pre-trained weights, which could potentially address the limitations of existing low-rank adaptation methods."
            },
            "weaknesses": {
                "value": "The main weakness of the paper is the lack of experiments on large models where the memory efficiency of Delta-LoRA would be most beneficial. The models tested in the paper are relatively small, which makes the memory-saving advantage less meaningful. Additionally, there is a performance loss compared to fine-tuning, which is expected. However, the paper should have reported the performance of full finetuning with stateless optimizers (such as SGD) and showed that Delta-LoRA outperforms this baseline."
            },
            "questions": {
                "value": "- Could you provide more evidence to support the claim that Delta-LoRA can nearly match the performance of full finetuning with \"large\" models?\n- How does Delta-LoRA's performance compare to full finetuning with stateless optimizers? (Note -- the memory footprint is actually slightly lower with full finetuning with stateless optimizers)"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission671/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698955784630,
        "cdate": 1698955784630,
        "tmdate": 1699635994022,
        "mdate": 1699635994022,
        "license": "CC BY 4.0",
        "version": 2
    }
]