[
    {
        "id": "LJAV79Uaiu",
        "forum": "Fd8MBEOirN",
        "replyto": "Fd8MBEOirN",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5546/Reviewer_3HQY"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5546/Reviewer_3HQY"
        ],
        "content": {
            "summary": {
                "value": "In this paper, the authors propose a 3D patchwork for out-of-distribution detection. They propose to use the intermediate patch features from a pre-trained 3D convolutional network to create a memory bank for point cloud patches. The authors conduct experiments on various point cloud backbones to demonstrate the effectiveness of the proposed OpenPatch. Ablation studies are also provided for component analysis."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The idea is novel. The intermediate features from the pretrained point cloud model is adequately used to solve the OOD problem.\n2. The visualization is clear. The quatitative evaluation of OpenPatch in Figure 4 is clear to demonstrate the concept and the effectiveness of the proposed method."
            },
            "weaknesses": {
                "value": "1. In the experiment part, the authors only compare OpenPatch with a few related literatures. However, from section 2, there are many related work that are not included in the experiment part. The authors are encouraged to provide more robust experiment comparison to convince the effectiveness of the proposed method.\n2. There are more advanced backbones in point cloud representation learning field. The authors are encouranged to show that OpenPatch also works well on more advanced backbones.\n3. In figure 4, the concept of \"Patch\" is not clearly demonstrated. It would be nice the the authors can show the \"Patch\"-level visualizations."
            },
            "questions": {
                "value": "See weakness above."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5546/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5546/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5546/Reviewer_3HQY"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5546/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698741380434,
        "cdate": 1698741380434,
        "tmdate": 1699636569947,
        "mdate": 1699636569947,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "1ZHUV0Aya4",
        "forum": "Fd8MBEOirN",
        "replyto": "Fd8MBEOirN",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5546/Reviewer_shas"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5546/Reviewer_shas"
        ],
        "content": {
            "summary": {
                "value": "This paper aims to identify novel classes in 3D point clouds. It uses intermediate features to distinguish known semantic classes from novel classes that are not seen during training. It stores patch embeddings in a memory bank, and proposes a score function to find novel classes. Experiments are performed with full and few-shot scenarios."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- Detection of novel classes is indeed an important task. While many methods have been proposed in 2D, it has been less explored in 3D applications.\n- The paper is generally clear and easy to understand"
            },
            "weaknesses": {
                "value": "- The task of out-of-distribution detection is closely related to the open-set and open-world task. Nonetheless, the paper does not compare to methods that perform open-world tasks.\n\"Walter J Scheirer, Anderson de Rezende Rocha, Archana Sapkota, and Terrance E Boult. Toward open set recognition. IEEE transactions on pattern analysis and machine intelligence (2012)\"\n\"Abhijit Bendale and Terrance Boult. Towards open world recognition. In Proceedings of the IEEE conference on computer vision and pattern recognition (2015)\"\n\n- The paper is mainly a simple adaptation of what has been tried in 2D (memory bank and scoring) and falls short in terms of originality. Moreover, it does not compare to other out-of-distribution methods from 2D.\n- The motivation for a 3D framework is somehow weak since the paper does not explain the challenges in the 3D domain compared to the direct adaptation from 2D.\n- There no proper ablation studies.\n- Using \"detection\" in the title is confusing since the paper is only doing classification and semantic segmentation."
            },
            "questions": {
                "value": "- How is out-of-distribution detection different from open-set and open-world?\n- What are the challenges/differences in the 3D domain compared 2D?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5546/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5546/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5546/Reviewer_shas"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5546/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698835677096,
        "cdate": 1698835677096,
        "tmdate": 1699636569846,
        "mdate": 1699636569846,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "3b8Sr5LHp4",
        "forum": "Fd8MBEOirN",
        "replyto": "Fd8MBEOirN",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5546/Reviewer_RMdW"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5546/Reviewer_RMdW"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a new method called OpenPatch for out-of-distribution (OOD) detection on 3D point clouds. The authors use a pre-trained 3D convolutional neural network to extract semantically and geometrically meaningful patch embeddings from intermediate layers. These patches represent local parts of an object. They then build class-specific memory banks containing patch embeddings extracted from known in-distribution samples. Apply coreset subsampling to reduce redundancy.  For testing, the authors propose a scoring function that extracts patch embeddings and find nearest neighbors in the memory banks. Evaluate novelty based on 1) distance to nearest patches and 2) entropy of class assignments. High entropy indicates the sample matches patches from many classes, suggesting it is OOD. Experiments show OpenPatch outperforms distance-based methods like nearest neighbors, as well as post-hoc methods that train classifiers on in-distribution data. It is also sample efficient, performing well even with few support examples per class."
            },
            "soundness": {
                "value": "1 poor"
            },
            "presentation": {
                "value": "1 poor"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "Not much could be said here."
            },
            "weaknesses": {
                "value": "1. The importance of determining if the point cloud of an object is out-of-domain for a 3d classifier is not well-presented. No prior works nor possible applications are shown for this work.\n2. The authors proposed a patch-based method for determining if a point cloud is OOD but failed to mention how are those patches obtained. I guess how to break a whole point cloud into patches has a significant impact on the OOD recognition accuracy. In this sense, the proposed method is not even complete.\n3. Extracting patch-wise features with deep networks is nothing new and the authors did not work hard on literature reviews. I am supervised the authors failed to discuss the relation between this work and deep VLAD approaches like NetVLAD and PointNetVLAD. Also patch-wise methods like BoW with deep CNNs back in 2015 are highly related to this work."
            },
            "questions": {
                "value": "The authors should spend more time studying related works BoW and VLAD with deep features back in the earliest days of deep learning."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5546/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699001484869,
        "cdate": 1699001484869,
        "tmdate": 1699636569752,
        "mdate": 1699636569752,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "JWBxlb87u4",
        "forum": "Fd8MBEOirN",
        "replyto": "Fd8MBEOirN",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5546/Reviewer_3nEL"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5546/Reviewer_3nEL"
        ],
        "content": {
            "summary": {
                "value": "This paper presents a novel approach to Out-Of-Distribution (OOD) detection in the realm of 3D data, termed OpenPatch. It addresses the challenge of detecting novel objects (OOD data) that a deep learning model has not encountered during its training phase. The core contributions of the paper can be summarized as follows:\n\n(1) Development of OpenPatch: OpenPatch, a novel OOD detection method, leverages patch representations from intermediate layers of pre-trained 3D models. This approach enables the detection of novel 3D objects by differentiating between known and unknown object categories without the need for any additional training, addressing the limitations of previous methods that rely heavily on fine-tuning with extensive support data sets.\n\n(2)  Plug-and-Play Capability with Semantic Novelty Detection: OpenPatch operates as a plug-and-play solution for real-world applications, notably in industrial robotics, where computational resources and available data are limited. It is designed to detect semantic novelty effectively by comparing the test sample’s patch features against a database of known classes, using distance metrics and entropy-based class assignment diversity to identify OOD instances, thereby mitigating potential operational hazards.\n\n(3) Demonstrated Superiority and Efficiency: The approach not only surpasses existing OOD detection methods in performance but also showcases high sample efficiency and resilience to domain bias. This makes OpenPatch highly suitable for practical applications, as it can be readily deployed without retraining for different tasks or updating the nominal support set, which is a significant advancement over existing 2D and 3D OOD detection techniques.\n\nIn summary, the paper introduces a robust and efficient method for detecting new objects in 3D data, which is of particular relevance for industrial applications and other real-world scenarios where data and computational resources are constrained."
            },
            "soundness": {
                "value": "1 poor"
            },
            "presentation": {
                "value": "1 poor"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "OpenPatch's strengths are concentrated in the following areas:\n\n(1) Novelty in distinguishing known and unknown classes: OpenPatch introduces a strategy for extracting generalizable patch features from pre-trained 3D deep learning architectures. It devises an innovative approach that integrates semantic and relative distance information to accurately identify new categories during the testing phase.\n\n(2) Streamlined deployment: OpenPatch can be efficiently deployed in resource-constrained environments, obviating the need for collecting custom datasets and training task-specific models."
            },
            "weaknesses": {
                "value": "(1) About innovation.\nThe approach taken in this paper is too similar to PatchCore. For example, the \"Patch Feature Extractor\" in OpenPatch mirrors the \"Local-Aware Patch Feature\" in PatchCore, while the \"Memory Bank and Subsampling\" in OpenPatch is very similar to the \"Coreset Reduced Patch Feature Memory Bank\" in PatchCore. And the key strategies selected by the two papers are similar, such as Greedy Coreset and KNN. Overall, I think this paper lacks innovation.\n\n(2) About experiments.\nA. The selected comparison methods are out of date. For example, in Tables 1 and 2 the chosen comparison methods are EVM Rudd et al. (2015) and Mahalanobis Lee et al. (2018), have become obsolete.\nB. The experimental advantages are not obvious. For example, in the \"Training on Support Set\" table, only 3 out of 6 main metrics outperform previous methods.\n\n(3) About writing.\nThe paper requires improvement in both writing and logic, particularly in the abstract and introduction sections."
            },
            "questions": {
                "value": "(1) About experiments.\n\nTable 1 and Table 2 demonstrate the performance advantages of OpenPatch on OOD compared with other methods. Moreover, the experiments in Table1 are pre-trained on Objaverse-LVIS dataset, while Table 2 shows the results obtained when starting from the OpenShape pre-trained multimodal embedding. But I have some questions about the choices of comparison methods: \n\nA.In Table 1 and Table 2, compared with methods such as EVM and Mahalanobis that have been proposed for many years, if the latest research such as [1][2][3] are added to the comparison, can OpenPatch maintain its advantage?\n\n[1]Semantic Novelty Detection via Relational Reasoning\n\n[2]Detecting out-of-distribution examples with Gram matrices\n\n[3]Delving into Out-of-Distribution Detection with Vision-Language Representations \n\nB.If the latest research [4] and [5] are introduced into the backbone selection of Table 2, what changes will occur in the experimental results?\n\n[4]Uni3D: Exploring Unified 3D Representation at Scale\n\n[5]ViT-Lens: Towards Omni-modal Representations\n\n\n(2) As mentioned in 3.2, \"The banks\" cardinality may quickly increase, significantly impacting the computational cost of the method. To mitigate this effect and address redundancy we adopt a greedy coreset subselection mechanism.” Can the impact of greedy coreset subselection mechanism on computational cost reduction be quantitatively reflected in the experiment?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5546/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5546/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5546/Reviewer_3nEL"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5546/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699098466837,
        "cdate": 1699098466837,
        "tmdate": 1699636569642,
        "mdate": 1699636569642,
        "license": "CC BY 4.0",
        "version": 2
    }
]