[
    {
        "id": "gzJ4RpWpJx",
        "forum": "Ffjc8ApSbt",
        "replyto": "Ffjc8ApSbt",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission9073/Reviewer_ptof"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission9073/Reviewer_ptof"
        ],
        "content": {
            "summary": {
                "value": "The paper proposes a unified kernel-based method to balance functions on the reproducing kernel Hilbert space (RKHS) to address the bias in collaborative filtering due to the observational nature of the collected data. Although balancing (i.e., re-weighting the sample loss) is an important technique to address such selection bias, this paper characterizes the effect of balancing low-dimensional functions on the bias of inverse propensity score (IPS) and doubly robust (DR) methods. A novel adaptive causal balancing method that alternates between unbiased evaluation and model training is proposed. Extensive numerical experiments are conducted on real-world recommendation data sets to demonstrate the proposed method could effectively improve prediction performance compared with the existing benchmarks."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. The problem studied is important and relevant.\n2. The idea is interesting and novel.\n3. The evaluations are solid and convincing."
            },
            "weaknesses": {
                "value": "1. The optimization formulation for balancing may be computationally intractable if the number of items and/or the number of users are large.\n\n2. It is unclear how to incorporate the proposed method into the modern deep learning (DL) based recommender system and to test its effectiveness in a field setting."
            },
            "questions": {
                "value": "1. How to update the weights for the problems where the number of items and/or the number of users are large?\n\n2. Modern DL-based recommender system typically generates an embedding for each user and each item for subsequent tasks such as score prediction and recommendation. Is it possible to adjust this method as a means of fine-tuning the item and/or user embeddings?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission9073/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission9073/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission9073/Reviewer_ptof"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission9073/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698549132027,
        "cdate": 1698549132027,
        "tmdate": 1699637142630,
        "mdate": 1699637142630,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "4j7PtY6LNM",
        "forum": "Ffjc8ApSbt",
        "replyto": "Ffjc8ApSbt",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission9073/Reviewer_4dU2"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission9073/Reviewer_4dU2"
        ],
        "content": {
            "summary": {
                "value": "This work contributes to the field of debiased recommendation recommendation by proposing a\nuniversal kernel-based balancing method to balance functions. It also provides theoretical analysis and guidance of balancing property under finite samples. Experimental results on three real-world datasets verify the proposed balancing methods."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1.This work discusses the limitations of existing methods including the Inverse Propensity Score (IPS) and Doubly Robust (DR) method for debiased recommendation, showing that the importance of balancing property under finite-dimensional function classes.\n\n2.The authors extend them to CBIPS and CBDR estimators and it is reasonable to proposed kernel balancing method for optimization.\n\n3.The work also provides theoretical analysis and proof of the proposed kernel balancing and proposes three causal balancing methods to effectively balance the kernel functions.\n\n4.Experimental results show the effectiveness of the adaptive kernel balancing method."
            },
            "weaknesses": {
                "value": "1.It is advisable to include a discussion of the relationships or distinctions between this work and prior research in the Related Work section.\n\n2.In terms of the Adaptive Kernel Balancing method, I am confused why balancing the kernel functions with maximal $|\\alpha_{s,t}|$ can contribute the most to the $e_{u,i}$. It requires more explanation to improve the readability. Besides, the authors adopt this way to improve the efficiency but there is no corresponding experiment to validate this.\n\n3.Writting of this paper needs improving:\n- The background of debias recommendation is not enough. \n- The definition of $o_{u,i}$ is not clarified clearly.\n- Grammar needs carefully checking:\n  - the usage of “an” such as “Moreover, we propose an causal” \n  - learn an appropriate propensity model that achieve lower estimation bias."
            },
            "questions": {
                "value": "See above."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission9073/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698555747409,
        "cdate": 1698555747409,
        "tmdate": 1699637142508,
        "mdate": 1699637142508,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "vj5yJYwDz1",
        "forum": "Ffjc8ApSbt",
        "replyto": "Ffjc8ApSbt",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission9073/Reviewer_CJCu"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission9073/Reviewer_CJCu"
        ],
        "content": {
            "summary": {
                "value": "This study explores the concept of incorporating a balance regularization loss to mitigate selection bias in Recommender Systems (RS). It centers on determining which function class requires balancing. The authors reframe the issue as an optimization problem, contending that the prediction error should result from a linear combination of balancing functions, supported by theoretical analysis. To achieve this, the authors suggest utilizing kernel functions as balancing functions and put forth three approaches for selecting these kernels. Empirical experiments illustrate the benefits of the proposed balancing techniques."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- The study delves deeper into the challenge of addressing selection bias by examining the specific function that warrants balance. This research problem introduces a novel perspective.\n\n- The concept of employing a linear combination of kernel functions to attain both unbiasedness and universality is intriguing and offers inspiration."
            },
            "weaknesses": {
                "value": "I think the idea in this paper is interesting and has some value. However, I have some significant concerns that prevent me from recommending this manuscript for acceptance.\n\n **1. Motivation**\n\n- W1: This paper lacks a sufficient motivation for the importance of carefully selecting the function class for balancing. The authors do discuss the computational cost associated with choosing numerous balancing functions in Section 3.2. However, the original paper [1] suggests that even selecting a single function for balancing can yield performance improvements. It is essential to elucidate why the choice of multiple balancing functions is necessary and why the specific type of function is critical. In my view, the motivation may be derived from Corollary 1 to some extent, which asserts that certain types of balancing functions introduce bias (correct me if I am wrong). Nonetheless, it would be valuable to provide a more insightful explanation in the introduction section. I would like to see an illustrative example, which could enhance comprehension of the motivation.\n\n**2. Clarity**\n\nThis paper contains several areas of ambiguity and insufficient support for its claims, which hinder the comprehension of its ideas. Some key issues include:\n\n- W2: The optimization problems in Sections 4.2 and 4.4 are perplexing. The rationale behind minimizing the sum of $g(\\cdot) \\log g(\\cdot)$ as opposed to a standard cross-entropy loss is unclear and confusing. The purpose of constraining the sum of $o_{u,i}g(\\cdot)$ to be one and the meaning of the third constraint require more detailed explanation and motivation. The authors should clarify the significance and reasoning behind each statement in the proposed optimization problem.\n\n- W3: Several theorems and corollaries, such as Theorem 1, Corollary 1, and Lemma 2, lack supporting proofs. In particular, the proof of Corollary 1, which appears directly relevant to the paper's motivation, is crucial.\n\n- W4: The paper suggests that \"balancing propensity can reduce the generalization bound\", but this claim is not clearly evident from Theorem 2, which seems to provide a bound without a comparative analysis.\n\n- W5: The fourth paragraph in Section 1 references \"the first question\" and \"the second question\", but it is unclear where these questions are presented in the paper.\n\n- W6: The paper does not elaborate on how the parameters within the kernel functions are learned. For instance, Gaussian kernel functions are known to have a parameter, $\\sigma$. The paper should explain the process for selecting suitable parameter values.\n\n- W7: Given that kernel functions are not frequently used for debiasing Recommender Systems, it is recommended that the authors provide more specific definitions and formulations regarding the kernel functions in Section 4.3 to enhance clarity.\n\n- W8: There are some typos in this paper. \n  - Section 1: \"it is the first paper provides ...\", \"Ours theoretical analysis shows...\". \n  - Section 4.4: \"which Random chooses...\".\n\n**3. Experiments**\n\n- W9: The paper does not specify which kernel function was chosen, whether Gaussian or exponential.\n\n- W10: I found that the performance on \"Coat\" you reported in Table 1 is significantly lower than that on [1]. It would be helpful to understand whether this variance is attributed to different experimental settings or other factors.\n\n- W11: The abbreviation \"CB\" for causal balancing is indeed similar to \"Covariate Balancing\" and may cause confusion. A more distinct abbreviation should be considered to prevent any potential misunderstandings. \n\nOverall, the motivation and clarity are my main concerns. I will consider changing my score if I receive a high-quality (concise and clear) rebuttal.\n\n[1] Haoxuan Li, Yanghao Xiao, Chunyuan Zheng, Peng Wu, and Peng Cui. Propensity matters: Measuring and enhancing balancing for recommendation. 2023d.\n\n\n---\n\n*After the rebuttal: the authors address the most of my concerns. Therefore, I am glad to raise my score from 3 to 6.*"
            },
            "questions": {
                "value": "Please see the Weaknesses part."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission9073/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission9073/Reviewer_CJCu",
                    "ICLR.cc/2024/Conference/Submission9073/Senior_Area_Chairs"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission9073/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698682528432,
        "cdate": 1698682528432,
        "tmdate": 1700714653906,
        "mdate": 1700714653906,
        "license": "CC BY 4.0",
        "version": 2
    }
]