[
    {
        "id": "9Udgryn0ta",
        "forum": "FRpCyW7pWp",
        "replyto": "FRpCyW7pWp",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3539/Reviewer_ZdKC"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3539/Reviewer_ZdKC"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes and studies fully continuous GRUs by reformulating GRUs as delay differential equations. Empirical results are provided to justify the efficacy of the proposed model."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- Provide clean formulation and interpretations of a fully continuous version of GRUs\n- Overall the paper is easy to follow"
            },
            "weaknesses": {
                "value": "- Missing comparisons to related work that uses delay differential equations for designing RNNs; e.g., the $\\tau$-GRU proposed in https://arxiv.org/abs/2212.00228, and also other recent models (e.g., LEM, coRNN, state-space models)\n- Missing evaluation on important benchmark tasks such as sequential image classification on MNIST and CIFAR-10\n- Missing ablation studies on the delay factor $\\tau$ (what is the role of it?)\n- Missing details on the activation functions written in Eq. (1) (what are $\\sigma$ and $\\phi$?)\n- Missing theoretical results to show that the proposed model indeed has better representation learning capability"
            },
            "questions": {
                "value": "- I understand that the DDE is solved using an ODE solver with adaptive step sizes but how does the behavior of the model depends on $\\tau$ when it is fixed? What happen if $\\tau$ is too big? \n- What are the adaptive step sizes used for the experiments?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3539/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698613296904,
        "cdate": 1698613296904,
        "tmdate": 1699636308109,
        "mdate": 1699636308109,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "XIJTYoQgR7",
        "forum": "FRpCyW7pWp",
        "replyto": "FRpCyW7pWp",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3539/Reviewer_LsJ8"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3539/Reviewer_LsJ8"
        ],
        "content": {
            "summary": {
                "value": "The paper proposed a fully time-continuous version of the gated recurrent unit (GRU) RNN model. Different from the standard ODE-RNN of Rubanova et al. 2019, which is comprised of a continuous-time ODE and a discrete RNN, the Cont-GRU is fully continuous. The paper shows that the Cont-GRU outperforms alternative time-continuous architectures experimentally."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "# Pros:\n- Interesting and novel idea to make a discrete time RNN continuous while maintaining the same discrete time semantics by using time-delayed differential equations.\n- The paper is mostly well written"
            },
            "weaknesses": {
                "value": "# Cons:\n- The experiments are primarily based on outdated RNN architectures and miss breakthrough time-continuous architectures of the past few years (Gu et al. 2021, Rusch et al. 2021, and Rusch et al. 2022).\n\n\n# References\n- Gu et al. 2021, Efficiently Modeling Long Sequences with Structured State Spaces.\n- Rusch et al. 2021, Unicornn: A recurrent model for learning very long time dependencies.\n- Rusch et al. 2022, Long expressive memory for sequence modeling."
            },
            "questions": {
                "value": "Why did you not compare with the methods in Rusch et al. 2021, Rusch et al. 2022, and Gu et al. 2021?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3539/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698695357817,
        "cdate": 1698695357817,
        "tmdate": 1699636307985,
        "mdate": 1699636307985,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "dzB9HxfCQ7",
        "forum": "FRpCyW7pWp",
        "replyto": "FRpCyW7pWp",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3539/Reviewer_YiRU"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3539/Reviewer_YiRU"
        ],
        "content": {
            "summary": {
                "value": "In this paper, the authors introduce an innovative model known as Cont-GRU, which operates in continuous time. Cont-GRU stands out for its ability to generate continuous hidden states, reset rates, and update gates. To gauge the model's performance, the authors conducted a comprehensive comparative analysis, pitting it against 17 baseline models across five real-world datasets."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "1 poor"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "1. The authors present a fully continuous GRU model.\n\n2. To address the homeomorphic issue inherent in ODE-based methods, the authors incorporate Differential Delay Equations (DDEs).\n\n3. The proposed model exhibits a relatively small memory footprint, making it efficient and resource-friendly."
            },
            "weaknesses": {
                "value": "1. The authors overlook several closely-related works, warranting a more comprehensive discussion of the relevant literature.\n\n2. The introduction section lacks a clear and well-articulated explanation of the underlying intuition behind the proposed model.\n\n3. The experimental results may benefit from greater credibility by including additional baselines that are currently absent from the analysis."
            },
            "questions": {
                "value": "1. The paper lacks a comprehensive discussion of Cont-GRU in relation to Neural CDE and Neural DDE, giving the impression that it is a straightforward amalgamation of these approaches.\n\n2. The paper omits discussing CRU [2], a continuous recurrent model, which should be included in the related work section.\n\n3. While the authors emphasize the limitations of Neural ODE and Neural CDE regarding the homeomorphic issue, they do not provide experimental evidence demonstrating how Cont-GRU addresses this problem.\n\n4. Despite comparing with 17 baselines, several pertinent baseline models, such as CRU and DDE-based models, are conspicuously absent and should be included in the evaluation.\n\n5. The authors assert that previous work represents a \"half-way continuous\" generalization of GRUs and argue for the necessity of fully-continuous models. However, the paper should explicitly state the limitations of fully-continuous models in certain scenarios, such as recommendation systems, where preferences can undergo abrupt changes due to external events [1].\n\n6. The formulation of the derivative dh(t)/dt, particularly the role of A, B, and C in Equation (6), is inadequately explained in the main paper, causing confusion.\n\n7. Although an adaptive delay factor is proposed, the paper lacks experimental validation of its effectiveness and efficiency, such as whether it reduces memory usage or accelerates the training process.\n\n8. Memory usage and time cost should be discussed in the main paper, along with a clear explanation of why Cont-GRU is faster than NCDE.\n\n9. Figure 1 requires improvement to enhance clarity, as the computation flow of Cont-GRU is not evident from the current depiction.\n\n[1] Neural jump stochastic differential equations\n\n[2] Modeling Irregular Time Series with Continuous Recurrent Units"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3539/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698833132428,
        "cdate": 1698833132428,
        "tmdate": 1699636307905,
        "mdate": 1699636307905,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "oS492rHkQU",
        "forum": "FRpCyW7pWp",
        "replyto": "FRpCyW7pWp",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3539/Reviewer_JpZR"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3539/Reviewer_JpZR"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a new continuous GRU model for continuous time series data. It does so by defining a GRU as a delay differential equations which allows them to have a fully continuous model. The method is similar to neural controlled differential equations, with the added lag as an input."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The main method makes sense and the continuous extension of GRU is sensible. The choice of $\\tau$ is convenient and I can see that it can be useful to pick this particular parameterization with adaptive solvers.\n\nThe results in Table 1, 2, 3 and 4 are really good. The method confidently beats the competitors across all tasks.\n\nThe empirical studies are a nice addition as they showcase what exactly works and what does not."
            },
            "weaknesses": {
                "value": "This is not the first continuous model in the sense of evolving the hidden state without jumps, neural CDEs are one example. It seems that the difference to neural CDEs is the network that you use, in particular you have GRU updates, and you add a single previous step from the solver.\n\nThis is also not the first neural DDE. The paper mentions two previous works but does not explain how is the proposed method different, nor is there a comparison with these methods (or explanation why it's not possible).\n\nAlthough the method is presented as continuous, the main experiments are encoding fixed history and making a prediction based on the encoded vector. So the method is still encoder-decoder, therefore, you should also compare to mTAN [1] or potentially some other strong baselines. Figure 1 (c) shows that the values x(t) are continuous in time but this is only available up until the last observed data point, unless you use causal interpolation as discussed in [2]. Note that the causal cubic Hermite spline will still not allow online prediction. The method is therefore still lacking the online prediction that is possible with \"jump\" methods.\n\nThe implementation in code uses saving and loading previous delay values from a file which is not ideal, I can imagine some errors arrising because of that. Also, the authors should try to have a better implementation if they want wider adoption of their method.\n\nThe paper could be written better in general.\n\nMinor:\n\n- Limitations 1. and 2. in Introduction are not really limitations but simply design choices.\n\n- \"Eq. equation\" in many places\n\n- Algorithm 1 is not very useful, it contains too little information about the actual training procedure.\n\n[1] Shukla & Marlin, Multi-Time Attention Networks for Irregularly Sampled Time Series (2020)\n\n[2] Kidger et al., Neural Controlled Differential Equations for Online Prediction Tasks (2021)"
            },
            "questions": {
                "value": "- GRU is surprisingly bad in Table 1 compared to your method. How do you explain this gap in performance considering that USHCN is a regularly sampled dataset?\n\n- The baselines in Figures 5 and 6 look way off. What is the reason for such poor predictions?\n\n- Similarly, ODERNN is very \"jumpy\" in predictions on USHCN in Figure 4."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3539/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698837120744,
        "cdate": 1698837120744,
        "tmdate": 1699636307824,
        "mdate": 1699636307824,
        "license": "CC BY 4.0",
        "version": 2
    }
]