[
    {
        "id": "i1F5eG5NSq",
        "forum": "fTEPeQ00VM",
        "replyto": "fTEPeQ00VM",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3335/Reviewer_EeeT"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3335/Reviewer_EeeT"
        ],
        "content": {
            "summary": {
                "value": "The paper proposes TabRepo -- a dataset of predictions and metrics for 1206 hyperparameter configurations of 6 models (i.e. 201 configuration per model) on 200 classification and regression tasks (to clarify, these 200 tasks are taken from existing public benchmarks).\n\nThe paper demonstrates that TabRepo can be useful for:\n- analyzing whether hyperparameter tuning and ensembling can help traditional models outperform modern AutoML systems;\n- analyzing ensembling strategies by using the published model predictions without retraining these models (*\"at no cost\"*);\n- performing *\"transfer learning\"* (in this paper, this term describes the usage of results obtained on some tasks to inform the choice of models/hyperparameters/etc. on other tasks); as an example of this, the paper shows that portfolio learning outperforms existing AutoML approaches."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- The paper is easy to follow.\n- The training, evaluation, ensembling and hyperparameter tuning protocols are clear and transparent.\n- The evaluation of the \"Portfolio learning\" technique and its positive results is interesting.\n- TabRepo is the largest dataset in its niche.\n- Many modern AutoML algorithms are covered."
            },
            "weaknesses": {
                "value": "*(a quick comment on the selected confidence level: I am not a big expert in the whole landspace of AutoML papers, though I am familiar with this type of methods; as for all other aspects, I am fully familiar with them)*\n\n\n**(A) Regarding datasets, in my opinion, the \"quality vs. quantity\" balance should be improved.** I believe that, for the field of tabular data, it is time to raise the bar in terms of dataset quality and to compose benchmarks that will have more chances to generalize to real world problems. After a quick review, I noticed the following datasets that can make the benchmark biased in ways that a hypothetical practitioner would not approve:\n- volcanoes-{a2,a3,a4,b1,b2,b5,b6,d1,d4,e1} -- the real world is not 10x biased towards tabular datasets about volcanoes with 3 features and 5 classes, but the benchmark is biased in this way.\n- wine-quality-{red,white} -- see the previous bullet.\n- fri_c0_1000_5, fri_c0_500_5 and 8 more similar tasks (10 in total) -- also seems to be a set of closely related problems as in previous bullets.\n- optdigits -- I think that computer vision problems should not be included in general tabular benchmarks, or should be presented in a separate group.\n- kr-vs-k -- I think that deterministic game-based problems (here, chess) should not be included in general tabular benchmarks, or should be presented in a separate group.\n- etc.\n\nPerhaps, works like `[1]` can be a source of more realistic datasets (worth mentioning: `[1]` is a bit limited in terms of dataset sizes, so other works like `[2]` may also be worth considering).\n\n**(B) I think that models should be more diverse.** The current set of models is strongly biased towards:\n- tree-based models (all models except for MLP)\n- ensemble-like models (all models except for MLP)\n\nI am afraid that this may limit the potential of TabRepo in terms of what kind of analysis it allows conducting and what results it allows uncovering. I suggest considering the following:\n- Adding one linear model.\n- Adding one non-parametric model (e.g. kNN or modern kNN-like models), at least on datasets where it is possible.\n- Adding one modern parametric DL model (note that competitive parametric DL models are not necessarily heavy transformers `[3]`).\n- Adding one modern non-parametric DL model.\n- Keeping no more than two gradient boostings (personally, I would prefer just one, again, to reduce tge bias, given that there is also RandomForest).\n- Excluding ExtraTrees.\n\nAlso, I appreciate that there are various opinions on whether tabular DL models are worth attention. However, if DL models are not well presented, then the benchmark should be positioned as Classic-ML-only benchmark, but not as a general benchmark. Otherwise, some readers may have wrong expectations from the title and the abstract.\n\n**(C) In my opinion, the paper may need bigger stories (bigger than Section 4 and Section 5) to support the proposed dataset.** My understanding is that it is (implicitly) suggested that TabRepo will help others to uncover and tell big/novel/non-trivial stories. However, compared to mainstream dataset-oriented works like `[1]` (where it is easy to imagine a wide target audience and a potential range of works based on the proposed benchmark), TabRepo seems to be more niche, and, to me, it is not immediately obvious how TabRepo can be used to obtain novel results. This is why, in this specific case, I expect the proposed dataset to be supported by at least one strong self-sufficient finding.\n\nI would like to add that:\n- I appreciate the stories told in Section 4 and Section 5, there is nothing wrong with them. However, they are not positioned as founding elements of the paper and, indeed, it may be too early to position them as such.\n- If (A) and (B) are perfectly addressed, then (C) will not be a blocker, at least not for me.\n\n**(D) Other things:**\n- The story in the introduction may be a bit polarizing. I mean things like \"their performance has saturated and state-of-the-art methods now leverage AutoML techniques\", *\"AutoML solutions currently dominate tabular prediction benchmarks\"*, etc. I embraced the suggested perspective for the review, but overall, I don't share it, and I can imagine how this can trigger big discussions.\n- Not a big issue, but personally, I find the \"at no cost\" wording a bit controversial, I would probably avoid it or somehow make it softer. The reported findings have non-zero cost, and the ability to use a public dataset at no cost is a usual property of public datasets. Perhaps, I am missing something here, but sharing this impression just in case.\n\n**References**\n\n- `[1]` \"Why do tree-based models still outperform deep learning on tabular data?\" Grinsztajn et al.\n- `[2]` \"TabR: Tabular Deep Learning Meets Nearest Neighbors in 2023\" Gorishniy et al.\n- `[3]` \"On Embeddings for Numerical Features in Tabular Deep Learning\" Gorishniy et al."
            },
            "questions": {
                "value": "See weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3335/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3335/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3335/Reviewer_EeeT"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3335/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698586298340,
        "cdate": 1698586298340,
        "tmdate": 1699636282964,
        "mdate": 1699636282964,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "VE4ssYRdxU",
        "forum": "fTEPeQ00VM",
        "replyto": "fTEPeQ00VM",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3335/Reviewer_XQfD"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3335/Reviewer_XQfD"
        ],
        "content": {
            "summary": {
                "value": "The paper introduces a big dataset of tabular model predictions. It showcases a few use cases of such dataset like: offline evaluation of hyperparameter tuning, hyperparameter transfer (portfolio learning). It shows that a simple portfolio learning method using this dataset outperforms state-of-the-art AutoML system on a standard benchmark."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- The paper is very well written.\n- The experimental setup is sound: proper baselines, standard and relevant benchmark.\n- The idea of sharing a large set of model evaluations is interesting, potentially practical and extensible. \n- Performing on par with SoTA AutoML systems with a simple model selection technique from a proposed dataset.\n- The investigation into how much data is needed for efficient transfer is insightful."
            },
            "weaknesses": {
                "value": "- A set of models is rather small. One potentially interesting\n  extension could be adding more mainstream DL techniques (besides\n  transformers, which are considerably slower, as correctly noted in\n  the limitations section). Extending MLPs with regularization\n  techniques from `[1]` could make the results more \"modern\" in the DL\n  part of tabular models. MLPs with embeddings for continuous features\n  from `[2]` is another potential candidate for a more \"modern\" but\n  still fast DL method.\n- It is unclear how the results would transfer to a more\n  out-of-distribution datasets. Would portfolio transfer work as well\n  as AutoML or hyperparameter tuning on datasets that differ from the\n  datasets present in the benchmark in some aspects. Seeing\n  performance on disregarded larger datasets (discussed in appendix)\n  could shed more light on practical applicability of TabRepo\n- One limitation that should be discussed is the tradeoff between\n  computational efficency and memory. TabRepo is a large dataset,\n  this could introduce problems in practice and make AutoML systems preferable.\n\n**References**:\n- `[1]` Kadra, Arlind, et al. \"Well-tuned simple nets excel on tabular datasets.\" Advances in neural information processing systems 34 (2021): 23928-23941.\n- `[2]` Gorishniy, Yury, Ivan Rubachev, and Artem Babenko. \"On embeddings for numerical features in tabular deep learning.\" Advances in Neural Information Processing Systems 35 (2022): 24991-25004."
            },
            "questions": {
                "value": "- Are the portfolios (selected models+hyperparameters) interpretable? (In a rough sense: there is a large MLP, small GBDT, heavily regularized MLP, etc.), or the portfolios are mostly random and change for different subsets (of datasets)?\n- Could TabRepo results be used for a new, potentially OOD datasets (for example larger tabular datasets than present in the benchmark). How does zero shot portfolio transfer compares to AutoML and hyperparameter tuning on OOD datasets?\n\nMinor remarks (mostly stylistic or notation):\n- In the model bagging section there might be a slight misuse of the $[n] = \\{1,...,n\\}$ notation introduced earlier, where it is used as an index in $(X^{(\\mathrm{train})}[b], y^{(\\mathrm{train})}[b]), (X^{(\\mathrm{val})}[b], y^{(\\mathrm{val})}[b])$.\n- In the same model bagging section and the next (Datasets, predictions and evaluation) you say that models are fitted by minimizing the losses, in case of binary classification it's AUC, is it directly optimized for all models, or is it just used as a metric (and the terms loss and metric are used interchangeably)?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3335/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3335/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3335/Reviewer_XQfD"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3335/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698819225900,
        "cdate": 1698819225900,
        "tmdate": 1699636282881,
        "mdate": 1699636282881,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "MFxvAVSD8x",
        "forum": "fTEPeQ00VM",
        "replyto": "fTEPeQ00VM",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3335/Reviewer_PZnZ"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3335/Reviewer_PZnZ"
        ],
        "content": {
            "summary": {
                "value": "The paper provides a collection of predictions from a wide range of models over an extensive benchmark of 200 regression and classification datasets. The paper draws some conclusions about model performance in different families, and how the predictions can be used for post-hoc ensembling."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "I agree with the paper that extensive benchmarking is quite expensive, and the AutoML benchmark in particular is expensive to run. \nThe paper is quite clearly written, and easy to follow."
            },
            "weaknesses": {
                "value": "It's unclear to me how the problem of expensive benchmarks is solved by the proposed repository; at best it can be a benchmark for ensemble strategies. Something similar has been done in \"CMA-ES for Post Hoc Ensembling in AutoML: A Great Success and Salvageable Failure\" by Purucker, though with much more involved ensembling methods.\n\nThis paper only uses a simple greedy method, similar to what is used in Autosklearn, or \"Mining Robust Default Configurations for Resource-constrained AutoML\" (Flaml zero shot) or \"Learning Multiple Defaults for Machine Learning Algorithms\" or \"Learning hyperparameter optimization initializations\".\n\nFuthermore, the distinction and benefit over OpenML is not entirely clear. Figure 1, for example, could have been generated with the runs on OpenML, which contains 10M runs, compared to 200k runs in this paper (with the disclaimer that the runs are not a cross-product of models and datasets, i.e. not all models are evaluated on all datasets, though there is several \"studies\" that do exactly that).\n\nThe main reason that OpenML does not store predictions or probabilities is that this would be very storage intensive and there is no funding for it. Most works that do portfolio building have computed all of these metrics, though they are usually not shared since the storage overhead seems daunting."
            },
            "questions": {
                "value": "How large is TabRepo in GB?\nDo you intent for TabRepo to have new models dynamically added, or do you want to fix thecurrent models?\nWhat future uses do you see for TabRepo?\nHow does your work compare to \"CMA-ES for Post Hoc Ensembling in AutoML\"?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3335/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698870333084,
        "cdate": 1698870333084,
        "tmdate": 1699636282807,
        "mdate": 1699636282807,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "1Pl5rvHIpo",
        "forum": "fTEPeQ00VM",
        "replyto": "fTEPeQ00VM",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3335/Reviewer_kTk5"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3335/Reviewer_kTk5"
        ],
        "content": {
            "summary": {
                "value": "Authors introduce a large dataset of tabular model evaluations on a large set of models as well as datasets. The prediction outputs of the considered models are also provided for efficient analysis without having to reevaluate the models. Authors demonstrate the utility of their dataset by 1. comparing hpo methods and auto-ml systems, 2. demonstrating ensembling, portfolio-selection and 3. transfer learning capabilities."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- The evaluation is extensive, with all the models constructed through bagging on multiple cross-validation folds and initialization for each dataset. \n- Utility of TabRepo is demonstrated by analyzing the cost of tuning and the performance obtained for various auto-ml methods.\n- Model portfolio  construction and transfer learning is shown to be effective using already-computed predictions."
            },
            "weaknesses": {
                "value": "As a dataset of tabular-model evaluations, the work is sound. However, I am not entirely convinced about the utility of the analysis provided in this work. For ex, various autoML methods and their performance comparisons (Fig 2) are already provided as part of AutoGluon. It would be helpful if the authors could illustrate a few more cases which potentially could benefit from TabRepo."
            },
            "questions": {
                "value": "Could you suggest few more potential use-cases that benifit from including prediction outputs?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3335/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699054636531,
        "cdate": 1699054636531,
        "tmdate": 1699636282737,
        "mdate": 1699636282737,
        "license": "CC BY 4.0",
        "version": 2
    }
]