[
    {
        "id": "SEOExSU2JN",
        "forum": "FTSUDBM6lu",
        "replyto": "FTSUDBM6lu",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8603/Reviewer_1SjE"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8603/Reviewer_1SjE"
        ],
        "content": {
            "summary": {
                "value": "The manuscript introduces an explainable convolutional neural network (CNN)-based method for medical image classification. Specifically, it first uses a multi-phase feature selection algorithm to select important features from a pre-trained CNN model, and then adopts a patch ranking algorithm to identify informative patches in the input image. The method is evaluated on an Alzheimer’s magnetic resonance imaging (MRI) dataset to demonstrate its effectiveness."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The manuscript presents a simple method to identify important regions/patches in input images for CNN predictions and thus helps improve model explainability.\n\n2. The proposed method can produce higher image classification accuracy with a smaller model size."
            },
            "weaknesses": {
                "value": "1. The focus of this submission is to improve CNN model explainability, but this is not well verified in the experiments. For instance, it is not clear how the most informative patches “at the 7th and 12th patch rows and at the 8th and 9th patch columns” identified by the method is related to the clinical interpretation. Are those patches indeed the most discriminative from a clinical perspective? In addition, the quantitative evaluation of how the top-ranked image patches contribute to the CNN prediction is also not clear.\n\n2. The presentation is difficult to follow and needs to be significantly improved. (1) Some key technical concepts or details are not well explained. For example, the motivation of patch ranking score definition in Algorithm 2 is not clear, and no intuitive explanation is given in the manuscript. In addition, the introduce of \\omega_k is not well motivated. (2) The notations are inconsistent. For instance, do the K’s in Algorithm 1 and Algorithm 2 have the same value? In Section 2.1, m = n x H x W and represents the number of the features, but m = max(a_{ij}) in Section 4. Additionally, no definition for Q_S (Section 2.1) is provided. These ambiguous notations are very confusing. (3) Figure 1 does not clearly show the workflow of the proposed method in the training or testing stage. It would be helpful to provide two separate figures for model training and testing respectively.\n\n3. The method is tested on a single CNN backbone, ResNet50, which produces features with each corresponding to 8 x 8 patches in the input image. It is not clear if the method is applicable to other CNN architectures that extract features with each corresponding to different-sized image patches. This is not explored or tested in the experiments.   \n\n4. The proposed method is evaluated on a single image dataset and disease, so the generalization to other diseases is unknown.       \n\n5. The dataset used in the experiments is highly imbalanced. The number of moderate demented cases (64 subjects) is much smaller than that of non-demented (3200 subjects) or very mild demented (2240 subjects) cases. Is it not clear what loss is used to handle the data imbalance. In addition, the model classification performance is evaluated using only classification accuracy, which is not an appropriate choice for imbalanced data."
            },
            "questions": {
                "value": "In addition to the comments in the Weaknesses above, there are some others to be clarified: \n\n1. It seems that the proposed method requires the input images to be well registered so that all images are in the same coordinate system. What if some input images shift to a direction (horizontal or vertical) by a few pixels? Will this affect the identification of the important image patches for different input images that are not in the same coordinate system or space?\n\n2. In Section 1 of Page 2, regarding the sentence “current methods such as CAM-methods based heatmaps do not deeply analyze a relationship among ranked image patches, top features, top feature maps, and a decision.” What does “deeply analyze a relationship” mean?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission8603/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission8603/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission8603/Reviewer_1SjE"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8603/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698680354216,
        "cdate": 1698680354216,
        "tmdate": 1699637076122,
        "mdate": 1699637076122,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "UXJiPlVZCP",
        "forum": "FTSUDBM6lu",
        "replyto": "FTSUDBM6lu",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8603/Reviewer_xK6b"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8603/Reviewer_xK6b"
        ],
        "content": {
            "summary": {
                "value": "This paper describes a Patch Ranking Map (PRM), a learnable set of image patches that have important associations with a CNN’s decisions. A feature accumulation matrix and feature ranking matrix are used to rank image patches in the PRM for purposes of explainability. The PRM was shown to consistently select brain regions associated with Alzheimer’s disease from MRI images, and the selection of top features was shown to enable more efficient models that improve test accuracy, while reducing model size (Table 1)."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "-\tNovel framework for systematic ranking of image patches, from feature maps\n-\tDemonstrates possibility for improved classification performance by eliminating relatively uninformative features, which is relevant in medical domains with limited data"
            },
            "weaknesses": {
                "value": "-\tPRM method appears relevant only for tasks where inputs are strictly registered according to some atlas, such that corresponding regions are always in the same spatial position\n-\tMinimal details on the MLP classifying the extracted selected top features\n-\tActual contribution to explainability above existing heatmap methods unclear"
            },
            "questions": {
                "value": "1. The H x W dimensions of the image patches might be justified. Are they due to the nature of the MRI task? In any case, would 1x1 patches (i.e. H = W = 1) equivalent to pixel-level heatmaps be feasible?\n2. The lack of details about the MLP model applied to the selected top features is critical, since it would appear to significantly affect ultimate model performance.\n3. For the model size values listed in Table 1, it might be clarified as to whether this includes the ResNet50 feature extractor, since that would be a part of the ResNet50-FS model during inference. Moreover, again, the lack of details about the MLP makes it difficult to comprehend the tradeoff with respect to selected top features, and model size.\n4. The method of combining the different FS methods (via the feature matrices) might be further substantiated, especially with respect to the weights of the weighted average functions mentioned in Section 4. How were the weights determined?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8603/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698742741241,
        "cdate": 1698742741241,
        "tmdate": 1699637075952,
        "mdate": 1699637075952,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "BsAa2qHYog",
        "forum": "FTSUDBM6lu",
        "replyto": "FTSUDBM6lu",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8603/Reviewer_PHrZ"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8603/Reviewer_PHrZ"
        ],
        "content": {
            "summary": {
                "value": "The paper proposed a CNN architecture that incorporate feature selection method, in order to provide more explainability to the model decision."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "1 poor"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The paper aims to tackle an important problem, this is especially important in medical applications."
            },
            "weaknesses": {
                "value": "1. The novelty is limited, the proposed model mostly involves straight application existing feature selection methods. \n2. The evaluation is limited (only on one dataset)\n3. Presentations could also be improved. \n4. Incomplete study, the relationship between the top selected patches and the disease is not yet established"
            },
            "questions": {
                "value": "NA"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "1: strong reject"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission8603/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission8603/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission8603/Reviewer_PHrZ"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8603/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698802120613,
        "cdate": 1698802120613,
        "tmdate": 1699637075841,
        "mdate": 1699637075841,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "5AwqUZULwI",
        "forum": "FTSUDBM6lu",
        "replyto": "FTSUDBM6lu",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8603/Reviewer_tnrN"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8603/Reviewer_tnrN"
        ],
        "content": {
            "summary": {
                "value": "A method that incorporates feature selection algorithms into a CNN image classifier is presented that results in a ranking of image patches in input space. This ranking reflects the relevance of the patches to the classifier, and thus provides a way to visualize which part of the images are important to the classification task. Classification of brain MRI images from an Alzheimer’s dataset is used in an experiment and a preliminary result is given but without relating it to the relevant medical literature."
            },
            "soundness": {
                "value": "1 poor"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "The attempt to visualize which parts of the brain are implicated in classifying disease can be of relevance in some applications. The authors have used existing feature selection methods to do this in a novel way."
            },
            "weaknesses": {
                "value": "The approach lacks clear theoretical motivation, and is not compared with existing methods for obtaining sparsity in neural networks or obtaining visual “explanations”. The result highlights certain locations/patches as being most relevant, but this preliminary work has not yet ascertained whether this result makes sense to clinicians/neurologists or agrees with what is known from the medical literature. There are various aspects of the method and experiments which need further development.\n\nAlgorithm 1 applies m feature selection methods sequentially, each reducing the number of features by a prespecified amount, finally reaching K features. This Algorithm box needs to be accompanied by some more careful motivation and explanation. Why is this a good idea? Does it matter which methods are used and on what order, and how might that be decided? How are the numbers of features at each stage to be determined in advance?\n\nAlgorithm 2 effectively just states “select the K patches having the largest values of theta = f (a,r) for some function f”. This doesn’t need its own algorithm box.  The motivation for the choice of f() given on p4 was not clear to me. It is stated without giving the theoretical motivation.\nThe first paragraph of 5.1 gives a part of the method, in which a fine-tuned network is combined with feature selection and a newly trained MLP. This needs to be described more carefully in Section 4.\n\nDetails are missing from the experiment description which states that “top features are selected by the 5-phase FS algorithm”. Which FS methods make up the 5-phase algorithm, in which order were these applied, and how were the parameters omega_0 and s determined?\n\nTable 1 compares the methods with a method that uses all the features. Can the authors please clarify whether the latter uses the extra MLP model, in common with the proposed method? If not, is the comparison a fair one?\n\nTable 3 reports results using 7 partial feature sets, 6 features, from 7 100-feature sets. How/why were these numbers (7, 6, 7, 100) chosen? Were they determined in advance of the experiment, or are they the result of some hyperparameter search which has not been described?\n\nSome sections need reorganized or rewritten. Section 1 contains unnecessary repetition and use of terms such as “ranked image patches”, “top features”, “top feature maps” without first really saying what they mean (top of what?). Section 2 uses notation that could certainly be simplified, and rather than start with a list of definitions would be better to start with the overview which is currently at the start of Section 4. (I think k in Defn. 6 should be K)."
            },
            "questions": {
                "value": "See \"weaknesses\" section above."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "1: strong reject"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8603/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698862194943,
        "cdate": 1698862194943,
        "tmdate": 1699637075661,
        "mdate": 1699637075661,
        "license": "CC BY 4.0",
        "version": 2
    }
]