[
    {
        "id": "sqWRQUhUZ7",
        "forum": "g6rZtxaXRm",
        "replyto": "g6rZtxaXRm",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3107/Reviewer_LDou"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3107/Reviewer_LDou"
        ],
        "content": {
            "summary": {
                "value": "This paper studies how to extend the class descriptions to improve the performance of CLIP-style vision-language models (VLMs) in image classification. It points out that the class descriptions generated by existing methods may not provide useful information that differentiates the class from other classes. \n\nTo address this problem, this paper proposes the Follow-up Differential Descriptions (FuDD). FuDD first identifies a set of ambiguous classes using the basic class descriptions. Then, for each ambiguous class, a LLM is prompted to generate descriptions, which involve information that can distinguish it from other ambiguous classes. The generated class descriptions are then used to obtain the final classification results.\n\nThe empirical studies show that FuDD outperforms the basic class descriptions and naïve LLM generated descriptions that do not consider differential attributes between classes. The experiments include two kinds of LLMs, i.e., the GPT-3.5 (accessed via API) and the open-sourced LLAMa2. It is shown that LLAMa2-based FuDD can achieve effective results after being fine-tuned on the descriptions generated by GPT-3.5."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "* The idea of generating differential class descriptions is well-motivated and reasonable.\n* The experiments are well-designed and the results are convincing, which demonstrates the effectiveness of using differential class descriptions.\n* The paper is well-written and easy to follow."
            },
            "weaknesses": {
                "value": "* The experiments only include one type of VLM, i.e., CLIP. The reviewer would like to know whether FuDD is compatible with more advanced VLMs.\n* There is no analysis on the trade-off between performance gain by FuDD and additional (computational or financial) cost. Since generating pair-wise class description is more expensive than generating independent description for each class, such analysis is important."
            },
            "questions": {
                "value": "N/A"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3107/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3107/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3107/Reviewer_LDou"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3107/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698028899050,
        "cdate": 1698028899050,
        "tmdate": 1699636257054,
        "mdate": 1699636257054,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "7xhABard4y",
        "forum": "g6rZtxaXRm",
        "replyto": "g6rZtxaXRm",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3107/Reviewer_Y5Zb"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3107/Reviewer_Y5Zb"
        ],
        "content": {
            "summary": {
                "value": "This paper studies the prompt engineering. Instead of directly asking LLM or designing a set of prompts, the author proposed to let the model decides which sets of categories are ambiguous and then ask the LLM to clarify those sets of categories. This is actually a quite interesting and smart idea. Comparing with the other prompt engineering approach, the proposed one achieves higher performance."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. The proposed idea makes a lot of sense and achieves quite impressive performance.\n\n2. The paper showed that by finetuning the open-sourced model, the open-sourced model (LLAMA2) could also generate the descriptions with discriminative capability across ambiguous categories.\n\n3. The proposed approach achieves much better performance than simple prompt engineering.\n\n4. If this is the first paper presented in this field, I would rate a strong acceptance. This is a little bit out of my domain, I would rate acceptance."
            },
            "weaknesses": {
                "value": "I think this paper is interesting and the proposed approaches make sense. I would not be able to state the weaknesses."
            },
            "questions": {
                "value": "1. The section 5: I wonder why would the Llama2 can generate informative sentences for satellite images? Especially given the model only been finetuned on the ImageNet dataset sentences.\n\n2. What if the caption is so long and so complex that the image-text model could not understand? I wonder if the author encountered this scenario, if so, how to address it?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3107/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698803449387,
        "cdate": 1698803449387,
        "tmdate": 1699636256972,
        "mdate": 1699636256972,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "Kf2gPgr0Ey",
        "forum": "g6rZtxaXRm",
        "replyto": "g6rZtxaXRm",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3107/Reviewer_sQgp"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3107/Reviewer_sQgp"
        ],
        "content": {
            "summary": {
                "value": "This paper proposed a simple data augmentation technique for zero-shot image classification tasks. Specifically, the idea is to utilize large language models (LLM) to generate more descriptive and informative class labels for ambiguous classes, with the hope that they can help the base image-text retrieval/classification model to classify the image. Experimental results suggest promising gains over baseline, in this case a CLIP model without this augmentation technique."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The proposed method is intuitive. It is expected that using more descriptive class labels can improve zero-shot tasks.\n2. Experimental results show consistent gains across different datasets."
            },
            "weaknesses": {
                "value": "1. The method is incremental, as it is a small trick to boost zero-shot image classification results.\n2. The baseline is not strong enough. It is therefore not clear if the method can still improve state-of-the-art models on these tasks.\n3. More diverse and challenging tasks are missing from the experiment, e.g. image-text retrieval. It will be nice to show wider applicability of the method."
            },
            "questions": {
                "value": "NA"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3107/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698814676938,
        "cdate": 1698814676938,
        "tmdate": 1699636256883,
        "mdate": 1699636256883,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "94kc6k8DdA",
        "forum": "g6rZtxaXRm",
        "replyto": "g6rZtxaXRm",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3107/Reviewer_RXgc"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3107/Reviewer_RXgc"
        ],
        "content": {
            "summary": {
                "value": "Recent work shows that evaluating vision-language models with descriptions on object attributes improves image classification performance. This work proposes to prompt LLMs to specifically give “differential” descriptions (i.e., distinctive attributes between ambiguous classes) and using such more targeted descriptions outperforms generic descriptions. The method shows performance improvement over the baselines on a range of image classification benchmarks."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The idea is simple and natural. Directly prompting LLM to give attributes for a certain class is an underspecified task; there are so many attributes of different granularities to enumerate. Generating differential descriptions given two classes is a smart way to generate targeted attributes."
            },
            "weaknesses": {
                "value": "**1. No significant method improvement**\n\nThe idea of prompting LLM to give more differentiating descriptions is effective but not necessarily a significant innovation. \n\n\n**2. Reliance on pre-trained vision-language models**\n\nThe paper focuses only on getting differential descriptions; however, it is not guaranteed that CLIP can accurately interpret them. The effectiveness of such models hinges critically on and is bounded by the vision-language models. I suspect that this could be why the performance improvement is not very significant and why different CLIP variants could exhibit huge performance variations.\n\nI would appreciate an error analysis: how many of the mistakes are due to insufficient / erroneous differential descriptions and how many of the mistakes are due to CLIP’s insensitivity to descriptions? This could be informative for future work.\n\n\n\n**3. API cost for a single inference on an image**\n\nIt is not immediately clear how many times we need to query LLM for a single inference on one image. For k=10, does it mean we need to create 55 queries? For experiments where k = |C|, will the cost become prohibitive (even with caching)?\n\nIt would be better if such details are discussed in the main text."
            },
            "questions": {
                "value": "- For the equation in 3.2, what does the summation mean? I guess the equation simply means getting the top-k classes with the highest similarity with the image features? Then in this case, do we need to sum over c_i?\n\n- Would it be possible to give examples of differential descriptions for each of the evaluation datasets? It is especially interesting to see the huge performance on EuroSAT.\n\n- Would it be possible to prompt the LLM to come up with differential attributes given >2 classes in a single prompt?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3107/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698829346117,
        "cdate": 1698829346117,
        "tmdate": 1699636256810,
        "mdate": 1699636256810,
        "license": "CC BY 4.0",
        "version": 2
    }
]