[
    {
        "id": "Y0tg6RNNwN",
        "forum": "ghdSJUNlRQ",
        "replyto": "ghdSJUNlRQ",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5252/Reviewer_xgwB"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5252/Reviewer_xgwB"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a novel intrinsic reward function design method in hierarchical goal-based reinforcement learning. In order to alleviate the short-sighted reward designs that often lead the agent into undesirable states where the final goal is no longer achievable, the forward-looking reward (FLR) proposed in this paper can enable the agent to evaluate the achievability of the next subgoal upon the completion of the subtask. FLR can be applied to existing hierarchical goal-based reinforcement learning methods, and the results of the corresponding variants obtained in the Mujoco environment show that FLR can improve the performance of the vanilla algorithm."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The paper is easy to follow. The description of motivation is clear and makes people feel reasonable and meaningful. It is indeed a problem worthy of attention that the intrinsic reward function designed in hierarchical goal-based reinforcement learning is too short-sighted.\n2. The chosen experimental environment is reasonable. If the reward function designed for the agent in the AntMaze3Leg scenario is too short-sighted, it will indeed lead to task failure.\n3. The analysis of the experimental results is sufficient. In the paper, the author gives the number of episodes where the agent falls and the look-ahead reward difference between the normal and fall states when the proposed FLR is applied, which clarify the role of FLR in reinforcement learning to a certain extent."
            },
            "weaknesses": {
                "value": "1. The difference between the performance of the algorithm using FLR and the vanilla algorithm is not significant. Especially in AntMaze4Leg, the performance of FLR+DHRL is almost the same as that of the original DHRL.\n2. The experiment was only conducted in two scenarios. I think this is a more empirical paper and should be experimented in more different domains. The current experimental results are not convincing enough.\n3. I think FLR is more about improving the original algorithm capabilities, rather than really giving it the ability to solve short-sighted problems. For example, in AntMaze3Leg, as training progresses, PIG cannot effectively suppress the number of episodes where the agent falls, and neither can FLR+PIG.\n4. The code is not available, which is not conducive to the reproduction of experimental results."
            },
            "questions": {
                "value": "1. Why do the curves in Figure 4(b) show a downward trend in the later period?\n2. How does FLR+PIG perform in AntMaze4Leg?\n3. I think the comparison between FLR+DHRL with oracle-based DHRL in Appendix Figure 6 cannot be directly used to illustrate that FLR encourages the avoidance of undesirable transitions. Is the reason the author gives this conclusion because their final winning rates are similar? How about the learning curve for the original DHRL?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "N/A"
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5252/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698553977274,
        "cdate": 1698553977274,
        "tmdate": 1699636524075,
        "mdate": 1699636524075,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "jjoYvSSWs8",
        "forum": "ghdSJUNlRQ",
        "replyto": "ghdSJUNlRQ",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5252/Reviewer_oQAw"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5252/Reviewer_oQAw"
        ],
        "content": {
            "summary": {
                "value": "This paper investigates the issue of inefficient exploration in hierarchical goal-conditioned reinforcement learning (HGRL). The main idea proposed in this paper is to use a forward-looking reward (FLR) that guides the low-level policy to consider the achievability of the final goal with respect to the current subgoal or state. The FLR is based on a proxy model that estimates the value function of the next subgoal slightly distant from the current one. The paper claims that FLR can improve the performance and sample efficiency of HGRL, especially when the agent starts from unskilled states. The paper also claims that FLR can be easily applied to existing HGRL methods as an extension. Moreover, the empirical analysis on MuJoCo environments shows that FLR outperforms the selected baselines and demonstrates robustness and stability in complex tasks."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "1 poor"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- It tries to address an important and challenging problem of reward design in HGRL, which has not been well studied in the literature. \n- It proposes a simple yet effective solution incorporating a forward-looking perspective and a proxy model for value estimation."
            },
            "weaknesses": {
                "value": "- The authors claim that their proposed method can work as a plug-in for existing HGRL methods. However, the experiments are conducted only on top of DHRL. Since RL algorithms often perform high-performance variance in different environments/tasks, I think it is necessary to make comparisons with more baselines. And also, I think it would be better if the authors make comparisons on different environments, not only the Maze.\n- Key designs lack of explanation, e.g., how to determine the $sg$ in equation 5? Parameter searching via enumeration, or gradient-based?\n- Missing introduction of environment details\n- The investigation on the effectiveness of $\\alpha$ is not thoroughly, as the authors only test a range of $\\alpha$ when $\\gamma = 0.99$. More trails should be included.\n- The writing is not good enough. For instance, the supplementary should be improved, e.g., there should include some natural language description for the given algorithm tables, and it seems the authors didn't conduct repeated experiments in Figure 6; The paper mentioned FPS algorithm, but what is FPS algorithm? No reference and no introduction; Figure 3 shows the results of \"initial random rollouts\" settings, but there is no description for this setting.\n\nAnd I suggest the authors improving the writing further, especially the details of the involved environments. As you should not suppose your readers are all familiar with the related work of goal-conditioned RL."
            },
            "questions": {
                "value": "1. What is FLW in the begining of section 2.3?\n2. What is the upperbound of $\\epsilon$?\n3. Section 2.3, the authors include a reference to HER in wrong format. It should be a parenthetical citation.\n4. Section 2.2, the authors claim \"we may need to redeﬁne the low-level policy as $\\pi_l(s, sg_i, g)$ rather than $\\pi_l(s, sg_i)$ agnostic to $g$. This requires anadditional complication to train the low-level policy\". How to do that? I cannot relate the corresponding context in this paper. Could you further explain it?\n5. What is the mathematical format of $g$ in your work?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5252/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698662189319,
        "cdate": 1698662189319,
        "tmdate": 1699636523981,
        "mdate": 1699636523981,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "4lFriNu6Li",
        "forum": "ghdSJUNlRQ",
        "replyto": "ghdSJUNlRQ",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5252/Reviewer_mzz8"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5252/Reviewer_mzz8"
        ],
        "content": {
            "summary": {
                "value": "In this paper, the authors focus on the problem that short-sighted reward designs often lead the agent into undesirable states in HGRL. That is, with the completion of a simple given subtask, the agent may be misguided, leading to the ultimate goal becoming unattainable. The authors propose a subtask reward scheme to bridge the gap between the long-horizon primary goal and short-horizon subtasks. The motivation of this paper is reasonable, and there are relatively detailed method analysis."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "+ The motivation of this paper is reasonable, and the introduction is well-organized.\n+ The innovation of this paper is relatively strong.\n+ The effectiveness of the proposed method is verified by experiments.\n+ The pictures presented in this paper are clear and standardized."
            },
            "weaknesses": {
                "value": "+ Only in the simplest scenarios, the proposed method has obvious performance improvement. More experiments should be conducted in various scenarios(such as FetchPush, FetchPickAndPlace, AntMazeBottleneck, and UR3Obstacle) to highlight the superiority of the proposed method.\n+ As can be seen from the ablation study, the experiment is sensitive to the hyperparameter $\\varepsilon$, even in a simple task, not a robust hyperparameter is provided.\n+ The proposed solution is only suitable for controlling the local reaching task of the robot, because when achieved goal is subsituted with the location of the object being operated, it has the same hindsight goal for all the goal relabeling using HER, and FLR will not yield results as expected.\n+ It seems that the subscripts of $sg_{i}$ and $k_{i}$ are not standardized.\n+ At the beginning, the value of $V_{\\pi}$ is definitely biased, and these biased values will continue to exist in the experience buffer when updating, which will continue to degrade theperformance, and may be a reason for the unsatisfactory performance on complex tasks.\n+ The proposed solution is only suitable for controlling the local reaching task of the robot, because when the operated object is not changed in position，it has the same hindsight goal for all the goal relabeling using HER, and FLR will not yield results as expected."
            },
            "questions": {
                "value": "See weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5252/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698835875039,
        "cdate": 1698835875039,
        "tmdate": 1699636523901,
        "mdate": 1699636523901,
        "license": "CC BY 4.0",
        "version": 2
    }
]