[
    {
        "id": "Le6CQzB48W",
        "forum": "GsNp4ob8BY",
        "replyto": "GsNp4ob8BY",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5697/Reviewer_bkwo"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5697/Reviewer_bkwo"
        ],
        "content": {
            "summary": {
                "value": "This work proposes a parameter-efficient finetuning approach similar to \"prompt tuning\", which inserts special tokens to the input and learns to adapt domains and shift behaviors based on the special tokens. Specifically, two types of tokens can be learned: \"domain markers\", which prepends to the input to indicate specific domains, and \"functional tokens\", which appends to the input to indicate specific tasks. The authors conduct experiments on: 1) Machine Translation, to show the proposed approach can achieve modularity and compositionality of different domains; 2) Molecular Property Prediction & Drug-Drug Interaction, where the approach achieves better performance than other baselines when adopting regression heads (rather than to predict discrete tokens); 3) Binding Affinity Prediction, where the approach operates on both Protein and Drug domains and achieves good performance."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- The proposed approach is an effective application of \"prompt tuning\" with certain adaptation; especially, it is proven effective achieving modularity and compositionality through experiments on Machine Translation and Drug-Drug Interaction. It is shown that modularizing domains and tasks is possible through learning those special tokens, which could derive zero-shot performance on unseen task domains by composition.\n  \n- The proposed approach is evaluated on multiple datasets across different domains, especially including Protein and Chemical Compounds, which are quite distant from natural languages, where it is able to obtain good performance on all of them through finetuning only a small amount of parameters."
            },
            "weaknesses": {
                "value": "- The proposed approach is similar to \"prompt tuning\" and its related techniques. The mere adaptation is to provide a different set of tokens per domain/task, which itself is relatively trivial. The ability to achieve modularity and compositionality is also not as surprising, though it is still valuable to show it empirically.\n  \n- The state-of-the-art performance on Protein and Chemical Compounds seems to mainly come from using regression heads, rather than from this specific way of using the prompt tuning, as shown by Figure 3. **There are no side-by-side experiments comparing the traditional prompt-tuning and the proposed tuning both adopting regression heads or regular LM heads**. In the end, the proposed approach is essentially equivalent to prompt tuning, if not considering task/domain composition. Adding this side-by-side experiments on a specific task could help to show the advantages of the proposed setting."
            },
            "questions": {
                "value": "Is it possible to show the results of the regular prompt tuning with regression heads on the task of Descriptor Prediction or QED Prediction alone?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5697/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698733205262,
        "cdate": 1698733205262,
        "tmdate": 1699636596151,
        "mdate": 1699636596151,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "rnUJru1Ree",
        "forum": "GsNp4ob8BY",
        "replyto": "GsNp4ob8BY",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5697/Reviewer_VcX3"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5697/Reviewer_VcX3"
        ],
        "content": {
            "summary": {
                "value": "The authors design a framework for adding trainable special tokens (called ability tokens) to pre-trained language models (LMs). Embeddings of these special tokens are learned on the corpus of specialized domains in order to adapt the model to these domains. The authors introduce two types of ability tokens: domain markers and functional tokens. Domain markers are trained on the single-domain unlabeled corpus. Functional tokens are trained on single-domain and multi-domain labeled samples. During inference, these special tokens are inserted into the input text. Experimental results on machine translation, protein, and molecular property prediction achieve better performance compared with other domain adaption methods, such as LoRA and prompt tuning."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. This method achieves better performance in the medical domain than other PEFT methods.\n2. These ability tokens can be combined to generalize to unseen tasks.\n3. Only a few parameters need to be trained for the domain adaption."
            },
            "weaknesses": {
                "value": "1. This method is similar to existing PEFT methods like Prompt-Tuning. I think it may lack novelties.\n2. Ablation experiments show that the effectiveness of domain markers is relatively limited.\n3. I think that training regression heads for numerical prediction problems may cause an unfair comparison with other adaption methods based on text generation."
            },
            "questions": {
                "value": "1. What are the main differences between your approach and Prompt Tuning? It would be helpful to add a discussion about this.\n2. Do you use the task-specific linear heads for other baseline methods, like LoRA and prompt tuning?\n3. What is the difference between ability tokens with text instructions used in chat-aligned LLMs?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "N/A"
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5697/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5697/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5697/Reviewer_VcX3"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5697/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698810741477,
        "cdate": 1698810741477,
        "tmdate": 1699636596043,
        "mdate": 1699636596043,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "14OM3xlNAf",
        "forum": "GsNp4ob8BY",
        "replyto": "GsNp4ob8BY",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5697/Reviewer_4P5B"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5697/Reviewer_4P5B"
        ],
        "content": {
            "summary": {
                "value": "This paper explores the repurposing of general language models (LMs) as specialized task solvers, particularly in domains that have limited representation in pre-training corpora. The authors propose the use of ability tokens, specifically domain markers and functional tokens, to enhance LMs' ability to handle specialized inputs. Domain knowledge is encoded in domain markers, while specific task knowledge is encoded in functional tokens. However, a major concern is that the performance seems to be primarily driven by overlap between the training data of the LLMs and the downstream tasks. Additionally, the experiments are mainly focused on one specific domain without testing the generalization of the approach to other domains."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- The paper presents a straightforward method to incorporate domain knowledge into LMs while maintaining the original knowledge encoded in the models' parameters.\n- The performance of the approach is not sensitive to different context lengths."
            },
            "weaknesses": {
                "value": "- The contribution of data contamination to the final performance is unclear. The ability tokens, which generally correspond to dataset or task names, may result in LMs memorizing information about the datasets during pretraining. An analysis of this phenomenon is needed to understand the effectiveness of the method.\n- The proposed method is specifically designed for effective domain adaptation of LLMs, but it is only evaluated in the biomedical domain. Evaluations in other domains would strengthen the paper's findings.\n- More ablation studies are required to demonstrate the effectiveness of the ability tokens. For example, evaluating the llama-7b model with and without ability tokens for different tasks.\n- The experiments only utilize one model. Including results from other models would further support the conclusions."
            },
            "questions": {
                "value": "- Is there any specific procedure for initializing the embedding for ability tokens, or is it done in a standard manner?\n- Are the lengths of domain markers and functional tokens always the same, or can they vary depending on the task?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5697/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699138583826,
        "cdate": 1699138583826,
        "tmdate": 1699636595949,
        "mdate": 1699636595949,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "g6VeTskEsH",
        "forum": "GsNp4ob8BY",
        "replyto": "GsNp4ob8BY",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5697/Reviewer_gWMh"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5697/Reviewer_gWMh"
        ],
        "content": {
            "summary": {
                "value": "This paper discusses the limitations of Large Language Models (LLMs) in highly specialized fields such as biomedical sciences and introduces a new framework to improve their performance in specialized tasks. The authors propose the use of \"ability tokens\" as domain markers to guide the model in specific tasks.\n\nThe setting of this paper is interesting. While adding ability tokens is a common practice in aligning language models with new tasks and modalities, it is non-trivial as it results in changes in the early layers of LLM embeddings. The three-stage hierarchical training protocol is both novel and practical. Additionally, the authors evaluate the method across a wide spectrum of tasks, further demonstrating its applicability."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. The paper is well-written, and the claims of the paper are supported by comprehensive experiments on a wide spectrum of tasks. The drug discovery experiments, in particular, are solid, given that biosequences deviate significantly from text, thereby qualifying as a distinctive modality.\n2. The method has good generalization properties (could generalize to unseen tasks). \n3. The study introduces a novel approach that provides contribution to the field, particularly when compared to traditional prompt-tuning methods. The hierarchical training of ability tokens as proposed in the paper enhances the potential for generalization across varied tasks, and allows the combination of ability tokens, making parameter-efficient methods more suitable for multi-task learning."
            },
            "weaknesses": {
                "value": "1. The paper lacks ablation results, which is crucial to demonstrate the effectiveness of the ability tokens."
            },
            "questions": {
                "value": "1. What is the effectiveness of the 3-stage training process and how much each stage contributed to generalization results? \n2. A common practice in adapting Llama to specialized domains is to add specialized tokens as words, such as <molecule></molecule>.  However, these tokens are not added as new tokens, but are tokenized into multiple tokens '<', 'molecule', '>',  and then use LORA to adapt the llm to specialized tasks. This method has shown effective in [1][2]. What is the advantage of the proposed methods to this way of adding ability tokens? \n3. What is the data efficiency of the proposed method, compared to prompt tuning and LORA? \n\n\n[1] Zhu, Deyao, et al. \"Minigpt-4: Enhancing vision-language understanding with advanced large language models.\" arXiv preprint arXiv:2304.10592 (2023).\n[2] Liu, Haotian, et al. \"Visual instruction tuning.\" arXiv preprint arXiv:2304.08485 (2023)."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5697/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5697/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5697/Reviewer_gWMh"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5697/-/Official_Review"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699698056034,
        "cdate": 1699698056034,
        "tmdate": 1699698115687,
        "mdate": 1699698115687,
        "license": "CC BY 4.0",
        "version": 2
    }
]