[
    {
        "id": "IpQDpssf2P",
        "forum": "gusHSc09zj",
        "replyto": "gusHSc09zj",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2304/Reviewer_bLPE"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2304/Reviewer_bLPE"
        ],
        "content": {
            "summary": {
                "value": "The authors proposed an approach to perform causal discovery from time series data originating from mixtures of different causal models. This approach can simultaneously infer the underlying causal graphs and the posterior likelihood of each sample belonging to a specific mixture component by maximizing the evidence lower bound, on top of the framework of the Rhino algorithm."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The problem setting is interesting, and the approach holds potential for broad applicability.\n2. The authors conduct extensive experiments on simulated and two real-world datasets, compared with several baselines.\n3. The authors characterize a sufficient condition for the identifiability of such mixture models and explain the relationship between the constructed evidence lower bound and the data likelihood.\n4. The authors provide ablation studies."
            },
            "weaknesses": {
                "value": "1. Certain notations and explanations remain unclear, and these will be described in the upcoming Questions section.\n2. Some details concerning the comparison between the proposed method and baseline algorithms in the experiments are perplexing, and these questions will also be raised in the later section.\n3. The baselines used in the paper are not algorithms designed for multiple DAGs and mixture SCMs. Even though the authors mentioned other algorithms designed for multiple DAGs, none has been applied in the comparison."
            },
            "questions": {
                "value": "**1. Notations and explanations**\n\n1.1 The SCM described in equation (1) differs from equation (6) and also the equation below equation (6); which one is correct? Do you assume additive noise?\n\n1.2 In Theorem 1 equation (*), what is the definition of $a_i$? Does it mean one sample from $i$th SCM?\n\n1.3 In Theorem 1, what are $g_1$ and $g_2$? Should they be $h_1$ and $h_2$?\n\n1.4 As mentioned in the main paper, \"This highlights the idea that learning a mixture model is only beneficial when the underlying SCMs differ from one another significantly. \" could you clarify what the significant difference is here?\n\n**2. Details in the experiment**\n\n2.1 In the experiment section, \"(per sample) indicates that the baseline predicts one graph per sample.\" how to apply the algorithm with only one sample? For example, PCMCI$^{+}$ needs CI tests, and CI tests need a set of samples instead of only one sample.\n\n2.2 In the experiment performance section, AUROC and F1 are used as metrics. However, it is not mentioned which kind of AUROC and F1 refer to adjacency or orientation AUROC/F1?\n\n2.3 As far as I know, the Rhino algorithm is not designed for heterogeneous time series data. In the experimental section, would it be feasible to compare the proposed algorithm with \"Rhino (grouped)\" as well? This would involve applying the Rhino algorithm to the grouped data based on the true underlying causal graph. Considering this, the results regarding Rhino in Figures 3 and 6 could be more comprehensive if grouped data were utilized.\n\n2.4 Could the post-processing of PCMCI$^{+}$ outputs potentially affect the AUROC/F1 scores of PCMCI$^{+}$? If it does, would this influence tend to favor the proposed method in the comparison results?\n\n2.5 In the synthetic data experiment, the metrics are averaged across 3 runs. Does each run requires a newly generated synthetic dataset? Personally, 3 runs seem to be a limited number for comprehensive evaluation.\n\n2.6 In Figure 3, it seems a little strange that the performance of PCMCI$^{+}$ (grouped) is better with $D=10$ than with $D=5$. The same phenomenon happened in other algorithms. Do you have any clue on why this happened?\n\n2.7 In Figure 4, \"The accuracy is averaged across 3 runs and across data dimensionality D = 5, 10, 20.\", is it more appropriate to plot the results for $D=5,10,20$ separately as the value of $D$ could affect the accuracy? Again, 3 runs seem limited to me.\n\n2.8 Could you explain more about \"The clustering accuracy and performance metrics show high standard deviation when K is set to the true number of mixture components K* = 10.\" which is stated in the appendix and explain more about the \"buffers\" when $K>K^{*}$?\n\n**3. Other questions**\n\n3.1 Why maximizing ELBO is equivalent to maximizing or minimizing each term separately in the log-likelihood in terms of $\\theta, \\phi$, and $\\psi$ as $\\phi$ and $\\psi$ appear together in the second term?\n\n3.2 Is it better to mention the Rhino algorithm in the related work section and briefly explain how it works as the proposed algorithm is built on top of Rhino?\n\n3.3 Is it essential to verify whether the data satisfies condition (*) to ensure the reliability of the results? If so, how to verify this?\n\n3.4 The paper mentions that people can also infer functional equations through the proposed model. Could you help me locate the related outputs in the experiment section? Does this mean the causal effect?\n\n3.5 Has any code been provided?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission2304/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2304/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2304/Reviewer_bLPE"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2304/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698636012848,
        "cdate": 1698636012848,
        "tmdate": 1699636163001,
        "mdate": 1699636163001,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "w4hx6skdNp",
        "forum": "gusHSc09zj",
        "replyto": "gusHSc09zj",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2304/Reviewer_dKxB"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2304/Reviewer_dKxB"
        ],
        "content": {
            "summary": {
                "value": "An ELBO method is introduced for finding and assigning weight to component SEMs in a mixture and drawing causal inferences from this mixture."
            },
            "soundness": {
                "value": "1 poor"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The problem of identifying the different SCMs in a mixture model where each mixed dataset uses a different graph and parameterization is extremely important, so I’m glad it’s being addressed."
            },
            "weaknesses": {
                "value": "I do have some issues.\n\n1.\tIf we turn to the experimental section of the paper, we get two examples: one for NetSim (which I’m very familiar with) and another for the DREAM3 gene network. Both of these have problems with respect to the goal of this paper, suggesting that the choice of experimental datasets could be improved.\n2.\tThe problem with the NetSim data is that it’s not an extremely convincing time series, as the records in the simulation are spaced far enough apart in time to render the data nearly i.i.d. In fact, analyzing it as i.i.d. often yields better results than analyzing it as time series, frustratingly, as in this paper: \n\nMulti-subject search correctly identifies causal connections and most causal directions in the DCM models of the Smith et al. simulation study. NeuroImage, 58(3), 838-848. \n\nThis paper also treats the distributions as a mixture, though doesn't assume non-i.i.d.\n\n3.\tAs a result, it seems that any study proposing a time series analysis of this data should do a comparison of this result to one obtained by treating the data as i.i.d. instead, since this is a known phenomenon for this particular dataset. This is an issue because the proposed method is specifically designed to deal with time series.\n4.\tThe problem with the DREAM3 examples is that none of the reported results have any lift with AUC; they’re all stuck around 0.5, which is more or less random. The differences between the methods are slight. This result doesn’t give a case where the proposed method is particularly helpful."
            },
            "questions": {
                "value": "Can you find better examples to show the usefulness of the theory?\n\nWhere can the theory really shine so far as the empirical application is concerned? Where can it be expected to do significantly better than alternative methods?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission2304/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2304/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2304/Reviewer_dKxB"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2304/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698682462211,
        "cdate": 1698682462211,
        "tmdate": 1700076866547,
        "mdate": 1700076866547,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "25upE4QmoU",
        "forum": "gusHSc09zj",
        "replyto": "gusHSc09zj",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2304/Reviewer_vYSG"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2304/Reviewer_vYSG"
        ],
        "content": {
            "summary": {
                "value": "This work presents a method that infers causal relationships from time-series data by allowing for mixtures of different causal models, rather than assuming a single underlying causal model. The authors utilize end-to-end variational inference to optimize parameters and perform inference on causal graphs, functional equations, and sample membership within mixture components. The method is assessed on both synthetic and real-world datasets, showcasing competitive performance on training data in causal discovery tasks. The authors establish the identifiability of the proposed model under mild assumptions."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The paper addresses a relevant and interesting aspect of causal discovery in time-series data.\n\nThe proposed loss function is a simple extension of the standard variational inference objective, enabling efficient end-to-end training with a mixture of core causal discovery models.\n\nThe method is flexible in terms of the choice of core causal structure learning algorithms, inheriting the structural identifiability properties of these algorithms.\n\nCompetitive empirical results (although on training data) are reported across various metrics."
            },
            "weaknesses": {
                "value": "The proposed objective function can be seen as a straightforward extension of the standard variational inference optimisation framework. Therefore, the overall novelty and significance of the work may be somewhat limited in this regard.\n\nA major drawback of the work is that the reported results are based on training data, as the proposed method depends on learnable sample-specific parameters. It raises questions about why an encoder producing a K-way categorical random variable given a sample was not considered by the authors.\n\nThe lack of reported results on generalisation limits insight into the proposed method's ability to perform beyond the training data.\n\nAlthough the method claims flexibility in terms of core causal structure learning algorithms, performance is only demonstrated based on one causal discovery method."
            },
            "questions": {
                "value": "Can you please clarify how the AUROC metric is computed for the different methods being compared?\n\nRegarding the experiment on Netsim-permuted data, wouldn’t one expect the results of the proposed method to be inherently favorable compared to non-mixture alternatives? This is because by permuting the variables, we intentionally manipulate the data to explicitly align with the underlying assumption of a mixture model.\n\nWhat specific hyper-parameter value K was chosen for the DREAM3 Gene Network experiment?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2304/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698845247683,
        "cdate": 1698845247683,
        "tmdate": 1699636162831,
        "mdate": 1699636162831,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "SV7RGvthUW",
        "forum": "gusHSc09zj",
        "replyto": "gusHSc09zj",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2304/Reviewer_vKpF"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2304/Reviewer_vKpF"
        ],
        "content": {
            "summary": {
                "value": "Authors propose a variational inference adopted for causal discovery in time-series data; in particular for mixtures of multiple causal graphs."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- in general, exposition is good (although there is room for clarity and explanations in formal parts ).\n- addressing  mixture of multiple-causal graph  discovery is an interesting/relevant direction of research, that hasn't been much investigated (although I have my reservations)\n- experimental results are coupled with a theoretical structural identifiability result."
            },
            "weaknesses": {
                "value": "- my main skepticism is due to the fact that all the results are for the training set, which I am surprised (and had a stronger positive impression until that point). Trivial enough: For an unquestionable positive score, I would rather need result on test data, on unseen graphs. \n\n-   How different the causal graphs in these mixture models (and also the data i.e., average SHD within the cluster is missing.  This is really important to really understand what is going on behaviour of the method. (hence, my question). No surprise to see its effect on highly-imbalanced one.\n\n- on minor point,  an illustrative toy example is lacking would be very useful."
            },
            "questions": {
                "value": "-  What is the effect of the distance between causal graphs to the performance?\n\n-  g_1 and g_2 are not defined in Theorem 1, is it a typo: should be h? or a particular graph?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission2304/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2304/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2304/Reviewer_vKpF"
                ]
            }
        },
        "number": 5,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2304/-/Official_Review"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1700417252166,
        "cdate": 1700417252166,
        "tmdate": 1700417252166,
        "mdate": 1700417252166,
        "license": "CC BY 4.0",
        "version": 2
    }
]