[
    {
        "id": "pdzBR0T87N",
        "forum": "hbHwZYqk9T",
        "replyto": "hbHwZYqk9T",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission100/Reviewer_45Hg"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission100/Reviewer_45Hg"
        ],
        "content": {
            "summary": {
                "value": "Federated learning has gained attention for its capability to train global models while maintaining local data privacy. This paper delves into the challenge of client-side model heterogeneity, exacerbated by differences in clients' memory, processing, and network capabilities (system heterogeneity). The proposed FedP3 framework can well address these challenges."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "4 excellent"
            },
            "strengths": {
                "value": "- Adaptable Design: FedP3 caters to model diversity by allowing personalization based on each client's specific capacities, including computational, memory, and communication constraints.\n- Novel Dual-Pruning Strategy: FedP3 integrates a dual-pruning approach. This encompasses both global pruning (server to client) and local pruning executed by individual clients.\n- Strong Privacy Commitment: FedP3 prioritizes user privacy. The design ensures that full client data is kept confidential as only the selected layers are transmitted from the client to the server post-local training."
            },
            "weaknesses": {
                "value": "- Absence of Theoretical Insights: This work seems lacks a strong theoretical foundation or interpretation.\n- More Ablations: The current model does not explore all potential ablations, for instance, different data aggregation techniques."
            },
            "questions": {
                "value": "Please refer to the weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission100/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698543645749,
        "cdate": 1698543645749,
        "tmdate": 1699635935091,
        "mdate": 1699635935091,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "z5oW3eCGnG",
        "forum": "hbHwZYqk9T",
        "replyto": "hbHwZYqk9T",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission100/Reviewer_8d9P"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission100/Reviewer_8d9P"
        ],
        "content": {
            "summary": {
                "value": "The authors present a \"privacy-preserving\" pruning mechanism that is tailored for heterogeneous clients/devices. In this approach, only a part of the model is transmitted to the server, saving resources and enhancing privacy."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- The paper is well written, presented and easy to understand. \n- Tackling device heterogeneity on federated learning is an important problem\n- Model pruning and submode research is an important step towards addressing device heterogeneity and our ability to train larger models with federated learning"
            },
            "weaknesses": {
                "value": "The main weaknesses of this paper are:\n- The authors claim that this method is \"privacy-preserving\" and designed to maximise privacy overall. At the same time, there is no evaluation at all wrt to privacy (either analytical or through some empirical attacks). Furthermore, the privacy aspect is not discussed, practically assuming that fewer layers sent -> more privacy. While there might be some correlation there, I would expect these claims to be backed up with some thorough evaluation/analysis. \n\n- Similarly, the authors claim that resources are saved (energy, memory, cpu)  and larger models can be trained. But there is no evaluation wrt to any such savings. There are no numerical results wrt to any energy savings, the memory consumption savings, understanding how wide can the heterogeneity can we have wrt to device capabilities. Finally, It would be great to have a thorough study on the convergence speed. \n\n- Finally, given that there are a number of sub-model FL training methods proposed (the authors cite a few), it would be great if the evaluation could be expanded to compare with the state of the art."
            },
            "questions": {
                "value": "Please see my comments above."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission100/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission100/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission100/Reviewer_8d9P"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission100/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698749601078,
        "cdate": 1698749601078,
        "tmdate": 1699635935005,
        "mdate": 1699635935005,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "Ko44TTxBow",
        "forum": "hbHwZYqk9T",
        "replyto": "hbHwZYqk9T",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission100/Reviewer_Kwpv"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission100/Reviewer_Kwpv"
        ],
        "content": {
            "summary": {
                "value": "This paper focuses on addressing the model heterogeneity problem in federated learning. Concretely, it proposes an adaptable federated framework that leverages the personalized pruning technique in a privacy-preserving way. Experiments show that FedP3 can deal with data and model heterogeneity and adapt to various pruning strategies."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. An interesting network pruning-based pipeline is proposed. In this pipeline, the size of training parameters can be personalized for each client.\n\n2. Various local pruning and global aggregation strategies are developed, which present high flexibility of the proposed framework. \n\n3. Limitations of this paper including theoretical analysis and LLMs aspects are well discussed."
            },
            "weaknesses": {
                "value": "1. The relation between privacy-friendly property and network pruning is implicit. It is better to provide a detailed illustration of the reason why existing pruning-based FL methods have privacy concerns. This can help readers to better understand the motivation of the privacy-preserving part. \n\n2. The authors have emphasized the possibility of utilizing the proposed method in LLMs-based scenarios but there is a lack of related experiments supporting that point. Only shallow neural networks and ResNet are considered in the experimental part.\n\n3. To show the improved communication efficiency as mentioned in the 5th paragraph of the Introduction, it is better to provide some quantitive results on the number of communicated parameters. \n\n4. The presentation of the paper should be further enhanced and some parts should be reorganized. For example, the training goal and variable notation should be given in the Preliminary or Methodology section rather than the Introduction section. \n\n5. Lack of empirical comparison with existing FL methods that also address model heterogeneity problem. \n\n6. To solve the model heterogeneity problem, some existing work needs to be discussed, e.g. Knowledge Distillation-based FL [1],  Prototype-based FL [2], and NAS-based FL.\n\n[1] Ensemble Distillation for Robust Model Fusion in Federated Learning, NeurIPS 2020\n\n[2] FedProto: Federated Prototype Learning across Heterogeneous Clients, AAAI 2022\n\n[3] FedNAS: Federated Deep Learning via Neural Architecture Search, arXiv 2020"
            },
            "questions": {
                "value": "1. Please refer to weakness.\n\n2. How to conduct federated training of LLMs based on the proposed method?\n\n3: In the algorithm, predefined pruning mechanisms are assigned for each client. Is this a common operation in FL under model heterogeneity issues? Are there any previous works conducting similar operations?\n\n4: There are multiple pruning and averaging strategies that can be adopted in the proposed FedP3. For a specific case, how to select the most appropriate strategy? \n\n5. In practice, what if we set several types of models to tackle various heterogeneous devices? Can you set a baseline algorithm to test it?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission100/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699448727287,
        "cdate": 1699448727287,
        "tmdate": 1699635934931,
        "mdate": 1699635934931,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "XK073o9trN",
        "forum": "hbHwZYqk9T",
        "replyto": "hbHwZYqk9T",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission100/Reviewer_CVkW"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission100/Reviewer_CVkW"
        ],
        "content": {
            "summary": {
                "value": "The paper focus on the problem of federated learning with model heterogeneity among clients and designs an algorithm that (1) allows each client only to perform training on a small subnetwork and (2) incorporates model pruning between server and clients to meet the different memory and communication constraints of individual clients. For subnetwork selection, the paper allows each client to train a randomly selected subset of layers of the global model. For model pruning, the paper explores two approaches: uniform pruning and uniform-ordered dropout. Finally, for aggregation of clients' updates, the paper explores simple averaging, weighted averaging (with the weight proportional to the number of layers each client trains), and attention averaging."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- The problem of designing FL algorithms under model heterogeneity is well-motivated from practice. \n- The paper introduces the new ingredient of subnetwork pruning between the server and the clients and investigates the effect of pruning strategies and pruning ratio on the performance of FL.\n- The authors performed necessary ablation studies for the proposed algorithm, such as different subnetwork selections, data heterogeneity levels, sizes of total networks, and aggregation methods."
            },
            "weaknesses": {
                "value": "- There is a discrepancy between the experiment setting and the motivation problem setting in the introduction. \n  - The experiment setting does not reflect the heterogeneity of memory and communication constraints between clients, even though this is a major motivation mentioned in the introduction. Specifically, in all experiments, different clients train subnetworks roughly the same size. \n  - The subnetwork is not significantly smaller than the global model. For the ResNet-18 experiments, the subnetwork of each client appears to be at least around half the scale of the global model. This differs from the interesting scenario mentioned in the introduction, where each subnetwork is significantly smaller than the global model.\n- Lack of baselines for interpreting the significance of the proposed algorithm. One baseline that is not mentioned is an approach that performs model pruning on the global model first and then performs standard FL on the pruned smaller model. This is for understanding the necessity of personalized model pruning among clients.\n- Algorithm descriptions sometimes need more clarity; see question 3 for more details."
            },
            "questions": {
                "value": "1. Could the authors comment on whether the algorithm would perform well if the subnetworks trained by individual clients are significantly smaller than the global model? Table 2 shows that the algorithm performs poorly when each client only trains one layer.\n2. Could the authors comment on an alternative approach of global model pruning + standard FL on the pruned model?\n3. Several parts of the algorithm could be clarified more.\n   - Figure 1 shows that each client still needs to store a large proportion of the unpruned global model. Is that correct?\n   - In Algorithm 1, the pruned weights $P_i(W_t^l)$ are not used anywhere later.\n   - In eq (2), the objective function $h$ does not appear to be defined for the problem considered in this paper."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission100/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699635934855,
        "cdate": 1699635934855,
        "tmdate": 1699637371324,
        "mdate": 1699637371324,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "1HL1LmHBLH",
        "forum": "hbHwZYqk9T",
        "replyto": "hbHwZYqk9T",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission100/Reviewer_mPei"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission100/Reviewer_mPei"
        ],
        "content": {
            "summary": {
                "value": "The appeal of Federated learning lies in its privacy-aware model training using data held locally on clients. However, the issue of varied client capacities, termed system heterogeneity, complicates its implementation. This paper proposes the FedP3 framework, emphasizing federated, personalized, and privacy-friendly network pruning, to cater to such diverse client scenarios."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "4 excellent"
            },
            "strengths": {
                "value": "1.\tThe proposed system comprehensively considers a holistic management of heterogeneity, i.e., it effectively manages both data and model disparities. It supports data distribution among clients, class-wise or Dirichlet non-iid. Moreover, it accommodates variance in the models between the server-client and among individual clients.\n2.\tThe proposed methods are inspiring for real-world scenarios, including dual pruning that supports both global pruning (from server to client) and local pruning by individual clients; few-layer communication from the clients to the server after local training. \n3.\tExperiments validate that the proposed FedP3 is both effective and adaptable. It paves the way for personalized and privacy-conscious pruning in a heterogeneous federated setting."
            },
            "weaknesses": {
                "value": "1.\tFew-layer communication can also significantly reduce communication costs and save bandwidth, a detailed numerical analysis would help.\n2.\tThe results on various FL aggregation strategies shall be considered for completeness.\n3.\tHyperparameter tuning part is not so crystal. More explanation is needed on how to choose and tune the hyperparameter (maybe via grid-search?) to deliver the best possible results for each model.\n4.\tBroader Literature Review is expected. While this work focuses primarily on the discussion and analysis of the most relevant and typical works, this approach might overlook other pertinent past research that holds tangential relevance to their study."
            },
            "questions": {
                "value": "1. How much the few-layer communication can save communication costs and bandwidth?\n2. How the other FL aggregation strategies work in combination with FedP3?\n3. How to choose and tune the hyperparameter?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission100/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission100/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission100/Reviewer_mPei"
                ]
            }
        },
        "number": 5,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission100/-/Official_Review"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699666009073,
        "cdate": 1699666009073,
        "tmdate": 1699666009073,
        "mdate": 1699666009073,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "ykL2P9lgVL",
        "forum": "hbHwZYqk9T",
        "replyto": "hbHwZYqk9T",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission100/Reviewer_2HRe"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission100/Reviewer_2HRe"
        ],
        "content": {
            "summary": {
                "value": "This paper highlights the growing interest in federated learning (FL) for its privacy-preserving capabilities. It particularly addresses the challenge of client-side model heterogeneity in FL, driven by variations in client resources. Termed \"system heterogeneity,\" this scenario necessitates customizing a unique model for each client. The paper introduces FedP3, a Federated Personalized and Privacy-friendly Network Pruning Framework, designed to address model heterogeneity effectively. FedP3 can adapt established techniques to specific instances, offering a practical solution."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "==*== Strengths\n+ This work offers an effective and adaptable FL framework FedP3 tailored for model heterogeneity scenarios.\n+ The proposed personalized network pruning technique is applicable to diverse scenarios."
            },
            "weaknesses": {
                "value": "==*== Weaknesses\n- The outcomes of the experiment need to be made more convincing. \n- Limited in-depth comparison with state-of-the-art solutions.\n- Privacy analysis and convergence analysis need to be included.\n- Empirical verification of the claimed contributions is necessary."
            },
            "questions": {
                "value": "Comments:\n\n-\tPrivacy analysis and convergence analysis need to be included. Indeed, separating model parameters from the network parameter architecture is intuitively beneficial to FL privacy protection, but whether existing gradient reconstruction attacks or other privacy attacks will challenge this personalization technology has not been fully explored. Therefore, it would be better if the authors could analyze the privacy performance empirically or theoretically.\n\n-\tFurthermore, the convergence analysis of the proposed method has not given any explanation. For model heterogeneous scenarios, reviewers expect to see rigorous analysis and discussion of the convergence and stability of this method.\n\n-\tThis paper claims that the proposed personalized pruning technique can well alleviate the system heterogeneity and model heterogeneity problems, but the reviewer has not seen any discussion and numerical results on the system heterogeneity scenario.\n\n-\tLimited in-depth comparison with state-of-the-art solutions. In fact, personalized pruning technique is not the first time to be applied to FL to solve efficiency and heterogeneity problems. The following literature needs to be included in the baseline solutions and explain the differences and connections between this paper and them.\n\n[1] Zhou X, Jia Q, Xie R. NestFL: efficient federated learning through progressive model pruning in heterogeneous edge computing[C]//Proceedings of the 28th Annual International Conference on Mobile Computing And Networking. 2022: 817-819.\n\n[2] Li A, Sun J, Li P, et al. Hermes: an efficient federated learning framework for heterogeneous mobile clients[C]//Proceedings of the 27th Annual International Conference on Mobile Computing and Networking. 2021: 420-437.\n\n[3] Pase F, Isik B, Gunduz D, et al. Efficient federated random subnetwork training[C]//Workshop on Federated Learning: Recent Advances and New Challenges (in Conjunction with NeurIPS 2022). 2022."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "NA"
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission100/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission100/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission100/Reviewer_2HRe"
                ]
            }
        },
        "number": 6,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission100/-/Official_Review"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699776804952,
        "cdate": 1699776804952,
        "tmdate": 1700630215244,
        "mdate": 1700630215244,
        "license": "CC BY 4.0",
        "version": 2
    }
]