[
    {
        "id": "xpMA1rvUV8",
        "forum": "hCaoJh01io",
        "replyto": "hCaoJh01io",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3101/Reviewer_dSMV"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3101/Reviewer_dSMV"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes Mutual Information Boost (MIB) to generate key states for a task specified by natural language. Based on the observation that the uncertainty of a state reduces rapidly when approaching a key state, the proposed method identifies key states by maximizing the rate of mutual information changes between the key state and its preceding states. The paper showed that the selected subgoals can guide the policy to reach a higher success rate in manipulation tasks."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- The paper identifies the ambiguity issue of using VLMs to ground key states and proposes a method that uses changes in mutual information to improve it.\n- The information boost can apply to any key states that are defined by physical constraints and is a more principled way to identify key states.\n- The paper presents the method and idea clearly, and it is easy to follow."
            },
            "weaknesses": {
                "value": "- The key states for some tasks are hard to describe using sentences, for example, in the task “hold the tube and align it with the table”, it is hard to describe the key state for “align” if not know the dimension, size, or relative orientation/positions for the tube and table. The proposed method would be more practical if it could identify key states without the state-by-state instruction generated by LLMs.\n- Most tasks in the experiment do not really need to understand key states. For example, tasks such as pick and place cubes can be learned with pure behavior cloning (it is a bit surprising the performance reported in this paper was not that good), but it is harder to see the effect of key states grounding with short-horizon pick-and-place experiments.\n- There is no qualitative example of the identified key states. It is hard to understand if the selected key states are good and why predefined rules are worse than MIB."
            },
            "questions": {
                "value": "- If the key states have the maximum mutual information boost, why there is a need to set “n” (the margin) to ensure any two key states are not too close to each other? It is possible that the two key states are quite close, for example, for the task “inserting the key to the keyhole, aligning the key with the keyhole, and moving the key into the keyhole are both key states and can be quite close to each other temporally.\n- How much does paraphrase instruction help? If the embedding doesn’t have knowledge about the physically relevant description, changing the sentence wouldn’t have much help."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3101/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698723356046,
        "cdate": 1698723356046,
        "tmdate": 1699636256448,
        "mdate": 1699636256448,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "BXIf5cuy1M",
        "forum": "hCaoJh01io",
        "replyto": "hCaoJh01io",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3101/Reviewer_4ns7"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3101/Reviewer_4ns7"
        ],
        "content": {
            "summary": {
                "value": "The paper introduces a method to ground manipulation concepts generated by Large Language Models (LLMs) into physical states, facilitating the training of efficient manipulation policies. The authors observe that current methods, which rely on multimodal foundation models to localize key states, often lack accuracy and semantic consistency. To address this, they propose an information-theoretic criterion called Maximal Information Boost (MIB) to enhance grounding efficiency without requiring extensive fine-tuning. The approach is based on the observation that the uncertainty of a state diminishes rapidly as it approaches a key state."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "This paper presents an interesting idea of using the maximal information boost (MIB) principle to align key state descriptions in language with image states in demonstration trajectories. The final goal of this approach is to enable better imitation learning from demonstration trajectories. The proposed approach is interesting in the sense that it introduces a novel metric for enforcing grounding."
            },
            "weaknesses": {
                "value": "There are three major weaknesses of the paper.\n\nFirst, the writing of the paper is not very clear. For example, the majority of the paper describes how we can use MIB to segment trajectories, but there is no description of how this MIB-derived segmentation is actually used in training the policy network. I believe this part should be at least briefly described in the paper. (I found it in the supplementary material, but I would like to mention that reviewers are not subject to reading the full supplementary material).\n\nSecond, while I found the introduced metric novel and interesting, I did not fully get its intuition. In particular, is it just the case that the speed of the robot arm will be very low when it's close to a \"key state?\" Because the uncertainty is essentially defined as s_t | s_{t-dt}.\n\nThird, since the contribution of the paper lies in segmenting trajectories (the policy part is directly following CoTPC, based on the supplementary description), there is little comparison between the segmentation method and other related approaches, such as\n\n- Skill Induction and Planning with Latent Language https://arxiv.org/abs/2110.01517\n- Learning from Trajectories via Subgoal Discovery https://proceedings.neurips.cc/paper_files/paper/2019/file/6f518c31f6baa365f55c38d11cc349d1-Paper.pdf\n- CompILE: Compositional Imitation Learning and Execution https://arxiv.org/abs/1812.01483\n- Identifying useful subgoals in reinforcement learning by local graph partitioning https://dl.acm.org/doi/10.1145/1102351.1102454\n\namong many, many others. The authors should discuss, and compare with these algorithms.\n\nAlso, it seems that the proposed method has the limitation that each key state can only be visited once in a demonstration trajectory (due to the Chronological assumption). Therefore, it can't model task descriptions that require loops (e.g., scoop all sugar, possibly multiple rounds, to transfer them from one bowl into another bowl)."
            },
            "questions": {
                "value": "If the paper is based on CoTPC and CoTPC uses predefined key states, why would the performance of this paper be better than CoTPC? Is it because CoTPC is using a smaller number of key states? or due to noises in the labels?\n\nIs the variance computed in the pixel space? (eq 7)"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3101/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698781693781,
        "cdate": 1698781693781,
        "tmdate": 1699636256364,
        "mdate": 1699636256364,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "KoEp30rIlV",
        "forum": "hCaoJh01io",
        "replyto": "hCaoJh01io",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3101/Reviewer_KD76"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3101/Reviewer_KD76"
        ],
        "content": {
            "summary": {
                "value": "The paper proposes a method called Maximal Information Boost (MIB) to efficiently connect language models with physical states in robotic manipulation tasks. It also introduces Key State Localization Network (KSL-Net) for matching physical states to their descriptions and predicting the likelihood of correctness. The method improves semantic alignment, enhances performance, and generalizes manipulation policies across various tasks."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- Introduce the Maximal Information Boost (MIB) criterion to enhance grounding efficiency without requiring fine-tuning.\n- Develop the Key State Localization Network (KSL-Net) to determine the probability of each state being the grounded key state.\n- Enhance semantic compatibility and improve generalization in robotic tasks."
            },
            "weaknesses": {
                "value": "- The LLM lacks visual information or constrains about the environment, which restricts its ability to make geometry-based decisions like collision avoidance.\n- It is necessary to manually create various paraphrases that are semantically consistent depending on the tasks.\n- The paper does not address how well the proposed approach can generalize to unseen tasks."
            },
            "questions": {
                "value": "- Do you need to train a separate model for each task? Given the simulated environments are relatively simple, how can you justify that the model is not overfitting the environment?\n- The environments presented in the paper are clear scenarios, involving only a limited number of objects relevant to specific tasks. I'm curious about how the approach would handle complex scenes with multiple objects and some of them are unrelated to the task, as this might introduce ambiguity.\n- Do you still need to do additional planning in your setup to complete the task with key frames?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3101/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3101/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3101/Reviewer_KD76"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3101/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699440003834,
        "cdate": 1699440003834,
        "tmdate": 1699636256293,
        "mdate": 1699636256293,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "tY7ajghbU9",
        "forum": "hCaoJh01io",
        "replyto": "hCaoJh01io",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3101/Reviewer_S4jr"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3101/Reviewer_S4jr"
        ],
        "content": {
            "summary": {
                "value": "The authors note that existing techniques using multimodal foundation models for key state identification are often imprecise and semantically inconsistent. To improve this, the authors introduce a concept named Maximal Information Boost (MIB), an information-based metric to increase grounding effectiveness without extensive fine-tuning."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- Innovative Concept: The approach leverages Multimodal Instance Binding (MIB) to focus on key state grounding, which is a novel method.\n- The method has proven to enhance semantic compatibility with instructions, as evidenced by the experiments."
            },
            "weaknesses": {
                "value": "1. The robotic environment/task as described by the authors does not necessarily need key-state grounding. I believe 100 clean expert demonstrations with end-to-end BC-RNN could achieve similar performances. Key state grounding is useful for long-horizon tasks. I would recommend environments/tasks like [franka Kitchen](https://robotics.farama.org/envs/franka_kitchen/franka_kitchen/) used by BeT and by real-world tasks in [MimicPlay](https://www.notion.so/CoRL2023-reviews-92631182f55f47979d5f15dbdf7c0f7c?pvs=21) . I will change my view if I see more complex robotic applications.\n\n2. If I understand correctly, the LLM in your setup requires task-specific prompts. As described in Appendix A.9.\nIf the prompt already contains the information needed for the LLM to respond, I don’t see why I should use an LLM. I could directly provide the information to the robot."
            },
            "questions": {
                "value": "# \n\n1. Is the Exemplar part of the prompt? For example, on page 19:\n{Exemplar: For a task that involves picking up a cube and moving it to a goal position…..}\n2. Doesn’t the prompt already contain all the information needed for the task? Why do I need to use an LLM? What's the key difference between the exemplar and LLM response?\nHow many attempts did you make to ask ChatGPT to get the answer you wanted?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3101/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3101/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3101/Reviewer_S4jr"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3101/-/Official_Review"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699656710728,
        "cdate": 1699656710728,
        "tmdate": 1699656913127,
        "mdate": 1699656913127,
        "license": "CC BY 4.0",
        "version": 2
    }
]