[
    {
        "id": "lzc6lfWQRi",
        "forum": "Hf54sNeeBM",
        "replyto": "Hf54sNeeBM",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1728/Reviewer_fnKJ"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1728/Reviewer_fnKJ"
        ],
        "content": {
            "summary": {
                "value": "This paper analyzed a critical issue of prompt-based approaches in continual learning, i.e., the errors in selecting an appropriate prompts from the prompt pool. To alleviate this issue, the authors proposed to accumulate knowledge in a single prompt through a contrastive learning strategy and transfer of top eigenvectors. Experimental results demonstrate that their method can achieve comparable performance as some representative baselines with smaller parameter cost."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. This paper is well-written and easy to follow. The motivation is clear and well supported by empirical analysis.\n\n2. The proposed method is reasonable. It’s good to seen that the capacity of a single prompt can be comparable to a prompt pool, especially in continual learning."
            },
            "weaknesses": {
                "value": "1. Despite the clear motivation, the proposed method only marginally outperforms the relatively earlier baseline in this direction, i.e., DualPrompt (ECCV22). There have been many more recent work based on constructing a prompt pool, e.g., CODA-Prompt (CVPR’23) and HiDe-Prompt (NeurIPS’23). I'm concerned about whether there is enough room for further development of the core insight of this paper, i.e., learning all tasks in a single prompt. Although I appreciate that the proposed method uses less parameters than L2P and DualPrompt, the improvement seems to be less significant because the prompts are light-weight. \n\n2. In addition to the results of parameter cost and inference cost, I would encourage the authors to further compare their training cost, as the use of contrastive learning usually requires more computation in training phase.\n\n3. I find a recent work [1] also discussed some similar issues, such as the misaligned prompts and the use of contrastive learning. While not required, I encourage the authors to make comparisons (at least conceptually) with this work.\n\n[1] Hierarchical Decomposition of Prompt-Based Continual Learning: Rethinking Obscured Sub-optimality. NeurIPS 2023."
            },
            "questions": {
                "value": "Please refer to the Weakness.\n\nBesides, I would suggest the authors to consider other fine-tuning techniques, such as adapter and LoRa. They usually have better capacity than prompts to fit downstream distributions, and might make the proposed method much stronger."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1728/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698476947946,
        "cdate": 1698476947946,
        "tmdate": 1699636101585,
        "mdate": 1699636101585,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "NntI4dzgUJ",
        "forum": "Hf54sNeeBM",
        "replyto": "Hf54sNeeBM",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1728/Reviewer_1SQd"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1728/Reviewer_1SQd"
        ],
        "content": {
            "summary": {
                "value": "This paper proposed a new prompt-based method to address the catastrophic forgetting issue in continual learning. Instead of learning a group of prompts to capture the previous knowledge, the key idea of the proposed method is to learn the knowledge in a single prompt. The proposed method uses contrastive learning to pull the features of two different augmented views  in the embedding space. Experimental results demonstrate SOTA performance in continual learning."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. This paper is overall well-structured and easy-to-follow.\n\n2. The proposed single prompt learning based approach is effective in performance, memory saving and time-efficient.\n\n3. The authors have done comprehensive analyses on different continual learning benchmarks, module ablation study, etc."
            },
            "weaknesses": {
                "value": "1. My major concern on this paper is that the performance improvement of the proposed method over the most relevant SOTA method (i.e., DualPrompt) is mirror on all benchmarks. This make it questionable why learning a single prompt is an optimal solution than learning a pool of prompts.\n\n2. Compared to these prompt learning-based baseline methods (e.g., L2P, DualPrompt), what is the advantage of the proposed method on learning a single prompt in continual learning is not very well justified.\n\n3. The formulation of $L_{ctr}$ and $L_{prev}$ are very similar except that different W are used. It is unclear to me which part plays a more important role in the method. It will be great more discussions and experiments on how $\\lambda_{ctr}$ and $\\lambda_{prev}$ affect the model performance on different benchmark are provided to help better understand these two losses."
            },
            "questions": {
                "value": "See \"Weaknesses\"."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1728/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698786993268,
        "cdate": 1698786993268,
        "tmdate": 1699636101490,
        "mdate": 1699636101490,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "ngw7KIEdCj",
        "forum": "Hf54sNeeBM",
        "replyto": "Hf54sNeeBM",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1728/Reviewer_ieXN"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1728/Reviewer_ieXN"
        ],
        "content": {
            "summary": {
                "value": "The paper proposes a novel prompt-based approach to continually learn new tasks using just a single prompt. It accumulates both the previous and current task’s knowledge  in a single prompt  using contrastive learning without negative pairs, thereby removing the need for a pool of prompts and a corresponding task-id prediction mechanism  to select the prompt during inference (as in previous works)."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. The application of contrastive learning without negative pairs on prompt based continual learning seems novel.\n\n2. The proposed approach helps in reduction of parameters and inference time without loss in performance.\n\n3. Writing is clear and easy to understand."
            },
            "weaknesses": {
                "value": "[1]. The contrastive learning is novel but in compared to the recent work [1,5] paper does not shows the SOTA results. The recent prompting based baselines shows much better result but are missing in the paper. \n\n[2]. The approach in [1]  seems to outperform the proposed approach. One justification can be the the approach requires two passes through the ViT during inference: one pass with the old prompt and another with the new prompt (referred to as ensemble in the paper). However, without the ensemble also, the approach seems to perform better as can be inferred from table 3 of their paper. Similarly, look the other work [4,5].\n\n[3]. The prompting based model is mostly expansion based approach (where prompt is the expansion parameter) where these approach leverages over the strong pretrained model. In the absence of the pretrained model how the approach behaves? There are few expansion based recent work [2,3] that does not leverages the pretraiend model can author show the result compared to these approach.\n\n[4] In the ablation (Table-4) the author has shown the model performance and prompt parameters growth which is good. The different parameter growth vs model performance is missing. How the model will behave if the prompt parameter are increased? If the next tasks are complex we require model prompt parameter to adapt the novel task.\n\n[5] The paper mentions that the prompt selection  mechanism in l2p and dual-prompt can introduce mis-alignment of prompts. I am a bit curious as to how much mis-alignment does each of the approaches have?\n\n\n[1] “A Unified Continual Learning Framework with General Parameter-Efficient Tuning, ICCV-2023”\n[2] \"Exemplar-Free Continual Transformer with Convolutions\", ICCV-2023\n[3] \"Dytox: Transformers for continual learning with dynamic token expansion, CVPR-2022\"\n[4] \"S-Prompts Learning with Pre-trained Transformers: An Occam's Razor for Domain Incremental Learning. NeurIPS-2022\"\n[5] \"Coda-prompt: Continual decomposed attention-based prompting for rehearsal-free continual learning. CVPR-2023\""
            },
            "questions": {
                "value": "Please refer to the weakness section."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1728/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698827034023,
        "cdate": 1698827034023,
        "tmdate": 1699636101427,
        "mdate": 1699636101427,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "DIPYOfbuUM",
        "forum": "Hf54sNeeBM",
        "replyto": "Hf54sNeeBM",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1728/Reviewer_5sqM"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1728/Reviewer_5sqM"
        ],
        "content": {
            "summary": {
                "value": "The core idea of this paper is that the upper-bound prompt is the prompt optimized by the merged dataset for all tasks. To approximate the upper-bound prompt, drawing inspiration from contrastive learning, the authors treat the input along with the current and previous prompts as two different augmented views (i.e., positive pairs). Then, the authors pull the features of these positive pairs in the embedding space together to accumulate knowledge. Experimental results demonstrate the performance increase of their method in continual learning."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "1. The writing is clear.\n2. This work applies the contrastive loss in the self-supervised learning to the class-incremental learning."
            },
            "weaknesses": {
                "value": "1. If using the same prompt for different sessions, the prompt is essentially a set of parameters that are constantly being updated. From this pespective, the loss proposed in this paper is very similar to the regularization loss in LwF. To be more specific, the loss used in this paper requires that the current prompt and previous prompts be similar, essentially demanding that the output of the new model and the old model be similar. However, the authors do not compare their methods to any classic regularization techniques.\n\n2. The comparison in this paper is insufficient, as it does not compare their method to the CODA-Prompt [1]. Different from most existing prompt-based incremental learning methods, the authors use the same prompt for different sessions. To support the technique selection contrary to most existing methods, more comparison is essential.\n\n3. The authors do not provide the performance of using the upper-bound prompt. It is insufficient to only prove that the prompt has been close to the upper-bound prompt. Whether is the performance of using the upper-bound prompt higher than the performance of state-of-the-art prompt-based incremental learning methods using task-specific prompts (including CODA-Prompt and HiDe-Prompt [2])?\n\n4. This method restricts the model ability to learn new tasks, so I suspect that it may not work when there is a large gap between the pre-trained data and new-task data. It is essential to use other pre-trained models or conduct experiments on other datasets, e.g., using the model pretrained on ImageNet-1K with MoCo v3 [2,3]. For more datasets, the authors can refer to [4].\n\n[1] CODA-Prompt: COntinual Decomposed Attention-based Prompting for Rehearsal-Free Continual Learning, CVPR 2023.\n\n[2] Hierarchical Decomposition of Prompt-Based Continual Learning: Rethinking Obscured Sub-optimality, NeurIPS 2023.\n\n[3] SLCA: Slow Learner with Classifier Alignment for Continual Learning on a Pre-trained Model, ICCV 2023.\n\n[4] Revisiting Class-Incremental Learning with Pre-Trained Models: Generalizability and Adaptivity are All You Need.\n\nIn summary, my main concern is that the argument in this paper is not convincing. Theoretically, when different sessions use the same prompt, the prompt becomes a set of continuously updating model parameters. In incremental learning, it is challenging for the prompt to both avoid forgetting old tasks and adapt to new tasks. The reason that most existing works use task-specific prompts is to avoid this problem. This work is totally based on the premise that the same prompt is used for each session, but the author does not delve into why task-specific prompts should be abandoned. Experimentally, the method mentioned in this paper has not been compared to state-of-the-art methods using task-specific prompts, e.g., CODA-Prompt. It is also unknown whether the upper-bound prompt can bring the significant performance increase. Building on the two aspects, I still cannot believe that using the same prompt for all sessions can outperform using task-specific prompts. To justify this claim, more evidence may be required."
            },
            "questions": {
                "value": "1. Can the authors provide more evidences (e.g., analyses or experimental results) for supporting the use of the same prompt for different sessions rather than the use of task-specific prompts for different sessions?\n\n2. The loss in this paper is essentially a regularization loss to prevent forgetting. Compared to the regularization loss in LwF, which one is better? Why is the regularization loss in this paper better? This is a very important problem.\n\n3. Can the authors provide the comparison to CODA-Prompt? It will be better if the authors can provide the comparison between their method and HiDe-Prompt.\n\n4. When using the upper-bound prompt, how does the model perform? \n\n5. How is the model performance when using different pre-trained models or different datasets?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission1728/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1728/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1728/Reviewer_5sqM"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1728/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698827578943,
        "cdate": 1698827578943,
        "tmdate": 1699636101356,
        "mdate": 1699636101356,
        "license": "CC BY 4.0",
        "version": 2
    }
]