[
    {
        "id": "0uyxOASjZz",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3322/Reviewer_Ey9T"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3322/Reviewer_Ey9T"
        ],
        "forum": "hGKda1uVEn",
        "replyto": "hGKda1uVEn",
        "content": {
            "summary": {
                "value": "The paper proposes a computationally efficient method for assessing feature importance, based on a polynomial model. To this end, it leverages a support vector machine, or more generally the kernel trick. The decisive advantage is added flexibility compared with a linear model."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "I very much like that the method is able to take all degrees of variable interactions into account. This is a very good use of the kernel trick.\n\nThe controlled experiments on synthetic data are well designed."
            },
            "weaknesses": {
                "value": "Eq. (7) is simply a polynomial hypothesis, possibly feeding into a non-linearity, with degree equal to the number of features. This is an unusual but of course viable model. The authors consider the potential computational burden of the exponential feature explosion, but they do not mention the associated learning theoretical risk, namely overfitting. LASSO-style L1-regularization is hinted at. However, standard L2 regularization is applied in eq. (9), as it is common in SVMs. There is no single word about the need to tune the regularization constant. How do I use a method for estimating feature importance if the resulting values depend on a magic parameter?\n\nProvided that the model is a simple polynomial, and provided that the polynomial kernel is among the few standard kernels considered in basically all SVM research (and all non-linear SVM software packages), I am very much surprised by Lemma 1. Why not simply leverage the polynomial kernel as it is used since 25 years or so?\n\nI am even more surprised by the discussion following eq. (14). For prediction making, an SVM never uses $m$ directly, but only $m^T x$, which can be computed efficiently using the kernel. This is an absolutely basic fact about SVMs and kernel methods in general. I can only conclude that the authors don't really know the methods they aim to leverage. It seems to me that Theorem 1 and the whole section 3.2 can be replaced with the standard prediction making scheme of SVMs. If I am mistaken, then I'd be appreciate being corrected in the rebuttal phase.\n\nFor my taste, the paper contains too many references to the appendix for information that is crucial for understanding the proposed method. This essentially amounts to circumventing the page limit. Put differently: ignoring the appending, the paper is not sufficiently self-contained.\n\nThe choice of combinations of methods and data sets in section 5.2 appears unsystematic. Why were these data sets used and not others? In order to be convinced, I'd like to see experiments on an established data set collection. In this case, it is fine to present a representative subset, with complete tables in the appendix.\n\nTable 2 presents results in terms of the MSE. Is this simply the quality of the model prediction, i.e., testing the fit of a polynomial to another predictor like a random forest? If so, what does it have to do with estimating the correct feature importance? Also, how do the authors justify its use as a measure of quality of an \"explanation\"? What if I fit an RF \"explainer\" to an RF model, with an error of zero? Would the authors then conclude that it is a superior explanation?\n\nFigure 2 can be improved in multiple ways. It definitely needs a log scale on the vertical axis! The range of features from 10 to 20 is extremely narrow, and definitely unsuitable for estimating complexity, which is an inherently asymptotic quantity. Please extend at least to a few hundreds. Simply restrict methods that don't scale well (like the Taylor expansion approach) to smaller dimensions.\n\nI appreciate that the authors provide code. Though, it is not sufficiently commented (or even documented). At the very least, please provide a README explaining prerequisites like required packages, data set files (and where to get them), and an overview of which script is supposed to do what. Naively running the scripts, I was not able to do anything useful with the code, and I was far from reproducing any experiments. Furthermore, the provided zip file contains hidden MACOS and PYTHON temporary files, as well as auto-generated html files and some (huge) javascript. It is entirely unclear to me why they are included.\n\nMinor points:\n\nWhen introducing the notation, please consider replacing the verb \"show\" by \"denote\".\n\nMobius -> Möbius ({\\\"o} in LaTex)\n\nTerminology, between eq. (8) and (9): $w^T \\phi(x) + b$ is not a hyperplane, but a linear function. For $m \\not= 0$, its kernel (zero set) is a hyperplane.\n\nSection 5.1: Please consider replacing the \"*\" symbol commonly used for multiplication in programming by a LaTeX math symbol like \\cdot or \\times.\n\nFigure 1: What does the vertical axis represent? It is in the text, but the information should really be in the figure caption."
            },
            "questions": {
                "value": "Please comment on my criticism above on section 3.2. Can the method make predictions in the same way a kernel SVM does? If no, why not?\n\nPlease also comment on my understanding of the MSE in table 2. Why do you think that it is a suitable measure of quality?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3322/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1697388399194,
        "cdate": 1697388399194,
        "tmdate": 1699636281793,
        "mdate": 1699636281793,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "qDmHyZkQ1r",
        "forum": "hGKda1uVEn",
        "replyto": "hGKda1uVEn",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3322/Reviewer_iYFx"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3322/Reviewer_iYFx"
        ],
        "content": {
            "summary": {
                "value": "In this study, the authors proposed a method for estimating Shapley values (feature importance scores) from the coefficients of polynomial regression.\nThe authors have derived the relationship between Shapley values and marginal contributions, as well as their Mebius transformations, which connects the coefficients of polynomial regression and Shapley values.\nBased on this relationship, the authors propsoed an algorithm for computing Shapley values by learning the coefficients of polynomial regression.\nFurthermore, the authors focused on binary classification problems and propose a method to circumvent the direct computation of exponentially many coefficients of polynomial regression through dual SVM."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The strength of this paper is on the reduction of the computation of Shapley values into a problem solvable in polynomial time through polynomial regression and dual SVM.\n\n**Originality and Quality**\n\nThe use of dual SVM to avoid handling the exponential many coefficients in polynomial regression is the originality of this research.\nFurthermore, the computation of Shapley values without explicitly recovering the coefficients of polynomial regression from the dual SVM solution is intriguing.\n\n**Clarity**\n\nThroughout the paper, the main claims were reasonably well described, contributing to overall clarity.\n\n**Significance**\n\nIn problems where data or models can be adequately approximated using polynomial regression, the proposed method is considered a valuable approach for computing Shapley values.\nProviding an efficient solution for specific class of problems is an important contribution to research in this domain."
            },
            "weaknesses": {
                "value": "The weakness of this paper lies in the gap between the set function and the polynomial regression model (7).\nIn the context of Shapley values for feature importance, each input feature's presence or absence is represented by binary values.\nThe set function is constructed based on this binary representation.\nIn contrast, each $x_i$ represetns the actual value of each input feature in the polynomial regression model (7).\nThis usage seems to be inappropriate as an analogy to the set function, as it doesn't correspond well with the notion of presence or absence of features.\nIn fact, in (7), the condition \"a feature takes the minimum value of 0\" does not necessarily mean that the feature is absent in the set function.\nThe paper seems to conflate \"presence or absence of features\" and \"actual values of features\" when introducing the multilinear extension.\nThus, Shapley values computed using the \"actual values of features\" in the polynomial regression model may not align with Shapley values calculated in the original set function.\nThe validity of replacing \"presence or absence of features\" with \"actual values of features\" and its consequences should be discussed in the paper.\n\nAdditionally, as a minor weakness, I would like to point out that in Section 5.1, the synthesized datasets seem to have independent features (according to the code in the supplement).\nIn cases where features are independent, feature importances can be well-estimated by fitting models like RandomForest and calculating permutation importance.\nIndeed, in the example below, RandomForest combined with permutation importance ranks important features reasonably well.\n(Because I could not find the reproducible codes for Sectoin 5.1, I implemented it by myself.)\nThe synthesized datasets used in the experiments may be too easy.\n\n```\nimport numpy as np  \nfrom sklearn.ensemble import RandomForestRegressor\nfrom sklearn.inspection import permutation_importance\n\ndef data1(X):\n    return np.prod(X[:, :3], axis=1), [0, 1, 2]\n\ndef data2(X):\n    return np.prod(X[:, :3], axis=1) + np.prod(X[:, 3:5], axis=1), [0, 1, 2, 3, 4]\n\ndef data3(X):\n    return np.exp(np.sum(X[:, :4]**2, axis=1)), [0, 1, 2, 3]\n\ndef gen_data(n, datatype, random_state=0):\n    np.random.seed(random_state)\n    X = np.random.randn(n, 10)\n    if datatype == 1:\n        y, tif = data1(X)\n    elif datatype == 2:\n        y, tif = data2(X)\n    else:\n        y, tif = data3(X)\n    return X, y, tif\n\nseed = 0\nfor dt in range(3):\n    x, y, tif = gen_data(500, dt, seed)\n    rf = RandomForestRegressor(random_state=seed).fit(x, y)\n    r = permutation_importance(rf, x, y, n_repeats=30, random_state=seed)\n    print('datatype:', dt)\n    print('true important features', tif)\n    print('feature ranks', np.argsort(r['importances_mean'])[::-1])\n\n>> datatype: 0\n>> true important features [0, 1, 2, 3]\n>> feature ranks [2 1 0 3 5 7 9 8 6 4]\n>> datatype: 1\n>> true important features [0, 1, 2]\n>> feature ranks [1 2 0 8 9 6 7 5 3 4]\n>> datatype: 2\n>> true important features [0, 1, 2, 3, 4]\n>> feature ranks [3 4 1 0 2 9 5 8 6 7]\n\n```"
            },
            "questions": {
                "value": "* Are there any justification of replacing \"presence or absence of features\" in the original set function with \"actual values of features\" in (7)?\n* Is Shapley values computed using the \"actual values of features\" in the polynomial regression model identical with Shapley values calculated in the original set function?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3322/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698388326209,
        "cdate": 1698388326209,
        "tmdate": 1699636281709,
        "mdate": 1699636281709,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "zb6WeVJ6ek",
        "forum": "hGKda1uVEn",
        "replyto": "hGKda1uVEn",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3322/Reviewer_gc9E"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3322/Reviewer_gc9E"
        ],
        "content": {
            "summary": {
                "value": "This paper introduced a SVM-based method for parameter estimation, and dynamic programing used to compute the shapley value in an efficient way."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. Propose to use SVM to mitigate the inefficiency problem of Shapley values, so that the dynamic programming can be used. This solution is novel.\n2. The complexity of the method only relies on data samples."
            },
            "weaknesses": {
                "value": "1 the advantage of the proposed method is not well presented in this paper, I am not convinced by the effectiveness and efficiency of this method even I have very carefully gone through the related works, introduction, and experimental sections. \n2. I strongly encourage the authors to visualize the high-order feature interactions. To see how the methods capture effective feature interactions. \n3. Based on the results in section 5.2, it's hard to justify the effectiveness of SVSVL. Maybe the author can show the capability to capture feature interactions."
            },
            "questions": {
                "value": "1. In fig 2, it looks like most of the methods except Shapley taylor perform similarly. Why the time are not changed with the number of features? How does your method perform better than theirs?\n\n2. Understand that the complexity only relies on the number of samples rather than the number of features. Is it a good property? Generally, the number of data samples is much larger than the number of features, right?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "N.A"
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3322/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3322/Reviewer_gc9E",
                    "ICLR.cc/2024/Conference/Submission3322/Senior_Area_Chairs"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3322/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698918427496,
        "cdate": 1698918427496,
        "tmdate": 1700740975687,
        "mdate": 1700740975687,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "SIJwvRbqnT",
        "forum": "hGKda1uVEn",
        "replyto": "hGKda1uVEn",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3322/Reviewer_NKAm"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3322/Reviewer_NKAm"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes an efficient way of computing Shapley value (SV), which is notorious for its combinatorially expensive computational cost. The authors first refer to a known result that the inclusion and exclusion of the variables in SV can be represented as a Mobius transform of a multi-linear form.  \n \nGuided by the formal similarity between the multi-linear form and the ANOVA kernel function, the authors propose to use the dual formulation of SVM to compute SV. Thanks to the duality, the dimensionality of the problem is now the number of samples rather than the size of the power set.\n\n The authors provide theoretical proof of the above conversion and perform comparative empirical studies with alternative attribution methods.\n \nNote: my review is tentative. It may be changed after the discussion period."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "4 excellent"
            },
            "strengths": {
                "value": "- Introduced a very innovative view to the SV.\n- Provides formal proofs."
            },
            "weaknesses": {
                "value": "- The description tends to jump directly into the conclusion without showing any intuition.\n- The biggest limitation can be that the paper does not provide a direct comparison with the exact SV definition despite the fact that the derived SVM formulation is an approximation, as stated as \"the method has its limitations, including its inability to account for higher moments of features\"."
            },
            "questions": {
                "value": "- Is the proposed method exact? I mean, does it yield an equivalent attribution value to that from the original definition? \n- Please elaborate on what you mean by not being able to account for r higher moments of features, which suggests approximation. \n- If it is not exact, direct comparison with the exact definition is mandatory. Did you present such a result in this paper?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "NA"
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3322/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3322/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3322/Reviewer_NKAm"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3322/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699093857908,
        "cdate": 1699093857908,
        "tmdate": 1700762676893,
        "mdate": 1700762676893,
        "license": "CC BY 4.0",
        "version": 2
    }
]