[
    {
        "id": "kzpdjVpEVX",
        "forum": "hnrB5YHoYu",
        "replyto": "hnrB5YHoYu",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4906/Reviewer_KXKr"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4906/Reviewer_KXKr"
        ],
        "content": {
            "summary": {
                "value": "The paper aims to tackle the fairness problem in text-to-image generation. They define the problem as a distribution alignment problem and use the optimal transport as the alignment loss; they also enable the user-defined target distribution as the fairness metrics. They also analyzed the straightforward end-to-end fine-tuning failure and proposed using the adjusted gradient. The experiment also shows that their method is able to reduce the bias while reserving the sematic information."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The paper is clearly written and proposes a straightforward finetuning solution to improve the fairness of the text-to-image generation model. They also propose an alignment loss based on the optimal transport and provide an analysis of the gradient of the finetuning step. Their experiments also show the effectiveness of their method."
            },
            "weaknesses": {
                "value": "This paper kind of mixing fairness and bias and uses both terms interchangeably, especially for the experiment evaluation part, they define the metric for bias by themself which reduces the credential of the evaluation. I wonder if any other metrics from other research papers have been used for evaluation. Is it possible to use well-defined fairness metrics like demographic parity/ equal opportunity, etc?"
            },
            "questions": {
                "value": "1. for the equation 4, what is the u? \n2. As for the alignment loss, have you tried some other metrics other than the optimal transport loss? And why did you choose the optimal transport metric?\n3. For the face classifier, how accurate it is? and if the combination of face detector and face classifier is not performed well on some datasets, how does it affect the debias experiment result?\n\nsome minor comments:\n1. In section 4.2, when you talk about U-net, please provide the necessary background info."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4906/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698443884241,
        "cdate": 1698443884241,
        "tmdate": 1699636475448,
        "mdate": 1699636475448,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "RNiuBpSj03",
        "forum": "hnrB5YHoYu",
        "replyto": "hnrB5YHoYu",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4906/Reviewer_qhuJ"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4906/Reviewer_qhuJ"
        ],
        "content": {
            "summary": {
                "value": "The authors propose a new method for debiasing text-to-image diffusion models. While the approach is general, the authors focus on the mitigation of demographic biases here, such as gender, racial, or age-related biases in generated depictions of different occupation types or sports activities. \n\nThe method consists of a supervised fine-tuning step for different model components, which minimizes (in addition to two regularization losses that aim to preserve image quality) a loss that penalizes deviations in the demographic distribution of the generated images from a prescribed target demographic distribution. \n\nThe authors demonstrate experimentally that naive autodifferentiation-based gradient descent on this loss fails to achieve successful optimization; they provide a theoretical explanation, backed by empirical experiments, for this behavior. They then proceed to propose a simple gradient adjustment mechanism that mitigates this problem and enables successful optimization of the proposed loss function. \n\nFinally, the authors perform extensive experiments (using Stable Diffusion as an example), an ablation study, and comparisons with previously proposed debiasing mechanisms. Throughout all experiments, the proposed method is highly successful in mitigating demographic biases for unseen prompts, especially also in regards to intersectional biases."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "4 excellent"
            },
            "strengths": {
                "value": "The manuscript addresses a topic of immediate and urgent concern. \n\nIt is very well written, appropriately references relevant prior work, and compares the proposed new method extensively to previously proposed methods. \n\nThe proposed approach is derived from first principles (distribution alignment) and intuitively appealing. The method is widely applicable - also beyond demographic debiasing - and, importantly, allows for \n1) customized and explicit choices of the target data distribution, and \n2) debiasing along multiple demographic dimensions at once. \n\nThe experiments are extensive, well described, and convincingly demonstrate the utility of the proposed method and its superiority over previously proposed approaches to address the same problem."
            },
            "weaknesses": {
                "value": "I could not find any major weaknesses in this manuscript. I only have a few minor questions and suggestions that I will list below."
            },
            "questions": {
                "value": "### Questions\n- CLIP is not without its own issues; see e.g. Shtedritski et al., Wang et al., Wolfe et al., or Zhang and Ré. Could the authors discuss how this might affect the efficacy of their proposed method?\n- How do the authors implement using different lambda values for different regions of the same image, as they describe at the end of section 4.1? (\"We use a smaller weight for the non-face region ... and the smallest weight for the face region.\") L_img is per image, not per pixel, no?\n- I was confused about the training of the gender and race classifiers for the evaluation. Were separate classifiers trained for the training and the evaluation stage? If yes, why? Or is this maybe some kind of unintended text duplication? (\"The gender and race classifiers used for the evaluation loss are trained on the CelebA and FairFace datasets. ... Evaluation. We train new gender and race classifiers using CelebA and FairFace.\")\n- It was unclear to me which of (soft prompt, text encoder, U-Net) were actually finetuned for all of the main experiments in section 5.1?\n- Can the authors think of (and comment on) any drawbacks of applying their method at scale and for many fairness-relevant properties simultaneously? Could there be any negative consequences (e.g., in terms of image quality or biases) when e.g. generating very different images (bears, tables, groups of people, ... )? Recent observations by Qi et al. could also be interesting to discuss in this regard.\n\n### Suggestions for improvement\n- The optimal transport approach in Eq. (4) was a bit confusing to me at first because it differs from the usual setting in which the optimal transport scheme between two *distributions* is considered. By contrast, the authors consider an expectation over the optimal transport schemes between two *vectors* here. I believe everything is actually described correctly, but maybe there is a way to make this section even easier / more intuitive for readers to grasp? (Sorry, possibly not very helpful.)\n- It is a little bit confusing that y denotes both the generated target labels (normal font) as well as the images generated by the frozen model (boldface). \n- What does it mean that CLIP-ViT-bigG-14 and DINOv2 vit-g/14 are \"more performative than the ones used in training\"?\n- The authors might want to consider citing Lester et al. regarding soft prompt tuning?\n\n### References\n- Lester et al., The Power of Scale for Parameter-Efficient Prompt Tuning,  https://arxiv.org/abs/2104.08691\n- Qi et al., Fine-tuning Aligned Language Models Compromises Safety, Even When Users Do Not Intend To!, https://arxiv.org/abs/2310.03693\n- Shtedritski et al., What does CLIP know about a red circle? Visual prompt engineering for VLMs, https://arxiv.org/abs/2304.06712\n- Wang et al., FairCLIP: Social Bias Elimination based on Attribute Prototype Learning and Representation Neutralization, https://arxiv.org/abs/2210.14562\n- Wolfe et al., Contrastive Language-Vision AI Models Pretrained on Web-Scraped Multimodal Data Exhibit Sexual Objectification Bias, https://dl.acm.org/doi/abs/10.1145/3593013.3594072\n- Zhang and Ré, Contrastive Adapters for Foundation Model Group Robustness, https://arxiv.org/pdf/2207.07180.pdf"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "10: strong accept, should be highlighted at the conference"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4906/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4906/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4906/Reviewer_qhuJ"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4906/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698708125939,
        "cdate": 1698708125939,
        "tmdate": 1699636475361,
        "mdate": 1699636475361,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "vS0A6cUsYR",
        "forum": "hnrB5YHoYu",
        "replyto": "hnrB5YHoYu",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4906/Reviewer_T8Ls"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4906/Reviewer_T8Ls"
        ],
        "content": {
            "summary": {
                "value": "This paper studies how to finetune diffusion models with fairness as the goal. By formulating generation fairness as distribution alignments, the paper introduces a distributional alignment loss and an end-to-end fine-tuning framework. Experiments show that the fine-tuned model can generate facial images with targeted distribution of certain sensitive attributes."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The fairness of image generation studied in this paper is an important and practical problem. \n2. The proposed fine-tuning method is sound, and the results validate the effectiveness of the method.\n3. The paper has made a comprehensive analysis of which part of the model to fine-tune as well as the challenges in fine-tuning, providing insights into future fair fine-tuning work."
            },
            "weaknesses": {
                "value": "1. The paper only tested the method on single-face generation, limiting the applicability of the proposed method.\n2. It is unclear whether fine-tuning with the fairness loss affects the quality and diversity of the generated images on general prompts.\n3. Although experiments in the paper show better performance than baseline methods, it is unclear how expensive the fine-tuning is compared with the baseline methods."
            },
            "questions": {
                "value": "1. In Equation (4), how to obtain the expectation in practice?\n2. In Table 2, on unseen prompts, how good is the proposed method compared with the baselines? Does the fine-tuning have an overfitting problem?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4906/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699219728547,
        "cdate": 1699219728547,
        "tmdate": 1699636475280,
        "mdate": 1699636475280,
        "license": "CC BY 4.0",
        "version": 2
    }
]