[
    {
        "id": "pcDfF2tIxF",
        "forum": "huGECz8dPp",
        "replyto": "huGECz8dPp",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3474/Reviewer_Lyy3"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3474/Reviewer_Lyy3"
        ],
        "content": {
            "summary": {
                "value": "The Information Bottleneck (IB) principle provides an information-theoretic framework to analyze the training process of deep neural networks (DNNs) by tracking mutual information values. The training process involves two phases: fitting and compression, with compression believed to enhance generalization. The paper introduces an approach for IB analysis in general DNNs, overcoming challenges in estimating mutual information between high-dimensional vectors. The method involves compressing representations to estimate mutual information accurately. The approach is supported by theory and demonstrated through experiments, including analysis of a real-scale convolutional DNN, uncovering new insights into mutual information dynamics."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "The theoretical analysis is sound and the experiments conducted in the paper are interesting and showing insides into the information flow of DNN."
            },
            "weaknesses": {
                "value": "Here are some comments / weaknesses / things to improve:\n\nAbstract: „has only been verified for NNs of tiny sizes or specific types, such as quantized NNs“: I would not say that this is verified see summary table of [1]. The SNN paper did not saw a compression.\n\nIntroduction: „(a) stochastic NNs (Goldfeld et al., 2019; Tang Nguyen & Choi, 2019; Adilova et al., 2023) or (b) quantized NNs (Lorenzen et al., 2022).“: there is also the combination of both which was a paper at AAAI‘23 [2].\n\nStatement 2: „This statement demonstrates that an arbitrary amount of information can be lost through compression. It arises from the fact that “less significant” in terms of metric spaces does not align with “less significant” in terms of information theory. However, with additional assumptions, a more useful theoretical result can be obtained.“: I am not sure but following the arguments from Goldfeld [3] MI is ill defined in deterministic DNN. So with this in mind no information can be removed in the compression phase. Can you maybe discuss this in the paper?\n\n\n[1] Bernhard C. Geiger. On information plane analyses of neural network classifiers—a review. IEEE Transactions on Neural Networks and Learning Systems, 33(12):7039–7051, 12 2022. doi: 10.1109/ tnnls.2021.3089037.\n[2] https://ojs.aaai.org/index.php/AAAI/article/download/25851/25623\n[3] Ziv Goldfeld, Ewout van den Berg, Kristjan H. Greenewald, Igor V. Melnyk, Nam H. Nguyen, Brian Kingsbury, and Yury Polyanskiy. Estimating information flow in deep neural networks. In ICML, 2019."
            },
            "questions": {
                "value": "see weaknesses"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "1: You are unable to assess this paper and have alerted the ACs to seek an opinion from different reviewers."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3474/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3474/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3474/Reviewer_Lyy3"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3474/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1697710889304,
        "cdate": 1697710889304,
        "tmdate": 1699636300471,
        "mdate": 1699636300471,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "yguRR5Cw08",
        "forum": "huGECz8dPp",
        "replyto": "huGECz8dPp",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3474/Reviewer_d5Zt"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3474/Reviewer_d5Zt"
        ],
        "content": {
            "summary": {
                "value": "In this paper, authors have proposed a method for estimating the Shannon Mutual Information (MI) between the compressed representations of high-dimensional random vectors. Moreover, a discussion of information flow estimation based on the Information Bottleneck (IB) principle is presented for the MNIST classification problem using a simple LeNet architecture."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "A systematic comparison between different entropy estimation methods in the MI estimation problem has been conducted in section 5."
            },
            "weaknesses": {
                "value": "While this paper tries to solve the well-known challenge in the IB principle, i.e., MI estimation for high dimensional vectors, I have some issues with the approach in this paper:\n\n1 - I don't follow the claimed MI estimation approach. The proposed method has considered some of existing entropy estimation methods, (which they all have their own limitations) to estimate MI using the empirical frequencies in the MI expression (equation 1). What is the novelty of this approach ? The entropy estimation is a canonical problem in statistics. Both parametric and non-parametric have their own pros and cons. While non-parametric methods (e.g., KDE) do not consider any underlying assumption about the distribution of the data, they are typically not scalable in very high-dimensional regime (and they need a lot more training data), and they might be less sensitive than their parametric counterparts when the assumptions of the parametric methods are met.\n\n2 - Another issues is the one that authors have also mentioned in the paper. Just providing a toy example of MNIST for a small classification model is not yet convincing to consider the scalability of the MI estimation approach, its accuracy on the high-dimensional data (not just 784), and its applicability in other non-classification problems (regression, unsupervised, generative, etc.).\n\n3 - Some details about the functions $f_1$, $f_2$, $f$, $g$, etc do not exist in the paper."
            },
            "questions": {
                "value": "1 - Does the function $f$ in statement need to to be bijective (both injective and surjective) ? I think only being  injective is not sufficient."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3474/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3474/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3474/Reviewer_d5Zt"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3474/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698673472960,
        "cdate": 1698673472960,
        "tmdate": 1699636300380,
        "mdate": 1699636300380,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "plDP1Lj1Yd",
        "forum": "huGECz8dPp",
        "replyto": "huGECz8dPp",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3474/Reviewer_MJhB"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3474/Reviewer_MJhB"
        ],
        "content": {
            "summary": {
                "value": "The paper proposes to measure mutual information (MI) in neural networks via compressed representations, utilizing auto-encoder architectures that are assumed to be bijective mappings to a lower-dimensional space. With this rationale, the authors propose performing information plane analyses of stochastic neural networks using these compression-based estimators."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The paper is quite accessibly written and deals with an interesting topic. The results seem interesting, as they are not fully in line with what has commonly been observed in information plane analyses."
            },
            "weaknesses": {
                "value": "In addition to the questions below, I see a few weaknesses that prevent me from giving a better score:\n- While it is clear that MI does not change under bijective mappings, the same may not hold for estimators of MI. In other words, I question the validity of the first equality in (4). To be more concrete, I think one can create counterexamples where a KDE of MI differs depending on whether it is obtained from the original data (dimension $n$) or the latent representation (dimension Sn'$). Since MI can only be estimated and not measured, this leads me to questioning the validity of the study: If compression affects the results of the estimator, then how can we be sure that the estimate represents the \"true\" (i.e., uncompressed) behavior of MI?\n- Along that line, it would be important to see in Figs. 3 and 4 how the MI estimate obtained directly from the high-dimensional images behaves. This would more clearly show that compression is useful in comparison with estimators for high-dimensional data.\n\nSummarizing, the paper does not show that the compressed representations are \"better\" for MI estimation than the original layer outputs/data, or that fundamentally different qualitative results can be obtained. While the approach seems reasonable and valid, I would like to see more evidence that it outperforms MI estimation from high-dimensional random variables.\n\n\nMinor:\n- In (5) and below, it should be made clear that $E_X$ is the encoder for $X$, while $E_Y$ is the encoder for $Y$.\n- In the third paragraph of Section 5, the abbreviation WKL is not introduced.\n- The colormap in Fig. 5 is not ideal, there is too little variation in the color."
            },
            "questions": {
                "value": "- In Fig. 3 and 4, why do the curves for most estimators decrease when compared to the true MI?\n- In the same figures, why does MINE require a critic with the same architecture as the autoencoder, if its input are low-dimensional ($n'=2$ or $4$) signals? (Note that the MINE curves are blue.)\n- In the same figures, there is good agreement between the blue and green curves. However, it can be assumed that the encoders $E_X$ and $E_Y$ act in a way to retrieve $f_1(\\xi)$ and $g_1(\\eta)$, respectively (or some other bijection thereof). With this in mind, it is not surprising that the curves agree so well. Has this been tested? For example, it could be a good idea to use a higher/smaller dimension for the output of the encoders as for the dimension of the generated signals.\n- Why does the KL estimator have such a high offset?\n- In Section 6, is noise also added during training or only during computing MI estimates? In any case, since noise is added one must not ignore the potential geometric affects that are induced by it (effects both during training and during estimation).\n- How where the confidence intervals in Fig. 5 computed? How many networks have been trained?\n- In Fig. 6, why is there so much variation/so large CIs at the end of training?\n- In the same figure, why is there no decrease of \"loss delta\" at the end of training?\n- In the same figure, does \"loss delta\" refer to the difference of losses between two consecutive epochs?\n- In the same figure, the data processing inequality seems to be violated for $I(L;Y)$, see $L_2$ vs. $L_5$. Do you have an explanation for this?\n\n_EDIT:_ After discussion with the authors, I have improved my score."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3474/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3474/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3474/Reviewer_MJhB"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3474/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698746301413,
        "cdate": 1698746301413,
        "tmdate": 1700549006788,
        "mdate": 1700549006788,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "RjgFSDr3mP",
        "forum": "huGECz8dPp",
        "replyto": "huGECz8dPp",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3474/Reviewer_Fd1K"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3474/Reviewer_Fd1K"
        ],
        "content": {
            "summary": {
                "value": "This paper proposed a framework for Information Bottleneck analysis of neural networks. To estimate the mutual information(MI) of high dimensional vectors, the paper proposes to use an auto-encoder to compress the data into a low dimensional space and provide a theoretical analysis of the error bounds. To avoid the hidden representation of a trained network $L$ becoming a deterministic function of $X$, the paper incorporates the Stochastic Neural Network. Numerical experiments on synthetic data show that the MI estimator of the compressed data can be close to the true value using the weighted Kozacheko-Leonenko estimator. Then the estimator is used on compressed data of several hidden layers $L_i$ of a convolutional network trained on MNIST to demonstrate the evolution of $I(L_i, X)$ and $I(L_i,Y)$."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "Using information-theoretic analysis of DNNs to understand the training evolutions is an interesting topic. The proposed method provides a practical method to conduct information bottleneck analysis. Theoretical analysis and experiments on synthetic data demonstrate that an appropriate estimator on the compressed data can approximate the mutual information well."
            },
            "weaknesses": {
                "value": "I think a lot of details of the proposed method are missing. \n\n1. What are the structures of the auto-encoder used to compress the data, and how are they trained? Is the result sensitive to the choice of the auto-encoder structure or some hyper-parameters? In algorithm 1, $E_X$, $E_Y$ of the auto-encoder is assumed to satisfy conditions of Corollary 1, so I think the auto-encoder is an important detail of the proposed method and should be discussed more in the paper or appendix. If the performance is sensitive to the details of auto-encoder choice and requires a lot of tuning, it will be a major drawback of the proposed method.\n\n2. How are the stochastic NNs used in the proposed method, and what are the noises introduced in each layer? Incorporating stochastic NN is emphasized several times in the paper as a main component of the proposed method, but the details are missing.\n\n3. Another weakness is that the proposed method is only applied to one real data example, the MNIST data. More experiments and analysis would improve the significance of the paper.\n\nReaders are directed to the source code about these details, I think at least some more details of the proposed method should be provided in the paper or appendix."
            },
            "questions": {
                "value": "Please see the weakness part above, some minor questions\n\n1. In section 3.1, it says \"This hypothesis is believed to hold for a wide range of structured data, and there are datasets known to satisfy this assumption precisely.\" Any references to the hypothesis or some examples that the datasets satisfying this assumption precisely? I think some details would help understand the hypothesis.\n\n2. The stochastic NN is introduced to help compute the mutual information, does It also affect model training? if not, what is the relationship of a stochastic NN and a regular trained NN?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3474/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3474/Reviewer_Fd1K",
                    "ICLR.cc/2024/Conference/Submission3474/Senior_Area_Chairs"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3474/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698811972431,
        "cdate": 1698811972431,
        "tmdate": 1700585698369,
        "mdate": 1700585698369,
        "license": "CC BY 4.0",
        "version": 2
    }
]