[
    {
        "id": "uGpWP0oKoS",
        "forum": "I4wB3HA3dJ",
        "replyto": "I4wB3HA3dJ",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1547/Reviewer_BeTH"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1547/Reviewer_BeTH"
        ],
        "content": {
            "summary": {
                "value": "Targeting at domain generalization scenario with possible shifts among domains, this paper proposes to take 'per domain optimality' into consideration for finding the perturbation of SAM. The proposed DISAM is shown to have an improved convergence rate. Numerically, DISAM outperforms other SAM alternatives."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "S1. The idea of tackling domain shift in SAM is novel. \n\nS2. A new algorithm, DISAM, is proposed with satisfying numerical results. DISAM improves over state-of-the-art by a large margin."
            },
            "weaknesses": {
                "value": "W1. Stronger motivation needed. The authors motivates the domain difference using Fig. 1 (b). While the convergence behaviors among domains are indeed inconsistent at the early stage,  the losses are similar after e.g., 30 epoch. The authors should also explain why the difference of convergence in **early phase** impact the generalization of SAM.\n\n\nW2. More discussions on $\\lambda$ in eq. (7) are needed. This is a critical parameter that considers the variance/domain shifts in DISAM. However, this $\\lambda$ does not appear in Theorem 1. Can the authors illustrate more on this point? And how does the choice of $\\lambda$ influence convergence and generalization?"
            },
            "questions": {
                "value": "Q1. Relation with a recent work (https://arxiv.org/abs/2309.15639).\n\nThe paper above also proposes approaches to reduce variance for finding perturbations, although not designed for the domain generalization setting. How does this work relate with the proposed DISAM?\n\n\nQ2. Theorem 1 illustrates that the *convergence* of DISAM benefits from $\\Gamma$. Can the authors explain more on the discussion of \n> as DISAM enjoys a smaller $\\Gamma$ than SAM, DISAM can permit the potential larger $\\rho$ than that in SAM, thus yielding a better generalization\n\nIn particular, how does the convergence rate link with generalization?\n\nQ3. The last sentence in Sec 3 claims that\n>  ... allowing larger $\\rho$ for better generalization.\n\nWhy does larger $\\rho$ relate to better generalization?\n\nQ4. (minor) The notation in e.g., eq (5) can be improved, because the multiple subscripts $i$ in $\\Sigma_{i} \\frac{C_i}{\\sum_i C_i}$ are confusing."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission1547/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1547/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1547/Reviewer_BeTH"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1547/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1697946496349,
        "cdate": 1697946496349,
        "tmdate": 1700875519237,
        "mdate": 1700875519237,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "0bcLv8wwPA",
        "forum": "I4wB3HA3dJ",
        "replyto": "I4wB3HA3dJ",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1547/Reviewer_d1EH"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1547/Reviewer_d1EH"
        ],
        "content": {
            "summary": {
                "value": "The paper introduces the Domain-Inspired Sharpness Aware Minimization (DISAM) algorithm, a novel approach for optimizing under domain shifts. The motivation behind DISAM is to address the issue of inconsistent convergence rates across different domains when using Sharpness Aware Minimization (SAM), which can lead to optimization biases and hinder overall convergence.\n\nThe key innovation of DISAM lies in its focus on maintaining consistency in domain-level convergence. It achieves this by integrating a constraint that minimizes the variance in domain loss. This strategy allows for adaptive gradient perturbation: if a domain is already well-optimized (i.e., its loss is below the average), DISAM will automatically reduce the gradient perturbation for that domain, and increase it for less optimized domains. This approach helps balance the optimization process across various domains.\n\nTheoretical analysis provided in the paper suggests that DISAM can lead to faster overall convergence and improved generalization, especially in scenarios with inconsistent domain convergence. The paper supports these claims with extensive experimental results, demonstrating that DISAM outperforms several state-of-the-art methods in various domain generalization benchmarks. Additionally, the paper highlights the efficiency of DISAM in fine-tuning parameters, particularly when combined with pretraining models, presenting a significant advancement in the field."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "As of now, there has not yet been a sharpness-aware minimization (SAM) methodology developed specifically for addressing distribution shifts. The issue of varying convergence rates across different domains, as observed in SAM, is undeniably a significant challenge.\n\nThis methodology presents an impressive degree of compatibility, as it can be integrated with a variety of sharpness-variants. An especially commendable aspect of this approach is its computational efficiency. Compared to standard SAM techniques, it does not incur additional computational costs, making it a practical option for scenarios where resource constraints are a consideration.\n\nIn summary, the development of a SAM methodology that is adept at handling distribution shifts, and particularly its implications for domain convergence, is both novel and highly relevant in the current landscape of optimization challenges."
            },
            "weaknesses": {
                "value": "The idea of minimizing the variance between losses, a core aspect of the presented methodology, is not entirely novel. Similar concepts have been previously explored in methods like vREX (Out-of-Distribution Generalization via Risk Extrapolation) and further extended to gradient computations in methodologies like Fishr (Invariant Gradient Variances for Out-of-Distribution Generalization). In this context, the proposed approach appears to be an incremental adaptation of vREX principles applied specifically to the challenges faced in Sharpness Aware Minimization (SAM) scenarios.\n\nThe improvement in out-of-distribution (OOD) performance using the DISAM methodology does not appear intuitive. In fact, when comparing its performance enhancements to those achieved with CLIPOOD, as reported, the difference seems marginal. This observation raises questions about the actual effectiveness of DISAM, particularly in the context of fine-tuning methodologies."
            },
            "questions": {
                "value": "Similar to how transitioning from ERM to vREX in optimization has been shown to enhance domain generalization performance, the application of vREX to SAM in the form of this methodology could be seen as a natural extension that brings comparable performance improvements. Furthermore, it is a valid assertion that incorporating various algorithms tailored for domain generalization (such as Fish, Fishr, gradient alignment) into the SAM optimization framework could potentially yield performance enhancements. The logic here is that these methods, when applied within the context of SAM, could enhance its ability to generalize across domains.\n\nHowever, the critique that DISAM may simply be an incremental version of applying domain generalization methodologies to SAM is not without its counterarguments. It's important to consider the specific challenges and nuances of the SAM framework and how DISAM addresses these. If DISAM introduces significant modifications or adaptations that are uniquely tailored to the idiosyncrasies of SAM, then its contribution could extend beyond a mere incremental update. The key would lie in the specifics of how DISAM modifies or enhances the existing principles of SAM and domain generalization methods, making it more than just a straightforward application of known techniques.\n\nIn summary, while the perspective that DISAM is an incremental version of existing methodologies is certainly tenable, a comprehensive evaluation would require a deeper exploration of how DISAM specifically adapts or augments the SAM framework to address its unique challenges. If such adaptations are significant, they could justify the novelty and utility of DISAM beyond a simple combination of existing techniques.\n\nCan you provide the reproducible code during the rebuttal period?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "\\"
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission1547/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1547/Reviewer_d1EH",
                    "ICLR.cc/2024/Conference/Submission1547/Senior_Area_Chairs"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1547/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698334156910,
        "cdate": 1698334156910,
        "tmdate": 1700717237511,
        "mdate": 1700717237511,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "ku4NzSCV00",
        "forum": "I4wB3HA3dJ",
        "replyto": "I4wB3HA3dJ",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1547/Reviewer_mma9"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1547/Reviewer_mma9"
        ],
        "content": {
            "summary": {
                "value": "This paper introduces a novel optimization algorithm named Domain-Inspired Sharpness Aware Minimization (DISAM) tailored for challenges arising from domain shifts. It seeks to maintain consistency in sharpness estimation across domains by introducing a constraint to minimize the variance in domain loss. This approach facilitates adaptive gradient adjustments based on the optimization state of individual domains. Theoretical and empirical findings show the proposed method offers faster convergence and superior generalization under domain shifts."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1.\tThe proposed method targets at the model generalization under domain shifts, which is a common challenge in machine learning. To date, there has been a lack of thorough investigation into sharpness-based optimization in the context of domain shifts, and the idea of constraint the variance of losses among training domains is interesting.\n\n2.\tThe paper not only presents theoretical evidence showcasing the efficiency of DISAM, but it also provides empirical data to support this claim, demonstrating the improved performance across various domain generalization benchmarks.\n\n3.\tThe analytical experiments conducted in this paper are comprehensive and lucid, providing evidence of DISAM's efficacy in enhancing convergence speed and mitigating model sharpness. Additionally, the study investigates the application of DISAM for fine-tuning a clip-based model, aiming to achieve improved open-class generalization."
            },
            "weaknesses": {
                "value": "1.\tSAM-based optimization incurs twice the computational overhead and additional storage overhead in comparison to the commonly used SGD. While DISAM, the method proposed in this paper, demonstrates faster convergence under domain shift conditions when compared to SAM, it does not include a comparison with optimizers such as SGD or Adam.\n\n2.\tThis paper employs multiple benchmarks to evaluate the performance of multi-source domain generalization. The article highlights the need for advancements in the domain shift perspective of the SAM method and suggests conducting comparisons between DISAM and the state-of-the-art (SOTA) method to further validate the effectiveness of the proposed approach.\n\n3.\tThe value of $\\rho$ in DISAM significantly influences both the convergence speed and generalizability. And it needs more discussion on how to effectively determine the value to maximize the benefits of proposed method."
            },
            "questions": {
                "value": "1.\tThe article presents a theoretical analysis suggesting that larger values of parameter $\\rho$ should lead to improved generalization, given that convergence is guaranteed. It is important to reflect this aspect in the experiments to provide stronger evidence and validation.\n\n2.\tRegarding the open class generalization of the clip-based model, further experimental analysis should be conducted to elucidate the reasons behind the superior performance of DISAM.\n\nFor other questions, please refer to the weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission1547/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1547/Reviewer_mma9",
                    "ICLR.cc/2024/Conference/Submission1547/Senior_Area_Chairs"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1547/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698646800924,
        "cdate": 1698646800924,
        "tmdate": 1700708260209,
        "mdate": 1700708260209,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "BGpXY97QRW",
        "forum": "I4wB3HA3dJ",
        "replyto": "I4wB3HA3dJ",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1547/Reviewer_sVwJ"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1547/Reviewer_sVwJ"
        ],
        "content": {
            "summary": {
                "value": "Due to the inconsistent convergence degree of SAM across different domains, the optimization may bias towards certain domains and thus impair the overall convergence. To address this issue, this paper considers the domain-level convergence consistency in the sharpness estimation to prevent the overwhelming perturbations for less optimized domains. Specifically, DISAM introduces the constraint of minimizing variance in the domain loss. When one domain is optimized above the averaging level w.r.t. loss, the gradient perturbation towards that domain will be weakened automatically, and vice versa."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "They identify that the use of SAM has a detrimental impact on training under domain shifts, and further analyze that the reason is the inconsistent convergence of training domains that deviates from the underlying i.i.d assumption of SAM."
            },
            "weaknesses": {
                "value": "This paper considers the domain-level convergence consistency in SAM for multiple domains, and proposes to adopts the domain loss variance in training loss. The convergence consistency is a general issue, and the solution is normal, thus the novelty is not so clear for publication in ICLR."
            },
            "questions": {
                "value": "1.\tIn the definition of the variance between different domain losses, the values of loss between different domains are restricted. Which one is more import? The value of losses in different domains, or the minimization speed of loss in different domains?\n2.\tIn the learning of multiple domains, there is Multi-Objective Optimization, so the domain-level convergence consistency is a general issue under domain shifts? Or the convergence consistency is a general issue in Multi-Objective Optimization?\n3.\tThis paper considers the domain-level convergence consistency in SAM for multiple domains, and proposes to adopts the domain loss variance in training loss. The convergence consistency is a general issue, and the solution is normal, thus the novelty is not so clear."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1547/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698718731804,
        "cdate": 1698718731804,
        "tmdate": 1699636082877,
        "mdate": 1699636082877,
        "license": "CC BY 4.0",
        "version": 2
    }
]