[
    {
        "id": "kyfU2huNQi",
        "forum": "i6EtCiIK4a",
        "replyto": "i6EtCiIK4a",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3145/Reviewer_wVzv"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3145/Reviewer_wVzv"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a stochastic first-order algorithm based on the Moreau envelope reformulation.  Non-asymptotic convergence analysis under weaker conditions than previous works is provided. The proposed algorithm is evaluated on various setups, including few-shot learning, data hyper-cleaning, and neural architecture search."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The method looks novel.\n2. Experiments look good."
            },
            "weaknesses": {
                "value": "1. Although the assumptions are indeed weaker than previous works, the convergence measure is also different from many previous works, so the results may not be directly comparable.\n2. I think the recent paper which has a strong theoretical guarantee should be cited.\nKwon, Jeongyeol, et al. \"On Penalty Methods for Nonconvex Bilevel Optimization and First-Order Stochastic Approximation.\" arXiv preprint arXiv:2309.01753 (2023)."
            },
            "questions": {
                "value": "1. What does the \"Rethinking\" in the title mean? Why do we need to rethink? What is the finding after rethinking?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "n/a."
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3145/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3145/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3145/Reviewer_wVzv"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3145/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1697704515379,
        "cdate": 1697704515379,
        "tmdate": 1699636262063,
        "mdate": 1699636262063,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "WPm2RBTPuT",
        "forum": "i6EtCiIK4a",
        "replyto": "i6EtCiIK4a",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3145/Reviewer_Qikw"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3145/Reviewer_Qikw"
        ],
        "content": {
            "summary": {
                "value": "This paper concerns bi-level optimization (BLO) problems with an inner constraint set. By introducing the Moreau envelope of the lower-level function, the BLO can be reformulated into a nonconvex optimization problem with a smooth constraint. A single loop algorithm is proposed based on the formulation, leveraging the structure of the Moreau envelope. The author also provides a non-asymptotic rate for the algorithm and conducts numerical experiments to show its superiority."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. The application of the Moreau envelope gives a nice reformation for the BLO. Compared with traditional value function reformation, the Moreau envelope-based reformation is a smooth problem and easier to solve.\n\n2. Non-asymptotic convergence rate is developed for the proposed method without using the PL condition."
            },
            "weaknesses": {
                "value": "1. In the nonconvex case, (4) is only a relaxed version of the original BLO. Is not clear whether the global optimal solutions, local optimal solutions, and stationary points of (4) are related to the original BLO. Hence, I am not sure whether the stationarity measure in this paper is useful.\n\n2. Assumption 3.2 (ii) appears too technical and artificial. The author does not convince me of its practicability, because the given examples are simple and no theoretical results is ensuring Assumption 3.2 (ii).\n\n3. In Theorem 3.1, it is strange to say that \"there exists c_{\\alpha},c_{\\beta}>0\" as the upper bounds of the stepsizes $\\alpha_k,\\beta_k$. This appears to be impractical since only the existence of $c_{\\alpha},c_{\\beta}$ does not suggest how to choose the right stepsizes in implementation."
            },
            "questions": {
                "value": "Do the models in the experiments satisfy the Assumptions previously assumed?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "Yes, Research integrity issues (e.g., plagiarism, dual submission)"
                ]
            },
            "details_of_ethics_concerns": {
                "value": "This paper (ID 3145) is similar to submission 3552 of ICLR 2024 in many aspects, including the problem setting, idea, algorithm, theoretical analysis, and convergence results.\n\n1.For the problem setting, both paper 3145 and paper 3552 focus on constrained Bilevel optimization. In the lower-level problem, paper 3145 considers a nonsmooth regularizer $g$ and paper 3552 considers constraints $g(x,y)\\leq0$. The settings are very similar.\n\n2.For the underlying ideas, the two papers both use the Moreau envelope to replace the value function in the lower-level problem. The difference is merely that paper 3552 applies the Lagrange duality due to the inequality constraints while paper 3145 does not.\n\n3.For the algorithms, the updates of their algorithms are rather similar; see equations (9) (10) in paper 3145 and (10) (11) in paper 3552.\n\n4.For the theoretical analysis, both papers use a merit function $V_k$ with similar structures and prove its sufficient decrease. Moreover, they consider similar stationarity measures and explain the stationarity measure via similar penalty functions; see equations (15) (16) in paper 3145 and (15) (16) in paper 3552.\n\n5.For the convergence result, the obtained convergence rates $\\frac1{K^{(1-2p)/2}}$, $\\frac1{K^{p}}$, and $\\frac1{K^{1/2}}$ are the same in the two papers; see Theorem 3.1 of paper 3145 and Theorem 3.1 of paper 3552.\n\nI hope the authors can give some comments on the above similarities to address my concern."
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3145/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3145/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3145/Reviewer_Qikw"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3145/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1697997759603,
        "cdate": 1697997759603,
        "tmdate": 1700715784018,
        "mdate": 1700715784018,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "4zx3yDRjVU",
        "forum": "i6EtCiIK4a",
        "replyto": "i6EtCiIK4a",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3145/Reviewer_y7ue"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3145/Reviewer_y7ue"
        ],
        "content": {
            "summary": {
                "value": "This paper studied the nonconvex constrained bilevel optimization, where its upper level is nonconvex and its lower level is nonsmooth and weakly convex. It proposed an efficient single-loop gradient-based Hessian-free algorithm based on the Moreau envelope technique. Moreover, it provided the non-asymptotic convergence analysis for the proposed algorithm. Extensive experimental results demonstrate the efficiency of the proposed algorithm. In summary, the contributions of this paper are significant on the design method and solid convergence analysis."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "4 excellent"
            },
            "strengths": {
                "value": "This paper proposed an efficient single-loop gradient-based Hessian-free algorithm based on the Moreau envelope technique. Moreover, it provided the non-asymptotic convergence analysis for the proposed algorithm. Extensive experimental results demonstrate the efficiency of the proposed algorithm. In summary, the contributions of this paper are significant on the design method and solid convergence analysis."
            },
            "weaknesses": {
                "value": "It is better to list some bilevel optimization examples in machine learning that have non-smooth and weakly convex lower level functions, which will strength the motivation of this work."
            },
            "questions": {
                "value": "Some comments:\n\n1)\tIn the proposed algorithm 1, there exist five tuning parameters $\\alpha_k,\\beta_k,\\eta_k,\\gamma,c_k$. Although the authors gave the range of these parameters in the convergence analysis, I still think the choice of these tuning parameters is not easy in practice. \n\n2)\tFrom the convergence analysis, I saw that the authors used the condition that $f(x,y)$ is a weakly convex. I suggest that the authors should add this condition in Assumption 3.2 of the paper.\n\n3)\tThe inequality (11) in Assumption 3.2 (ii) is a strict condition ? If not , please give an example.\n\n4)\tIt is better to list some bilevel optimization examples in machine learning that have nonsmooth and weakly convex lower level functions, which will strength the motivation of this work."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3145/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698494240580,
        "cdate": 1698494240580,
        "tmdate": 1699636261884,
        "mdate": 1699636261884,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "eUqebTI186",
        "forum": "i6EtCiIK4a",
        "replyto": "i6EtCiIK4a",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3145/Reviewer_am3o"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3145/Reviewer_am3o"
        ],
        "content": {
            "summary": {
                "value": "The paper applies the Moreau envelope for solving bilevel optimization with non-convex low-level optimization. The proposed algorithm extends such Moreau envelope framework from convex to non-convex settings, achieves a single loop structure, and avoids Hessian computation at the same time. A non-asymptotic convergence rate is derived and extensive numerical evaluations demonstrate faster convergence and superior performance."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. Compared to previous bilevel optimization algorithms, the proposed MEHA algorithm is both single-loop and hessian-free, yielding an advantage in the efficiency of convergence. \n\n2. The numerical evaluation conducted is quite comprehensive, covering both synthetic experiments and various real-world tasks."
            },
            "weaknesses": {
                "value": "The only weakness the reviewer sees is the lack of technical novelty, as the analysis is largely based on previous work utilizing the Moreau envelope for convex low-level objectives (Gao et al., 2023), and other Hessian-free works. As a result, the proposed method seems like an extension / combination of previous methods."
            },
            "questions": {
                "value": "N/A"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3145/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3145/Reviewer_am3o",
                    "ICLR.cc/2024/Conference/Submission3145/Senior_Area_Chairs"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3145/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698618496709,
        "cdate": 1698618496709,
        "tmdate": 1700659031865,
        "mdate": 1700659031865,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "67mPRnsqjM",
        "forum": "i6EtCiIK4a",
        "replyto": "i6EtCiIK4a",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3145/Reviewer_UhJL"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3145/Reviewer_UhJL"
        ],
        "content": {
            "summary": {
                "value": "The authors propose a single-loop algorithm for bilevel optimization problems.\nThe algorithm can handle non-smooth and smooth + non-smooth weakly convex inner functions. The authors provide convergence rates under very weak assumptions (smoothness of the outer and the inner problem)."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "4 excellent"
            },
            "strengths": {
                "value": "To my knowledge, this work contains two major novelties:\n- in the smooth case, convergence proof a single loop algorithm with weak assumptions (smoothness of the inner and the outer problem only, no need for bounded gradients)\n- in the non-smooth case, to my knowledge, this is the first single-loop algorithm proposed\nMaybe the authors and other reviewers can comment on this."
            },
            "weaknesses": {
                "value": "While the proposed algorithm is clearly defined, authors could do a better job at providing the intuitions: the directions $d_x^k$ and $d_y^k$ are given with little context. The same comment applies to the merit function and Lemma 3.1."
            },
            "questions": {
                "value": "- Could you comment on the novelty, is this the first analysis with such a weak set of assumptions? Or I am missing something?\n\n- Could you give intuitions on the proof? (which is currently 10 pages long in the appendix) and intuitions on the merit function.\nMaybe the authors could provide a proof sketch"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "NA"
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 5,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3145/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698677653222,
        "cdate": 1698677653222,
        "tmdate": 1699636261614,
        "mdate": 1699636261614,
        "license": "CC BY 4.0",
        "version": 2
    }
]