[
    {
        "id": "VezbzFsYZ2",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4597/Reviewer_wvB3"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4597/Reviewer_wvB3"
        ],
        "forum": "IKkFJgAdlW",
        "replyto": "IKkFJgAdlW",
        "content": {
            "summary": {
                "value": "This paper proposes to use linear extrapolation to generate OOD graph data, which helps improve graph OOD generalization. This paper also provides theoretical guarantees for the proposed augmentations."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- The paper provides a linear extrapolation framework for graph data, with analyses and guarantees. (I do not read the proofs since I am not familiar with graph learning, so I can not promise that the theoretical results are right)\n- The proposed GDA method shows strong empirical performance and outperforms the baselines a lot (I am not familiar with graph OOD algorithms, so I am not sure whether this method outperforms the existing SOTA)"
            },
            "weaknesses": {
                "value": "- It seems that the up-to-date baseline used in this paper is in 2022, are there any new baselines in 2023?"
            },
            "questions": {
                "value": "I have no other questions. I am not very familiar with graph learning, and I can not find obvious errors in this paper, so I give a score of 6. However,  I wish the AC consider my suggestions as little as possible."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4597/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4597/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4597/Reviewer_wvB3"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4597/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1697356733160,
        "cdate": 1697356733160,
        "tmdate": 1699636438223,
        "mdate": 1699636438223,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "YLDRqhzPZW",
        "forum": "IKkFJgAdlW",
        "replyto": "IKkFJgAdlW",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4597/Reviewer_hu8t"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4597/Reviewer_hu8t"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes structure and feature extrapolation for OOD generalization, achieving substantial improvement on various graph OOD datasets."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The proposed method is evaluated on a wide range of datasets and significant improvement is achieved on OOD data.\n2. The proposed graph extrapolation is interesting."
            },
            "weaknesses": {
                "value": "1. This paper lacks qualitative or quantitative evaluation of extrapolated graphs (e.g. visualization on GOOD-CMNIST-color) and how the quality of augmented graphs affects the OOD generalization performance.\n2. The quality of graph extrapolation depends on the quality of subgraph extraction, which might not be very reliable. Experimental analysis should be provided on the robustness of the method, especially when the causal/environment subgraphs are hard to find."
            },
            "questions": {
                "value": "Can you provide more results on the quality of causal/environment subgraph generation and some visualization of the result of G-Splice?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4597/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698329233275,
        "cdate": 1698329233275,
        "tmdate": 1699636438111,
        "mdate": 1699636438111,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "KsRSIXNewD",
        "forum": "IKkFJgAdlW",
        "replyto": "IKkFJgAdlW",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4597/Reviewer_cpdN"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4597/Reviewer_cpdN"
        ],
        "content": {
            "summary": {
                "value": "This paper introduces a novel approach to tackle the challenge of out-of-distribution (OOD) generalization in the context of graph classification tasks. The primary objective of this method is to address domain adaptation issues by employing a data-centric approach that involves generating OOD data samples through the technique of data extrapolation. To this end, an environment-aware framework is proposed, which incorporates linear extrapolation techniques in both the graph's structural and feature spaces. The theoretical underpinnings of this work provide justifications for the causal validity of the generated samples obtained through linear extrapolation, ensuring their tailored nature for specific OOD shifts. Through comprehensive empirical analyses and extensive experimentation, the effectiveness of the proposed method is demonstrated, surpassing the performance of existing OOD learning and data augmentation approaches in the realm of graph tasks. The key contribution lies in the innovative design of non-Euclidean-space linear extrapolation, which facilitates the augmentation of both the graph's structural and feature spaces, thereby enabling the generation of OOD samples customized for specific shifts without compromising the inherent causal mechanisms. The obtained results consistently showcase notable improvements across diverse graph OOD tasks."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1)\tThe paper presents a data augmentation technique to address the OOD generalization challenge in graph-related tasks. The proposed method introduces the innovative concept of employing linear extrapolation for generating novel training samples, contributing to the advancement of the field.\n2)\tThe paper introduces extrapolation techniques at both the structural and feature levels, providing valuable insights for addressing out-of-distribution (OOD) challenges in graph and node-level problems.\n3)\tThe paper offers a comprehensive and clear theoretical proof, which serves as a solid foundation and provides theoretical substantiation for the proposed method in the paper."
            },
            "weaknesses": {
                "value": "1)\tInsufficient experiments: In Chapter 6.2, concerning the feature shift node classification experiment, it is worth noting that there is a noticeable absence of experimental results on the GOOD-Arxiv dataset, which is characterized by a substantial volume of data. In addition, graph OOD problems include not only covariate shift but also concept shift. GOOD benchmark also provides relevant settings. It would be beneficial if you could provide results and discussions related to the data from this specific setting.\n2)\tThe feature extrapolation (FeatX) seems unrelated to Structure Extrapolation. However, in graph structure, feature information and structural information are interrelated. Could you provide a more detailed explanation of feature extrapolation and structural extrapolation?"
            },
            "questions": {
                "value": "1)\tThe article proposes a separate and independent data augmentation approach that extrapolates at the structural and feature levels. However, in practical scenarios, it is possible for both structural and feature offsets to occur simultaneously. The question arises as to whether this separate augmentation strategy can effectively address such a complex out-of-distribution (OOD) problem."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4597/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4597/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4597/Reviewer_cpdN"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4597/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698799423076,
        "cdate": 1698799423076,
        "tmdate": 1699636438033,
        "mdate": 1699636438033,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "LfF85hUfiD",
        "forum": "IKkFJgAdlW",
        "replyto": "IKkFJgAdlW",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4597/Reviewer_EXsh"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4597/Reviewer_EXsh"
        ],
        "content": {
            "summary": {
                "value": "The paper proposes a graph data augmentation method to tackle the problem of graph OOD generalization. The proposed augmentation strategy extrapolates both structure and feature spaces to generate OOD graph data without corrupting underlying causal mechanisms. Theoretical analysis and empirical results evidence the effectiveness of our method in solving target shifts, showing substantial and constant improvements across various graph OOD tasks."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "* The paper tackles an important problem of graph OOD generalization. \n\n* The contribution is novel and interesting. \n\n* Paper writing is careful and clear. \n\n* Experiments are conducted thoroughly."
            },
            "weaknesses": {
                "value": "* Table 1 is too dense."
            },
            "questions": {
                "value": "1. About non-causal feature selection: Is the variance score really measuring the causal relationship between feature elements and target, or just the correlation between them? \n\n2. There is a line of work in cognitive science, namely the Structure Mapping Theory [1], stating that human’s generalization capability is based on the ability to transfer structural information. Recently this idea has been successfully incorporated (to some extent) in neural networks [2].  However, I do not see a clear relationship between causality and OOD generalization. I would appreciate if the authors could provide a more careful explanation on why preserving underlying causal mechanisms can help in OOD scenarios. \n\n3. From Table 2, it seems that G-Splice plays more significant role than FeatX in improving the model’s performances. Do the authors have any explanation or analysis for this? \n\n4. Variances of the proposed method are much higher on FSMotif dataset. Why is it? \n\nI would be happy to increase my score if the authors could tackle my concerns.\n\nReferences\n\n[1] Gentner, Dedre. \"Structure-mapping: A theoretical framework for analogy.\" Cognitive science 7.2 (1983): 155-170.\n\n[2] Pham, Kha, et al. \"Improving Out-of-distribution Generalization with Indirection Representations.\" The Eleventh International Conference on Learning Representations. 2022."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4597/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698836215634,
        "cdate": 1698836215634,
        "tmdate": 1699636437928,
        "mdate": 1699636437928,
        "license": "CC BY 4.0",
        "version": 2
    }
]