[
    {
        "id": "i7xo20uiUX",
        "forum": "izdFGwDgvW",
        "replyto": "izdFGwDgvW",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3752/Reviewer_jLvo"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3752/Reviewer_jLvo"
        ],
        "content": {
            "summary": {
                "value": "The paper proposes a method called Image-Caption Encoding (ICE) to improve the out-of-distribution generalization performance of vision-language models on image classification tasks. \nICE is a training-free method that combines information from both image embeddings and text caption embeddings generated by the model to make a more informed prediction at test time. The top-k predictions are weighted from the caption predictions and image predictions for improved classification and correcting any mistakes from the image classifier. \nExtensive experiments show ICE provides consistent improvements of around 0.5% on average and up to 3% on challenging datasets when added to existing state-of-the-art baseline methods for both zero-shot classification and few-shot fine-tuning."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "**Originality**\n\nThe idea of using image captions at evaluation time to improve OOD image classification is novel. The approach of combining image and caption probabilities is also creative, building on ideas from ensembling while utilizing unique properties of captions.\n\n**Quality** \n\nThe paper presents thorough experiments across 15 datasets with multiple SOTA baselines. Ablation studies analyze the impact of key parameters. The paper also provides examples and analysis to develop an intuition for why and how ICE works, what are it's limitations and when it fails.\n\n**Clarity**\n\nThe paper is clearly written and easy to follow. The method is intuitively explained with figures. Experiments and results are well-organized.\n\n**Significance** \n\nImproving out-of-distribution generalization is an important problem. The consistent gains from this simple approach could make the method widely applicable by utilizing informative captions in unique ways to improve OOD classification."
            },
            "weaknesses": {
                "value": "- As discussed in the limitations, the method relies on captions providing useful supplementary information. Generating captions from a stronger vision-language model (such as BLIP) and then combining those captions with image predictions could help to make caption selection more robust.\n\n- Determining the optimal weight between image and caption probabilities seems challenging. Would a learning-based approach that adaptively learns weights for each branch work better?  Exploring other ways to set this weight adaptively could strengthen the approach and give more insights into how failure can be handled.\n\n- There is no comparison to other ensembling techniques that could provide diversity. While the motivation behind using captions to improve the OOD is interesting, the improvements from the model are small which raises two questions - a) are the captions generated the main problem, or b) are the way they are used to correct the prediction? A more descriptive SOTA captioning model would help in answering the first question and hence lead the way to design better ensembling techniques."
            },
            "questions": {
                "value": "No specific questions, please look at weaknesses for certain clarifications."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3752/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698239796442,
        "cdate": 1698239796442,
        "tmdate": 1699636331546,
        "mdate": 1699636331546,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "lXtcoiKjd8",
        "forum": "izdFGwDgvW",
        "replyto": "izdFGwDgvW",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3752/Reviewer_DXxh"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3752/Reviewer_DXxh"
        ],
        "content": {
            "summary": {
                "value": "The address the problem of out-of-distribution (OOD) generalization of image classification models. The proposed method: ICE, is build on the premise that when a OOD datapoint is misclassified, the correct class can sometimes be found in the Top-K predicted classes. To take advantage of this property, ICE enforces consistency between the image-conditioned and caption-conditioned predictions at evaluation time. Evaluation shows that Top-1 OOD accuracies improve by 0.5% on average when the proposed ICE framework is used."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "+ The proposed approach is well-motivated. Section 4.3 provides details of why the proposed ICE method can improve over baseline zero-shot/few-shot classification approaches in certain cases.\n\n+ The paper is well written, Figure 4 provides a good overview of the proposed approach.\n\n+ The paper reports hyper-parameters and training details, which improves reproducibility.\n\n+ The paper includes adequate ablations in Figure 6, discussion the effect of the weight parameters \\lambda and \\eta.\n\n+ The paper discussion its limitations in detail."
            },
            "weaknesses": {
                "value": "- Inference time: Compared to prior work such as  CoCa (Yu et al., 2022), the proposed ICE framework needs to encode/decode multiple captions. This would likely significantly increase inference time compared to prior work. A thorough analysis of inference time with respect to prior work is necessary.\n\n-  Performance improvement over baselines is limited. While the average performance improvement is 0.5%, in many datasets the performance improvement over the baseline is less than 0.1%, e.g., Caltech, Food, SUN, UCF in case of zero-shot cross-dataset generalization. Furthermore, in the case of few-shot domain generalization in Table 2 the best performance is obtained by the baseline CLIPood method.\n\n- In-domain performance: the proposed method is evaluated primarily on cross-dataset and domain generalization settings. However, the in-domain performance, e.g., on ImageNet, is not evaluated (\\cf Figure 4 in CoCa).\n\n-  The proposed method seems to be applicable only to image datasets. However, prior work such as CoCa is applicable even to video datasets. A discussion on the applicability of the proposed approach to video datasets would be highly appreciated.\n\n- As the approach looks only at the Top-K classes, its performance is inherently limited. Is the proposed approach helpful in case the correct class is not within the initial Top-K predictions?"
            },
            "questions": {
                "value": "1. A detailed analysis of inference speeds with and without the use of the proposed ICE method would be helpful.\n2. The paper should discuss in more detail in which scenarios ICE provides a performance boost, as in the case of many datasets, e.g., Caltech, Food, SUN, and UCF, the performance improvement is less than 0.1%.\n3.  The paper should also discuss in more detail the applicability of the proposed approach to video data."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3752/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698729195858,
        "cdate": 1698729195858,
        "tmdate": 1699636331474,
        "mdate": 1699636331474,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "B332kauulN",
        "forum": "izdFGwDgvW",
        "replyto": "izdFGwDgvW",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3752/Reviewer_oC1d"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3752/Reviewer_oC1d"
        ],
        "content": {
            "summary": {
                "value": "The paper proposes to improve the zero-shot and few-shot image classification performance for contrastive vision-language models by utilizing the caption embeddings, given an additional caption model. The proposed method is straightforward and comprehensive evaluations on 11 downstream datasets demonstrates the effectiveness of the method."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- The paper is well written and the organization of the paper is clear.\n- Experiments are comprehensive with multiple downstream datasets under the zero-shot and few-shot setting."
            },
            "weaknesses": {
                "value": "- It remains unclear why the text decoder from CoCa is used. It seems that the proposed method only requires a textual description of the input image (any off-the-self high-quality caption models may work). It would be interesting to compare with the performance when using other caption models.\n\n- Compared to CLIP, the approach requires an additional caption model (as the image decoder) and is dependent on the quality of the caption, which can be hard to measure. \n\n- Empirical improvement in the few-shot setting seems marginal compared to the baselines. It may be arguable whether the additional computational cost (of forwarding passing the image to the text decoder) is desirable."
            },
            "questions": {
                "value": "- Can authors explain why CoCa is used, instead of an arbitrary caption model? If we replace CoCa with SoTA caption model, will the performance be significantly improved? \n\n- The performance gain in the few-shot setting seems marginal (Table 2). Does this mean that in the few-shot adaptation setting, we may just need a few images, instead of using an additional decoder?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3752/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698826665248,
        "cdate": 1698826665248,
        "tmdate": 1699636331391,
        "mdate": 1699636331391,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "QpmPrlWQFh",
        "forum": "izdFGwDgvW",
        "replyto": "izdFGwDgvW",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3752/Reviewer_F7uJ"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3752/Reviewer_F7uJ"
        ],
        "content": {
            "summary": {
                "value": "The authors observed that even when image classification models make a mistake, the correct answer frequently appears within the top five guesses. Inspired to nudge the model towards the right choice among these top contenders, they introduced a novel approach for zero-shot image classification by combining image and text caption embeddings. This technique enhances the performance of the SOTA methods by an average of 0.5%, and by as much as 3%. They have tested their method on cross-dataset generalization datasets and domain generalization datasets. They also performed simple qualitative error analysis."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- Tested their method using a wide range of image recognition datasets (11 cross-dataset generalization datasets and 4 domain generalization datasets)\n- Ablation studies on the parameters of ICE is performed."
            },
            "weaknesses": {
                "value": "- The performance gains are slight; examining Table 1 and Table 2 shows that ICE only slightly increases performance over the baseline by 0.1 to 0.4 on variations of ImageNet. Moreover, for certain datasets like INet-Sketch, the baseline actually performs better.\n- Image captioning poses a greater challenge compared to image classification because, particularly for complex images (including some found in ImageNet) a single image may not correspond to just one correct label. Consider, for instance, the top-right picture in Figure 5 labeled as \"strawberry.\" Labeling this image solely as a strawberry seems inaccurate. More broadly, it's impractical to use images featuring multiple objects for a single-label classification. Image captioning is the suitable approach for these types of images. Pushing for precise classification on such images may simply be tailoring models to fit benchmark datasets without truly enhancing their comprehension of the images. Therefore, I don't see how their approach can be applied for complex images. I agree that this approach works for simple images, but I'd assume the existing image models already work well for such cases, as evidenced by Table 1 and 2.\n- In Section 4.3, \"Understanding Why ICE Provides Improvements,\" the explanation is merely qualitative, based on just four examples. It's difficult to gauge the representativeness of these cases. A deeper quantitative analysis—for example, determining how common these cases are in standard image datasets—would be necessary to fully understand why and how ICE is effective."
            },
            "questions": {
                "value": "Related to the last point in the Weaknesses section, how representative are four scenarios discussed in Section 4.3 within standard image datasets?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3752/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699237591328,
        "cdate": 1699237591328,
        "tmdate": 1699636331329,
        "mdate": 1699636331329,
        "license": "CC BY 4.0",
        "version": 2
    }
]