[
    {
        "id": "wEbqhxPpg1",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2621/Reviewer_in5m"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2621/Reviewer_in5m"
        ],
        "forum": "J0cCuE3JRC",
        "replyto": "J0cCuE3JRC",
        "content": {
            "summary": {
                "value": "This paper investigates the performance of Graph Neural Networks (GNNs) for link prediction tasks in comparison to traditional feature extraction methods. The authors propose a simple machine learning model called \"Bag of Features,\" which combines structural features based on node proximity in the graph structure and domain features based on feature space similarity. Their findings show that this model delivers highly competitive results when compared to state-of-the-art GNN models across various benchmark datasets. This supports recent theoretical observations that current GNNs may not be fully exploiting their potential, suggesting a need for innovative approaches to unlock the full capabilities of GNNs."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "4 excellent"
            },
            "strengths": {
                "value": "1. The proposed Bag of Features (BFLP) model is elegant, simple, and effective, combining both structural features and domain features to create a powerful machine learning model for link prediction tasks.\n\n2. The model demonstrates consistently competitive results when compared to state-of-the-art GNN models, providing empirical evidence that there is room for improvement in current GNN approaches.\n\n3. The paper highlights the potential for conventional feature extraction methods to be integrated into future ML models to enhance their performance.\n\n4. The work is likely to inspire future research in the link prediction domain, encouraging researchers to explore alternative methods and improve upon existing GNN techniques.\n\nOverall, I enjoyed reading the paper and it is a significant contribution to the application of link prediction."
            },
            "weaknesses": {
                "value": "Several improvements can be made to enhance the quality of the work. Addressing these comments may lead to a higher score:\n1. Rectify the discrepancies between baseline performances in Table 5 and those on the OGB website (refer to Comment 1 for details).\n\n2. Broaden the evaluation datasets to encompass a variety of network structures and domains (see Comments 2 and 3 for clarification).\n\n3. Perform ablation studies to gain a deeper understanding of the contributions made by the Bag of Features model components (refer to Comment 4 for more information)."
            },
            "questions": {
                "value": "1. A discrepancy exists between the performance reported in Table 5 and the OGB website. For instance, GraphSAGE shows a 48.10 on the OGB website, but the paper reports 56.88. The performance in Table 5 closely aligns with the validation performance on the OGB website. The authors should verify if Table 5 reflects the validation dataset performance and determine the cause of this inconsistency.\n\n2. Tables 3 and 4 follow the methods of (Zhao et al., 2022) and (Guo et al., 2022), respectively. To enhance comprehensiveness, the authors should consider adding Facebook and OGB-DDI to Table 3, and Cora, Citeseer, and DBLP to Table 4.\n\n3. The paper focuses on homophilous graph datasets, but the proposed method could also be applied to heterophyllous graph datasets. Including these datasets would increase the paper's impact.\n\n4. The ablation studies only examine the removal of all structural or domain features. A more detailed table illustrating the impact of each individual feature on the datasets would make the results more appealing."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission2621/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2621/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2621/Reviewer_in5m"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2621/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1697441539201,
        "cdate": 1697441539201,
        "tmdate": 1700664831554,
        "mdate": 1700664831554,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "Vc5ZnzzZ5R",
        "forum": "J0cCuE3JRC",
        "replyto": "J0cCuE3JRC",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2621/Reviewer_Wcv5"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2621/Reviewer_Wcv5"
        ],
        "content": {
            "summary": {
                "value": "This work unifies conventional feature extraction methods for link prediction and uses standard machine learning models to learn from them. The result model delivers highly competitive results on various datasets."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. Clear method.\n\n2. Solid experiments."
            },
            "weaknesses": {
                "value": "1. Novelty is limited. Most methods are ordinary feature extraction tricks.\n\n2. Experiments are not conducted on OGB datasets other than collab."
            },
            "questions": {
                "value": "1. Please add experiments on other OGB datasets.\n\n2. This work used XGBoost as the ML model. Did you conduct ablation study for it? For example, use Logistic regression and SVM instead?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2621/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698407417155,
        "cdate": 1698407417155,
        "tmdate": 1699636201257,
        "mdate": 1699636201257,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "Hv5E6PWirz",
        "forum": "J0cCuE3JRC",
        "replyto": "J0cCuE3JRC",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2621/Reviewer_dape"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2621/Reviewer_dape"
        ],
        "content": {
            "summary": {
                "value": "This paper leverages different graph structural features with node attributes for link prediction tasks. Then, an XGBoost method is utilized based on these features for link prediction."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "1. The authors explore different graph structural features for link prediction.\n2. The paper is well-written and easy to follow."
            },
            "weaknesses": {
                "value": "1. The paper's novelty appears constrained. The significance of graph structural features in the realm of link prediction has been previously underscored by several studies, such as [1][2][3].\n2. The evaluation omits several critical baselines that similarly exploit graph structural features. Notably absent are BUDDY, Neo-GNN, NCN, NCNC, and NBFNet.\n3. The experimental setup seems to miss out on key datasets such as ogbl-ddi, ogbl-ppa, and ogbl-citation2. \n4. There are no ablation studies about the importance of each feature.\n5. While the method demonstrates commendable efficacy on the OGBL-Collab dataset, it's concerning that the associated code is inaccessible, given the empty repository link.\n6. Using the original feature to measure the node similarity might be unreasonable.\n\n[1] Menon, Aditya Krishna, and Charles Elkan. \"Link prediction via matrix factorization.\"\n[2] Muhan Zhang and Yixin Chen. Link prediction based on graph neural networks. \n[3] Xiyuan Wang, Haotong Yang, and Muhan Zhang. Neural common neighbor with completion\nfor link prediction."
            },
            "questions": {
                "value": "Please refer to the weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission2621/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2621/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2621/Reviewer_dape"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2621/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698809176447,
        "cdate": 1698809176447,
        "tmdate": 1699636201185,
        "mdate": 1699636201185,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "NPheynnnNc",
        "forum": "J0cCuE3JRC",
        "replyto": "J0cCuE3JRC",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2621/Reviewer_rEua"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2621/Reviewer_rEua"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes bags of heuristics for link prediction. The experiments show the effectiveness of the proposed method."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "This paper shows that the conventional features of the graph can be utilized to outperform GNN in link prediction."
            },
            "weaknesses": {
                "value": "1. The conclusion that graph heuristics can outperform GNN in link prediction is not a new contribution. This article only proposes some heuristics but does not explain why they are effective.\n2. This paper overclaims its contribution. The method and experiments of this paper are designed for link prediction, but the contribution of this paper lies in discussing that GNN is not good at graph learning. As far as I know, heuristics perform better than GNN only in link prediction, and there seems to be no similar phenomenon in other domains such as graph classification, node classification, and graph regression.\n3. The experimental part of this article does not compare with state-of-the-art GNN methods, such as NBFNet[1] and Seal[2].\n\n[1] Neural Bellman-Ford Networks: A General Graph Neural Network Framework for Link Prediction\n\n[2] Link Prediction Based on Graph Neural Networks"
            },
            "questions": {
                "value": "see weakness"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2621/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698912916716,
        "cdate": 1698912916716,
        "tmdate": 1699636201068,
        "mdate": 1699636201068,
        "license": "CC BY 4.0",
        "version": 2
    }
]