[
    {
        "id": "CG3zKKKUPB",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8706/Reviewer_jbwL"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8706/Reviewer_jbwL"
        ],
        "forum": "k8Y71G7Xpz",
        "replyto": "k8Y71G7Xpz",
        "content": {
            "summary": {
                "value": "This paper considers how to speed up the second-order method for online kernel learning using sketching. To achieve a logarithmic regret bound, it is common to deploy Newton-type method for OKL, but second-order methods are usually computationally inefficient. This paper attempts to address the issue by using sketching and better algorithms. To this end, they provide an algorithm with update time $O(Bk+k^2)$, when $k$ is small this is a strict improvement from prior works that rely on computing the Newton direction exactly. They also conduct extensive experiments to show that the proposed method is faster than other second-order methods and has a better error rate than first-order methods."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The algorithm in this paper is relatively simple and elegant. It uses sketching in a natural and unsurprising way to improve the runtime efficiency. It also proposes a decomposition algorithm that can effectively handle low-rank updates, by computing a truncated SVD on a much smaller matrix. This leads to the overall runtime improvements. These improvements are also visible through experiments."
            },
            "weaknesses": {
                "value": "The idea of using sketching to speed up second-order methods are not novel, for example, the Newton sketch due to Pilanci and Wainwright and the spectral approximation approach in several papers on training neural networks [BPSW21]. Other than the sketching speedup, and the truncated SVD procedure, this paper follows a very standard pipeline to analyze the performance of their modified algorithm. Overall, the results are not surprising and the novelty is limited.\n\n[BPSW21] J. van den Brand, B. Peng, Z. Song and O. Weinstein. Training (over-parametrized) neural networks in nearly linear time. ITCS'21."
            },
            "questions": {
                "value": "Typo: on page 3, two paragraphs above section 3.2, $K_{i,j}$ should be $\\phi(x_i)^\\top \\phi(x_j)$ instead of $\\phi(x_i)\\phi(x_j)^\\top$."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission8706/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission8706/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission8706/Reviewer_jbwL"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8706/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1697180938468,
        "cdate": 1697180938468,
        "tmdate": 1699637091869,
        "mdate": 1699637091869,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "yZR0uSEcQL",
        "forum": "k8Y71G7Xpz",
        "replyto": "k8Y71G7Xpz",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8706/Reviewer_9VaC"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8706/Reviewer_9VaC"
        ],
        "content": {
            "summary": {
                "value": "This paper propose FORKS:Fast Second-Order Online Kernel Learning using Incremental Sketching, a fast and effective second-order online kernel learning method. FORKS use efficient low-rank modifications to maintain incremental randomized sketches and apply it to second-order online kernel learning, which makes FORKS have linear time complexity w.r.t. the budget, and enjoy a logarithmic regret bound for online kernel learning.\nThe proposed TISVD : Truncated Incremental SVD, is a novel incremental singular value decomposition based method adapting to matrix decomposition problems.\nThe paper conducts an extensive experimental study to demonstrate the superior performance of FORKS on several datasets and validate the robustness and scalability of FORKS on large-scale datasets."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "Originality:It proposed a new incremental SVD method,TISVD. It simplifies the singular value decomposition of the updated matrix to a singular value decomposition of a matrix with lower rank,which is very effective in maintaining the incremental maintenance of kernel matrices\nQuality: This paper combines the strengths of two current articles in the field of online kernel learning and proposes a new framework FORKS, which greatly improves the time efficiency and accuracy.\nClarity；This paper systematically elaborates on the steps of its framework , and analyzes the complexity and the regret bound of FORKS.The proposed framework is easy to follow.\nSignificance:This proposed framework significantly improves the efficiency of each incremental update step while ensuring the logarithmic regret bound."
            },
            "weaknesses": {
                "value": "The original content of this paper is relatively limited. The main framework of this paper is a simple combination of important parts from the other two papers ,SkeGD and PRONS-N-KONS.\nIn addition, stacking formulas simply is unfriendly to those who are not familiar with incremental random sketch,and more images would be better."
            },
            "questions": {
                "value": "1.Compared with other ISVD methods, TISVD performs a truncated rank SVD. Will there be any loss of information in the original matrix, as low rank is one of the prerequisites for ISVD?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission8706/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission8706/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission8706/Reviewer_9VaC"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8706/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698827742292,
        "cdate": 1698827742292,
        "tmdate": 1699637091721,
        "mdate": 1699637091721,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "yM06JJLU9Q",
        "forum": "k8Y71G7Xpz",
        "replyto": "k8Y71G7Xpz",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8706/Reviewer_SDsQ"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8706/Reviewer_SDsQ"
        ],
        "content": {
            "summary": {
                "value": "This paper considers kernel learning in the online setting. The main goal is to give an algorithm with logarithmic regret that is also efficient. It is well known that online gradient descent based methods only achieve square root regret, while exact second order optimization methods achieve logarithmic regret. Thus,  the paper proposes a new approximate second order method, which approximates the kernel matrix at any time step using an online variant of CUR Decomposition/Nystrom approximation, proposed by Wang et al. 2016. This method is similar to others that have been proposed in the literature that use Nystrom based kernel matrix approximation to speed up second second order online kernel learning.\n\nNaively, applying this Nystrom decomposition method requires time roughly s^3 per iteration where s is the number of landmark points sampled. This is due to having to perform a truncated SVD of an s x s sampled matrix to reduce it to some rank k < s.  To address this, the paper proposes an incremental SVD approach which improves the s^3 runtime to O(sk+k^3).\n\nThe paper provides a regret analysis for their approach, as well as experiments. The paper also claims that the proposed algorithm is more robust in adversarial settings than existing approaches. However, it was unclear to me why this was — given that the algorithm largely follows the same blueprint as related prior work. No guarantees on robustness are given.\n\nI have two related major concerns about the presented results.\n\n1. The relationship between the proposed truncated incremental SVD (TISVD), (which seems to be the main algorithmic contribution of the work) and existing work on incremental SVD was unclear to me. Existing work on incremental SVD updates the SVD of a s x s rank-k matrix with a constant rank update in O(sk+k^3) time. Once this update is performed, the matrix may no-longer be rank-k. However, one can trivially truncate the new SVD back to rank-k if desired. This seems to be the only difference proposed by TISVD? It would be helpful if the authors could explain why the given O(sk+k^3) runtime then just doesn’t directly follow from existing work on Incremental SVD. There is an extensive discussion in appendix D, but it is not clear and does not address my question above.\n\n2. Of course, truncating the SVD after each low-rank update, as is done in this paper has a cost. It means that after all the updates have been performed the output *is not* equivalent to just performing a truncated SVD on the sum of updates. Consider a simple example where I have a diagonal 2 x 2 matrix A. And rank parameter k = 1. Then say initially A_1,1 = 1, A_2,2 = 0. My rank-1 approximation to A (i.e. truncated rank-1 SVD) will be [1,0,0,0]. Now say I repeatedly make rank-1 updates where I increment A_2,2 by .5. Then every time I make a rank-1 update and then truncate back to rank-1, I will truncate A back to [1,0,0,0]. This will be a very poor approximation to my matrix, which after t updates will have A_11 = 1 and A_22 = t/2. \n\nThis issue is known in the literature. For example, it is addressed by work on Frequent Directions sketching — see https://arxiv.org/abs/1501.01711, which performs a different type of truncation that prevent losing large weight of accumulated updates.\n\nCritically, the main regret bound of the paper Theorem 1, must depend then on some sort of accuracy guarantee for TISVD, since the algorithm it applies to uses TISVD. However, if one inspects the proof of Theorem 1, there is no mention of TISVD. From what I understand, it is simply assumed that TISVD does in fact output an optimal rank-k approximation to the accumulated updates (I believe specifically in equation (16)).\n\nIt would be very helpful if the authors could address the above concerns during the author response period and correct me if I am mistaken."
            },
            "soundness": {
                "value": "1 poor"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "See full review."
            },
            "weaknesses": {
                "value": "See full review."
            },
            "questions": {
                "value": "I have starred questions/comments that I think are more important and would be helpful to see in the rebuttal.\nQuestions/Comments:\n- I don’t understand the premise in the first paragraph. Why does OGD only use a linear combination of the feature vectors? This is only if the gradient is a linear combination of these vectors right? It would depend on the function being optimized no? OGD could be applied to highly non-linear models, such as neural networks. Are you focusing specifically in linear regression and kernel ridge regression here? It is unclear.\n-** In the discussion of the work of Calandriello et al. it says ‘rendering a significant cost of updates’. I didn’t follow this? Why is this? Isn’t the goal of that line of work exactly to make the cost scale linearly in the number of data points seen?\n-** In abstract and intro it is not clear what ‘the budget’ is. Relatedly I don’t understand why the work of Calandriello has a quadratic scaling. Can this be made more concrete?\n- In the problem set up, can what class does f_t come from? Presumably it can’t be just and function mapping inputs to labels. Are you assuming that it is linear in the RKHS?\n-** In the classic Nystrom method of Williams and Seeger, the approximation of the for KS(S^TKS)^+ S^K where S is a sampling matrix. I.e. U = (S^TKS)^+. See equation (10) in Williams and Seeger. U is very efficient to compute since S^T K S is just a small principal submatrix of the kernel matrix. Further, this approximation is optimal in the trace norm.\n- From what I can tell the approach described in (1), which optimizes U in the Frobenius norm, was not discussed in the Williams and Seeger paper, and is much more computationally expensive as it requires computing (KS)^+. Why is this variant being considered? Why does classic Nystrom not suffice? The approach of (2) seems reasonable, but why use it over classic Nystrom? Is it more accurate in some settings? Some justification needs to be given here.\n-** Why in 5 are you using a rank k SVD. Is the goal to further reduce dimension? If so, why?  Again — this needs to be justified as this seems to be a key computational step tackled by the presented approach.\n- Incremental SVD algorithms/algorithms for SVD with low-rank updates are widely studied. See e.g. https://www.merl.com/publications/docs/TR2006-059.pdf. More work should be cited here and a more clear comparison made.\n- The discussion of the randomized SVD in Appendix D might be inaccurate?. Assuming you are maintaining a reduced rank-k SVD of the s x s matrix, then this matrix can be multiplied by in O(s*k) time, not O(s^2) time. By multiplying by each factor sequentially. Thus, the runtime here I believe should be O(s*k^2+k^3).\n- In Theorem 1, the coherence is undefined. This has multiple different definitions in the literature so needs to be defined.\n-** Table 1 doesn’t make sense to me. If one wants to achieve a faster algorithm, why not just set B = 0. Or just design an algorithm that actually looks at just a small fraction of the budget, giving any runtime desirable. In order for this table to sensical, there must be some notion of how the budget and the regret bound relate. Also as mentioned earlier — the term ‘budget’ is never defined. It is not clear what it means."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "1: strong reject"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8706/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698943406087,
        "cdate": 1698943406087,
        "tmdate": 1699637091599,
        "mdate": 1699637091599,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "VGCY7WGTKA",
        "forum": "k8Y71G7Xpz",
        "replyto": "k8Y71G7Xpz",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8706/Reviewer_Rsps"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8706/Reviewer_Rsps"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a novel variant of second-order online sketched kernel learning with a reduced complexity in time and memory. The approach exploits a key ingredient, the so-called Truncated Incremental SV,  when updating the approximated sketched feature map. \nTiSVD allows to incrementally modify a SVD matrix (when new data arrives) by directly modifying its different components and consequently update at a lower price the approximated sketched feature map. This trick is used in association with second order corrections of the weight w_t. The contribution is simple to understand when reading appendix C and it nicely completes the literature. A regret analysis is developed with an assumption about directional curvature of the  Lipchitz continuous loss (no strong convexity is required) additionally to classic assumptions about polynomial weight decay of the base kernel. Experimental results include comparisons between this algorithm and competitors with fixed budget (nb of streaming data with non-zero loss for which corrections have to be made). Moreover, FORK is also empirically shown to be robust against adversarial attacks."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "Overall, the paper is well written. Its strength is to combine a technical contribution with theoretical and empirical back up. The work, well executed, appears as the first one to reduce the complexity to a linear order of a budget and therefore, provides a useful contribution to the ML community.\n\nTiSVD is original up to my knowledge. However, originality is somehow limited in the sense that the contribution consists essentially in introducing TiSVD in the algorithm for updating the approximated sketched feature map while the overall algorithm already pre-exists."
            },
            "weaknesses": {
                "value": "Overall, my main concern is that this work is very incremental while bringing a new component in second-order online sketched kernel algorithms. It certainly deserves a publication but I am not completely convinced that it should be in a venue like ICLR.\n\nThe paper presents some flaws in its presentation that can be easily solved. \n- Related works are not presented in sufficient details so that one can measure the importance of the contribution.\n- a few lines are needed to close the loop between the description of TiSVD and its usage in the algorithm, too much material is delayed to the supplements \n- more importantly, Assumption 3 is badly written: 1/ it is written as a definition while it is an assumption about S_p. 2/ It contains a big typo, the equation as presented here seems to me a non-sense. I assume that the event on which the probability is computed should be $\\|  B_iA_i  - B_I S_p S_p^T A_i \\|^2 > Constant \\| A_i \\|^2 \\|B_I \\|^2$ with the right notations..."
            },
            "questions": {
                "value": "- Please following the previous remarks, comment on novelty of the paper\n- can you come back to assumption 3 and confirm the typo and propose a clean version of it ?\n- discuss the choice of k (in empirical study, it is fixed for comparison which is fine)\n- Adversarial attacks are empirically studied. I did not catch why the algorithm should be robust to such attacks. Is a theoretical guarantee is reachable ? \n- finally, overcoming concept drifting is also a claim of the paper but I don't really see a discussion about that."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8706/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699087002938,
        "cdate": 1699087002938,
        "tmdate": 1699637091467,
        "mdate": 1699637091467,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "TcnJqAkfuu",
        "forum": "k8Y71G7Xpz",
        "replyto": "k8Y71G7Xpz",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8706/Reviewer_XAux"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8706/Reviewer_XAux"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a fast second-order approach, called FORKS, for online kernel learning. The FORKS method leverages incremental sketching to reduce the computational cost. The authors provide both theoretical and empirical analysis for the proposed method."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "The proposed method requires less computational cost than existing second-order approaches for online kernel learning."
            },
            "weaknesses": {
                "value": "1. The novelty of this paper is limited. The TISVD algorithm, which claimed to be novel, seems the same as the method in (Brand 2006). The incremental maintenance of sketch is almost same as the method in (Zhang & Liao, 2019). \n2. This paper does not seems to consider the approximation error caused by truncated SVD."
            },
            "questions": {
                "value": "see weakness"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 5,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8706/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699119902449,
        "cdate": 1699119902449,
        "tmdate": 1699637091358,
        "mdate": 1699637091358,
        "license": "CC BY 4.0",
        "version": 2
    }
]