[
    {
        "id": "6ERtKCQ4fY",
        "forum": "KNzL1nglNB",
        "replyto": "KNzL1nglNB",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5287/Reviewer_Geja"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5287/Reviewer_Geja"
        ],
        "content": {
            "summary": {
                "value": "The authors propose a Label-encoding Risk Minimization (LRM), which draws inspiration from the phenomenon of neural collapse. Specifically, the proposed LRM first estimates the label encodings through prediction means for unlabeled samples and then aligns them with their corresponding ground-truth label encodings. As a result, the LRM takes both the prediction discriminability and diversity into account and can be utilized as a plugin in existing models to address scenarios with insufficient labels. Theoretically, the authors analyze the relationship between the LRM and ERM."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- The authors propose a new method to extend the limitation of classical Empirical Risk Minimization (ERM) into the label insufficient scenario.\n- The experiments have been conducted to illustrate the superiority of the proposed method."
            },
            "weaknesses": {
                "value": "- The authors validate the performance of the proposed only on some small-scale datasets, such as CIFAR-10, CIFAR-100, an so on. The validation on larger-scale datasets are missing. \n- The qualitative analysis and visualization in experiments are missing."
            },
            "questions": {
                "value": "- The authors validate the performance of the proposed only on some small-scale datasets, such as CIFAR-10, CIFAR-100, an so on. The validation on larger-scale datasets are missing. \n- The qualitative analysis and visualization in experiments are missing."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5287/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5287/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5287/Reviewer_Geja"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5287/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698401576628,
        "cdate": 1698401576628,
        "tmdate": 1699636529102,
        "mdate": 1699636529102,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "KUHhBEOm27",
        "forum": "KNzL1nglNB",
        "replyto": "KNzL1nglNB",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5287/Reviewer_UtTT"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5287/Reviewer_UtTT"
        ],
        "content": {
            "summary": {
                "value": "Empirical Risk Minimization (ERM) performs well with the sufficient labels, but suffers from neural collapse in situations with insufficient labels.  In this paper, authors prove that label encoding (one-hot encoding) is the cause of Neural Class-Mean Collapse (NCC), and propose Label-encoding Risk Minimization (LRM) to alleviate the NCC problem."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- The authors have demonstrated the cause of NCC through the use of label encoding and have further enhanced it to improve network performance. \n- The evidence supporting NCC and LRM is explicitly presented.\n- Experimental results show that LRM achieves good performance in various tasks such as semi-supervised learning (SSL), unsupervised domain adaptation (UDA), and semi-supervised heterogeneous domain adaptation (SHDA)."
            },
            "weaknesses": {
                "value": "- Although authous conducted experiments on a variety of tasks, for each task they only ran experiments on specific datasets. For example, for UDA, they only ran experiments on Office-31 and did not evaluate on many other UDA datasets.\n\n- Authours also do not have experimental results on large scale data. It is not confirmed that their algorithm is useful when training a model from scratch on large scale training data."
            },
            "questions": {
                "value": "- Can we say that domain adaptation is a situation where there are not enough labels? A typical domain adaptation is a setting where there are no target labels at all, and the amount of labels in the source data is irrelevant. What does it mean to have insufficient labels in this situation?\n\n- Is there a reason why you didn't perform experiments on a large scale dataset such as ImageNet?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5287/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698741212756,
        "cdate": 1698741212756,
        "tmdate": 1699636529006,
        "mdate": 1699636529006,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "t8JgYkAkFQ",
        "forum": "KNzL1nglNB",
        "replyto": "KNzL1nglNB",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5287/Reviewer_VuKt"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5287/Reviewer_VuKt"
        ],
        "content": {
            "summary": {
                "value": "In this paper, authors focus on extending the empirical risk minimization (ERM) of the supervised learning to the label insufficient scenarios with proposed label-encoding risk minimization (LRM), which draws inspiration from the phenomenon of neural class-mean collapse (NCC). The core idea of LRM comes from estimating the label encodings through prediction means for unlabeled samples and aligning them with their corresponding ground-truth label encodings."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "Specifically, it is implemented by adding LRM term to objective function. Authors not only analyze the relationship between the LRM and ERM in theory, but also demonstrate the superiority of the LRM under several label insufficient scenarios including semi-supervised learning (SSL), unsupervised domain adaptation (UDA) and semi-supervised heterogeneous domain adaptation (SHDA). LRM also can be utilized as a plugin in existing models to cope with insufficient label scenarios. Moreover, parameter sensitivity and feature visualization also be analyzed with elaborate experiments. The paper is overall well written.\nAlthough, the calculation of the prediction means of unlabeled samples is simple, the idea of treating prediction means as an estimation of label encoding is interesting. Experimental results are attractive on several label insufficient scenarios. Fundamental proofs of theorems and implementation details in supplementary material also help with paper understanding for readers.\nI'm looking forward to open source codes."
            },
            "weaknesses": {
                "value": "However, there are some questions need to be clarified from authors. Please refer to the part of questions."
            },
            "questions": {
                "value": "1.\tIn this paper, the core assumption is that the label encodings should remain consistent for both labeled and unlabeled samples under label insufficient scenarios. How about the performance if this assumption does not hold ? In other words, if unlabeled samples have different classes or even class is unknown (All datasets of experiment have explicit classes in manuscript, such as CIFAR, Office and so on.) how we evaluate the LRM ?\n2.\tAlthough, authors perform two tasks on class-imbalanced setting in order to verify the effectiveness of the proposed LRM. This is no theoretical guarantee on class-imbalanced supervised learning. If it exceeds the scope of this work, do we need more experiments to support the conclusion ? Because, in the real world, class-imbalanced problem is pervasive.\n3.\tIn Figure 2(a), please give the detailed explanation why the accuracy of ERM is fluctuant while that of ERM+LRM is not. It is hard to understand."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5287/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698745770629,
        "cdate": 1698745770629,
        "tmdate": 1699636528921,
        "mdate": 1699636528921,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "GOQlIp0m6w",
        "forum": "KNzL1nglNB",
        "replyto": "KNzL1nglNB",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5287/Reviewer_2ZQ3"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5287/Reviewer_2ZQ3"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a Label-encoding Risk Minimization (LRM) for label-insufficient scenarios. The proposed LRM firstly estimates the label encodings through prediction means for unlabeled samples and then aligns them with their ground-truth label encodings. The authors theoretically analyze the relationship between LRM and ERM. The authors demonstrate the superiority of LRM under several label insufficient scenarios, including semi-supervised learning, unsupervised domain adaptation, and semi-supervised heterogeneous domain adaptation."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1.\tThe paper is well-written and easy to follow.\n2.\tThe paper proves that the underlying cause of neural collapse (NCC) is the use of one-hot label encoding, and proposes label-encoding risk minimization, which minimizes the discrepancy between estimated label encodings of unlabeled samples and their corresponding label encodings. The proposed method is reasonable with a theoretical guarantee.\n3.\tThe authors apply LRM on multiple label insufficient scenarios: semi-supervised learning, unsupervised domain adaptation and semi-supervised heterogeneous domain adaptation. The consistent performance gains validate the effectiveness and generality of LRM."
            },
            "weaknesses": {
                "value": "1.\tThe author primarily proves and experiments with methods in label insufficient scenarios. However, in real-world situations, many data exhibit a long-tail (class-imbalanced) distribution. Can this proposed method be applied to class-imbalanced supervised and semi-supervised scenarios?\n2.\tAs shown in Table1, the authors combine LRM with two semi-supervised methods: FlexMatch and DST. Can the proposed method be combined with other SSL methods, such as MixMatch [1] and ReMixMatch [2]?\n3.\tAs shown in Table2, the authors combine LRM with two UDA methods: CDAN and SDAT. Can the proposed method be combined with SOTA UDA methods [3]?\n\n[1] MixMatch: A Holistic Approach to Semi-Supervised Learning, NeurIPS 2019.\n[2] ReMixMatch: Semi-Supervised Learning with Distribution Alignment and Augmentation Anchoring, arxiv 2019.\n[3] Patch-Mix Transformer for Unsupervised Domain Adaptation: A Game Perspective, CVPR 2023."
            },
            "questions": {
                "value": "See weakness for details."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5287/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5287/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5287/Reviewer_2ZQ3"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5287/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699276746659,
        "cdate": 1699276746659,
        "tmdate": 1699636528816,
        "mdate": 1699636528816,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "UyiJAEDds5",
        "forum": "KNzL1nglNB",
        "replyto": "KNzL1nglNB",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5287/Reviewer_yg8U"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5287/Reviewer_yg8U"
        ],
        "content": {
            "summary": {
                "value": "The paper investigates scenarios with limited label information, such as semi-supervised learning or unsupervised domain adaptation for multiclass problems.\nIt proposes a new way to incorporate the unlabeled data into the risk formulation, by estimating and optimizing the mean prediction for each  class. The method is motivated by NCC, and is demonstrated to be applicable to several base methods, task types, and datasets."
            },
            "soundness": {
                "value": "1 poor"
            },
            "presentation": {
                "value": "1 poor"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "* The proposed modification gives substantial improvements in the experiments, and can be combined with several different base methods.\n* The proposal can be applied in several related, but distinct, settings with limited label information.\n* I think the single-sample DST+LRM results for Cifar10 (~68%) are quite impressive."
            },
            "weaknesses": {
                "value": "### Claims\nThe paper makes several claims that are wrong or (in my opinion) overstated:\n\n\n> We prove that the underlying cause of NCC roots in the use of label encoding, i.e., one-hot label encoding, which\nleads to the collapse of the features through back-propagation.\n\nI don't think this is true. On one hand, it requires the injectivity assumption made later in the paper. On the other, I believe that if you assume this, then there is no need for one-hot encodings, e.g., if you use squared error, and map each category to a distinct point in R^m, then optimizing the loss to zero requires the features to collapse for each category.\n\n---\n\n>  Since these label encodings serve as accurate supervision information\n\nThis doesn't seem to be true, at least not without additional qualifiers. From the appendix:\n\n> Furthermore, we observe that $w_c^u$ and $s^u_c$ in Eq. (7) may be incorrect at the beginning of the training iteration. \n> To prevent them from fitting into certain categories too early leading to unstable learning, we perform an additional softmax\n> transformation before calculating cross-entropy loss, which encourages them smoother. \n> The same strategy is also adopted in the following two tasks.\n\n---\n\nIn the intro,\n> One problem of EntMin is that the soft-labels assigned by the classifier could be mainly from dominant\n> categories with large numbers of samples, resulting in a decrease in prediction diversity (Cui et al., 2020) that the samples are prone to be\n> pushed towards the majority categories. One reason for that\n> lies in the absence of more appropriate guidance information for unlabeled samples. So we want to\n> ask “for unlabeled samples, is there more precise guidance information available?”\n\nTo me, this insinuates that the paper would look at imbalanced settings, as these seem to motivate this work here. In fact, though, this is deferred to future work:\n\n> As a future direction, we intend to investigate the relationship between the LRM and ERM, in the context of\n> class-imbalanced supervised learning.\n\n---\n\nTheorem 1:\n> In addition, Theorem 1 is loss-agnostic and solely relies on the mapping property of f (·)\n\nIt is *not* loss agnostic. In fact, the theorem itself states that it assumes L(x,y) =  0 => x = y, which is not true, e.g., for max-margin losses.\n\n> The linear classifier is an injective function, which thus satisfies Theorem 1.\n\nA linear classifier need not be injective. In fact, if C < d, it *cannot* be injective.\nRegarding softmax, if you use `f` as the softmax function, and `L` as cross-entropy, then I would no longer call `h` the \"features\" -- these are now the logits. And I don't think applying L2 normalization or ReLU nonlinearities to the logits is a common practice.\n\n---\n\nsec. 4.2\n> These label encodings serve as reliable supervised information for learning from labeled samples.\n> Moreover, note that the label encodings remain consistent for both labeled and unlabeled samples\n> under label insufficient scenarios studied in this paper. Consequently, it is reasonable to apply\n> label encodings to guide the learning process of unlabeled samples. \n\nthat is an unsubstantiated claim (at this point in the paper at least)\n\n> Specifically, we first calculate the weighted average of prediction probabilities for unlabeled samples in each category, i.e., prediction mean.\n\nThe way this is written is wrong, though the actual calculations presented in the paper seem to be sensible. You cannot average predictions for unlabeled samples *of a category*, precisely because the categories are unknown. So the averaging is actually over the predicted distribution of categories as provided by some classifier.\n\n### Theorem 3:\nTheorem 3 seems to be the wrong way around, in the sense that normally, you'd like the original loss/risk to be upper-bounded by your proposed surrogate, so that optimizing the latter gives some guarantees on the former.\n\nOn a positive note, though, Fig. 2 shows that in practice, the two values can be quite close, so this might be more a theoretical concern.\n\n### Readability:\nThe paper would benefit from grammar improvements. Mostly, these do not impact readability too much. Below are two examples where I don't think the overall sentence structure works.  \n\n\npage  2:\n> As the ERM heavily relies on the guidance of the label information and fails to fully utilize the potential of unlabeled\nsamples, leading to suboptimal performance in label insufficient scenarios.\n\npage 9: \n> Accordingly, under the setting where only labeled samples from both domains are\n> available for training, which can be regarded as a class-balanced supervised learning task."
            },
            "questions": {
                "value": "The label-encoding risk is a *global* quantity, in the sense that is needs to know all training points to be calculated, and does not decompose into a sum over individual points. How does that integrate into mini-batch training?\n\n--- \n\n> [...] while in contrast, according to properties (4) and (5) in Theorem 2, LRM minimizes the label-encoding risk, which is verified in Appendix D.4.\n\nI don't understand this argument. Doesn't the LRM minimize the Label-encoding risk by construction? What does this have to do with (4) and (5)?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5287/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5287/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5287/Reviewer_yg8U"
                ]
            }
        },
        "number": 5,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5287/-/Official_Review"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699716283162,
        "cdate": 1699716283162,
        "tmdate": 1699716283162,
        "mdate": 1699716283162,
        "license": "CC BY 4.0",
        "version": 2
    }
]