[
    {
        "id": "upfA9yN44Q",
        "forum": "KTq2XSBNsa",
        "replyto": "KTq2XSBNsa",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission449/Reviewer_d6Z2"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission449/Reviewer_d6Z2"
        ],
        "content": {
            "summary": {
                "value": "This work proposes MOESART, a k-sparse routing strategy for SMOE training. Instead of directly taking experts from the router's output, MOESART relies on sampling to construct a sparse and unbiased estimator of the router's softmax distribution. In the experiments, MOESART consistently outperforms several routing strategies on a wide range of tasks, ranging from recommender systems, vision, to NLP."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- This work addressing the challenge of designing a good k-approximation of the softmax, an important research problem that can impact many research topics. The proposed method is generally sound, and achieved encouraging results on a wide range of tasks."
            },
            "weaknesses": {
                "value": "## Major concern - Lack comparison with differentiable Top-k strategies\n\n- Much of the paper compare MOESART against the standard (nondifferentiable) Top-k strategies. To give a better picture of this work's contribution, it is important to also compare MOESART against differentiable top-k strategies in both technical contributions, performances, and time complexity. The authors already mentioned the relevant baselines in Hazimeh et al., 2021; Ibrahim et al., 2023;  and Sander et al., 2023 but none are further discussed.\n\nFurthermore, the theoretical guarantee of MOESART is also rather weak. There are other alternatives such as REINFORCE, that is unbiased but are not widely used in this setting because of its high variance.\n\n## Major concern - Contribution of the Trimmed Lasso regularization\n\n- How much does the Trimmed Lasso regularization contribute to the performance gains of MOESART? Does this regularization also benefit existing baselines?\n\n ## Minor concern - Experiment details\n\n- In Table 1, the naive Top-k baseline seems to be the second-best method on most metrics. This result quite contradicts the literature where other advanced routing algorithms should outperform Top-K. Further investigations are needed.\n- The NLP experiment in Table 2 should include X-MoE, which was originally proposed for this application.\n\n## Minor concern - Presentation\n\n- The proposed method is presented quite poorly in Section 3. The Trimmed Lasso regularization is a general strategy but is presented in the middle of the method discussion.\n- In Section 3, it would be better to first detail the complete MOESART algorithm, then discuss its property (MOESART is a good k-sparse approximation) and the regularization used during implementation.\n\n## Other suggestions\n- It would be useful to visualize the logits and softmax distribution before and after adjustment."
            },
            "questions": {
                "value": "- What are the contributions of MOESART compared to existing differentiable Top-k in terms of technical contributions, performances, and time complexity.\n- How much did the Trimmed Lasso regularization contribute to the performance gains?\n- Please provide an explanation for the inconsistency results in Table 1.\n- If possible, please include X-MoE in Table 2."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission449/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission449/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission449/Reviewer_d6Z2"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission449/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698342875642,
        "cdate": 1698342875642,
        "tmdate": 1699635971377,
        "mdate": 1699635971377,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "tAGtqJgNxl",
        "forum": "KTq2XSBNsa",
        "replyto": "KTq2XSBNsa",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission449/Reviewer_7cYf"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission449/Reviewer_7cYf"
        ],
        "content": {
            "summary": {
                "value": "MOESART introduces an MoE router sampling and expert weighting strategy which they show empirically, learns a better sparse approximation of the classical (dense) MoE models than Top-k style routers while still being sparse."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The proposed method outperforms other methods while still being sparse."
            },
            "weaknesses": {
                "value": "- The paper uses top-k != 1 for all their experiments and doesn't show results for k=1.\n- The paper shows results on relatively small datasets / training setups."
            },
            "questions": {
                "value": "Is the paper saying it introduces \"weighting expert outputs by output of router (aka sampling weight)\"? I've seen this done in multiple MoE implementations."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission449/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698679779254,
        "cdate": 1698679779254,
        "tmdate": 1699635971310,
        "mdate": 1699635971310,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "L8Swx04TQW",
        "forum": "KTq2XSBNsa",
        "replyto": "KTq2XSBNsa",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission449/Reviewer_Fbe3"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission449/Reviewer_Fbe3"
        ],
        "content": {
            "summary": {
                "value": "The author studied the sampling of MoE models. Specifically, the author proposes a sampling-based routing mechanism, which samples the expert index from a distribution originating from the softmax distribution. The author conducts empirical study on various datasets, and the results support the effectiveness of the proposed method."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The studied problem (expert router training for MoE models) is important and may have a big impact. \n2. The proposed method demonstrates consistent performance gain on various benchmarks over (Top-k, V-MoE, Expert Choice Router, and X-MoE)."
            },
            "weaknesses": {
                "value": "My major concern with this study is that the rationale of the proposed method is not clear. The proposed method is complicated and is only assessed with empirical comparisons. Ablation studies play a crucial role in assessing the effectiveness of the proposed method but are only included in the ablation study briefly. Particularly, some questions that I have include:\n1. why it is desired to use a sampling-based expert index assignment? Figure 2 suggests that MOESART has a smaller gap between training and inference. However, it is unclear to me whether such a smaller gap is a result of the introduced regularization. \n2. why it is desired to update the scaling factor as proposed? As mentioned by the author, the gradient of the expert sampling is typically ignored by MoE training (but can be estimated with the policy gradient method), and the router training is conducted with only the scaling factor. Intuitively, modifying the scaling factor in a way could lead to better gradient estimation and thus better MoE training. However, it is unclear how this is achieved by the proposed method. \n\nAnother major concern is the choice of baseline. Specifically, as in the Switch Transformer paper (in the appendix), the author suggests that softmax-based expert index sampling does not perform well. Instead, the Switch Transformer paper proposes to use jitter noise. Compared to the V-MoE method, the jitter noise proposed in Switch Transformer samples multiplicative random noise from a uniform distribution, which leads to sparse expert sampling during training. As the focus of this study is also sparse and the impact of the Switch Transformer study, I believe it is necessary to include the Switch Transformer / jitter noise as a baseline."
            },
            "questions": {
                "value": "In the current draft, the proposed method is positioned as a sampling method. But from my understanding, the sampling process of the expert index remains unchanged from the softmax sampling. Instead, the proposed method focuses on introducing additional regularization and changing expert output scaling. I would suggest the author change the wording like \"carefully designed sampling\"."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission449/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698813039167,
        "cdate": 1698813039167,
        "tmdate": 1699635971234,
        "mdate": 1699635971234,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "oNvPOKVaTN",
        "forum": "KTq2XSBNsa",
        "replyto": "KTq2XSBNsa",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission449/Reviewer_diTt"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission449/Reviewer_diTt"
        ],
        "content": {
            "summary": {
                "value": "This work introduces MOESTART, a sampling-based routing method for mixture of experts models. The authors address the performance issues faced by existing top-k gate variants due to the discontinuous nature of the routing problem. To maintain k-sparsity during both training and inference, the authors propose a method that incorporates sampling to emulate the results of top-k softmax gates. The proposed method demonstrates significant improvements across diverse domains, including recommender systems, vision, and NLP."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. The motivation behind this work is reasonable, and the proposed solution is demonstrated to be unbiased, both theoretically and practically.\n2. The writing and organization of the paper are of good quality, resulting in an easy-to-read presentation.\n3. The authors have conducted comprehensive experiments to thoroughly validate the effectiveness of MOESTART, ensuring the reliability of the proposed method."
            },
            "weaknesses": {
                "value": "1. It should be noted that all experiments in this work were conducted on small-sized datasets, whereas existing Mixture of Experts (MoE) structures typically focus on large-scale training and inference scenarios. This difference in dataset size should be taken into consideration when evaluating the applicability of the proposed method.\n2. One limitation of the method is that it only supports k>=2, which may restrict its practical value. It would be beneficial for future improvements to extend the method's applicability to lower values of k as well."
            },
            "questions": {
                "value": "1. The motivation behind MOESTART is to achieve results that closely resemble those of the top-k softmax gate. However, it is intriguing to observe that MOESTART consistently outperforms the softmax gate in all the conducted experiments. The authors should provide additional clarification or insights as to why MOESTART exhibits superior performance compared to the traditional softmax gate, despite its primary goal of approximation."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission449/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission449/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission449/Reviewer_diTt"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission449/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698837053042,
        "cdate": 1698837053042,
        "tmdate": 1699635971143,
        "mdate": 1699635971143,
        "license": "CC BY 4.0",
        "version": 2
    }
]