[
    {
        "id": "WhK69CAB0P",
        "forum": "KWO8LSUC5W",
        "replyto": "KWO8LSUC5W",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission133/Reviewer_t9PA"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission133/Reviewer_t9PA"
        ],
        "content": {
            "summary": {
                "value": "The paper aims to improve the computational complexity and scalability of differentiable structure learning method. A smooth acyclicity formulation based on priority vector and tempered sigmoid are presented. With this formulation, the final approach solves an unconstrained optimization problem, requiring quadratic number of operations per optimization step. The paper presents empirical analysis to study the performance and execution time."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "-   The goal of improving the computational complexity and scalability of differentiable structure learning method is well motivated.\n-   The smooth acyclicity formulation and optimization scheme are sound.\n-   The execution time and scalability are improved."
            },
            "weaknesses": {
                "value": "The novelty of the paper may be limited because:\n- Although the paper claimed several times that it provides \"the first unconstrained optimization approach that learns DAG from observational data\", several existing works have done so, such as https://arxiv.org/abs/2006.10201 and DP-DAG (https://arxiv.org/abs/2203.08509). DP-DAG has been discussed in Section 2, but it may not be clear why the paper still claims being \"first\". Also, it would be great to compare these methods in the experiments.\n- A key motivation of the work is to avoid computing the acyclicity constraint with cubic cost, which has been achieved by DP-DAG.\n\nFurthermore, the overall idea, to my knowledge, share similarities NOCURL and is not entirely new, which has  been well acknowledged and discussed in Section 4.2 and Appendix D.2.\n\nThere is quite some performance drop for the proposed method in many cases (especially for large $d$), although the improvement in running time is notable:\n- It may not be clear how to interpret AUC as compared with NHD. For instance, for the results of 500 nodes in Appendix E.3, the NHD of COSMO and DAGMA are 3.57 and 1.73 respectively, indicating that COSMO performs much worse than DAGMA (probably due to lots of false discoveries). However, the AUC of COSMO is slightly better than DAGMA.\n- Therefore, I would suggest reporting NHD in the main paper that might be more commonly used in structure learning (e.g. see DAGMA and NOTEARS papers).\n- It seems that there is much more performance drop for nonlinear case. Is there a reason for not including NOTEARS-MLP for 40 and 100 nodes?"
            },
            "questions": {
                "value": "For some questions, see weaknesses section.\n\nOther questions:\n- Similar to NOTEARS and DAGMA, one would expect an $L_1$ regularization $\\|W\\|_1=\\|H\\circ S(p)\\|_1$. Instead, Eq. (12) involves three different regularizations $\\|H\\|_1$, $\\|H\\|_2$, and $\\|p\\|_2$, two of which are $L_2$ regularizations.  This seems counter-intuitive and involves many hyperparameters. Can the authors explain why $\\|W\\|_1=\\|H\\circ S(p)\\|_1$ would not work?\n- In practice, since the temperature cannot be annealed to exactly 0, will the solution be exactly an acyclic graph before thresholding?\n- Does the characterization in Eq. (7) cover the entire space of weighted DAGs $W$? \n- It seems that the references provided for Section 2 \"NOBEARS\" and Section 1 \"does not sacrifice theoretical guarantees of asymptotic convergence to acyclic solution ...\" are not correct?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission133/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission133/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission133/Reviewer_t9PA"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission133/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698693582362,
        "cdate": 1698693582362,
        "tmdate": 1700691333836,
        "mdate": 1700691333836,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "Ryy7V36UWj",
        "forum": "KWO8LSUC5W",
        "replyto": "KWO8LSUC5W",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission133/Reviewer_LvdG"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission133/Reviewer_LvdG"
        ],
        "content": {
            "summary": {
                "value": "The paper proposes a new continuous relaxation of the acyclicity constraint for learning DAGs that is based on learning a priority score per node (that implies a partial ordering of the nodes) and relaxing its corresponding binary directed adjacency matrix to obtain non-zero gradients.\nSimilar to NoCurl (Yu et al. 2021), a node is an ancestor of another iff its priority score is smaller than the priority score of the other node minus a margin $\\epsilon$ (that allows to represent also partial orderings). This Heaviside function is then relaxed by means of a tempered sigmoid, allowing for optimization by gradient descent."
            },
            "soundness": {
                "value": "1 poor"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. The paper tackles an important problem of interest to the ICLR community by proposing a novel method for learning DAGs from observational data.\n\n2. The overall complexity of the optimization is quadratic in the number of nodes (which is one of the lowest among DAG learning methods) allowing for scaling to graphs of $> 10^4$ nodes in the experimental analysis. The empirical analysis shows that this lower complexity translates in practice to competitive training times.\n\n3. The paper is overall well presented. In particular, the proofs of appendix A and B are sound and easy to follow."
            },
            "weaknesses": {
                "value": "In order of gravity:\n\n1. (major) The paper neglects the order-based literature for DAG learning which is closely related to this work. Only VP-DAG (Charpentier et al. 2021) is mentioned, but a considerable line of research exists, starting from the seminal works [1,2], to the most recent ones [e.g. 3,4] based on permutation matrices, and in particular [5] that also makes use of a priority vector. The paper does not highlight the pros and cons wrt this literature nor compare with any of the order-based methods empirically.\n\n2. (major) Experiments are carried out on synthetic data with weight settings that are known to have trivial solutions [Reisach et al. 2021]. Hence they are insufficient to validate the method. The experimental analysis should be carried out on more challenging settings (e.g., smaller edge weights) where the trivial baseline sortnregress [Reisach et al. 2021] is not state-of-the-art.\n\n3. By using the tempered sigmoid at training, the adjacency matrix is never acyclic. Acyclicity is only obtained in the limit of the temperature tending to 0, that however turns the gradients to 0. This implies that careful temperature scheduling is required in order to converge to a good solution.\n\n4. The method relies on edge thresholding at test time to remove spurious relationships. However a method for choosing such threshold is not presented.\n\n[1] Nir Friedman and Daphne Koller. Being bayesian about network structure. A bayesian approach to structure discovery in bayesian networks. Machine learning, 50, 2003\n\n[2] Marc Teyssier and Daphne Koller. Ordering-based search: A simple and effective algorithm for learning bayesian networks. In UAI, pp. 548–549. AUAI Press, 2005. \n\n[3] Chris Cundy, Aditya Grover, and Stefano Ermon. Bcd nets: Scalable variational approaches for bayesian causal discovery. Advances in Neural Information Processing Systems, 34, 2021.\n\n[4] Ming Gao, Yi Ding, and Bryon Aragam. A polynomial-time algorithm for learning nonparametric causal graphs. In Advances in Neural Information Processing Systems, 2020\n\n[5] Zantedeschi, V., Franceschi, L., Kaddour, J., Kusner, M. J., & Niculae, V. (2023). DAG Learning on the Permutahedron. In ICLR, 2023"
            },
            "questions": {
                "value": "(minor) In page 15, the wrong theorem is reported."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission133/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698693892987,
        "cdate": 1698693892987,
        "tmdate": 1699635938696,
        "mdate": 1699635938696,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "CMGl2zmjbl",
        "forum": "KWO8LSUC5W",
        "replyto": "KWO8LSUC5W",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission133/Reviewer_tdcC"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission133/Reviewer_tdcC"
        ],
        "content": {
            "summary": {
                "value": "The paper studies the problem of DAG structure learning from a continuous score-based perspective. In order to optimize a given score over the space of DAGs, the authors propose to decompose the parameterization by a real matrix $H$ and an orientation matrix induced by a priority vector $p$, a threshold $\\epsilon$ and a temperature $t$. Then, it is shown that asymptotically as $t\\to 0$ the orientation matrix corresponds to a adjacency matrix of a DAG. The authors optimize $H$ and $p$ jointly and observe speed ups over SOTA methods."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The paper is overall clear and makes a fair contribution to structure learning, which is a significant problem. \nThe paper is also of good quality, the authors presented a comprehensive set of experiments, showcasing the competitive performance of their method."
            },
            "weaknesses": {
                "value": "The main weakness of the paper is its novelty. The re-parametrization itself is not new, that is, the idea of decomposing a weighted adjacency matrix by a real matrix and orientation matrix. Comparing to NOCurl, the change is basically from ReLU to Sigmoid. However, I should give credits to the authors for making this arguably small change work well in practice."
            },
            "questions": {
                "value": "* Consider a $p$ vector with all entries being different. Then, for some arbitrarily small $\\epsilon$, it seems to me that the orientation matrix is the adjacency matrix of a fully-connected DAG. In some sense, $\\epsilon$ controls the sparsity level of the output, however, this is problematic because $\\epsilon$ is not something being optimized but instead fixed a-priori. Please correct me if I am wrong.\n\n* In the paragraph about \"Direct Matrix Regularization\". For the values found for $H$ and $p$ after optimizing, why not simply threshold the smooth orientation matrix by a small amount so that the \"small entries\" are set to zero and are not affected by the possibly large values of $H$. Given that linear models with equal variances are identifiable from the score function, L2 regularization of the weights should not be necessary and I wonder if doing this affects the performance of COSMO.\n\n* I think more details about the optimization procedure should go to the main text. In particular, the scheduling for $t$ seems very important  and it was not clear how it was set in the main text.\n\n* Related to my point above, I might have missed this since I only briefly looked at the appendix. But the NOTEARS $h$ is not a good proxy for acyclicity as discussed by Bello et al. (2022). In fact, given that your method does not rely on $h$, why not simply threshold the smooth orientation matrix by a very small amount and check in $O(|V|+|E|)$ that the adjacency corresponds to a DAG?\n\n* In the experiments, the runtime for DAGMA looks different to what was reported by Bello et al. (2022). These might be because of the available implementation of DAGMA is using different hyperparameters for the optimization, but I am curious what values were used in the comparison for the main text.\n\n* I should also note a related work on learning DAGs by Deng et al. (2023) \"Optimizing NOTEARS objectives via topological swaps\", which obtains better performances in structure estimation although somewhat slower."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission133/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698938730811,
        "cdate": 1698938730811,
        "tmdate": 1699635938634,
        "mdate": 1699635938634,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "ZfzDuBJxCn",
        "forum": "KWO8LSUC5W",
        "replyto": "KWO8LSUC5W",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission133/Reviewer_Ar2D"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission133/Reviewer_Ar2D"
        ],
        "content": {
            "summary": {
                "value": "the paper proposes a constrain-free DAG learning formulation, based on existing notears and nocurl framework. The main innovation is to use a smoothed matrix to indicate the topological order, which enables the joint optimization of the smoothed topological matrix and a weighted adjacency matrix. Results show improved accuracy, esp when the number of dimension is high."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- the paper proposes an improved DAG learning approach without constraint, which is novel \n\n- empirical performance on the large number of variables is solid"
            },
            "weaknesses": {
                "value": "- Experiment: When the number of variable is small or medium, the accuracy seems to be worse than some existing approaches. In addition, some experiment results are missing and some elaboration is needed.\n\n- Presentation could be improved to be more scientifically sound.  \n\n\nDetails and questions:\n\n- Figure 3: since you showed the results with 1e4 nodes, what is the accuracy performance of these methods with large d?\n- page 13 in appendix, last line: how did the denominator become $(1 + e^{-\\epsilon})^n$ in the last step?\n- authors seem to over claim the contributions and often make some imprecise statements. The formulation is based on the existing nocurl formulation, with $W = H \\cdot f(p)$. Nocurl also learn a topological order with p along with the typical weighted adjacency matrix H. The difference is that nocurl learns topology from a preliminary solution, while the proposed COSMO optimizes them jointly with a smoothed formulation. This in itself is a worthy contribution, no need to make exaggeration statements such as claiming \"the first unconstrained optimization approach\" (which would be nocurl-u by authors' definition) and nocurl is \"a slightly similar model\". Authors should discuss the differences. \n- learning topology seems to be a hard task by itself. Gradient-based approach may not do too well on it, which explains the poorer results when the number of variable is smaller. What are authors observation on the change in topology over time (by the orientation matrix)? Does it have significant change in the beginning and then barely change toward the end of optimization steps? How does the temperature annealing change the topology over time?"
            },
            "questions": {
                "value": "see above"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission133/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission133/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission133/Reviewer_Ar2D"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission133/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698990226020,
        "cdate": 1698990226020,
        "tmdate": 1699635938569,
        "mdate": 1699635938569,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "9S29TPA68g",
        "forum": "KWO8LSUC5W",
        "replyto": "KWO8LSUC5W",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission133/Reviewer_Rsrs"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission133/Reviewer_Rsrs"
        ],
        "content": {
            "summary": {
                "value": "This paper introduces a constraint-free continuous optimization scheme (COSMO) to the structure learning problem that focuses on acyclic graph reconstruction. COSMO employs a differentiable relaxation of the acyclic orientation matrix, allowing it to learn a directed acyclic graph without explicitly enforcing acyclicity constraints. The key contributions include the introduction of a smooth orientation matrix, the development of COSMO, which is significantly faster than existing constrained methods, and a thorough experimental comparison highlighting COSMO's superior performance in terms of structure recovery and computational efficiency. The paper provides valuable insights and tools for more efficient and unconstrained acyclic structure learning."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- A primary strength of the method is its provision of an unconstrained continuous optimization approach for acyclic structure learning.\n- The method introduces a novel, differentiable approximation known as the \"smooth orientation matrix,\" which depends on a temperature parameter.\n-  The method outperforms certain constrained approaches in terms of speed due to the quadratic number of operations needed to reconstruct the DAG."
            },
            "weaknesses": {
                "value": "-  In Figure 1, are you learning a directed graph or a partially directed graph with undirected edges to be identified later?\nPlease formally define the priority vector in the notation section.\n- While Figure 1 appears to be an illustration of how COSMO works, it's not very clearly explained. It would be helpful to provide a proof sketch or illustration with an example in the introduction to briefly explain how your algorithm works (given this example) and why it's an unconstrained optimization method.\n- Can you provide information on the computational time and sample complexity of COSMO?\n- How do you guarantee the identifiability of the recovered graph, or do the results lead to some equivalence class?\n- In the related work section, consider covering some classic DAG structure learning methods.\n- The method relies on the temperature parameter for the sigmoid function. While annealing the temperature is shown to be effective, selecting an appropriate temperature schedule could be a challenging task, and the method's performance may be sensitive to the choice of temperature.\n- The effectiveness of this approach might depend on the initial conditions. Finding suitable initializations for the priority vector and other parameters could impact convergence and the quality of the learned DAG.\n- Figure 4 does not seem very necessary, and it's not very clear. Consider moving Figure 4 to the appendix and using the space to discuss the sensitivity analysis of your method's parameter choices."
            },
            "questions": {
                "value": "See above \"weeknesses\" section."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission133/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission133/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission133/Reviewer_Rsrs"
                ]
            }
        },
        "number": 5,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission133/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699216234477,
        "cdate": 1699216234477,
        "tmdate": 1699635938486,
        "mdate": 1699635938486,
        "license": "CC BY 4.0",
        "version": 2
    }
]