[
    {
        "id": "HoJOc7c9X2",
        "forum": "kXNJ48Hvw1",
        "replyto": "kXNJ48Hvw1",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2423/Reviewer_mREg"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2423/Reviewer_mREg"
        ],
        "content": {
            "summary": {
                "value": "The manuscript introduces a stacked RBM parallel tempering training, in which sampling is improved by swapping configurations of hidden and visible units in the vertical stack."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "The paper introduces an interesting idea, that allows to sample more efficiently from RBMs, without the need to specify effective temperatures, as in Parallel Tempering"
            },
            "weaknesses": {
                "value": "The numerical experiments do not allow to understand the improvement over more standard Parallel Tempering"
            },
            "questions": {
                "value": "Can the authors show the autocorrelation times of some observable (for example, on the Ising model, the magnetization at the critical point) ? It is hard to understand, from the proposed plots, whether the scheme introduced is faster than standard PT \n\nThe simplified theoretical analysis of mixing and swapping times is very interesting, but as far as I can see there is no direct comparison to simulation data. It would be desirable to have such a comparison, in order to understand whether the qualitative aspects of this analysis carry on to the more complex algorithm"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2423/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698739440242,
        "cdate": 1698739440242,
        "tmdate": 1699636177833,
        "mdate": 1699636177833,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "pYLRk3m8HR",
        "forum": "kXNJ48Hvw1",
        "replyto": "kXNJ48Hvw1",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2423/Reviewer_fKHh"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2423/Reviewer_fKHh"
        ],
        "content": {
            "summary": {
                "value": "This paper introduces a method called Stacked Tempering (ST) that applies the ideas of deep tempering to restricted Boltzmann machines (RBM). The authors propose to learn stacks of nested RBMs, where the representations of one RBM are used as \"data\" for the next one in the stack. By exchanging configurations between RBMs, the ST method allows for fast transitions between different modes of the data distribution. The paper provides analytical calculations of mixing times and demonstrates the efficiency of the ST method compared to standard Monte Carlo methods on several datasets."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- This paper introduces a new approach called Stacked Tempering (ST) for sampling from Restricted Boltzmann Machines (RBMs).\n  - ST learns nested RBM stacks by using the representation of one RBM as the \"data\" for the next RBM.\n- Efficiency of the ST method is demonstrated through experiments on multiple datasets including MNIST, in-silico Lattice Proteins, and 2D-Ising model.\n- This paper provides the first theoretical analysis supporting the use of deep representations for improving mixing in RBMs, inspired by previous research on deep tempering.\n  - Obtained analytical results are interesting."
            },
            "weaknesses": {
                "value": "- Learning nested RBMs seems costly compared to simple parallel tempering approach where additional models are not required.\n- This method is only applicable to RBMs."
            },
            "questions": {
                "value": "- Is it possible to extend this method for sampling from other energy-based models (e.g., deep Boltzmann machines)?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission2423/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2423/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2423/Reviewer_fKHh"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2423/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699086484140,
        "cdate": 1699086484140,
        "tmdate": 1700791705412,
        "mdate": 1700791705412,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "dpXiZ3yoGX",
        "forum": "kXNJ48Hvw1",
        "replyto": "kXNJ48Hvw1",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2423/Reviewer_4ET5"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2423/Reviewer_4ET5"
        ],
        "content": {
            "summary": {
                "value": "The paper proposes a new sampling scheme for RBMs that utilizes a hierarchy of RBMs of decreasing latent and visible dimensions to encourage learning a smoother version of the data distribution that captures more global aspects of the distribution in a manner akin to temperature annealing in parallel tempering. Their training approach involves sampling the latent variables at a given layer using alternating (between the latent and visible variables) Gibbs sampling (AGS) and then using the latent variable samples as training data for the next layer up in the hierarchy. Sampling involves using AGS to generate latent variables in a layer and then swapping the latent variables of one layer with the visible variables of the next one up using an acceptance probability. Their experiments on MNIST, a protein folding problem and the 2-D Ising model demonstrate how their approach can sample modes much quicker than AGS and parallel tempering. They also give a theoretical analysis in the overparameterized regime showing how different settings of the hyperparameters (regularization weight and ratio of hidden-to-visible variables) induces different representational regimes of the model. They also perform an analysis of the mixing time of their scheme indicating how it matches empirical data"
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- The main strengths of the paper are the results which indicate their approach's superior sampling performance compared to other reasonable baselines of parallel tempering and AGS. \n- The explanation of their approach is clear to understand and is given succinctly.\n- The theoretical analysis gives good insight and interpretation of the results of their approach as well as the consequences of different settings of the hyperparameters. In addition, the fact that the relations established for the mixing times (as in Figure 5) match the empirical results adds confidence in the correctness of their analysis"
            },
            "weaknesses": {
                "value": "- As their approach is intended to speed up sampling of RBMs a figure/table demonstrating how the real world sampling time is approved compared to the parallel tempering and AGS baselines would give the reader a better sense of how this method fares practically.\n- Adding figures similar to Fig 3(d-h) for the Ising model results in the main text would give the reader a better understanding of the results on this problem\n- A conceptual comparison to deep Boltzmann machines would be a great addition as it would make clear how their approach differs from sampling schemes for deep Boltzmann machines."
            },
            "questions": {
                "value": "- No questions that need clarifying"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission2423/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2423/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2423/Reviewer_4ET5"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2423/-/Official_Review"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1700521677722,
        "cdate": 1700521677722,
        "tmdate": 1700521677722,
        "mdate": 1700521677722,
        "license": "CC BY 4.0",
        "version": 2
    }
]