[
    {
        "id": "74WlUIWVYg",
        "forum": "ledQ1BCrwc",
        "replyto": "ledQ1BCrwc",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5919/Reviewer_4wGq"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5919/Reviewer_4wGq"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a diffusion-based graph generative model which aims to learn a distribution of a *large, attributed* graph from a single sample. This differs from past work in that other diffusion-based graph generative models either learn (1) a distribution of a small, attributed  graph from many samples (such as molecules) or (2) a distribution of a large unattributed graph from a single sample. The authors argue that learning a large graph from a single sample is plausible because the nodes are statistically exchangable, thus the joint distribution of nodes can be effectively learned in this setting (logic which also underlies classical graph statistical models such as the SBM)\n\nThe authors propose GraphMaker, a denoising model learned from a sequence of data corruptions that are applied to the adjacency matrix and attribute matrix. GraphMaker-Sync denoises the adjacencies and attributes simultaneously, while GraphMaker-Async denoises the adjacencies after the attributes have been denoised.\n\nThe authors propose three evaluation aspects for their approach and competitors:\n\n1) Graph property: how well do graph/attribute measures computed on the generated graph match the same measures on the source data\n\n2) Discriminative: how well does a GNN trained on the generated graph perform on the source data\n\n3) Benchmarking: how closely does the *rank* of GNN models benchmarked on the generated graph compare to the same ranks on the source data."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The main strength of this paper is that there are few graph generative models that can learn attributed-graph distributions in the large-graph setting. The only existing one (that I know of, which the authors cite) is Yoon et al. 2023 and appears to not actually generate the whole graph, but rather only batch-level training samples of rooted trees on which GNNs can be trained effectively. The fact that GraphMaker can generate a real graph sample with attributes at the same scale as the input data makes it a valuable contribution to the community."
            },
            "weaknesses": {
                "value": "The main weakness of the paper is that the empirical results show that the proposed method only marginally outperforms the SBM in the evaluation aspects (graph property, discriminative, benchmarking). While the GraphMaker graphs seem to match graph statistics slightly better (in aggregate), and also better align ranks in benchmarking, the discriminative aspect (Table 2) shows that GNN models trained on synthetic graphs from GraphMaker vs those from SBM do about the same when trained on the source data.\n\nThe fact that SBM is a powerful baseline is interesting, and could be due to a number of factors:\n\n(1) the graphs used in the empirical study are too homophilous, and thus the label-conditioning aspect of GraphMaker could essentially be copying what the SBM is already doing.\n\n(2) GraphMaker's noise injection is uniform over all edges / attribute dimensions: this could be too simple to go beyond the i.i.d. edge generation of SBM.\n\nA related weakness is that the authors did not benchmark against the EDGE graph diffusion model (Chen et al. 2023), which would be an interesting baseline alongside the SBM, which similarly does not generate the attributes.\n\nI elaborate on the above in my questions to the authors."
            },
            "questions": {
                "value": "Q1: Did you consider benchmarking on datasets that have less edge/attribute-level homophily? We should expect the performance of SBM to go down in this case, but potentially not for GraphMaker.\n\nQ2: Why not include EDGE + attribute diffusion as a baseline, as you did for SBM and other graph-only models? I think the relative contribution of this work is hard to assess without this comparison.\n\nQ3: From the description in Section 3.5, I cannot understand what GraphMaker-E is doing, and how it differs from GraphMaker-Async. Can you elaborate?\n\nI am willing to raise my score if the authors can provide more info along these lines."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5919/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698190785152,
        "cdate": 1698190785152,
        "tmdate": 1699636629431,
        "mdate": 1699636629431,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "vt2A8ZAJk5",
        "forum": "ledQ1BCrwc",
        "replyto": "ledQ1BCrwc",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5919/Reviewer_muBL"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5919/Reviewer_muBL"
        ],
        "content": {
            "summary": {
                "value": "This paper presents GraphMaker, a diffusion model for generating large attributed graphs. They presented three types of diffusion models that couple or decouple graph structure and node attribute generation, and that utilizes label conditions. Also, they present a new evaluation pipeline for graph generation."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. A neat figure to describe the method GraphMaker-Sync and GraphMaker-Async, which helps the easier understanding of the method.\n2. Presented a method for the generation of large attributed graphs given node labels."
            },
            "weaknesses": {
                "value": "1. The task that predicts the node labels and edge existence given the node attributes is more like a link prediction task, not a graph generation task. Is there any specific reason or reference that defines the task as a graph generation task?\n2. What is the novelty of the proposed model? Diffusion-based graph generative models such as GDSS can also deal with attributed graphs. Also, for scalability, simple usage of MPNN for the encoder seems not to be a critical novelty point.\n3. Hard to understand Section 3.4. What does it mean to learn from a single graph? Is it right that the model trains from only one graph and generates many graphs that fit with the training graph? When do we need such circumstances in the real world practically?\n4. Lack of performance comparison for recent diffusion-based graph generative models such as GDSS, DiGress, and GraphARM. Need more recent baselines for the evaluation part."
            },
            "questions": {
                "value": "1. What about the cases with only one type of node attribute like molecular graphs? Do we treat node attributes and node labels to be the same or GraphMaker cannot deal with it?\n2. What is the time complexity of GraphMaker? As the model is diffusion-based, it seems that the inference and training time may be long. How does GraphMaker benefit from large attributed graph generation? Hard to understand what a minibatch strategy is which is introduced in the introduction part."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5919/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5919/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5919/Reviewer_muBL"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5919/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698812263262,
        "cdate": 1698812263262,
        "tmdate": 1699636629322,
        "mdate": 1699636629322,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "A5oBAQnJCC",
        "forum": "ledQ1BCrwc",
        "replyto": "ledQ1BCrwc",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5919/Reviewer_xCEF"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5919/Reviewer_xCEF"
        ],
        "content": {
            "summary": {
                "value": "This paper presents GraphMaker, a new diffusion model proposed for creating large attributed graphs. Large-scale graphs with node attributes are crucial in real-world contexts like social and financial networks. Generating synthetic graphs that mirror real ones is essential in graph machine learning, especially when original data is confidential. While traditional graph generation models have limitations, recent diffusion models excel in specific areas but face challenges with large attributed graphs. It explores diffusion models focusing on the relationship between graph structure and node attributes and introduces techniques for scalability. The paper also offers a different evaluation method using models trained on synthetic data. Experiments demonstrate GraphMaker's proficiency in producing realistic and diverse large-attributed graphs for subsequent applications."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- S1. Generation of large attributed graph presents significant technical challenges that are worth investigation.\n\n- S2. Writing is generally clear, although there are some clarity or motivational issues (see W1 and W2). But overall, it is easy to read and follow.\n\n- S3. I like the evaluation methodology using ML models, which can be more expressive than traditional statistics, yet is general without requiring domain-specific knowledge."
            },
            "weaknesses": {
                "value": "- W1. Some technical details are not clearly introduced, especially in 3.5. \n\nIt was only mentioned that \"which generates node attributes\nthrough an external approach conditioned on node labels.\" How does this external approach/node label conditioning work exactly? What kind of label is suitable for this purpose? How are these node labels related to Y in 3.2? \n\nThese are not clearly explained.\n\n- W2. Motivation of the decoupled approach is not well articulated, and the choice of the word \"decoupled\" is misleading.\n\nFirst, the explanation/motivation of why GraphMaker-Asyn is better is not laid out convincingly. From the experiments, the results are also quite mixed. Essentially, together with GraphMaker-E, there are three alternative versions proposed, but there are no clear insight on why each version plays to its strength in certain scenarios.\n\nSecondly, I think GraphMaker-Asyn is not really decoupled, as both edge and attribute generation are still trained together. \n\n- W3. What is the difference between node attributes and labels? In Section 2, both are defined as categorical.\n\n- W4. The application scenario of large attributed graph generation is unclear. Currently, generation of small graphs such as molecules are popular as they may potentially drive killer applications such as drug discovery."
            },
            "questions": {
                "value": "See weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5919/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698975586511,
        "cdate": 1698975586511,
        "tmdate": 1699636629215,
        "mdate": 1699636629215,
        "license": "CC BY 4.0",
        "version": 2
    }
]