[
    {
        "id": "Y1ElQ1o5hQ",
        "forum": "lmShn57DRD",
        "replyto": "lmShn57DRD",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1208/Reviewer_qMLP"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1208/Reviewer_qMLP"
        ],
        "content": {
            "summary": {
                "value": "This paper delves into the challenges presented by multivariate long-term time series forecasting (MLTSF), specifically the difficulty of capturing cross-channel dependencies and temporal order information using current Transformer-based models. Despite the achievements of Transformer models in various fields, their application in MLTSF reveals certain inadequacies. Models like Informer, Autoformer, and FEDformer, while advanced, still face challenges in understanding intricate channel relationships in multivariate time series. \n\nTo address these issues, the authors propose the GRformer model. This innovative solution combines the strengths of Graph Neural Networks (GNN) and position encoding derived from Recurrent Neural Networks (RNN). The inclusion of a mix-hop propagation layer within a feedforward neural network promotes efficient interaction between different time series data points. Additionally, by leveraging a multi-layer RNN, the model recursively generates positional embeddings, emphasizing the importance of sequence order. \n\nThe paper's empirical tests, conducted on eight real-world datasets, demonstrate the GRformer's superior predictive accuracy in MLTSF tasks, underlining its potential as a novel solution in the field of time series forecasting."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "**Strengths**:\n\n1. **Originality**: \n   - The GRformer presents a unique fusion of GNN and RNN-based position encoding within a Transformer framework, addressing gaps in MLTSF.\n   - The incorporation of the Pearson correlation coefficient for graph structure is a notable innovation.\n\n2. **Quality**: \n   - Rigorous empirical validation is conducted on eight real-world datasets, ensuring robustness.\n   - The model's design is comprehensive, with the mix-hop propagation layer and RNN-based position encoding as highlights.\n\n3. **Clarity**: \n   - The paper delineates complex concepts coherently, facilitating reader understanding.\n   - Distinctive features and advantages of GRformer over existing models are clearly articulated.\n\n4. **Significance**: \n   - The GRformer's advancements in capturing cross-channel dependencies have potential broad impacts in time series forecasting.\n   - The paper paves the way for future research by highlighting existing challenges and areas of improvement.\n\nIn essence, the paper excels in its innovative methodology, thorough validation, lucid presentation, and relevance in the field."
            },
            "weaknesses": {
                "value": "1. **Mathematical Notation Consistency**:\n   - The authors' use of mathematical notation appears inconsistent. For instance, function names should ideally be presented in regular typeface rather than italic. Proper notation ensures clarity and avoids potential confusion.\n\n2. **Graph Construction Using Pearson Coefficient**:\n   - While the authors opted for the Pearson correlation coefficient for graph construction, which subsequently serves as the foundational structure for the GNN, one might question the exclusion of making GNN parameters learnable. This adaptability could potentially offer more flexibility to the model.\n\n3. **Assumption of Homoscedasticity**:\n   - The Pearson coefficient assumes homoscedasticity in the data. It's unclear if the authors verified this assumption across their datasets. Such checks are crucial to ensure the validity of the chosen coefficient.\n\n4. **Alternative Correlation Metrics**:\n   - The paper doesn't seem to explore or discuss other potentially beneficial correlation coefficients like Time-Lagged Cross-Correlation (TLCC) or Dynamic Time Warping (DTW). An exploration or justification of the chosen metric over others could have added depth to their methodology."
            },
            "questions": {
                "value": "**Hyperparameter Selection in Graph Construction**:\n   - The methodology introduced by the authors involves several hyperparameters, which seemingly have a significant impact on the model's outcomes. Specifically, when constructing the graph structure:\n     - How was the threshold value of 0.8 determined?\n     - Regarding the 'topk' selection, how was the value of \\( k \\) chosen, and does it correlate with the number of variables?\n\n **Mix-hop Propagation Parameter**:\n   - How was the value for the EMA parameter \\( \\alpha \\) in the mix-hop propagation process determined?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1208/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1697955080810,
        "cdate": 1697955080810,
        "tmdate": 1699636047386,
        "mdate": 1699636047386,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "ZW5q7GQSYk",
        "forum": "lmShn57DRD",
        "replyto": "lmShn57DRD",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1208/Reviewer_Evwp"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1208/Reviewer_Evwp"
        ],
        "content": {
            "summary": {
                "value": "This paper enhances Transformer with GNN and position embedding generated by RNN for multivariate time series forecasting. The proposed GRformer constructs graph by pearson correlation and uses a mix-hop propagation GNN layer to capture cross-channel dependency. For temporal dependency, it uses an RNN to recursively generate positional embeddings. Experiments on eight real-world datasets show that the proposed GRformer is on compare with SOTA model, PatchTST."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- This paper is well-written and easy to follow.\n- Using pearson correlation for graph constructing is reasonable and efficient."
            },
            "weaknesses": {
                "value": "My main concern is that the novelty is limited:\n\n- For RNN-based position embedding: \n  1. The idea of enhance Transformer with RNN is not new[1].\n  2. RNN operates recursively and cannot be parallelized, which offsets the efficiency advantages of Transformers that can be highly parallelized.\n  3. Ablation study in Table 3 shows that the improvement of RNN against previous learnable position embedding is not significant.\n- For Mix-hop propagation: \n    1. The mix-hop propagation layer is **exactly the same** as that in [2] and there is no explicit reference to it in Section 3.2.3.\n    2. Besides the graph construction via Pearson correlation, this is a direct combination of PatchTST and \"Connecting the dots\".\n\n[1] Qin, Yao, et al. \"A dual-stage attention-based recurrent neural network for time series prediction.\" arXiv preprint arXiv:1704.02971 (2017).\n\n[2] Wu, Zonghan, et al. \"Connecting the dots: Multivariate time series forecasting with graph neural networks.\" Proceedings of the 26th ACM SIGKDD international conference on knowledge discovery & data mining. 2020."
            },
            "questions": {
                "value": "- What is the authors' primary objective in visualizing the weights of the MLP in Figure 1(b), given that it only reflects the correlation among hidden states? \n- Could you provide a comparison of the computational efficiency between your RNN-based position embedding and a learnable position embedding, particularly in relation to varying sequence lengths?\n- How were the hyperparameters (0.8 and $k$) in Equations (2) and (3) chosen, and what impact do these specific values have on the model's performance and behavior?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission1208/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1208/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1208/Reviewer_Evwp"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1208/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698032964680,
        "cdate": 1698032964680,
        "tmdate": 1699636047317,
        "mdate": 1699636047317,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "0V7MNAJ5PS",
        "forum": "lmShn57DRD",
        "replyto": "lmShn57DRD",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1208/Reviewer_rJkP"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1208/Reviewer_rJkP"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes GRformer, a new neural architecture for multivariate long-term time series forecasting (MLTSF). The authors propose a hybrid architecture that consists of a Transformer-based graph neural network to model cross-channel dependencies and a recurrent neural network to model temporal dependencies. The proposed model shows promising performance on eight benchmarks. However, the motivation and reasoning behind the criticism of the Transformer-based approach are difficult to understand. Some of the claims are made without proper evidence, or by simply citing previous work, without providing any further detailed study or analysis. Additionally, the performance improvements on the benchmarks seem to outperform the baselines. However, I believe the claim of achieving a performance improvement with a 5.7% decrease in MSE and 6.1% decrease in MAE is misleading. These numbers are calculated by averaging MSE and MAE without considering the scales between different benchmarks and metrics. ILI has much higher mean squared errors (MSEs) and mean absolute errors (MAEs) than other benchmarks. This means that if you compute the average score in this way, the average score can be dominated by the relative improvement in this specific dataset. The tone reporting the improvement suggests that the model showed around a 6% decrease in errors on all benchmarks, but the average relative improvement for each benchmark at different metrics is actually 2.55% for MSE and 4.96% for MAE."
            },
            "soundness": {
                "value": "1 poor"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "The model achieves improvements over 7 different benchmarks using 4 metrics for each benchmark dataset. The experiments are done extensively with ablation on different positional encoding strategies. This however raises a question on why the RNN is needed (Table 3. R: the first column vs L: the second column show a very minor difference)."
            },
            "weaknesses": {
                "value": "I am not sure what I am seeing in Figure 1(b), and I don’t understand how to interpret the authors' claim that cross-channel interaction is chaotic based on simply visualizing the weight matrices of the Transformer's dense layer (internal MLP).\n\nI am not sure I understand the authors' point about positional encoding not being able to represent temporal orders well. RNNs have their own problems, such as vanishing gradients when modeling long-term temporal dependencies. Are you suggesting that RNNs outperform Transformers in multivariate long-term time series forecasting (MLTSF)?\n-> Are the ablation results in Table 3 the experiments to back this claim? If that's the case, the performance difference between an RNN-based positional encoding (?) vs a learned positional embedding is almost 0.\n\nWhat exactly is the RNN-based position encoding method? In the caption for Figure 2, it says \"The multi-layer RNN injects temporal order information.\" However, RNNs are not just injecting temporal order information as some sort of advanced positional encoding method; they can actually learn temporal dependencies. I am not sure if you are distinguishing between positional encoding and learning temporal representation.\n\nFigure 2 (b) is hard to understand, at least explain the operator signs in the caption, arrows are not clear."
            },
            "questions": {
                "value": "What is the main evidence that Transformer-based models are ineffective at capturing cross-channel dependencies and temporal orders? If Transformers were bad at capturing temporal orders, they would not have become as popular as they are today. I am curious why the authors make such claims, as I do not see any plausible supporting evidence in the manuscript.\n\nThe authors mentioned that they used multi-layered RNNs, however in the appendix, it's said 1-layer RNN was used. Can you clarify the details of the RNN architecture?\n\n“To properly capture temporal dependencies, we consider using a multilayer RNN to encode the positions in the time series.” Why deep RNNs can properly capture temporal dependencies while Transformers can’t?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1208/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698711813614,
        "cdate": 1698711813614,
        "tmdate": 1699636047246,
        "mdate": 1699636047246,
        "license": "CC BY 4.0",
        "version": 2
    }
]