[
    {
        "id": "pzPWozAHGn",
        "forum": "lROh08eK6n",
        "replyto": "lROh08eK6n",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5870/Reviewer_8cxP"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5870/Reviewer_8cxP"
        ],
        "content": {
            "summary": {
                "value": "This work proposes two high-dimensional network embedding methods called node2ket and node2ket+ that outperform standard methods such as word2ket. As evidence of these claims, they perform experiments studying several tasks, obtaining better compressive ratio than other approaches. Additionally, they provide an implementation in a library called LIBN2K."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- This paper improves upon existing network embedding techniques by proposing a high-dimensional embedding with better efficiency over previous quantum-inspired methods such as word2ket.\n- The theoretical analysis is clear, showing that node2ket gets a high-rank approximation of the information matrix\n- The experiments appear to be quite thorough and shows advantages over existing methods, as promised.\n- It is nice that the code is made available."
            },
            "weaknesses": {
                "value": "- This is a quantum-inspired algorithm for classical machine learning, which suffers from the lack of a clear connection to quantum computation (see Questions).\n- There are gaps for actually making this algorithm \"quantum-friendly,\" as it is generally not easy to load classical information into a quantum device."
            },
            "questions": {
                "value": "- What is the significance of the embeddings being designed for \"quantum Hilbert space\"? To me, the relationship to quantum computation is not clear and seems more like an afterthought. Quantum computers are known to be good at problems with certain structure, and it's not clear to me what structure is being leveraged here (and what benefits are obtained as a result).\n- The fact that pure quantum states are normalized leads to the constraint $\\\\|\\mathbf{x}_i\\\\|=1$. Is there any consideration for eliminating a global phase, which I assume would affect the embedding? Also, I wonder what embedding might be developed for more general quantum states, such as mixed states.\n- Forgive my ignorance, but what is the definition of positive node pairs and negative nodes? Does it just mean the inner product is positive or negative?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5870/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5870/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5870/Reviewer_8cxP"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5870/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698266126203,
        "cdate": 1698266126203,
        "tmdate": 1699636622040,
        "mdate": 1699636622040,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "3qVsrXwsbb",
        "forum": "lROh08eK6n",
        "replyto": "lROh08eK6n",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5870/Reviewer_RkWJ"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5870/Reviewer_RkWJ"
        ],
        "content": {
            "summary": {
                "value": "The paper introduces a groundbreaking paradigm for network embedding (NE), departing from traditional low-dimensional embeddings and exploring high-dimensional quantum state representations. The authors propose two NE methods, node2ket and node2ket+, and implement them in a flexible, efficient C++ library (LIBN2K). Experimental results showcase the good performance of their proposal, boasting advantages in parameter efficiency, running speed, and memory usage."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "The paper is well organized. The insights offered in the paper have the potential to inspire the development of other quantum-inspired methods and contribute to the broader application of quantum computing in the field of network embedding."
            },
            "weaknesses": {
                "value": "The primary concern in this submission pertains to the technical contribution. First, the extension of the word2ket concept to product states appears relatively straightforward. Second, the utilization of product states might limit the embedding's expressivity since these states occupy a smaller portion of the Hilbert space and result in a low-dimensional representation."
            },
            "questions": {
                "value": "No questions at the moment."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5870/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698745950197,
        "cdate": 1698745950197,
        "tmdate": 1699636621919,
        "mdate": 1699636621919,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "W7W6mBaWwa",
        "forum": "lROh08eK6n",
        "replyto": "lROh08eK6n",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5870/Reviewer_VRn5"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5870/Reviewer_VRn5"
        ],
        "content": {
            "summary": {
                "value": "For the standing and important task of network embedding in data mining and machine learning, the paper proposes explores the exponentially high embedding space for network embedding, which largely differs from existing works dewelling on the low-dimensional embedding. This is achieved by product quantum states in a super high-dimensional quantum Hilbert space. The experiments show surprisingly strong performance of the approach, in terms of both high memory and running efficiency with strong robustness across different tasks of network reconstruction, link prediction, and node classification. The authors also provide the source code to ensure the soundness of the experiments."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1) This paper innovatively resorts to the high-dimensional embedding space for network embedding, which quite departures from existing literature.\n2) The paper is well presented and the overview plot in Fig. 1 is very informative and useful to readers. The paper is well organized with strong content in appendix that signifcantly enriches the paper.\n3) The experiments are impressive. Provided with the source code, I am convinced by the strong performance.\n4) The authors give strong theoretical understanding of the essence of their approaches, which I really appreciate."
            },
            "weaknesses": {
                "value": "As the authors emphasized, the presented techniques are mainly suited for the structure networks, without considering the attributes. I understand this setting and think it is reasonable in practice. It also fits with many previous works in literature that have also been compred in this paper."
            },
            "questions": {
                "value": "1) Comaperd with Fig. 1, can the authors provide a more succinct plot to convey the main idea of the paper? Fig. 1 is still a bit busy which is useful yet a more direct illustration in the begining of the paper is welcomed. Something like Fig. 2 is better.\n2) Can the approach be useful for solving combinatorial problems especially for large-scale ones? As there is little attributes need to be considered in these cases thus it seems suited to the proposed methods?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5870/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5870/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5870/Reviewer_VRn5"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5870/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698758956369,
        "cdate": 1698758956369,
        "tmdate": 1699636621812,
        "mdate": 1699636621812,
        "license": "CC BY 4.0",
        "version": 2
    }
]