[
    {
        "id": "FqdqAqtYUr",
        "forum": "lzt60v45V4",
        "replyto": "lzt60v45V4",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2499/Reviewer_ouu6"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2499/Reviewer_ouu6"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a Bayesian framework for federated continual learning. For local updates, they combine previous posterior and global posterior into a mix prior to mitigate both the catastrophic forgetting and overfitting encountered in federated continual learning. For global aggregation, they use conflation that minimizes Shannon information loss."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. Writing is good. The problem formulation is clear.\n2. They propose a comprehensive Bayesian framework to FCL, including both solutions in local updates and global aggregation.\n3. They provide detailed theoretical analysis.\n4. Experiments are conducted on large-scale complex datasets like CIFAR-100 and Tiny-ImageNet."
            },
            "weaknesses": {
                "value": "I'm not familiar with previous works in federated continual learning. So I cannot provide a specific assessment regarding the novelty. The performance seems pretty good so I don't have any additional feedback on the limitations of the work."
            },
            "questions": {
                "value": "How do you compare with this work?\n\n[1] Guo, H., Greengard, P., Wang, H., Gelman, A., Kim, Y., & Xing, E. P. (2023). Federated Learning as Variational Inference: A Scalable Expectation Propagation Approach. arXiv preprint arXiv:2302.04228."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2499/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698601858597,
        "cdate": 1698601858597,
        "tmdate": 1699636186496,
        "mdate": 1699636186496,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "VGlkYumMFs",
        "forum": "lzt60v45V4",
        "replyto": "lzt60v45V4",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2499/Reviewer_J3Yt"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2499/Reviewer_J3Yt"
        ],
        "content": {
            "summary": {
                "value": "The paper addresses federated continual learning (FCL). There are two novelties proposed:\n1. (Primary) There have been variational generalisations, from continual learning (CL) to variational continual learning (VCL) and from federated learning (FL) to variational federated learning (VFL). This paper is the first to introduce variational federated continual learning (VFCL), by introducing variational inference with mixture prior aimed at mitigating both local overfitting and catastrophic forgetting.\n2. (Secondary) In (variational) federated learning, the task of aggregating client posterior distributions into a global distribution is done via parameter average. This paper proposes an alternative: conflation.\nApart from these novelties, the paper includes theoretical analysis on generalisation bounds on VFCL's performance, and experiments and adequate ablation studies showing the advantages of the proposed approach over existing related works."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "Good introduction. Good flow. Easy to read. Good review of existing works.\n\nThe contributions are clear and not difficult to understand. Many aspects of the contributions are adequately addressed with ablation studies.\n\nThe theoretical bounds in section 4 are welcome. It would be good if some connection to existing approaches can be established.\n\nExperimental results show reasonable accuracy gains against existing approaches."
            },
            "weaknesses": {
                "value": "There are mainly 2 weak points in my view.\n\n### Speed\n\nThe paper focuses mainly on accuracy, showing VFCL outperforming other state-of-the-art methods in a number of cases. However, the introduction of variational inference does come with complications in speed. In training, VFCL involves an additional iterative, MCMC sampling step (at optimizing eq (9)). In inference, you also need MCMC or variational inference to form the output distributions. There seems to be very little in the paper that addresses speed concerns. Whether or not speed can be a big concern for using the approach in practice seems to be left unanswered.\n\n### Experimental Datasets\n\nOne weakness is the choice of the datasets conducted for experiments. The paper uses CIFAR100 and TinyImageNet, which are originally designed neither for federated learning nor continual learning. The non i.i.d. property was simulated. While it makes sense from a theoretical point of view, it begs the question of how the model performs in real applications. Would it still be better than existing approaches in real applications? Have you conducted your approach on any real dataset for FCL?"
            },
            "questions": {
                "value": "I hope to get some feedback regarding the weak points above. Apart from those points, there are some further questions:\n\nEq (8) in training has to be solved using a sampling approach like MCMC. How does that impact training in terms of time?\n\nIn the experiments, Monte Carlo sampling was set to $n=1$ for the purpose of comparing with other approaches. But if the approach were to be used in a real application, is there any study to suggest in which range the value of $n$ should be?\n\nThere is an experiment on varying $\\lambda_p$. Is there a similar experiment on varying $\\lambda_k$? How do we know whether $\\lambda_k$ is a sensitive parameter or not?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "N/A"
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2499/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698677880695,
        "cdate": 1698677880695,
        "tmdate": 1699636186429,
        "mdate": 1699636186429,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "Wd5uxc6yDB",
        "forum": "lzt60v45V4",
        "replyto": "lzt60v45V4",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2499/Reviewer_Htsy"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2499/Reviewer_Htsy"
        ],
        "content": {
            "summary": {
                "value": "This paper looks at the problem of Federated Continual Learning, and proposes a variational inference solution where there is a variational (Gaussian) distribution over the parameters of a neural network. Previous papers have not looked at FCL using such variational methods. They use a mixture prior to mix together the priors coming from the continual learning and federated learning components. As they are interested in having different (personalised) models on each client, they have a specific global posterior aggregation method too. They also have some theoretical analysis on (upper bound of) the generalisation error of their algorithm."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. The FCL (Federated Continual Learning) problem is interesting, and no previous methods have tried a BNN approach to it. It makes a lot of sense to try this. \n\n2. I liked the mixture prior as a simple yet effective way to combine the terms coming from the continual learning and federated learning parts of the problem. \n\n3. I was able to follow the method and explanations quite well (although, it should be said that I am well-versed in BNNs/VI in general). I particularly found Figure 1 helpful. (That said, a small suggestion: the plots in Figure 1 with Gaussians did not make any sense until reading the paper in detail, and mostly just distracted me.) \n\n4. There are two experiments, and I liked the various ablations and comparisons of computation overheads."
            },
            "weaknesses": {
                "value": "1. My main issue is with the global posterior aggregation method (Section 3.3). Equation 10 makes sense to me (using a mixture of local approximate posterior distributions). However, Equation 11 does not seem related to Equation 10: Equation 11 looks like you have just simply multiplied together all the various local approximate (mean-field) Gaussians. IE it is a *product* of local posterior distributions. Am I misunderstanding something? If this is indeed the case, why write it through Equation 10 instead of just saying you are multiplying together the distributions? \n\n2. Although it is nice to see an attempt at theoretical analysis, I did not see what benefit this brings to the paper or method. Could the authors perhaps discuss how such analysis might be helpful for current or future analysis? The three bullet points at the end of Section 4 all seemed fairly obvious to me (but perhaps that is the point? But then what use is this section?). \n\n3. The experiments only reported one number per method. It is important to run many times (at least 3 or 5) with a mean and std deviation across runs to get an idea of if these results are significant in some way. Further questions about the experiments: \n- Why are the first 2 tasks called 'warm-up tasks'? \n- It is not clear exactly what is being reported in Tables 1 and 2. Is it the average accuracy after training on task t (where t is the number in the first row), or is it the final accuracy on task t's data after training on the last task? What is the Avg over? These details should ideally go in the caption (and the main text)."
            },
            "questions": {
                "value": "Please see Weaknesses section. \n\nOne more minor point: \n- In the second paragraph of the Introduction, the authors talk about previous methods (regularisation based and knowledge distillation based), which apparently use global knowledge / models. But then the authors say these methods do not combat local overfitting. I thought the point of use global knowledge was to combat local overfitting, so I did not understand why these other methods do not do this? I think the writing could be made clearer here."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2499/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698875069171,
        "cdate": 1698875069171,
        "tmdate": 1699636186359,
        "mdate": 1699636186359,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "DuXTuZQ1l8",
        "forum": "lzt60v45V4",
        "replyto": "lzt60v45V4",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2499/Reviewer_uvyG"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2499/Reviewer_uvyG"
        ],
        "content": {
            "summary": {
                "value": "This paper integrates the framework of variational inference with mixture model into the federated continual learning scenario. \n\nThe key idea is for each client to adopt variational inference on a mixture prior comprising its locally learned posterior & the aggregated global posterior of the previous task to optimize for a local posterior of the current task. In turn, such local posteriors will be shared with the server for aggregation (via conflation) & the aggregated posterior will be sent back to the clients so that they can update their mixture prior for the next iteration and so on.\n\nThe proposed method is compared with the latest work in FCL on two simulated continual learning scenarios on CIFAR100 & TinyImageNet."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "This paper aims to address a relatively new, less addressed problem in federated learning.\n\nThe writing is mostly clear & communicates well the high-level idea.\n\nThe technical exposition is rigorously detailed, which is great. The experiments also show consistent positive results across two datasets."
            },
            "weaknesses": {
                "value": "I have the following concerns of this work (in decreasing order of importance)\n\nFirst, I believe the empirical setting studied in this paper is a simplified version of the FCL setting in FedWeIT where clients have different task sequence. In this case, however, the clients are assumed to have the same task sequence, which is reducible to a pure CL setting: (1) existing CL parameterization can be adopted \"as is\" for the common model architecture; and (2) existing FL techniques can be applied to handle the federation of data. This ignores the essence of federated CL where there can be another cause for catastrophic forgetting which is client interference. This happens when clients have different task sequence and a naive attempt to aggregate their models (solving different tasks) can also lead to forgetting.\n\nThus, unfortunately, what is proposed here has not addressed that challenge because the global posterior aggregation here assumes local posteriors are derived from the same task (albeit with different data distributions).\n\nSecond, I also find the experiment too limited in comparison to the setting that was investigated under FedWeIT. For a thorough comparison, its exact same setting should have been adopted here. Also, the current reported performance is without deviation bar with relatively thin margin between best and second best methods, which is not very conclusive.\n\nThird, I do not see how the developed theory is specific to continual and federated learning. Its theoretical setup is entirely oblivious to the FCL setting so I am not sure what it really implies here.\n\nLast, while the writing is mostly clear, several parts still remain unclear. For example, background on conflation is missing, making it hard to see what is the loss function that replaces (10) in Section 3.3. The FL characterization in Eq. (1) is also strange: it suggests the optimization of all clients is decoupled (even thought it is not supposed to be the case). Also, are the mixing weights in Eq. (5) learnable?"
            },
            "questions": {
                "value": "Unless I misunderstand this work, I believe it is focused on a setting that assumes away a key challenge of federated CL. Please let me know if I misunderstand something important here.\n\nIn addition, I'd suggest re-running the experiments on the benchmark data introduced in https://proceedings.mlr.press/v139/yoon21b/yoon21b.pdf\nAll experiment results should have deviation bar reported.\n\nI also think the authors need to elaborate more on their theoretical results, and explain (if possible) how it specifically accounts for the continual and federated learning setup."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2499/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699011276596,
        "cdate": 1699011276596,
        "tmdate": 1699636186298,
        "mdate": 1699636186298,
        "license": "CC BY 4.0",
        "version": 2
    }
]