[
    {
        "id": "6lGVpGJ781",
        "forum": "mMaQvkMzDi",
        "replyto": "mMaQvkMzDi",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2012/Reviewer_sfnT"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2012/Reviewer_sfnT"
        ],
        "content": {
            "summary": {
                "value": "This paper produces a detailed analysis of various open-source Large Multimodal Models (LMMs) across 5 different axes: hallucinations, abstention, compositionality, explainability, and instruction following. The paper identifies how each model’s performance changes (or does not change) with increased ICL examples, and proposes variants of ICL prompting methods to improve performance on some of the identified categories."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "The categorization of various LMM failures and the thorough analysis of how different model variants and sizes perform at each task is well done. The main takeaways from this paper, highlighting crucial limitations of current LMMs and identifying where ICL is and is not useful, and proposed methods for improving ICL in the LMM context (X-ICL) are all meaningful insights for the research community. Overall, the work seems significant, experiments are thorough and diverse, and the writing is clear."
            },
            "weaknesses": {
                "value": "- Only qualitative results are given for the Instruction Following evaluations. It would be interesting to see if other forms of automated evaluations assessing instruction following can be used (e.g. checking that detailed answers are indeed more detailed or checking whether the original question was indeed answered by passing the LMM generated text and original instruction into a LLM like GPT-4). While LLM-based evaluations can still be flawed, it can also provide a more thorough view (looking at a wider range of questions rather than the small sample that was presented qualitatively in this work). Have the authors experimented with automatic evaluations for the instruction following tasks? \n- Nit: the table and figure fonts are very small and hard to see."
            },
            "questions": {
                "value": "See above question about automated evaluations for instruction following."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2012/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698711812040,
        "cdate": 1698711812040,
        "tmdate": 1699636132585,
        "mdate": 1699636132585,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "uXwXfOzwtd",
        "forum": "mMaQvkMzDi",
        "replyto": "mMaQvkMzDi",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2012/Reviewer_dAEJ"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2012/Reviewer_dAEJ"
        ],
        "content": {
            "summary": {
                "value": "This study assesses the shortcomings of open-sourced LMMs (3B-9B) in areas such as object hallucination, abstention, compositionality, explainability, and instruction following. The authors show that LMMs face challenges in most areas despite having ~9B parameters. The impact of In-context Learning (ICL) on these limitations is also examined, showing mixed effects; it helps in some aspects, worsens others, or has minimal impact. Variants of ICL are proposed to mitigate some flaws, aiming to continually improve benchmarks."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "4 excellent"
            },
            "strengths": {
                "value": "1. The paper is well-written, clearly highlighting essential results. The use of colored words effectively guides the reader to the relevant axes under examination.\n2. By offering novel insights, the paper contributes meaningfully to the future development of LMMs.\n3. A commendable effort has been made to cover multiple open-sourced LMMs\n4. The authors thoughtfully propose modifications to ICL, aiming to induce improvements along various axes."
            },
            "weaknesses": {
                "value": "1. While the modifications to ICL yield improvements in open-sourced LMMs, it would be advantageous to evaluate these findings in the context of models with >9B parameters, as these larger models are prevalent in the state-of-the-art (SOTA) and also have been shown to exhibit different trends than the smaller models.\n2. A more comprehensive discussion on why longer CL (32 & 64) does not yield improvements across various axes would enhance the understanding of the models' behaviors.\n3. The text in all illustration figures is very difficult to read, and Table 3 is also challenging to interpret due to the small font size."
            },
            "questions": {
                "value": "With three random trials conducted, it remains unclear whether the reported results in the tables represent mean or median values."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission2012/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2012/Reviewer_dAEJ",
                    "ICLR.cc/2024/Conference/Submission2012/Senior_Area_Chairs"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2012/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698837584120,
        "cdate": 1698837584120,
        "tmdate": 1700505887702,
        "mdate": 1700505887702,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "MudZbpThlJ",
        "forum": "mMaQvkMzDi",
        "replyto": "mMaQvkMzDi",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2012/Reviewer_PTKm"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2012/Reviewer_PTKm"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes to study the issues of large multimodal models and proposes a way to improve their performance through in-context learning. The paper proposes an axis of different ways to evaluate models (hallucinations, abstention, compositionally, explainability and instruction following) and illustrates how multimodal models typically struggle with this, with in-context learning further hurting performance. The paper proposes a new way to do in-context learning which improves performance along each of these axises"
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- This paper analyzes the performance of multimodal models and illustrates a variety fo axises on how they might fail\n- This paper proposes new methods to improve the in context learning performance of methods"
            },
            "weaknesses": {
                "value": "- The results lack confidence intervals -- in general there is very large variance between the numbers. For instance in Table 2 and 3, there is large variance of a single method between a different number of shots which seems larger than the reported gains of the proposed method . \n- It would be good to report quantitative results for each result in the paper.\n- I had difficulty understanding the main differences between the new in-context learning methods presented in the paper and the performances seem minor\n-  The existing evaluated models seem out of date -- it would be good to compare with models such as BLIP or LLava, MiniGPT-4 or GPT4V"
            },
            "questions": {
                "value": "- Can the authors provide psuedocode for each of the in-context learning methods that are proposed?\n- Why does the modification to in-context learning of presenting both positive and negative demonstrations  correspond to CoH in context learning?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2012/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698848889675,
        "cdate": 1698848889675,
        "tmdate": 1699636132427,
        "mdate": 1699636132427,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "QgTd7nyLvG",
        "forum": "mMaQvkMzDi",
        "replyto": "mMaQvkMzDi",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2012/Reviewer_wHgE"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2012/Reviewer_wHgE"
        ],
        "content": {
            "summary": {
                "value": "The paper presents a series of experiments assessing Large Multimodal Models (LMMs) in five areas: object hallucinations, abstention, compositionality, explainability, and instruction following. It shows that scaling LMMs doesn't fully address their deficiencies. In-Context Learning (ICL) is investigated as a remedial measure, with mixed results: it helps in some areas but not others, and can even increase hallucinations. Despite these insights, the paper suggests innovative ICL variants with potential for improvement."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The paper provides a thorough critique of LMMs by examining their performance beyond standard benchmarks and introducing new ICL approaches to overcome their limitations. It show some insight for understanding LMMs' applicability."
            },
            "weaknesses": {
                "value": "While the paper addresses an essential aspect of LMMs' functionality, it falls short in pioneering novelty. It does not introduce new datasets or unique evaluation methodologies, which limits its contribution to the field. The potential impact of the proposed ICL variants is not sufficiently analyzed, and the paper overlooks a discussion on the selection process for demonstrations in ICL. This lack of methodological detail, particularly when compared to existing demonstration selection strategies based on similarity, raises concerns about the practical implementation and reproducibility of the results."
            },
            "questions": {
                "value": "1. How is the selection process for demonstrations in context $C$ determined?\n1. Could you specify the evaluation metrics used for each of the five axes and explain why the metrics can measure the axes?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2012/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699272621104,
        "cdate": 1699272621104,
        "tmdate": 1699636132356,
        "mdate": 1699636132356,
        "license": "CC BY 4.0",
        "version": 2
    }
]