[
    {
        "id": "MIV8SocCpZ",
        "forum": "mWT3Ftkc3e",
        "replyto": "mWT3Ftkc3e",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1569/Reviewer_CiGA"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1569/Reviewer_CiGA"
        ],
        "content": {
            "summary": {
                "value": "This work provides convergence guarantees for the consistency models by Song et al. 2023, which is a one-step generative model achieving state-of-the-art results. The main assumptions are the Lipschitzness of the score function, the score estimation error, and the consistency error. Presented results include consistency mapping error, Wasserstein-2 distance, and TV distance between the mapping and the true probability flow. Multistep consistency sampling is also analyzed to show an improved convergence guarantee compared to the one-step alternative."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "* The writing is clear and generally good, minus a few typos.\n* To my knowledge, this is the first convergence guarantee result for the consistency model, and it is a valuable effort.\n* Assumptions on the data distribution are weak."
            },
            "weaknesses": {
                "value": "* While the assumptions on the data distribution are weak, this work assumes the score estimation error and consistency error are low (Assumption 3, 4), which are major assumptions that are conditioned on the success of the optimization procedure. While it is believable that most usual training procedures can result in low score estimation error since the loss is basically an MSE, it is much harder to reason about the training procedure for the consistency model (8). It is good that the authors acknowledge this point in multiple places.\n* Assumption 6 seems unmotivated: the authors attributed it to \"technical reason\", without further explanation.\n* The presentation of the latter results in Section 3.5 seems messy. It looks like the clarity can be improved by using better notations, as many terms are the same."
            },
            "questions": {
                "value": "* How is $\\theta^-$ defined? Is it a moving average of past $\\theta$'s?\n* Below Assumption 2, it says this paper does not assume convexity or dissipativity on $-\\log p$, unlike previous works. What is the reason that the analysis presented here does not require such assumptions?\n* What is the significance of obtaining a TV bound, compared to a Wasserstein-2 bound? The result seems a lot more messy compared to the ones concerning W2 errors.\n* Minor comments:\n  * Some of the $d$'s in (1)(2) are italicized when they shouldn't be\n  * In (5), is $dt$ a multiplication of $d$ and $t$?\n  * Below (7), \"such a mapping exists ..., and is smoothly relied on\" What's smoothly relied? And what exactly are the mild conditions mentioned here?\n  * Below Assumption 5, \"technique reason\" -> \"technical reason\"\n  * What does the notation $p P_{OU}^s$ mean, for a Markov kernel $P_{OU}^s$?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1569/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698376588197,
        "cdate": 1698376588197,
        "tmdate": 1699636085367,
        "mdate": 1699636085367,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "UqEMZCYZJy",
        "forum": "mWT3Ftkc3e",
        "replyto": "mWT3Ftkc3e",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1569/Reviewer_fM3B"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1569/Reviewer_fM3B"
        ],
        "content": {
            "summary": {
                "value": "This paper provides the convergence guarantee for the consisitency models in terms of Wasserstein distance. The authors also show that Multi-step consistency sampling procedure can further reduce the error comparing to one step sampling. Finally, with some Langevin-based modifications, total variation errors are also provided."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. As far as I am concerned, this is the first time a convergence guarantee for consistency models is established.\n2. The improvement of multi-step consistency sampling over one step sampling has been clearly demonstrated theoretically."
            },
            "weaknesses": {
                "value": "1. Not much technical contribution, most of the techniques has already been proposed in the literatures and the proof mostly follows Chen et al.(2023a). Also, Lemma 7 is not new, similar results have been established in [1]\n2. There are a lot of typos in the manuscript, e.g., on page 4: equation 4, the expression for $v^{\\mathrm{em}}(x,t)$; on page 15: in the second equation, $W_2(\\mathcal{N}(0,(1-e^{-2T})I_d), p_T)$ should be $W_2(\\mathcal{N}(0,I_d), p_T)$. Please reexamine your manuscript carefully.\n3. There are also some technique issues. For example, Lemma 11 in this paper is for the OU noise schedule, while Lemma 1 in Chen et al.(2023a) is for the variance explosion schedule.\n\n[1] Chen, H., Lee, H., and Lu, J. Improved analysis of scorebased generative modeling: User-friendly bounds under minimal smoothness assumptions. arXiv preprint arXiv:2211.01916, 2022a."
            },
            "questions": {
                "value": "1. In corollary 6, $n_k$ is taken to be a constant $\\hat{n}$ for all $k$. While in Song et al. (2023), $n_k$ is suggested to be decreasing. The theoretical results do not seem to support a decreasing $n_k$, any explanation?\n2. The results on multistep sampling that only requires a constant lower bound of $T$ is amazing. However, it seems that $L_f$ implicitly depends on $T$, especially when the data distribution is complicated (so it takes more time to transform a simple Gaussian noise to the data distribution). Not sure how pratical this benefit can be."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1569/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698585837492,
        "cdate": 1698585837492,
        "tmdate": 1699636085288,
        "mdate": 1699636085288,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "QRbxcAdgki",
        "forum": "mWT3Ftkc3e",
        "replyto": "mWT3Ftkc3e",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1569/Reviewer_8oEy"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1569/Reviewer_8oEy"
        ],
        "content": {
            "summary": {
                "value": "The paper provides the first convergence guarantee for Consistency Models (CMs), a newly emerging type of one-step generative model with the ability to produce samples comparable to those generated by state-of-the-art Diffusion Models."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. The paper provides the first convergence guarantee for Consistency Models, which is a notable contribution to the field of generative modeling;\n2. The results do not rely on strong assumptions about the data distribution, making them broadly applicable to a variety of scenarios;\n3. Very clear writing. A comprehensive conclusion on future directions."
            },
            "weaknesses": {
                "value": "I'm not entirely certain about the reasonability of Assumption 5. See Questions in details. \n\nBesides, there are no major weaknesses. A typo need to be corrected in the revision: at the beginning of section 3.3, it should be 'analyze' instead of 'analysis'."
            },
            "questions": {
                "value": "The only point I am concerned about is Assumption 5, which assumes the consistency model $f_\\theta$ is $L_f$-Lipschitz. But as far as I \n know, even if our model $f_\\theta$ can approximate the backward mapping $f^v$ very well, we should still expect that $L_f$ is of $O(e^T)$ (which comes from the Gronwall's Inequality applied on the exact reverse ODE). And so the first term in Corollary 4 could look like $max (d^{1/2}, m)$, which cannot be arbitrarily small. Can you overcome such Gronwall-type of error? If not, I would doubt that the results of this paper prove the efficiency of CMs."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission1569/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1569/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1569/Reviewer_8oEy"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1569/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698629870449,
        "cdate": 1698629870449,
        "tmdate": 1700347398762,
        "mdate": 1700347398762,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "9ex0upvsis",
        "forum": "mWT3Ftkc3e",
        "replyto": "mWT3Ftkc3e",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1569/Reviewer_N63V"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1569/Reviewer_N63V"
        ],
        "content": {
            "summary": {
                "value": "The authors of this work provide the first convergence guarantees for Consistency Models, a new class of diffusion models that achieves one-step generation. Under classical assumptions (smooth data density, bounded second moment of the data distribution, and an L2 bound on the score estimation) plus an additional assumption on the error of the consistency sampler, the authors provide a bound on the Wasserstein that is polynomial in all problem parameters. The authors further analyze multistep consistency sampling which removes the linear dependence on the total diffusion time $T$. Finally, the authors provide TV bounds by: i) early stopping and ii) modifying the reverse process with Langevin correctors."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- The authors provide the first analysis for Consistency Diffusion Models, which is an emerging class of diffusion models with nice theoretical and practical properties. It is nice to see that the theory follows closely the practical advancements and complements our understanding of why certain learning algorithms work.\n- The authors do a thorough analysis of Consistency Diffusion Models, providing bounds for Wasserstein distance (for smooth and bounded densities) and TV distance (under certain modifications).\n- The obtained bounds match the ones known for Score-Based Generative Models from the \"Sampling is as easy as learning the score\" paper.\n- The theoretical analysis is novel, especially for the result of Theorem 2."
            },
            "weaknesses": {
                "value": "Even though I overall consider this a strong submission, there are some weaknesses that need to be addressed or clarified.\n\n\n- The presentation of the paper could be improved. There are several typos in the main text -- I would encourage the authors to do another pass over the manuscript and fix them. Some examples:\n     * \"be further weaken\" -> \"be further weakened\"\n     * \"consistency model is nature\" -> \"is natural\"\n     * same sentence, fix formatting of the parenthesis.\n     * Figure 1: punctuation missing.\n     * \"a asymptotic analysis\" -> \"an asymptotic analysis\"\n     * \"For technique reason\" -> for technical reasons. It would also help to explain what these reasons are.\n- To improve the clarify of the paper, I think it would be better to explain what $\\theta_{-}$ is the first time it is introduced.\n- For Assumption 4, I think that the expectation should be over $x_{t_{n+1}}$. Given a $x_{t_{n+1}}$ everything is deterministic. Does that affect the proof of Theorem 2?\n- Corollary 4 is a little confusing. It seems that we require a lower bound on $T$, however, in the text, it is presented as having a large value of $T$ is a bad thing -- which is why the authors claim that multistep consistency sampling helps. I think the way this result is presented is a little misleading since it requires the learning errors to be O(1/T). \n- I am a little concerned about how much of the complexity of the problem is hidden in the upper-bound assumption on the learning of the consistency model. The model is trained to solve the whole probability flow ODE. If the score is inaccurately learned, the prediction of the solution can be poor because of error propagation. It seems that the error in the learning of the score and the consistency errors are actually related.\n- I also don't understand why this special time scheduling is needed. I don't think this is the scheduling that has been used in practice. I also don't recall seeing this assumption in prior work and it would be great to understand where this is coming from."
            },
            "questions": {
                "value": "See weaknesses above. Repeating here the points for completeness:\n- For Assumption 4, I think that the expectation should be over $x_{t_{n+1}}$. Given a $x_{t_{n+1}}$ everything is deterministic. Does that affect the proof of Theorem 2?\n- Corollary 4 is a little confusing. It seems that we require a lower bound on $T$, however, in the text, it is presented as having a large value of $T$ is a bad thing -- which is why the authors claim that multistep consistency sampling helps. I think the way this result is presented is a little misleading since it requires the learning errors to be O(1/T). \n- I am a little concerned about how much of the complexity of the problem is hidden in the upper-bound assumption on the learning of the consistency model. The model is trained to solve the whole probability flow ODE. If the score is inaccurately learned, the prediction of the solution can be poor because of error propagation. It seems that the error in the learning of the score and the consistency errors are actually related.\n- I also don't understand why this special time scheduling is needed. I don't think this is the scheduling that has been used in practice. I also don't recall seeing this assumption in prior work and it would be great to understand where this is coming from."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission1569/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1569/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1569/Reviewer_N63V"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1569/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699615004955,
        "cdate": 1699615004955,
        "tmdate": 1700824336319,
        "mdate": 1700824336319,
        "license": "CC BY 4.0",
        "version": 2
    }
]