[
    {
        "id": "6fKC3efTxS",
        "forum": "nFG1YmQTqi",
        "replyto": "nFG1YmQTqi",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1733/Reviewer_ox1H"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1733/Reviewer_ox1H"
        ],
        "content": {
            "summary": {
                "value": "In this paper, the authors propose a score-based generative models, namely TSGM, that can synthetic both regular time series and irregular time series. The novelty of the paper lies in the loss for score network. The authors conduct comprehensive experiments to demonstrate the effectiveness of the method and the authors also acknowledge the high run-time issue."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The authors propose the first SGM-based method for synthetic both regular time series and irregular time series.\n\n2. The authors propose a novel loss function for score network on time-series data.\n\n3. The proposed model achieves state-of-the-art results on different settings."
            },
            "weaknesses": {
                "value": "1. The propose loss function is not clearly written.\n\n2. The time complexity of TSGM is not discussed.\n\n3. The procedure of generating irregular time series is not clearly written.\n(See questions for more details.)"
            },
            "questions": {
                "value": "1. What is the time complexity of TSGM compared to baseline.\n\n2. What is the diffusion procedure for generating irregular time series using continuous-time models as encoder?\n\n3. As for irregular time series generation, how is the irregular-sampled timestamp generated in your sampling procedure?\n\n4. Please make a more clear explanation of how Eq. (12) is calculated.  \n\n5. How does the loss function related to time series data generation?\n\n6. How does the proposed loss function in Eq. (12) solve the computation issue? Does it accelerate the training process or the sampling procedure?\n\n7. Which encoder are used for encoding the irregular time series in your experiment?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1733/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698838997939,
        "cdate": 1698838997939,
        "tmdate": 1699636102012,
        "mdate": 1699636102012,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "of3NILqHec",
        "forum": "nFG1YmQTqi",
        "replyto": "nFG1YmQTqi",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1733/Reviewer_KQyu"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1733/Reviewer_KQyu"
        ],
        "content": {
            "summary": {
                "value": "The paper introduces a time series generative model employing score-based models. It involves pre-trained encoder-decoder units and a score-based model operating within the encoded space. This innovative method demonstrates effectiveness with irregular time series data. The authors conducted experiments using four datasets, generating distinct scenarios to evaluate their approach against reference models."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- The authors address an intriguing problem in their research.\n- The architecture and concepts appear well-aligned with the identified issues.\n- The empirical assessment carried out on benchmark data demonstrates the promising potential of the proposed approach."
            },
            "weaknesses": {
                "value": "In my view, the contribution doesn't appear to be highly innovative. The authors rely on two established models, the autoencoder and the conditional score-based approach. While this combined concept demonstrates practical efficacy, it seems more evolutionary than revolutionary. Furthermore, it's worth noting that prior works also explore the use of score-based models for time series, as evidenced in the research by Tashiro, Yusuke, et al. in \"Csdi: Conditional score-based diffusion models for probabilistic time series imputation,\" presented in Advances in Neural Information Processing Systems 34 (2021): 24804-24816. The model is designed for imputation, while the authors solve the problem of time-series generation, but the idea is still similar."
            },
            "questions": {
                "value": "I do not have any questions for authors."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1733/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698923867847,
        "cdate": 1698923867847,
        "tmdate": 1699636101938,
        "mdate": 1699636101938,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "tF4nZT3wcj",
        "forum": "nFG1YmQTqi",
        "replyto": "nFG1YmQTqi",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1733/Reviewer_Y133"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1733/Reviewer_Y133"
        ],
        "content": {
            "summary": {
                "value": "This work applies score-based generative methods to the time series domain. The model consists of both an RNN style encoder/decoder which transforms the time series into a latent space, and a score-based model which generates extensions to the time series. The RNN encoder/decoder allows this model to address time series with missing data in an otherwise regularly sampled data set. The authors show the generative quality of this model outperforms others through a train-synthetic-test-real and a discriminator comparison."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "1 poor"
            },
            "contribution": {
                "value": "4 excellent"
            },
            "strengths": {
                "value": "Using an RNN to encapsulate the temporal information both leverages the strengths of previous works and does not allow the leakage of future information. This is an expressive and robust way to create a temporal latent space which has the added benefit of handling data with missing samples.\n\nWith this encoder/decoder and a score-based generative model, this work combines two powerful architectures to generate time series that maintain data set characteristics much better than other methods. The authors demonstrated this via \"discriminative\" and \"predictive\" scores. On these metrics, the introduced model achieves state-of-the-art results with a considerable increase in the \"discriminative\" task."
            },
            "weaknesses": {
                "value": "## Writing\nThe writing of this paper is very poor and may have been submitted without being reviewed by others. After reading, I left this work with a similar amount of understanding as I would get from a short high-level conversation about a colleague's project. In general, this work is quite vague. There is a large amount of detail about this work that is missing. Below are a few\n\n1) What does this model look like? This work is centered on a model that is not described! Instead, the authors vaguely mention that the encoder/decoder are RNNs, and the backbone is a score-based model with a VE, VP, or subVP score (without defining what these abbreviations mean when they are first mentioned). There is a tremendous lack of detail as one can imagine many ways to satisfy this statement.\n* What are the $\\mathbf{f}$ and $g$ used in Eq. 1? These are crucial components of the Langevin sampling that these score models are based on, but these expressions are missing! This work mentions the VE, VP, and subVP from previous works, but does not provide the expressions that this work used.\n\n2) Much of the text in this work is superfluous. Providing all the examples is too much so I will provide a single one here\n\n>\"For synthesizing regular time series, we use a recurrent neural network-based encoder and decoder. Continuous-time methods, such as neural controlled differential equations (Kidger et al., 2020) and GRU-ODE (Brouwer et al., 2019), can be used as our encoder and decoder for synthesizing irregular time series (see Section 3.2 and Appendix I).\n\n> When synthesizing regular time-series only, the simplest way is to synthesize matrices, where D x N means the number of features and\nmeans the sequence length. However, our goal is to support both regular and irregular time-series, and our proposed design is more general than this approach.\"\n\n* The first paragraph states that most of the explanation for this statement is given later. Still, a one or half-sentence description would be ideal so the reader gains some understanding rather than having to believe the authors.\n* The second paragraph is the primary issue. It adds no new information and introduces a variable $D$ that is never used in the paper again. It is likely obvious to readers that a multivariate time series would be represented as a matrix, yet the authors decided to spend an entire paragraph describing this. Worse, the authors chose to prioritize this over expanding on vital information to understand this model (i.e. the $\\mathbf{f}$ and $g$ expressions).\n* The authors already say at the end of the first paragraph they are accomodating irregularly sampled time-series data, there is no need to say it again immediately after.\n\n3) The language and layout of this work are in a way that does not consider the readers' experience. It assumes that the reader is intimately knowledgeable about both the cited works and acronyms (i.e. knows what VP means and the expression). The authors need to explain in detail the elements that are crucial to what they did.\n\n4) The theorems and corollary are statements followed by either more statements or a description of the terms. At no point are they proven nor do the authors give some sense of why they may hold. If the authors would like to write in such a manner they should look to other works for proper examples. If the authors wish to explain this otherwise these statements still lack explanation and motivation which confuses the reader.\n\n5) The text references many appendices, but they are all missing. Even with appendices, the authors still need to give a brief description of what is happening rather than making a statement, referencing an appendix, and moving forward without providing context.\n\n## Score vs Diffusion models\nThe authors claim that this work is unique and the first of its kind, but fail to make adequate comparisons to previous works using diffusion models. Worse the authors falsely state \n\n> \"Although there exist diffusion-based time-series forecasting and imputation methods, our target score function and its denoising score matching loss definition are totally different from other baselines.\"\n\nto dismiss previous works without citing any of them. In Song et. al.'s work \"SCORE-BASED GENERATIVE MODELING THROUGH STOCHASTIC DIFFERENTIAL EQUATIONS\" they show that diffusion models are score based models with specific expressions of $\\mathbf{f}$ and $g$. Song et. al.'s work is not mentioned in this paper yet it is highly related and disproves various statements including the one above. I can imagine other interpretations of these statements, but again the authors do not follow up with detail about how their results are unique so the reader is left confused. In this light both the above and below statements need modifying since time-series generation using diffusion models does exist.\n\n> \"Despite the previous efforts to generate time-series using GANs and VAEs, according to our survey, there is no research using SGMs for this purpose. Therefore, we extend SGMs into the field of synthesis1.\""
            },
            "questions": {
                "value": "I find this work very interesting, but the presentation of this work is full of vague statements and lacks crucial information. This is ultimately unsuitable for publication. This paper is unable to properly portray the model, theory, and results in a way that others can adequately understand and reproduce this work. Consequently, this paper needs to be drastically changed. I believe that by making the following changes this work can be both exciting and impactful, but in its current state it is difficult to understand and consequently unconvincing.\n\n1) Please address all of the issues and examples I mentioned in the \"weaknesses\" section. Most of these issues are pervasive and extend beyond the examples I gave. Without a drastic change that addresses those issues it is hard to move forward with this work.\n\n2) Be more explicit that this method is not validated on all possible irregularly sampled data, it is only valid for data that is regularly sampled but is missing some measurements. This work only dropped points, but did not add points that are at non-integer spacings of the regular sampling period.\n\n3) The first line under Figure 2 is important to your argument and needs more evidence and explanation to why $\\mathbf{h}_n \\sim \\mathbf{x}_n$.\n\n4) The appendices are missing. Without these appendices, it is very difficult to fully review this work since many of the details exist there.  \n\n5) Some typos\n* In Eq. 5, $\\hat{\\mathbf{x}}_n$ is also an RNN so shouldn't it have the same arguments as $\\mathbf{h}_n$?\n* \"Eq. equation 12\""
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission1733/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1733/Reviewer_Y133",
                    "ICLR.cc/2024/Conference/Submission1733/Senior_Area_Chairs"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1733/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699134902551,
        "cdate": 1699134902551,
        "tmdate": 1701041098856,
        "mdate": 1701041098856,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "KWQC1TJ7mx",
        "forum": "nFG1YmQTqi",
        "replyto": "nFG1YmQTqi",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1733/Reviewer_thaZ"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1733/Reviewer_thaZ"
        ],
        "content": {
            "summary": {
                "value": "This paper proposed TSGM, a score-based generative model (SGM) for synthesizing time series data. The TSGM comprises an encoder-decoder architecture to transform data into the latent space, in which an SGM conducts the generation process. The loss function is derived from the denoising score matching (DSM) widely used in the current SGM. Notably. TSGM demonstrates superior performance when compared to competitors based on Variational Autoencoders (VAEs) and Generative Adversarial Networks (GANs)."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The methodology and experiment are clearly written.\n2. The performance of the proposed TSGM is obvious better than the previous methods in terms of time series generation."
            },
            "weaknesses": {
                "value": "1. The paper introduces TSGM for time series data synthesis. The paper highlights TSGM's superior performance in time series generation compared to VAEs and GANs. However, the paper's weaknesses include a lack of clear justification for the importance of time series generation, a lack of novelty in comparison to existing works, the absence of comprehensive comparisons for forecasting and imputation, and issues related to the clarity of theorems and corollaries.\n\n2. The authors did not clarify why time series generation is significant. The authors mentioned in the introduce that “In many cases, however, time-series samples are incomplete and/or the number of samples is insufficient”, which is served as the motivation for this work. However, for incomplete cases, time series imputation can be used, which has been investigated in the previous works mentioned in the paper, such as TimeGrad and CSDI. For insufficient sample number case, the authors did show whether generation samples can increase the quality or robustness of learning. \n\n3. The proposed method lacks novelty when compared to existing works like TimeGrad and CSDI. In the appendix, the authors differentiate their approach from these existing works by highlighting that TSGM is designed for synthesizing time series data from scratch, while the other works do not offer this capability. However, the authors did not discuss whether these works can be easily extended for generation time series.\n\n4. The experiment part needs to be strengthened. Can the authors compare with these methods in terms of forecast and imputation? forecast and imputation of time series can be considered as conditional generation, which is more challenge and important.\n\n5. The Corollary 3.2 seems useless. The operation of removing the expectation regarding to x^0_{n} is redundant, as in L2 we have taking the expectation regarding to x^0_{1:N}.\n\n6.  The index of theorems and corollaries should be unified."
            },
            "questions": {
                "value": "see weakness"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1733/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699248777089,
        "cdate": 1699248777089,
        "tmdate": 1699636101797,
        "mdate": 1699636101797,
        "license": "CC BY 4.0",
        "version": 2
    }
]