[
    {
        "id": "6gqaUuay3D",
        "forum": "NLRo4qhg6t",
        "replyto": "NLRo4qhg6t",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7673/Reviewer_zZ4B"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7673/Reviewer_zZ4B"
        ],
        "content": {
            "summary": {
                "value": "The proposed HIWE is a grid-baed nerf method, which flexibly allocates more model parameters to important regions. First of all, an important distribution is acquired by either SFM or by manual input. The second step is to generate axis-aligned bounding boxes by weight sampling strategy. Each bbox corresponds to a local grid, where each corner is associated with a feature vector. The third step is to train a grid-based nerf, with the difference that typical grid-based nerf works on a uniform voxel grid, while the HIWE works on a set of bboxes. Experiments demonstrates a good balance between quality and training speed."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. It is plausible to take region importance into consideration when working with nerf. The idea is simple and obviously effective - the scene is represented by a set of bboxes instead of a uniform voxel grid.\n2. The nerf is forced to focus on the bboxes, especially the samller bboxes, which leads to a fast training of 15min."
            },
            "weaknesses": {
                "value": "1. It is questionable to represent the scene with bboxes.\n(a) Indeed the bbox design enables flexible parameter density. However, The proposed bbox generation method is lack of control on the parameter density, i.e., we can't precisely define the parameter density / grid density at a specific region. For example, (i) The bbox centers are sampled from the importance distribution, which means it is likely that there is no bbox ar all for a region with lower (not zero) importance. (ii) In regions of higher importance, there may be lots of overlapping bbox, which is a waste of compute.\n(b) A simple alternative, is to represent the scene with Octree or similar datastructure. With Octree, we can precisely control the tree depth at each region, which the problem of (1a) and (1b). Justification is necessary to clarify why bbox not Octree.\n\n2. The acquisition of importance distribution is non-trivial. \n(a) The user have to reconstruct the scene first so that the important region can be manually defined, which becomes a chicken-and-egg problem. \n(b) Although the author proposed the \"normalized density of the SFM point cloud\", but that may not work in real world. SFM keypoints are usually on texture-rich regions, but \"texture-rich\" is NOT necessarily more important. \n(c) The 15min training time probably does not include the generation process of the importance distribution, which seems to be unfair.\n\n3. Inadequate experiment.\n(a) There are only 2 baselines, nerfacto and TensorRG, while there are lots of other grid-based nerf method.\n(b) In Table 1, the LPIPS metric is worse than baselines. However, LPIPS is usually more important than SSIM and PSNR, because SSIM and PNSR is just a metric on the statistics over the color distribution, while LPIPS is more capable of modeling the similarity of visual perception.\n(c) Training time of baselines are not presented. Although the proposed method is trined with only 30K iterations, it does not necessarily mean it is fast, because Section 3.5 Indexing of Bounding Boxes can be slow. This is related to Weakness 1 - why not Octree?"
            },
            "questions": {
                "value": "See weakness. Additionally, the proposed method is lack of novelty. The core idea is to represent the scene with bboxes, which is a marginal improvement over grid-based nerf methods."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7673/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698733135261,
        "cdate": 1698733135261,
        "tmdate": 1699636933678,
        "mdate": 1699636933678,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "mzWTAm6zvM",
        "forum": "NLRo4qhg6t",
        "replyto": "NLRo4qhg6t",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7673/Reviewer_8RFz"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7673/Reviewer_8RFz"
        ],
        "content": {
            "summary": {
                "value": "This work investigates the importance weights of different regions and focuses on more important regions for NeRF optimization. They propose a new grid-based positional encoding to accelerate training."
            },
            "soundness": {
                "value": "1 poor"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The paper first raises an observation of NeRF optimization at different levels of granularity and proposes a method using hierarchical bounding boxes to compose importance factors of different regions. I agree the intuition is reasonable to assign an importance region in a scene but I have different opinions on how this work design regions of importance."
            },
            "weaknesses": {
                "value": "1. Since HIWE assigns a fixed N^3 voxel grid for each object, the importance strategy may deal with each object with the same level of complexity regardless of whether it is big or small objects. The sentence \"Regions with less desired importance can thus be encoded by larger bounding boxes\" indicates larger objects are coarser. However, larger objects may also include higher complexity such as a building with textural exterior appearances or a large statue. I think the intuition behind, locating different importance regions, sounds reasonable, but the strategy here may only benefit scenes with small and delicate objects and large repetitive background. All the demonstrated results fall into this category.     \n\n2. One of the advantages is to save computation for repetitive textured regions. The detector seems to allow highly overlapping bbox, and there might be larger computation overhead to optimize voxels in repetitive space. For example, in Fig. 2 the repetitive boxes on pipes may cause large overhead.\n\n3. The work thinks repetitive background regions are not that important, but those details actually matter for visual quality. I personally wouldn't think Fig. 5's blurriness on grass or this kind of repetitive region is non-important.\n\n4. All the PSNR and SSIM in Table 1 are incredibly low. PSNR < 20 seems not yet converged and can only show very blurred images. The experiments are not convincing at all.\n\n5. Including more results on standard NeRF datasets with video on multi-view can show its applicability on different scenes."
            },
            "questions": {
                "value": "See Weakness"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "1: strong reject"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission7673/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7673/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7673/Reviewer_8RFz"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7673/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698785831056,
        "cdate": 1698785831056,
        "tmdate": 1699636933532,
        "mdate": 1699636933532,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "tQLyMVoYDQ",
        "forum": "NLRo4qhg6t",
        "replyto": "NLRo4qhg6t",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7673/Reviewer_BBC4"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7673/Reviewer_BBC4"
        ],
        "content": {
            "summary": {
                "value": "In this paper, the authors propose a novel grid definition to improve the performance of instant-NGP like methods on very large scene. Instead of using a uniform grid like in instant-NGP, the authors propose to derive overlapping grids sampled in regions of importance (using two possible definitions of importance, either user defined with a Gaussian density or defined according to the initial density estimated from structure-from-mention). This is then used to model large scenes acquired using drones."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "1 poor"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "Being able to render accurately large regions is extremely important. Being able to do so in a few minutes is even more so. The proposed method aims to solve both these problems at once and as such could have a strong practical impact."
            },
            "weaknesses": {
                "value": "It seems that the related work section is all over the place, even talking about compression techniques for NeRFs. This is a problem because the author don't discuss important related work and especially those that consider smart voxels structures. From the top of my head {1} and related methods adapt the concept of voxels to have a better splitting of the space using octrees for example. It is therefore very important to compare these very related ideas and explain why the overlapping grids proposed here is more appropriate than these size adaptive voxels decomposition. Note that some of these methods, like DVGO {2} or its improved version are also quite fast so could warrant an experimental comparison as well. Another related paper, thus more recent, is {3}.\n\nThe importance weighted pixel sampler is not clear in my opinion. The per pixel importance depends on the output of nerf (dependency on $T$, therefore a dependency on $\\sigma$ and $t_0$). When is it then computed? Does it requires a first \"importance generation\" before the actual training step everytime? Or every couple of steps? Wouldn't that be counter productive since it would improve heavily the computational cost. This part should be clarified. I mention here a potential typo \"the pixel's importance is proportional to the volume of the ...\" should be \"inversely proportional\".\n\nThe impact of the importance sampling step is not clear to me. The authors mention the case of single Gaussian to define a region of interest. I'm confused why the proposed scheme would be more interesting than a NeRF 360 that focuses on the region of interest. Indeed, the content of the highlighted region would be well reconstructed while the rest would be projected into the background. In my opinion this case should therefore be considered in the experimental section (or clearly justified inside the paper).Similarly, I think that the reasoning behind the second sampling should detailed.\n\nI also find the presentation of the results is quire poor. First, I would expect averages and highlighting of the best results in Tables to help the reader understand the best methods. I also don't think that a table is best way of presenting the results. In my opinion, a better way of visualizing the results would have been with convergence plots (for example PSNR vs training iters) instead of choosing a specific stop moment. Indeed, given how close the results are between the methods, it would make it possible to better compare the methods: maybe one achieve its final regime much more quickly than the others, for example with a couple more iterations one method will drastically improve while the other would stagnate. I expected comparisons with more relevant methods as well. Indeed, the method comapres itself to three different sizes of the nerfacto model and TensoRF. Where are the more appropriate methods (with some mentioned in the related section actually)? In particular, one could list zip-nerf or tiling the scene with multiple instant-NGP networks. It is not clear either what nerfacto model was used for Fig. 4.\n\nI would have also expected a more indepth analysis of the additional properties of the methods. Indeed, the proposed method is clearly outperformed in Table 2 but the authors downplay this results by explaining that the rendering technique is limited (one could point out that the \"first intersection\" hypothesis of the method is also quite restricting) but no such examples are shown. This also mention that surface representation is more challenging, except that no results are shown with proposed method showing that surface representation is indeed good and usable. \n\n{1} Yu, A., Li, R., Tancik, M., Li, H., Ng, R., & Kanazawa, A. (2021). Plenoctrees for real-time rendering of neural radiance fields. In Proceedings of the IEEE/CVF International Conference on Computer Vision (pp. 5752-5761).\n\n{2} Sun, C., Sun, M., & Chen, H. T. (2022). Direct voxel grid optimization: Super-fast convergence for radiance fields reconstruction. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (pp. 5459-5469).\n\n{3} Kulhanek, J., & Sattler, T. (2023) Tetra-NeRF: Representing Neural Radiance Fields Using Tetrahedra.  In Proceedings of the IEEE/CVF International Conference on Computer Vision (ICCV)  (pp. 18458-18469)"
            },
            "questions": {
                "value": "See the different remarks in \"Weaknesses\"."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission7673/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7673/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7673/Reviewer_BBC4"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7673/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698840266360,
        "cdate": 1698840266360,
        "tmdate": 1699636933356,
        "mdate": 1699636933356,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "7sJJhtI435",
        "forum": "NLRo4qhg6t",
        "replyto": "NLRo4qhg6t",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7673/Reviewer_etAT"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7673/Reviewer_etAT"
        ],
        "content": {
            "summary": {
                "value": "This work, HIWE, tackles novel-view synthesis task for large scale scenes. HIWE alloclates voxel grids using bounding volume hierarchy. The hierarchy structure is generated ahead of the optimization by using SfM sparse point cloud or user interaction. As a result, the model is much smaller, training faster, and show comparable quantitative results."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The method of allocating more model capacity to the more complex scene part is straightforward and making senses."
            },
            "weaknesses": {
                "value": "The bounding box allocation is decide ahead of the optimization and rely heavily on SfM solver. In case that SfM fails to recover point cloud such as reflective, translucent, or scene part that is complex but observed by few views, the proposed method can't adaptively allocate more resorce for it. I think this is one of the reason that the results are much worse than the discussed 3D gaussian splatting in Sec4.4 as 3DGS adaptively growth and prune the primitives.\n\nMissing discussion of some primitive primivie mixure methods:\n- [Mixture of Volumetric Primitives for Efficient Neural Rendering, LOMBARDI et al., ToG 2021]\n- [Progressively Optimized Local Radiance Fields for Robust View Synthesis, Meuleman et al., CVPR 2023]"
            },
            "questions": {
                "value": "1. The implementation of fast ray-bounding volume hierarchy intersection is claimed to be one of the main contruction (Sec.1 last paragraph). The algorithm is already implementmented by the used package optix or embree, so what would be the new merit by this work?\n2. How to ensure bounding volume coverage for textureless region (e.g., sky in Fig4) which SfM may not produce points?\n3. What would be the upper limited of current NeRF-based SOTA on the tested dataset? As discussed in Sec4.4, 3D gaussian splatting can achieve superior results on the tested dataset but could still have some limitation due to rasterization, it would also be good to know the current best results of large scene NeRF discussed in Sec.2.\n4. Paper proofread:\n    - The number results of the `pipes1' scene in Table 1 and 2 are not consistent.\n    - Ths SSIM of `tower2' is incorrectly highlighted (0.46 is highlighted but 0.55 is better).\n    - Duplicated \"requiring\" in the last sentence of Sec1."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7673/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698905135804,
        "cdate": 1698905135804,
        "tmdate": 1699636933237,
        "mdate": 1699636933237,
        "license": "CC BY 4.0",
        "version": 2
    }
]