[
    {
        "id": "uSLhDuA2W1",
        "forum": "nrctFaenIZ",
        "replyto": "nrctFaenIZ",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5973/Reviewer_su5x"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5973/Reviewer_su5x"
        ],
        "content": {
            "summary": {
                "value": "This paper addresses an intriguing issue in the domain of distributed optimization algorithms. Conventionally, in these algorithms, clients need to have periodic communication and each client performs an equal number of local training steps per communication round. The authors question this norm, pointing out that some clients might face more complex data or difficult problems, potentially necessitating more local training. \n\nThe paper introduces a novel algorithm, GradSkip, which realizes this intuition. The authors also provides a clear mathematical analysis and proof. The paper demonstrates that the number of local gradient steps can be reduced relative to the local condition number without undermining the communication complexity. Furthermore, the paper extends its discussion to include other scenarios like variance reduction and gradient compression, leading to the development of GradSkip+."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. The paper uncovers a notable conclusion that clients with simpler data or problems might require fewer local training steps, a concept not widely addressed in current literature.\n\n2. The authors support their findings with stringent and well-articulated mathematical proofs, enhancing the credibility and academic rigor of their work.\n\n3. The analysis provided is detailed and easy to follow, making the complex concepts accessible to readers.\n\n4. Introduction of unbiased compression operators is a significant technical innovation. This concept broadens the scope for a range of new algorithms, marking a substantial contribution to the field.\n\n5. The paper succeeds in providing a comprehensive framework that not only encompasses many known algorithms (ProxGD, ProxSkip, RandProx-FB) but also suggests the potential for several unknown algorithms through its unbiased compression operator."
            },
            "weaknesses": {
                "value": "One minor critique is that the paper's theoretical bounds are not tight in constant terms."
            },
            "questions": {
                "value": "Even though I acknowledges the theoretical contributions of this work, I have a question regarding its practical relevance. Specifically, how severe the issue of statistical heterogeneity is in machine learning? How large is the divergence of curvatures among clients? This question is related to the significance of GradSkip algorithm (and potentially any following works) in real-world scenarios."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5973/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698617667159,
        "cdate": 1698617667159,
        "tmdate": 1699636638294,
        "mdate": 1699636638294,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "f8vHya43Aj",
        "forum": "nrctFaenIZ",
        "replyto": "nrctFaenIZ",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5973/Reviewer_NZhx"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5973/Reviewer_NZhx"
        ],
        "content": {
            "summary": {
                "value": "This work proposes a new local gradient-type method for distributed optimization with communication and computation constraints. The proposed method inherits the same accelerated communication complexity from ProxSkip while further improving computational complexity. And two variants of the proposed method, i.e., GradSkip+ and VR-GradSkip+ are proposed."
            },
            "soundness": {
                "value": "1 poor"
            },
            "presentation": {
                "value": "1 poor"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "1. A new local gradient-type method for distributed optimization with communication and computation constraints is proposed in this work, which is the extension of the ProxSkip method. The proposed method inherits the same accelerated communication complexity from ProxSkip while further improving computational complexity.\n\n2. And two variants of the proposed method, i.e., GradSkip+ and VR-GradSkip+ are proposed."
            },
            "weaknesses": {
                "value": "1. The assumption that functions $f_i(x)$ are strongly convex is too strong since many functions will not satisfy this assumption when utilizing neural networks.\n\n2. Lack of theoretical analysis of the communication complexity of the proposed method. In distributed optimization, communication complexity is crucial for minimizing inter-node communication to enhance system efficiency and reduce communication costs.\n\n3. The experimental results are limited, the authors should conduct more experiments to verify the performance of the proposed method.\n\n4. The writing of this work is poor. I can't find the Conclusion section. And the summary of contributions is excessively lengthy.\n\n5. There are lots of mistakes in this work, for example, \n\n``Appendix ??'',\n\n ``see Algorithm ?? in the Appendix'', \n\n`` (see Appendix)''"
            },
            "questions": {
                "value": "Please see the weakness above."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5973/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5973/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5973/Reviewer_NZhx"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5973/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698742719924,
        "cdate": 1698742719924,
        "tmdate": 1700658859634,
        "mdate": 1700658859634,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "zz7FOsUgbd",
        "forum": "nrctFaenIZ",
        "replyto": "nrctFaenIZ",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5973/Reviewer_8o1X"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5973/Reviewer_8o1X"
        ],
        "content": {
            "summary": {
                "value": "The paper proposes Gradskip for solving federated optimization problems with smooth strongly convex objective. Gradskip improves local gradient computation complexity and achieves the optimal communication complexity. The paper further extends the idea of Gradskip to propose Gradskip+ and VR-Gradskip+, which covers a wider range of application."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The proposed Gradskip method and its extensions modify Scaffnew by allowing skipping local gradient computation and improve the local gradient computation complexity to $O(\\min(\\sqrt{\\kappa_{\\max}},\\kappa_i)\\log(1/\\epsilon))$ from $O(\\sqrt{\\kappa_{\\max}}\\log(1/\\epsilon))$, while still achieving the optimal communication complexity $\\sqrt{\\kappa}\\log(1/\\epsilon)$. I suggest the authors summarize their results and existing work in table.\n2. Allowing skipping gradient computation is helpful to address system heterogeneity as slow clients can compute less in a communication round."
            },
            "weaknesses": {
                "value": "1. The novelty of this paper looks somewhat limited. The novelty and main contribution is that Gradskip doesn't always compute local gradient and thus requires $O(\\min(\\sqrt{\\kappa_{\\max}},\\kappa_i)\\log(1/\\epsilon))$ proposes Gradskip, instead of $O(\\sqrt{\\kappa_{\\max}}\\log(1/\\epsilon))$. However, the framework and analysis of proposed Gradskip is similar to Scaffnew.\n2. The improvement on computational cost heavily depends on the values of $q_i$, which rely on $\\kappa_i$. However, Remark 3.3 says GradSkip addresses heterogeneity by assigning $q_i$ to clients in accordance with their local computational resources. It is unclear how to connect $\\kappa_i$ to the local computational resources.\n3. Can Gradskip also make improvement on computation time over Scaffnew? What is the time cost for computing gradient in each iteration?"
            },
            "questions": {
                "value": "see the section of weaknesses"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5973/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699010987047,
        "cdate": 1699010987047,
        "tmdate": 1699636638043,
        "mdate": 1699636638043,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "z6UCFh96Kx",
        "forum": "nrctFaenIZ",
        "replyto": "nrctFaenIZ",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5973/Reviewer_ENdC"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5973/Reviewer_ENdC"
        ],
        "content": {
            "summary": {
                "value": "Built upon ProxSkip, authors proposed GradSkip (and variants GradSkip+) algorithms by incorporating new randomness with each client. The proposed algorithm attains better computation complexity compared to existing works."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The key novelty lies in the newly introduced client-wise randomness, which induces fake local steps and less local steps (Lemma 3.1 and 3.2), the idea is elegant.\n2. Better computation complexity."
            },
            "weaknesses": {
                "value": "1. Compared to ProxSkip (Mishchenko et al. (2022)), the algorithm here requires finer structure information from the devices, i.e., individualized function smoothness parameters, while ProxSkip only requires a global smoothness parameter. And all clients are required to coordinate in advance to know the global information $\\kappa_{\\max}$, which may be a bit unrealistic.\n2. According to Theorem 3.6, the client gradient query number is improved from $\\sqrt{\\kappa_{\\max}}$ to $\\min(\\kappa_i, \\sqrt{\\kappa_{\\max}})$, while the iteration and communication complexity does not change, the claimed $O(n)$ superiority only appears in scenarios where the devices are very unbalanced (most of them have small $\\kappa$, while few of them attain very large $\\kappa$. As mentioned in your experiments, only one ill-conditioned device), I may view such scenarios to be relatively rare in real world (or it is better if authors can rationalize it). If so the derived improvement seems to be a little bit weak.\n3. As far as I understand, the proof heavily relies on the proof of ProxSkip, which restricts the significance of the contribution a bit.\n\nTo summarize, I think the algorithm is an interesting extension of ProxSkip with an elegant modification, while I concern that the improvement may be a bit marginal to cross the bar. Please definitely indicate if I misunderstood any points. Thank you very much for your efforts."
            },
            "questions": {
                "value": "1. In Assumption 3.4, why not extend each $f_i$ to attain a personalized strong convexity parameter $\\mu_i$? I think it should be expected.\n2. As a separate question, compared to communication complexity, whether improving individual computation complexity is an important question to the FL community, I expect that such improvement should be attractive to marginalized devices."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5973/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699408828322,
        "cdate": 1699408828322,
        "tmdate": 1699636637932,
        "mdate": 1699636637932,
        "license": "CC BY 4.0",
        "version": 2
    }
]