[
    {
        "id": "GvXu8chgAV",
        "forum": "o1RqSVIf3c",
        "replyto": "o1RqSVIf3c",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4706/Reviewer_yvPj"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4706/Reviewer_yvPj"
        ],
        "content": {
            "summary": {
                "value": "The paper presents Bayesian PR, a method to generate prefactual recommendations by learning a personalized cost function by collecting pairwise feedback from a user. These recommendations lie in the algorithmic recourse field since they give actionable feedback to a user to overturn the prediction of a machine learning model. The authors provide a Bayesian framework to learn a posterior distribution given the user feedback, by looking at the mutual information. Lastly, this method is incorporated in a graph-based recourse method, that is evaluated on real-world datasets."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "The paper explains the problem clearly and concisely, motivating the various methodological choices. It is also quite understandable and grounded in theory. The problem itself is very interesting and I think it has significant implications for the algorithmic recourse literature."
            },
            "weaknesses": {
                "value": "I think this paper fails to discuss and compare some important baselines, and this diminishes the novelty and soundness of the approach. [1] tries to give personalized recourse options by learning a cost function from experts, which would provide a strong baseline to begin with. Secondly, [2] provides a Bayesian framework for learning personalized cost functions for algorithmic recourse, via pairwise queries, robust to user uncertainty. \n\nMore specifically, it is not clear to me the advantage or the originality of the proposed Bayesian PR over the method in [2], which is cited by the authors in the paper, but not discussed anywhere in the main manuscript.\n\nThe same concerns apply to the experimental section. I believe [1] and [2] are closely related baselines which the authors should consider testing against.\n\n[1] Rawal & Lakkaraju. \"Beyond individualized recourse: Interpretable and interactive summaries of actionable recourses.\" NeurIPS (2020)\n\n[2] De Toni et al. “Personalized Algorithmic Recourse with Preference Elicitation”, arXiv preprint arXiv:2205.13743 (2022)"
            },
            "questions": {
                "value": "- What is the difference between the proposed Bayesian PR and the method proposed in [2]? After a closer look, they are closely related and I would appreciate hearing how the proposed approach differs from the one presented in [2]."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4706/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698680449337,
        "cdate": 1698680449337,
        "tmdate": 1699636452425,
        "mdate": 1699636452425,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "dRnPbK41Tl",
        "forum": "o1RqSVIf3c",
        "replyto": "o1RqSVIf3c",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4706/Reviewer_tJ3D"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4706/Reviewer_tJ3D"
        ],
        "content": {
            "summary": {
                "value": "In recourse recommendation the system suggests a sequence of feature realizations that leads from a negative classification to a positive one. Each step in the sequence is associated with personalized cost. The goal of the agent is to learn the user's cost (preferences) while simultaneously directing them to a positive state, incurring minimal overall cost on the way.\nThis paper proposes an approach for recourse recommendation which uses Bayesian preference elicitation for learning the user's preferences. An approximate procedure for transition selection is presented as well as an approximate posterior update. Numerical results on a few datasets are included."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "* Personalized recourse recommendation is an interesting problem\n* A Bayesian preference elicitation approach to personalization is plausible\n* The paper is clearly written and I did not find any errors in the derivations"
            },
            "weaknesses": {
                "value": "* Missing complexity analysis\n* Missing comparison to sampling and evaluation of approximation quality\n* Some technical issues (eg, kappa goes to inf)"
            },
            "questions": {
                "value": "* Theorem 3.2 assumes that kappa goes to infinity which corresponds to noiseless responses.\n  * How to understand Eq (3) (and the rest of section 4) with kappa=inf?\n  * Also, the link function is approximated by a linear function (section 4.1), so how would that work when kappa=inf?\n  * May be good to show empirically how this assumption affects the results vs using final kappa.\n* There are several layers of approximation (eg, kappa=inf, approximating sigmoid with a linear function, finite iterations for the projection in Alg 1), it would be helpful to clearly state all of them in a single place before giving all the details. It may also be helpful to do some ablation studies and see how each level of approximation affects the overall performance.\n* How does sampling compare to the analytical solution?\n  * A comparison to sampling is missing from the experiments. This is important for validating the quality of the approximate analytical solution as well as the computational efficiency claims.\n* Complexity:\n  * It would be good to state the overall complexity of: pair choice, posterior update, and recourse generation\n  * Solving an optimization problem for each possible value of m (|m_{t-1}-d| values) seems expensive\n  * Comparing N^2 pairs each turn seems expensive\n  * Problem 7b is an integer linear program, which is NP-hard in general, so the statement about the solution being computationally efficient seem exaggerated (especially with no detailed complexity analysis). It should be at least possible to show empirically which problem sizes can be handled and at what cost.\n* Choice of x points:\n  * Does it make sense to consider negative-negative pairs? Or choosing unlabeled points for comparison? It would be good to justify the positive-positive choice.\n  * The graph-based approach of section 5  considers only transitions between points from the training data, but it may be possible to transition to new points not in the data (possibly unrealizable). Can such transitions be accommodated in your framework? If we have access to the classifier we can know the label of any point.\n  * What are typical path lengths in the experiments?\n* Section 6.1:\n  * What is the dimension d?\n  * The model seems rather small (90 neurons in 3 MLP layers)\n  * What is the justification for the choice \\tau\\kappa=1?\n\nMinor/Typos:\n==========\n* Eq (2): I could not find b\n* Eq (3): nit - missing “(“ for R_ij\n* Why not define z_i and z_j earlier and simplify notation, for example in \\sigma_i and \\sigma_j, and in M_ij?\n* Showing validity results in Tables 1 and 2 (and 4 and 5) seems redundant since they are always 1. This can be stated once in the text. Also, x_r is chosen such that it returns a positive prediction, so it is not clear when that would not be the case.\n* Section 6.3: “consistent decrease as the number of questions increases” is a bit overstated, it seems that in most plots the rank increases initially before decreasing."
            },
            "flag_for_ethics_review": {
                "value": [
                    "Yes, Research integrity issues (e.g., plagiarism, dual submission)"
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "details_of_ethics_concerns": {
                "value": "There is a significant overlap with submission 8776."
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4706/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698687126783,
        "cdate": 1698687126783,
        "tmdate": 1699636452326,
        "mdate": 1699636452326,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "hTdlP3ILMV",
        "forum": "o1RqSVIf3c",
        "replyto": "o1RqSVIf3c",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4706/Reviewer_iStc"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4706/Reviewer_iStc"
        ],
        "content": {
            "summary": {
                "value": "An approach for personalized algorithmic recourse based on Bayesian\npreference elicitation. The apprach selects queries to the user that\nmaximize mutual information between the response and the cost\nfunction, and provides an efficient solution to choose queries and\ncompute the posterior of the cost distribution."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "A solid work presenting a methodologically sound and novel solution to\nbayesian preference elicitation of cost functions, complemented with\nan efficient implementation.\n\nThe manuscript is complemented with an extensive supplementary section\ndetailing proofs, extensions from pairwise to listwise comparisons,\nand additional experimental results."
            },
            "weaknesses": {
                "value": "From an algorithmic recourse perspective, the approach builds on the\nFACE algorithm, that achieves recourse by selecting a\nrecourse-achieving instance from the training set. This can be badly\nsuboptimal for users that are not similar enough to any specific\ntraining user. While experimental results in the appendix indicate\ncompetitive results with some alternatives using different strategies,\nthis limitation should be mentioned in the main paper. As far as I\nunderstand, this limitation is not due to the proposed Bayesian\napproach, but rather to the recourse strategy employed, so that\nadapting the approach to deal with other recourse strategies could\nfurther strenghten the contribution.\n\nThere is a recent research line in the algorithmic recourse community\nthat advocates the need for a causal perspective in algorithmic\nrecourse, where the effect on a action on causally dependent features\nof the user state is accounted for.  Karimi et al. \"(Algorithmic\nRecourse: from Counterfactual Explanations to Interventions\", 2020)\ndemonstrated that optimal algorithmic recourse cannot be achieved if\nthis causal perspective is ignored. This aspect is ignored in the\nmanuscript, making the overall approach (which is perfectly fine for\ngeneric personalized recommendations) less appealing in the\nalgorithmic recourse context."
            },
            "questions": {
                "value": "Can the approach be adapted to work with recourse strategies that generalize beyond training examples?\n\n\nCan you comment on the impact of the lack of a causal perspective on recourse achievement and cost minimization?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4706/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698692796356,
        "cdate": 1698692796356,
        "tmdate": 1699636452246,
        "mdate": 1699636452246,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "dhkjo7En96",
        "forum": "o1RqSVIf3c",
        "replyto": "o1RqSVIf3c",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4706/Reviewer_mLqk"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4706/Reviewer_mLqk"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes the so-called Prefactual Recommendation by Bayesian Preference Elicitation algorithm for personalized recommendation."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "1 poor"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "Personalized recommendation is an important question in the field of learning to rank."
            },
            "weaknesses": {
                "value": "1. Presentation is poor (see my questions below)\n2. The paper focuses on binary class only, which constraints the application of this algorithm\n3. No significant improvement in comparison with the baseline.\n4. The theoretical analysis may not be enough (see my questions below)"
            },
            "questions": {
                "value": "------------------------- For Presentation -------------------------\n\n1. It's not clear enough why this paper applies Mahalanobis distance is selected. Why does this distance make sense to serve as the cost function? How is it compared with many other distance functions and other cost functions?\n\n2. The main message of the main theorem of this paper is hard to follow. In (2) of Theorem 3.2, I don't believe any author could easily figure out the asymptotic manner of this probability (either it's a constant, close to 0, or close to 1?). \n\n3. Following 2, the complexity of the proposed algorithm is unclear and there is no analysis on how many samples (how large $M$) are needed for the algorithm.\n\n4. It's not clear what is the difference between the proposed algorithm with FACE. Does FACE also use shortest path? If so, what's their cost?\n\n------------------------- For Experiments -------------------------\n\n1. I don't think the proposed algorithm is better than the baselines because it has almost the same cost as FACE if using $\\ell_1$ as the true cost. The improvement in Mahalanobis distance as the true cost is not compatible because this is the same distance used in the algorithm and to some extent, the algorithm cracks the ground truth.\n\n 2. Why the baselines are not compared in Section 6.3?\n\n3. (Minor) I suggest moving other baselines (Appendix D.2) to the main text.\n\n\n------------------------- For Theoretical Analysis -------------------------\n\n1. The complexity analysis of the whole proposed algorithm is missing or lacks discussion.\n\n2. (Minor) Asymptotic mutual information is missing citation."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4706/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699130576959,
        "cdate": 1699130576959,
        "tmdate": 1699636452165,
        "mdate": 1699636452165,
        "license": "CC BY 4.0",
        "version": 2
    }
]