[
    {
        "id": "Ob0vpFWuaJ",
        "forum": "o4XNuQ5qft",
        "replyto": "o4XNuQ5qft",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4496/Reviewer_WtMt"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4496/Reviewer_WtMt"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a method called optimum shifting (OS) to modify the parameters of a neural network from one point to a flatter one while keeping the training loss unchanged. It minimizes the Frobenius norm of the weight in the final fully connected layer of a neural network without changing the output of the final layer for given training data. Further, a stochastic version (SOS) is proposed to reduce the computational costs and provide more degrees of freedom for optimum shifting. Experiments show the proposed method improves the generalization ability on different vision tasks."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. This paper has a good motivation.\n2. SOS is efficient and compatible with traditional regularization techniques."
            },
            "weaknesses": {
                "value": "This paper considers to modify the parameters of a neural network from one point to a flatter one while keeping the training loss unchanged for some training data. However, the specific implementation of this idea in this paper is very limited. Therefore, I think the current manuscript is not ready for publication.\n\n1. This paper is not very clear due to the inconsistent meanings of symbols and the incomplete description of experimental settings.\n2. The idea is not good enough. The implementation of the concept of optimum shifting is very limited."
            },
            "questions": {
                "value": "1. Theorem results in section 3.2 are very monotonous. Four theorems say almost the same things.\n2. The role of gaussian elimination used in SOS is not clear. In fact, I cannot understand why the rows in input matrix A need to be independent.\n3. Hessian Analysis for section 5.2 is missing."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4496/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698413501596,
        "cdate": 1698413501596,
        "tmdate": 1699636425768,
        "mdate": 1699636425768,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "GzWH20bhA8",
        "forum": "o4XNuQ5qft",
        "replyto": "o4XNuQ5qft",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4496/Reviewer_KEY9"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4496/Reviewer_KEY9"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a novel technique to change a trained neural network's parameters to a flat loss-landscape region without changing the training loss of the network, which is termed optimal shifting. The main idea is to treat the parameter of a neural network as a linear system and then minimize the trace of its Hessian. To overcome the computational challenge, i.e., the complete estimation of the Hessian matrix required for the whole training dataset, the author proposed an online optimization method motivated by the Stochastic Gradient Descent, where the author use a small batch of data to calculate the optimal shifting. Extensive experiments are conducted on different network architecture and computer vision tasks to demonstrate the effectiveness of the proposed method in improving the generalization of neural networks."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. Overall, the paper is very well written, with a clear demonstration of the main idea, and flows well in presenting the technical details. \n2. The perspective of viewing the parameters of a neural network as a linear system is refreshing, though it is not a ground-breaking idea. The proposed method is sound by connecting the flatness with the Hessian and also by providing the theoretical justification for minimizing the Frobenius norm of the weight in the final linear layer that can minimize the trace of the Hessian.\n3. The computational challenge is valid and significant, and it is good to see the author provide a very clean summary of the technical challenges for the reader to appreciate the contribution of the present work. The proposed Stochastic Optimum Shifting (SOS) seems very natural to deal with the issue, and it is interesting to see the author bridge the connection between Neural Collapse theory to provide an intuitive justification for the SOS.\n4. The extensive experimental results on different datasets and network architecture provide a comprehensive demonstration of the proposed method."
            },
            "weaknesses": {
                "value": "1. In the introduction, the author claimed that:\n\n\"Assume that the rows in $A$ are independent without loss of generality, the equation $Ax=b$ is under-determined if $m<n$ and has infinite solutions for $v$.\"\n\nThe author should provide a more explicit explanation about how we can formally guarantee independence when $A$ is a neural network since, at least it is not very intuitive to the reviewer. \n\n2. The author considers the neural network a linear system, which is fine for the linear layers in the neural network when we omit the non-linear activation function. However, as modeled in Equation (3), the neural network is a stack of linear layers with corresponding nonlinear activation functions. How will the exact choice of the nonlinear activation function have an impact on the theoretical results?\n\n3. From Tables 1 and 2 we can observe that the SOS performs the best when it integrates with the Mixup. Can the author provide any interpretation and reasoning about this phenomenon? Why the basic training strategy can not bring sufficient benefit for the proposed method?\n\n4. The improvement in the object detection task in Table 4 is too marginal. It is better for the author to include the mean and std for this table and also for other tables."
            },
            "questions": {
                "value": "Please refer to the Weaknesses section for more details."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4496/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4496/Reviewer_KEY9",
                    "ICLR.cc/2024/Conference/Submission4496/Senior_Area_Chairs"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4496/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698642308538,
        "cdate": 1698642308538,
        "tmdate": 1700351879611,
        "mdate": 1700351879611,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "s0zAEeTAIb",
        "forum": "o4XNuQ5qft",
        "replyto": "o4XNuQ5qft",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4496/Reviewer_urCd"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4496/Reviewer_urCd"
        ],
        "content": {
            "summary": {
                "value": "This paper introduces optimum shifting (OS) to change the parameters of a neural network from sharper minima to a flatter one, while maintaining the same training loss. The authors prove that the minima got by their method is actually flatter than the original one. Furthermore they introduce a stochastic optimum shifting (SOS) utilizing neural collapse theory for practical implementations, which reduces computational costs and provide more degrees of freedom for optimum shifting."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The paper is clearly written and the idea is easy to follow. \n\nThe proposed OS method is easy to understand and easy to implement.\n\nThe SOS technique seems to bring improvement to multiple tasks."
            },
            "weaknesses": {
                "value": "1. The SOS which uses batched data instead of whole dataset for training relies on the neural collapse phenomenon, but neural collapse just happen in the terminal phase of training.  This means before the stage of getting 0 training error, the rely on neural collapse is not valid. Hence the assumption that \"if the loss of 100 images remains unchanged ... the loss of the entire dataset will also remain nearly unchanged\" will not hold for the stage of training before 0 error.\n\n2. The empirical results are only on image tasks and this makes the claim of improvement by SOS not very convincing."
            },
            "questions": {
                "value": "Could you share your thoughts regarding weakness 1 (see above)?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4496/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698800563512,
        "cdate": 1698800563512,
        "tmdate": 1699636425621,
        "mdate": 1699636425621,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "tMf32JbIeV",
        "forum": "o4XNuQ5qft",
        "replyto": "o4XNuQ5qft",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4496/Reviewer_DgxS"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4496/Reviewer_DgxS"
        ],
        "content": {
            "summary": {
                "value": "Authors proposed an efficient method to improve the generalization of trained DNN models via stochastic optimum shifting on a small sample set leveraging neural collapse."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "Authors provided thorough proof on the theorems. This method seems to have marginal improvements over benchmark results using a small set of data to improve generalization. If there is a use case for this, it's a promising experiment."
            },
            "weaknesses": {
                "value": "As the authors mentioned. \"there always exist models with good generalization but with arbitrarily large sharpness\". I question the contribution made here is significant enough."
            },
            "questions": {
                "value": "why focus on generalization techniques after model is trained and not on producing a flatter minima during training. I think this is good after the fact but the effort is better spent on how to improve generalization during training."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4496/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698815031553,
        "cdate": 1698815031553,
        "tmdate": 1699636425463,
        "mdate": 1699636425463,
        "license": "CC BY 4.0",
        "version": 2
    }
]