[
    {
        "id": "LsJCnj0NRj",
        "forum": "OF5x1dzWSS",
        "replyto": "OF5x1dzWSS",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8556/Reviewer_6nnk"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8556/Reviewer_6nnk"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a novel framework called Doubly Robust Instance-Reweighted Adversarial Training to address the issues of heuristics and non-uniform robust performance in adversarial training. The approach utilizes distributionally robust optimization techniques to obtain importance weights and boost robustness on vulnerable examples. The experiments show that the proposed method outperforms state-of-the-arts on standard classification datasets."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. The proposed framework addresses the issues of heuristics and non-uniform robust performance in adversarial training. The authors use a doubly robust optimization (DRO) approach that is theoretically grounded. It provides a principled way to reweight the training examples based on their vulnerability to adversarial attacks. \n\n2. Even the algorithm falls under the category of iteratively-reweighted adversarial attack, this paper has a more principled optimization formulation than previous works because its DRO approach combines two different models to estimate the importance weights of each training example, and to estimate the importance weights, which is more robust to model misspecification and can handle a wider range of distributional shifts compared to traditional optimization methods. The obtained weights are optimal for the DRO optimization problem defined in Eq. 5 (with the closed-form exact solution for the weights), rather than being ad-hoc picked. This is the most important difference form previous instance-wise or iterative attacks.\n\n3. The bilevel optimization formulation of AT gives one the flexibility to separately design the inner and outer level objectives. This enables the authors to independently construct a new outer level objective that also solves for the instance weights w, and an inner level objective for regularized attack. This flexibility allows for a more generic and powerful framework than the traditional AT formulation, which is limited to a single objective function.\n\n4. The proposed method outperforms several state-of-the-art baselines on standard classification datasets, in terms of robustness against multiple adversarial attacks. They also show that their method can improve the robustness of the weakest (worst-case) data points, which is an important property for real-world applications."
            },
            "weaknesses": {
                "value": "Since the algorithm requires computing Jacobian inner products to perform parameter updates in the bi-level optimization, could the authors comment on the incurred time complexity? I am wondering if the algorithm runs much slower than vanilla AT (but only improves the robust accuracy moderately).\n\nIn their experiments, the authors have compared with AutoAttack which is good, but not with other SOTA methods such as TRADES or Diffusion-based Defense (ICML 2023). Adding some more comparison method would be good."
            },
            "questions": {
                "value": "See the above."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "N/A"
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission8556/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission8556/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission8556/Reviewer_6nnk"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8556/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698622040685,
        "cdate": 1698622040685,
        "tmdate": 1700654168374,
        "mdate": 1700654168374,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "iz3ZbCusQK",
        "forum": "OF5x1dzWSS",
        "replyto": "OF5x1dzWSS",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8556/Reviewer_bEW4"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8556/Reviewer_bEW4"
        ],
        "content": {
            "summary": {
                "value": "This paper addressed the challenge of adversarial robustness on most vulnerable samples. The existing approaches adopt a instance-reweighted strategy towards improving the worse case robustness. However, there is no principled way to estimate the per-sample weight. This work combines instance-reweighting with bi-level optimization for adversarial robustness. The min-max problem for instance-reweighting optimization was solve with a equivalent compositional bilevel optimization problem."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "Strength:\n\n1. The mathematical formulation of instance-reweighted bilevel optimization is solved in an elegant manner.\n\n2. The evaluation on imbalanced dataset suggest the worst case adversarial robustness can be improved."
            },
            "weaknesses": {
                "value": "Weakenss:\n\n1. The improvements on PGD and AutoAttack seem to be less significant. The more significant improvements are observed from RA-Tail-30. Therefore, it is necessary to provide more details of the evaluation protocol for RA-Tail-30.\n\n2. Since the advantage is mainly demonstrated at the imbalanced dataset, the current evaluations on Imbalanced datasets (CIFAR10 and SVHN imbalanced) are not enough for analyzing the performance breakpoint.\n\n3. Comparisons with more recent adversarial training methods are missing."
            },
            "questions": {
                "value": "It is encouraged to make comparisons with more recent adversarial training methods.\n\nExperiments on more diverse imbalance degrees are necessary for more comprehensive evaluation."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8556/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698831356102,
        "cdate": 1698831356102,
        "tmdate": 1699637070006,
        "mdate": 1699637070006,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "Xe2xrHh8ov",
        "forum": "OF5x1dzWSS",
        "replyto": "OF5x1dzWSS",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8556/Reviewer_u17N"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8556/Reviewer_u17N"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a instance reweighting based adversarial training (AT) framework. Consequently, the authors follow the setting of Zhang et al. 2022  (bilevel optimization formulation for AT) and add the instance reweighting mechanism into it. Moreover, the authors seek to  build a model in the outer level problem that is robust not only to the adversarial examples but also to the worst-case attack distribution.  Compared with the exisiting instance reweighting AT methods, the proposed method  obtain the importance weights by distributionally robust optimization (DRO). The DRO is a more sophisticated choice than the heuristic/geometric schemes of instance rewweighting. Furthermore, the authors propose an equivalent compositional optimization problem (Eq. (6)) and adopt the log-barrier penalty function to drop the challenging $\\ell_{\\infty}$ norm constraint. The final optimization problem is Eq. (7) and the authors modify SCGD into the compositional implicit differentiation (CID) algorithm to solve it. With some common used assumptions, the authors establish the convegence result for CID. \nIn the experimental studies, the authors compare three instance re-weighted adversarial training methods with the proposed method on four small-scale datasets. The proposed method show promising improvement on RA-PGD, RA-Tail-30 and RA-AA metric."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. The paper is well-written and easy to follow. \n2. The motivation is clear and the equivalent compositional optimization problem is reasonable. \n3. The proposed CID method has convergence guarantee."
            },
            "weaknesses": {
                "value": "1. The empirical studies is not sufficient. Only small-scale datasets is adopted in the experiment. \n2. The computational analysis is missing. \n3. The justifiability of the assumptions is not discussed."
            },
            "questions": {
                "value": "1. In Eq. (7)，is the constraint $\\delta\\in\\mathcal{C}_i$ correct? The author claim that \"Note that now the constraint $\\{\\delta\\in\\mathcal{C}_i\\}$ is never binding in Equation (7), because the log-barrier penalty forces the minimizer of $\\ell^{bar}_{i}$ to be strictly inside the constraint set.\" Moreover, in Algorithm 1 Line 5-7, why need the projected operator to keep $\\delta_{i,t}^{k}$ in $\\mathcal{C}$?\n\n2. It is better to discuss the justifiability  of Assumption 1-3 for AT problem. \n\n3. The SA performance is a weaknness of the proposed method. It is better to explain this limitation. \n\n4. It is better to add some statistical analyses like  P-values, CIs, effect sizes, and so on."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "NA."
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8556/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698831731146,
        "cdate": 1698831731146,
        "tmdate": 1699637069892,
        "mdate": 1699637069892,
        "license": "CC BY 4.0",
        "version": 2
    }
]