[
    {
        "id": "s5aRfZltbn",
        "forum": "ogmAeOvR1v",
        "replyto": "ogmAeOvR1v",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5013/Reviewer_TXwr"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5013/Reviewer_TXwr"
        ],
        "content": {
            "summary": {
                "value": "This work proposes a two-stage BEV detection method, which first generates proposals on BEV space, and then refines the results by projecting the candidate boxes to image planes to resample visual features. The idea sounds reasonable, and the results have demonstrated the effectiveness of the proposed framework. The writing is pretty easy to follow."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The proposed method sounds technically reasonable.\n\nThe writing is good.\n\nThe results show the effectiveness of the introduced method."
            },
            "weaknesses": {
                "value": "Some concerns are expected to be addressed by the authors,\n1) The training cost increases for 30%-50% and the inference speed decreases by more than 10% (see Tab.4 of the manuscript), which is an undeniable burden for realizing such a complex method. Could the authors provide more details about the bottleneck? And is there any plan to speed the framework up?\n2) The idea is reasonable but somewhat incremental. Two-stage detectors have been thoroughly proved to be superior to the one-stage counterparts in many fields. It is suggested to provide more explanation about the novelty of this paper.\n3) It is confused why encoding box-level information to the network can bring such marginal improvements (see Tab.7 of the paper). In my view, the sampling process in the second stage is based on the predicted box of the first stage, the box-encoding should not show such big influences. Any discussion?"
            },
            "questions": {
                "value": "It seems that the proposed framework can also be applied to implicit-type methods like BEVFormer. It is suggested to provide the results on these methods."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5013/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698146458667,
        "cdate": 1698146458667,
        "tmdate": 1699636489895,
        "mdate": 1699636489895,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "ZvQyIbI0bf",
        "forum": "ogmAeOvR1v",
        "replyto": "ogmAeOvR1v",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5013/Reviewer_ocap"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5013/Reviewer_ocap"
        ],
        "content": {
            "summary": {
                "value": "The authors propose a two-stage detector LSSInst to learn better 3D space representations. \nThe paper aims to leverage both the advantages of dense forward projection (LSS)  and sparse backward projection (DETR3D). The experimental results also show that the proposed method can improve the performance of existing methods."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. The proposed two-staged design can bring gain to many existing methods.\n2. The ablation study is well-designed."
            },
            "weaknesses": {
                "value": "1. Based on Table 4, the cost of better performance is the lower efficiency.  The reviewer is not excited by this trade-off.\n2. Recent sparse-query methods like Streampetr, SparseBEV, and Spase4D methods show that sparse queries alone can achieve higher results with faster inference speed. This has to make the reviewer think about the practical significance of the method proposed in this paper. Since the one-stage detector is better in both performance and efficiency, why do we need a more complex two-stage method?"
            },
            "questions": {
                "value": "See weakness 2"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "/"
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5013/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5013/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5013/Reviewer_ocap"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5013/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698579815999,
        "cdate": 1698579815999,
        "tmdate": 1699636489809,
        "mdate": 1699636489809,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "mKEWLLEr5B",
        "forum": "ogmAeOvR1v",
        "replyto": "ogmAeOvR1v",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5013/Reviewer_hgcA"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5013/Reviewer_hgcA"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a two-stage object detector which simultaenously considers both BEV and instance representation to capture instance-level and scene-level information. They design a BEV-to-instance adator to effective transfer information from BEV to instance representation space. Experiments on the nuScene dataset verify the effectiveness of the proposed method."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The motivation of this paper makes sense. Table 1 well supports the benefits of fusing BEV and instance features.\n2. The performance is strong. It can improve exising methods and achieves good results in various settings."
            },
            "weaknesses": {
                "value": "1. Even though the motivation can support the method, I think this paper lacks deeper analysis about why BEV-level and instance-level features lead to the performance difference in Table 1. Is this due to the size of the object? I do not quite agree with the regular/irregular objects. More analysis should be conducted, as this is the key insight of this paper.\n2. The proposed method is seems a simple combination of BEV-based and instance-based methods. I do not see any non-trivial design that essentially makes the combiniation work. It seems directly combining the two types of methods can lead to improvement. Ablation study about this is missing.\n3. It is not clear the necessity of the proposed BEV-to-instance adaptor. No relevant experiments are presented."
            },
            "questions": {
                "value": "See weakness."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5013/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5013/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5013/Reviewer_hgcA"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5013/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698837821077,
        "cdate": 1698837821077,
        "tmdate": 1699636489728,
        "mdate": 1699636489728,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "I6UILji8iZ",
        "forum": "ogmAeOvR1v",
        "replyto": "ogmAeOvR1v",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5013/Reviewer_6PoT"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5013/Reviewer_6PoT"
        ],
        "content": {
            "summary": {
                "value": "The author of this paper presents a novel approach that combines the strengths of explicitly modeling dense BEV features and sparse query-based methods without modeling BEV. This method results in improvements across various LSS-based methods，and surpasses the state-of-the-art LSS-based method SOLOFusion by 1.6% in mAP. In this paper, extensive comparisons are made between the proposed method and existing LSS-based methods. Additionally, numerous ablation experiments are conducted to demonstrate the effectiveness of the proposed approach."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "This paper introduces a novel method, refining sparse queries (similar to DETR3D) on dense BEV features. The authors claim that this combination improves the geometric details in LSS-based BEV perception with instance representations. This approach has achieved promising results on the NuScenes dataset, compared to other typical LSS-based methods, LSSInst achieves improvements in mAP. Specifically, it outperforms BEVDet by 5.0%, BEVDepth by 2.2%, BEVStereo by 2.6%, and surpasses the state-of-the-art LSS-based method SOLOFusion by 1.6%"
            },
            "weaknesses": {
                "value": "The title of this paper is \"LSSInst.\" And the paper emphasizes its improvement upon the LSS-based method. In the experimental section, the paper compares its results only with the sota LSS-based methods. However, upon closer examination of the methodology, it can be observed that the core contribution of this paper does not lie in the BEV Branch. In other words, the method proposed in this paper is not necessarily linked to the LSS-based methods, and replacing the BEV Branch with a query-based method would not affect the core aspects of this paper. To demonstrate the generalizability of the proposed method in this paper, it would be valuable for the authors to include experiments where the BEV Branch is replaced with a query-based method. After all, the LSS-based sota SoloFusion has been ranked beyond the top 20 in the NuScenes leaderboard."
            },
            "questions": {
                "value": "1.\tAs I mentioned above, to demonstrate the generalizability of the method in this paper, please show results that replace the BEV Branch with query-based methods, like bevformerv2\n2.\tIn the motivation of this paper, it is mentioned that \"BEV representation seems more attentive to regular objects (car, bus, truck, barrier) with distinct movements or common positions in the scene, with relative insensitivity to the objects (pedestrian, bicycle, traffic cone) with uncertain trajectories or dispersed locations\", and this point is substantiated by the results presented in Table 1. However, this viewpoint is incorrect. Taking BEVFormer-pure and PETR-e as examples, their results on the nuscenes test dataset are as follows, contrary to what is stated in the paper.\n\n\n\t                    map \t     car\ttruck\tbus\t    pedestrian\tbicycle\ttraffic_cone\tbarrier\nBEVFormer-pure   0.445\t   0.633\t0.346\t0.335      0.492\t 0.36\t0.664\t         0.587\nPETR-e\t             0.441\t  0.631\t0.364\t0.344\t0.475\t0.306\t0.66\t                 0.608\n\n\n3.\tThe result of bevformerv2 in Table 2 is lower than its github repo. The paper mentions the utilization of three temporal frames, while BEVFormerV2 reports the results for two temporal frames for 51.8 NDS and 42.0 mAP, BEVFormerV2 achieves better results than the approach proposed in this paper by using only two temporal frames. Although the proposed method in this paper uses a lower resolution, when both methods are employed at the maximum resolution, the results indicate that the approach in this paper still falls short compared to BEVFormerV2 on the nuscenes test dataset, which achieves 0.58 mAP and 0.648 NDS"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5013/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698974934544,
        "cdate": 1698974934544,
        "tmdate": 1699636489609,
        "mdate": 1699636489609,
        "license": "CC BY 4.0",
        "version": 2
    }
]