[
    {
        "id": "V84mzRSDQ4",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission226/Reviewer_8LLh"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission226/Reviewer_8LLh"
        ],
        "forum": "OJoMzslBIa",
        "replyto": "OJoMzslBIa",
        "content": {
            "summary": {
                "value": "Out-of-distribution (OOD) detection has been widely studied. This paper focuses on the distance-based OOD detection with contrastive optimization methods. It points out that assigning equal significance to all similar pairs is not efficient in reducing the MES for each class and achieving higher inter-class dispersion. Therefore, this paper proposes ReweightOOD, a weight mapping function based on similarity, to prioritize hard positives and hard negatives. Experiments and visualization results show the proposed ReweightOOD surpasses the baseline and SOTAs by a large margin on FPR and AUROC."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "Based on the distance-based methods in OOD detection, this paper may first combine reweighting the hard samples with contrastive optimization.\n\nThe paper conducts explicit experiments on the influence the ReweightOOD brings to MES and inter-class dispersion. The results on CIFAR and ImageNet also verify its effectiveness."
            },
            "weaknesses": {
                "value": "The novelty of this idea is quite limited. Designing different weights for hard samples has been widely applied in many fields including classification, detection, etc., and yields success. It can be directly accustomed to nearly all methods and will not result in depreciation at least.\n\nThe baseline chosen in this paper training a not-well-adjusted model to perform OOD Detection is quite unfair. As the proposed method is a loss function, it can be combined with other contrastive optimization methods easily. A method designed for OOD detection is more suitable to be a baseline. Therefore, it makes the results less convincing.\n\nThe important hyperparameters including the scaling and shifting scalars of the final linear transformation are not studied in the ablation experiments."
            },
            "questions": {
                "value": "Why are the parameters of two linear transformation layers directly set to (5, -4, 2, 1) or (5, -2, 2, 1)?\n\nWhat is the reason for using a smaller shifting scalar from -2 to -4 when training with a smaller dataset CIFAR10?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission226/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1697438305841,
        "cdate": 1697438305841,
        "tmdate": 1699635948389,
        "mdate": 1699635948389,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "gUgTGVxpnz",
        "forum": "OJoMzslBIa",
        "replyto": "OJoMzslBIa",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission226/Reviewer_tSwH"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission226/Reviewer_tSwH"
        ],
        "content": {
            "summary": {
                "value": "This paper uses contrastive learning to address out-of-distribution (OOD) problems. The article introduces what contrastive learning is and discusses the challenges encountered by classical contrastive learning in tackling OOD problems. The authors believe that the main issue with contrastive learning in addressing OOD problems is that the discrimination between many difficult samples is not high enough, resulting in a close proximity among these challenging samples. As a result, it becomes difficult to recognize OOD samples. Therefore, the authors propose a reweighting approach to enhance the discrimination between different categories in contrastive learning, thereby improving the effectiveness of OOD detection."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The method proposed in this paper is simple and intuitive, and may be a good way to solve OOD problems.\n2. According to the author's experimental results, the proposed method can indeed improve the performance of OOD detection.\n3. The author's writing is very clear, and the description of the method section is easy to understand, combining formulas and diagrams."
            },
            "weaknesses": {
                "value": "1. In the abstract, the author emphasizes that their method outperforms the baseline by 38%, which seems impressive. However, this improvement is mainly due to the low performance of the baseline method itself. The proposed method does not actually achieve such a significant improvement compared to the state-of-the-art (SOTA). In my opinion, this exaggerates the contribution of this paper. It would be better to clarify the improvement relative to SOTA in the beginning to avoid misleading the readers.\n\n2. The simplicity of the method itself can be considered an advantage. However, based on the experimental results, the improvement of this paper compared to the state-of-the-art is limited. Therefore, I hope the authors can further explore this direction and achieve more substantial advancements.\n\n3. The experiments conducted in this paper are not comprehensive enough. Firstly, experiments on complete ImageNet-1K were not conducted. Additionally, the comparison with the latest methods, such as those presented in recent conferences like CVPR 2023, was not included."
            },
            "questions": {
                "value": "Please address the problem in weakness."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "NA"
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission226/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698656392018,
        "cdate": 1698656392018,
        "tmdate": 1699635948311,
        "mdate": 1699635948311,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "KkVBSjDmm5",
        "forum": "OJoMzslBIa",
        "replyto": "OJoMzslBIa",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission226/Reviewer_XxBj"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission226/Reviewer_XxBj"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes some modifications to contrastive optimization-based OOD detection. Previous approaches assign equal importance to all similar instances. This paper proposes to give different weights to these instances and tries to enforce the minimum enclosing sphere and higher inter-class dispersions. Experiments on CIFAR100 and ImageNet 100 demonstrate the effectiveness of the proposed approach."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "1. The proposed method is very simple and intuitively makes sense. The idea of obtaining a minimum closure sphere makes sense to separate OOD and ID data, and it is also easy to implement this idea by adding weights to the loss functions."
            },
            "weaknesses": {
                "value": "1. **There are many recent OOD baselines but they are not taken into consideration for comparison.** There are many recent OOD baselines but the authors either do not cite them [1,2,3] or do not add them in the comparison (e.g., ASH, GradNorm). In particular, these are very strong baselines and I see the performance of this method at the same level as ReAct. It is a bit strange that the evaluation does not involve any activation-clipping baselines such as ReAct and ASH (they are clear state-of-the-art methods and do not require any training). \n\n\n>[1] React: Out-of-distribution detection with rectified activations. NeurIPS 2021.\n>\n>[2] RankFeat: Rank-1 Feature Removal for Out-of-distribution Detection. NeurIPS 2022. \n>\n>[3] Boosting Out-of-distribution Detection with Typical Features. NeurIPS 2022. \n\n\n2. **The experiments are not sufficient only on CIFAR/ImageNet100.** The authors only validate the proposed approach on CIFAR100 and ImageNet100, which is far from sufficient and comprehensive. Usually, people evaluate OOD methods on CIFAR10, CIFAR100, and ImageNet-1k benchmarks. I would be convinced if the method also works for ImageNet-1k. \n\n3. **The instance weight can be replaced with learnable temperatures.**  Adding weight significance to the samples is one way to obtain a higher inter-class separation, but I am wondering if would it also make sense to make the temperature learnable. Compared with weight significance, it would bring another benefit: learnable distribution shaping for each category.  \n\n4. **How does the method perform when scaling to more/fewer categories?** I would suspect the performance is highly related to the number of categories. If the value is too large (e.g., 1000) or too small (e.g., 5), the performance might deteriorate. Can authors provide some ablation studies on subsets of the used datasets?\n\n5. **Does the method also work for Transformer-based architectures?** Currently the authors evaluate their approach with ResNet-18, DenseNet and WideResNet? Can authors do more experimental evaluation on Transformers?"
            },
            "questions": {
                "value": "Please see the weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission226/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission226/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission226/Reviewer_XxBj"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission226/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698852295842,
        "cdate": 1698852295842,
        "tmdate": 1699635948243,
        "mdate": 1699635948243,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "vOuwunlLBy",
        "forum": "OJoMzslBIa",
        "replyto": "OJoMzslBIa",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission226/Reviewer_NpEj"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission226/Reviewer_NpEj"
        ],
        "content": {
            "summary": {
                "value": "The traditional distance-based OOD detection assumes that OOD samples are far from In-Distribution (ID) clusters in the embedding space. A recent method involves contrastive optimization to create an OOD-detection-friendly embedding space. However, this approach doesn't effectively reduce the Minimum Enclosing Sphere (MES) for each class and achieve higher inter-class dispersion, leading to potential overlap between ID and OOD samples. To address this, the paper proposes a reweighting scheme called ReweightOOD. This scheme prioritizes optimizing less-optimized contrasting pairs while assigning lower importance to already well-optimized pairs."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "This paper addresses the important issue of Out-of-Distribution (OOD) detection in neural networks, crucial for ensuring safety and reliability in critical applications."
            },
            "weaknesses": {
                "value": "1. The figures 3 and 4 are not mentioned in the article.\n2. I find Figure 5 visually unappealing, and I wonder why there is only one category in the right figure.\n3. Table 2 only has two columns, it's not worth occupying such a large space in the paper.\n4. More importantly, why not conduct experiments on the ImageNet dataset, like existing works [1] have done?\n\n[1] Sun Y, Guo C, Li Y. React: Out-of-distribution detection with rectified activations[J]. Advances in Neural Information Processing Systems, 2021, 34: 144-157."
            },
            "questions": {
                "value": "See above."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission226/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698907854076,
        "cdate": 1698907854076,
        "tmdate": 1699635948158,
        "mdate": 1699635948158,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "WB4Hs6GcEP",
        "forum": "OJoMzslBIa",
        "replyto": "OJoMzslBIa",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission226/Reviewer_4EKT"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission226/Reviewer_4EKT"
        ],
        "content": {
            "summary": {
                "value": "This paper tackles the problem of OOD detection. It is motivated from supervised contrastive learning and propose to further disperse the inter-class distance while reduce intra-class variance via reweighting. Specifically, it encourages the model to focus more on hard positives and negatives samples. The experimenets on several benchmarks show the performance advantages of the method."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- The motivation is clear and presentation is easy to follow.\n- The proposed method is straightforward and weights for positives and negatives are dynatmically adjusted based on the similarity score. \n- Table 1 and 2 shows the dispersion cross class and compactness within the class for the proposed method compared to SupCon\n- Performance gains on CIFAR10/100 and ImageNet100"
            },
            "weaknesses": {
                "value": "Novelty:\n- Although the reweighting on constrative learning has been under-explored in OOD detection community, focusing more on hard postivie/negatives are widely applied in deep metric learning (especially in face recognition). E,g [1][2]. I think the novelty is sort of limited as the paper adopt hard sample mining/weighting into OOD detection task. In rebuttal, can you explain the difference bewteen your work and [1,2] in terms of hard samples re-weighting?\n\nExperiment:\n- In ImageNet100, can we have numbers from other methods (e.g, CIDER) instead of SupCon only.\n- For Table 1,2, I am interested to see how the MES score and Average centroid dispersion for CIDER. \n- Hyperparameters test on linear transformation are encouraged. It is said that ResNet18 network are set to (5, −2, 2, 1) and (5, −4, 2, 1). Do you have to set differently for other backbones or datasets?\n- For Figure 5 (b), why there is only one cluster? also, can you provide feature vislization for SupCon or CIDER as well?\n\n[1] CurricularFace: Adaptive Curriculum Learning Loss for Deep Face Recognition\n[2] AdaFace: Quality Adaptive Margin for Face Recognition"
            },
            "questions": {
                "value": "Please refer to the weakness"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 5,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission226/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699580650606,
        "cdate": 1699580650606,
        "tmdate": 1699635948088,
        "mdate": 1699635948088,
        "license": "CC BY 4.0",
        "version": 2
    }
]