[
    {
        "id": "hhg8cXq3nV",
        "forum": "om5z1n0mXA",
        "replyto": "om5z1n0mXA",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7184/Reviewer_DPDx"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7184/Reviewer_DPDx"
        ],
        "content": {
            "summary": {
                "value": "The authors propose a benchmark for the graph classification task. Specifically, they curated datasets and GNN baselines, defined new evaluation metrics, and conducted evaluation experiments. Additionally, they developed a synthetic graph data generator and confirmed its ability to control the correlation between simple graph statistics and class labels."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "S1. The new evaluation metric, effectiveness metric, can capture the difficulty of a dataset based on the number of classes and the absolute accuracy. The experimental results (Figure 2) demonstrate its effectiveness.\n\nS2. The authors introduce Theorem 1 and utilize it to propose a synthetic graph generator that controls the correlation between graph statistics and class labels.\n\nS3. The authors successfully reveal some characteristics of representative GNSSs, such as GIN, using various datasets generated by the graph generator."
            },
            "weaknesses": {
                "value": "W1. The synthetic graph generator is based on the Erdos-Renyi (ER) graph model, which may not be practical for generating many real-world graphs. For instance, in fields like chemistry and pharmacy, the motif structure is crucial, and simple metrics such as node count and cycle count are not sufficient for graph classification.\n\nW2. While the authors conducted a correlation analysis between graph statistics and class labels produced from the graph generator, the quality analysis for the generated graphs is not enough because the accuracy evaluations of graph classification are not conducted. \n\nW3.  The figures and tables should be improved.\n- The organization of Figure 2 and Figure 3 differs (stacking or non-stacking), making it difficult to compare them easily.\n- The font size in many figures is too small to read.\n\nW4. The sources for the 14 datasets used in Section 4.3 are not provided."
            },
            "questions": {
                "value": "Q1. Can you provide some representative application fields and supporting literature where simple metrics like node count and cycle count are good enough to effectively estimate class labels with high accuracy?\n\nQ2. The reason for limiting the cycle count sequence to k = {3, 4, 5, 6} is unclear."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission7184/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7184/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7184/Reviewer_DPDx"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7184/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698765955585,
        "cdate": 1698765955585,
        "tmdate": 1699636852728,
        "mdate": 1699636852728,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "75nXdLxyEY",
        "forum": "om5z1n0mXA",
        "replyto": "om5z1n0mXA",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7184/Reviewer_EXhn"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7184/Reviewer_EXhn"
        ],
        "content": {
            "summary": {
                "value": "In the context of graph classification, the paper presents: \n1) an empirical protocol to benchmark GNN against structure-based and attribute-based simple baselines;\n2) a novel metric to quantify the effectiveness of graph datasets, i.e. to establish if the dataset is suitable to evaluate novel methods;\n3) an algorithm to generate synthetic datasets with controlled correlation between graph properties and graph labels."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- the work nicely extends previous work in the field. A measure to quantify dataset effectiveness is timely in a field where often progress is measured on flawed benchmarks.\n- sufficient novelty: a novel metric and a method to generate controlled datasets are proposed, which to my knowledge are novel contributions.\n- thorough experimental assessment, both in width and depth."
            },
            "weaknesses": {
                "value": "Not much to say, this paper is well written and the contribution is very welcome in the field. If I have to be picky, I'd say:\n- lack of recommendations to the practitioner (see below)\n\nMinor:\n- there are many typos, which I suspect come from a rushed writing. Please have a second round of proofread before the rebuttal."
            },
            "questions": {
                "value": "- Do you have recommendations for GNN practitioners? e.g., which benchmarks should definitely be avoided when presenting a novel graph-based method?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "None"
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7184/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698769791455,
        "cdate": 1698769791455,
        "tmdate": 1699636852634,
        "mdate": 1699636852634,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "1oqnnNVhJo",
        "forum": "om5z1n0mXA",
        "replyto": "om5z1n0mXA",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7184/Reviewer_eLa4"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7184/Reviewer_eLa4"
        ],
        "content": {
            "summary": {
                "value": "This paper investigates the important problem in graph classification, which is why certain GNN methods cannot outperform even simple baselines such as MLPs. The authors conduct extensive experiments to showcase the reasons for such a situation, and further propose a fair measurement that considers the performance gap and the inherent complexity of the datasets. The authors further propose a novel algorithm that can generate controllable correlation datasets. The experiments are comprehensive and showcase meaningful observations. The authors also provide theoretical analysis to support their claim"
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. This paper investigates the important problem in graph classification, which is why certain GNNs cannot outperform simple baselines such as MLPs. The authors conduct extensive experiments on 16 datasets to quantify the performance gap between different methods and using only structural and attribute information.\n\n2. The authors propose a novel measurement that can comprehensively assess the performance advancement of GNNs on graph classification tasks, while considering the effects of both the changing performance portion and the complexity of datasets.\n\n3. The authors propose a novel algorithm that can generate controllable correlation datasets for evaluation."
            },
            "weaknesses": {
                "value": "1. There are several grammatical errors in the paper. For example, \"whether a GNN method has truly improved\" should be \"whether a GNN method has been truly improved\".\n\n2. The authors do not provide a comprehensive figure to illustrate the overall assessment of the proposed strategy for graph classification methods. Although the idea is straightforward, such a figure can help readers capture the main objective for understanding.\n\n3. The effectiveness definition in Eq. (2) seems not to be intuitive. The authors multiple two factors that consider both the changing proportion of the performance gap and the complexity. However, it remains unclear why we should use the product form instead of others. Also, it is unclear why the first component is normalized by |Y|-1 instead of |Y|."
            },
            "questions": {
                "value": "Have the authors considered devising a method that can solve the limitations in existing graph classification methods?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7184/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698826612360,
        "cdate": 1698826612360,
        "tmdate": 1699636852465,
        "mdate": 1699636852465,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "ihUaJwXkCh",
        "forum": "om5z1n0mXA",
        "replyto": "om5z1n0mXA",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7184/Reviewer_yi6y"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7184/Reviewer_yi6y"
        ],
        "content": {
            "summary": {
                "value": "This paper revisits some datasets and claims that some graph benchmarks are unable to distinguish the advancements of GNNs over other methodologies. In particular, the authors propose an empirical protocol for evaluating the dataset discriminability. In this protocol, the authors use the absolute error between Graph-based methods and other methodologies to quantify their performance gap from two different perspectives (structure and attribute). Then they use this protocol to revisit and analyze some existing datasets. \n\nThe paper then points out the limitations of their protocol and designs a metric that quantifies the effectiveness of a dataset. Specifically, the proposed metric alsk takes the number of classes, and the worst model performance into consideration. \n\nFurthermore, the authors investigate the reasons behind the low effectiveness of datasets. Specifically, they investigate the correlations between various properties and sample labels. Base on the understanding, they propose a method for generating controllable graphs."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "*Clarity*. The research questions and goals of this paper are stated clearly, and the whole paper is written in a clear logic, analyzing and solving the problem step by step. For example, the authors find some limitations for the protocol in section 2, so they propose a new metric in section 3. \n\n*Quality*. More empirical evidence is provided in the appendix to illustrate the effectiveness of the proposed metric. The details of the experiments like the hyper-parameters for training are also provided in the appendix which will facilitate other researchers to reproduce the results. \n\n*Significance*. This paper revisits some existing datasets or benchmarks and reminds people that some datasets are unable to distinguish the advances of Graph-based models. This problem is very important. Solving this problem holds substantial impact potential for the broader community."
            },
            "weaknesses": {
                "value": "1. In general, the novelty of the paper is a bit limited. The paper mainly concentrates on an empirical investigation of the effectiveness of existing benchmarking datasets for graph classification. While providing some insights on the datasets, there is a lack of theoretical understanding or support. This also makes it more suitable for a benchmark track such as NeuIPS benchmarking track. \n\n2. Some of the choices and designs in the paper are not well-motivated. \na.  For example, why GCN and GIN are chosen as the two methods for evaluating the benchmarks. The authors claim “GIN is spatial” and “GCN is spectral”, which is not informative enough. It would be better if the authors could provide more description and comparison between the two (or with other methods) and motivate their choices. \nb. Furthermore, the choice of average degree as the input for the structure-dominated MLP model seems to be a bit ad-hoc without solid support. It is not very clear why the average degree is selected especially given that the authors investigate several other graph properties in later sections. \n\n3. It is not very clear how Theorem 1 describes or supports the graph generation process. In particular, the meaning of Eq. (3) is not clearly explained. It would be helpful if the authors could provide more details on this part. Furthermore, as generating synthesized graphs is a key component of the paper, it might be better if the authors provide more details on the graph generation model and process."
            },
            "questions": {
                "value": "Please answer the questions raised in the section on weakness. In addition, there are a few other questions. \n\n1. In Observation 3, of Section 2.3, it claims “only REDDIT-B displayed a noteworthy performance gap, indicating a strong correlation between degree information and task labels”. Why this is the case, if there is a strong relation between average degree and task labels, should the performance gap be small as the baseline can also achieve good performance? \n\n2. In section 4.1, how is the correlation between graph properties and class labels calculated? Can you provide any details in calculating this correlation? Also, how high should these correlation coefficients be to be considered high correlations?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission7184/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7184/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7184/Reviewer_yi6y"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7184/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698898514705,
        "cdate": 1698898514705,
        "tmdate": 1700702641352,
        "mdate": 1700702641352,
        "license": "CC BY 4.0",
        "version": 2
    }
]