[
    {
        "id": "bOyBMAIfZ4",
        "forum": "OqlmgmS4Wr",
        "replyto": "OqlmgmS4Wr",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7956/Reviewer_iTiT"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7956/Reviewer_iTiT"
        ],
        "content": {
            "summary": {
                "value": "This paper studies mixing state and action trajectories with general instruction tuning corpus to improve open-source LLM agents’ decision making capabilities while keeping their generalization performance. The authors propose a 3 stage approach: generating instructions, collecting trajectories, and filtering them based on task reward. For tasks where instructions are not already given, the paper uses similar auxiliary tasks or zero-shot prompts the LLM to construct a task input and outputs. Trajectories are collected by prompting the LLM agent using ReAct to generate actions, running in the environment to collect rewards and extra feedback, and continuing in a loop till an episode is terminated. Trajectories are filtered based on task specific thresholds. Finally, this trajectory corpus is combined with ShareGPT corpus to train a Llama-2 model. The authors show that the model improves baseline Llama-2 on decision making tasks while keeping its general capabilities and is competitive with GPT-4."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The paper is written well and easy to follow. It presents a set of expensive experiments, showcasing that open-source LLMs can be competitive with proprietary LLMs when trained on the right data."
            },
            "weaknesses": {
                "value": "While the empirical contribution is significant, the paper overall feels incremental with straightforward improvements over prior instruction tuning and knowledge distillation. Some of the design decisions are also not explained.\n\n1. While the agent trajectories are very valuable and costly to collect, they are mainly extracted from public tasks/benchmarks by using ReAct with GPT models. The overall process with instruction generation, trajectory collection, and filtering can be useful for other data collection efforts but they are relatively straightforward. For example, ReAct/COT prompting is used with no significant change, reward filtering is also a standard practice in imitation learning. I suggest highlighting main challenges and how significant they are in addition to remedies that you introduced.\n\n2. Using an already available corpora with ReAct and filtering trajectories based on a threshold seems to be reducing the size of the data drastically. For example, in Mind2Web, only a tiny fraction is kept. It is not clear if the benefit of COT annotated trajectories can overcome the reduction in the data size. Can you present results where you make use of the data as much as possible even if you can’t inject COT annotations?\n\n3. How did you choose $\\eta$? Given that it denotes the tradeoff between broader generalization vs agent-task performance, it is important to highlight its impact. Are your models sensitive to this parameter? \n\n4. Similarly, how did you decide 1:4 ratio for GPT-4 vs GPT-3.5?\n\n5. What is GPT-4’s interaction trajectory with the DB? How did you end up collecting multi-turn dialogues? Are you using rule-based turn generation to convert DB response into a prompt?\n\n6. Is ShareGPT not leaking any of the test-time task data? It would be helpful to clarify."
            },
            "questions": {
                "value": "1. What are main challenges that you had and how significant they are?\n\n2. Can you make use of the available data as much as possible? Would that improve the results even without the COT annotations?\n\n3. How did you choose $\\eta$ And 1:4 ratio?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission7956/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7956/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7956/Reviewer_iTiT"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7956/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698814284584,
        "cdate": 1698814284584,
        "tmdate": 1700756722525,
        "mdate": 1700756722525,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "GFHfYmYp8G",
        "forum": "OqlmgmS4Wr",
        "replyto": "OqlmgmS4Wr",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7956/Reviewer_cRHd"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7956/Reviewer_cRHd"
        ],
        "content": {
            "summary": {
                "value": "The authors present to fine-tuning LLMs for agent behaviors with a new dataset collected using demonstrations of GPT models, and demonstrated that LLAMA models achieve significantly better performance on the held-out test set after fine-tuning."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "4 excellent"
            },
            "strengths": {
                "value": "1. Agent tuning is an exciting and important direction to study for the LLMs as intelligent agents.\n2. The authors' data/training/model have been well-documented. The results should be reproducible"
            },
            "weaknesses": {
                "value": "1. Figure 1 (b), I don't think the message is fair for this figure, since you trained on AgentBench (although partly), but the other LLMs have not trained on AgentBench. One of the down-sides for open-source LLMs is the ability to generalize to `different' settings from training, but the proposed work has essentially made AgentBench in-distribution by training.\n2. It seems that GPT models are heavily relied on for generating training data. Do we have some sense of how to go beyond GPT models? Suppose we want to push the boundaries of GPT-4, then GPT-4 data may not work as well.\n3. I have concerns for generalization to other agent tasks that are distinct, but not captured in agent-bench. For example, driving or operating Minecraft.\n\nOverall, my main concern is that the improvements might have come from better instruction following, not agent reasoning.\n\nMinor issues:\n- Figure 1 (a), Where does the overall score stand against GPT-4, from which you collected training data?"
            },
            "questions": {
                "value": "1. How does AlfWorld results in table 4 compare to [1], which reported higher score than the highlighted best open-source model?\n\n\n\n\n[1] Micheli, Vincent, and François Fleuret. \"Language models are few-shot butlers.\" arXiv preprint arXiv:2104.07972 (2021)."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission7956/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7956/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7956/Reviewer_cRHd"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7956/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698966328548,
        "cdate": 1698966328548,
        "tmdate": 1699636977855,
        "mdate": 1699636977855,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "0fTd0UFpYT",
        "forum": "OqlmgmS4Wr",
        "replyto": "OqlmgmS4Wr",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7956/Reviewer_7D3A"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7956/Reviewer_7D3A"
        ],
        "content": {
            "summary": {
                "value": "The paper presents AgentTuning, a methodology designed to enhance the capabilities of Large Language Models (LLMs) when they are employed as agents, while preserving their broader language understanding and generation abilities. It introduces AgentInstruct, a specialized instruction-tuning dataset, and an integrated instruction-tuning approach that combines it with publicly accessible instructions spanning various domains. Through experimental evaluations conducted on AgentLLaMA (instruction-tuned LLaMA2 series), the paper demonstrates that AgentTuning substantially improves the performance of LLMs in agent roles while maintaining the LLMs' foundational language understanding and generation capabilities. Notably, AgentLLaMA-70B exhibits comparable performance to GPT-3.5-turbo on unseen agent-related tasks."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- The motivation to improve the agent ability of open-sourced LLM is good.\n- It is well-written and the idea it presents is clear.\n- The evaluation is extensive and the results look promising."
            },
            "weaknesses": {
                "value": "- Some details of the dataset construction is unclear.\n- The training strategy used for instruction-tuning is limited.\n- The rationale behind some design choice needs more explanations."
            },
            "questions": {
                "value": "This paper proposes the instruction-tuning dataset and hyprid instruction-tuning to improve the agent ability of open-sourced LLM (i.e., LLaMA2). I think it is a significant contribution to the LLM community. However, I have some concerns as the following.\n- The authors claim that they use a reward $r$ to filter out low-quality trajectories, but how this reward is calculated/generated is unclear to me. Besides, as the trajectories are generated by GPT3.5/4, I think the trajectories may contain some misleading information. I wonder whether there is a human evaluation of the correctness of the trajectories.\n- It leverages a hybrid instruction-tuning strategy, which is a simple multi-task training in essence. Based on my understanding, improving the agent ability while preserving the general language understanding ability is close to a continual learning scenario. So I think it is important to discuss some typical training strategies like weight regularization[1] and parameter allocation[2] used in continual learning. And it would be better if you can further provide some results when such strategies are applied to see whether these strategies can benefit training.\n- The rationale behind some design choices is not well-explained. For example, why is the ratio of sampling between GPT3.5 and GPT4 set as 1:4 and why is the threshold of reward $r$ is set as 2/3? Are there any rules or experimental explanations for these choices?  \n\n[1] Kirkpatrick et al. Overcoming catastrophic forgetting in neural networks. Proceedings of the National Academy of Sciences 2017.  \n[2] Serra et al.  Overcoming catastrophic forgetting with hard attention to the task. ICML 2018."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission7956/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7956/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7956/Reviewer_7D3A"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7956/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699025315030,
        "cdate": 1699025315030,
        "tmdate": 1699636977743,
        "mdate": 1699636977743,
        "license": "CC BY 4.0",
        "version": 2
    }
]