[
    {
        "id": "1AWIufOFCf",
        "forum": "PJwAkg0z7h",
        "replyto": "PJwAkg0z7h",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4863/Reviewer_2AV3"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4863/Reviewer_2AV3"
        ],
        "content": {
            "summary": {
                "value": "The authors propose an end-to-end benchmarking package for neural temporal point process models. The package contains 6 diverse real-world datasets, 1 synthetic dataset, 8 recent models, and support for both Tensorflow and PyTorch. The paper itself serves as a useful exposition of the field, tasks, types of models, proposed package, and detailed empirical results."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "4 excellent"
            },
            "strengths": {
                "value": "This paper is a welcome contribution to TPP modeling at a timely moment when significant neural point process approaches have been published yet many open questions still remain. The proposed package has all the hallmarks of usefulness:\n\n1) Reproducible workflows via modular API.\n\n2) Diverse models and datasets.\n\n3) Supports top-2 ML languages equally (this is rare among benchmarking frameworks).\n\n4) Open-source repository and datasets.\n\nThe paper is overall well-written."
            },
            "weaknesses": {
                "value": "There are some presentation/exposition gaps/weaknesses:\n\n1) The accuracy plots would be more useful as tables.\n\n2) The \"temporal event sequence\" topic is not well-defined.\n\n3) The processing of sequence data is not adequately described.\n\nI elaborate on these weaknesses in questions to the authors."
            },
            "questions": {
                "value": "My questions align with the three specific shortcomings I identified:\n\n1) For reproducibility purposes, it would be useful to the community to know the exact accuracy values (and confidence bounds) from the various methods. Therefore in my opinion all plots showing empirical results should be replaced with tables. Is this possible in the camera-ready version?\n\n2) I may have missed this in my reading, but in Fig 1, I don't quite know what is meant by \"Temporal event sequence\" as opposed to \"temporal point process\". Furthermore, isn't a Hawkes process a version of a temporal point process? It seems that these publication sets may overlap somewhat. I'm wondering if this is clarified in the text, or if the authors can clarify.\n\n3) In Section 4's \"Data Preprocess\" section, the authors write \"to feed the sequences of varying length into the model, we pad all sequences to the same length, then use the \"sequence_mask\" tensor to identify which even tokens are padding.\" These masks are not defined, and are referenced no where else in the manuscript, so in my opinion this passage carries almost no information. To my understanding (which may be incorrect), some TPP datasets consist of a single sequence, and some models may process the sequence recurrently, i.e. each state embedding h_t depends only on the previous embedding h_{t-1}. For these models, why are variable-length sequences needed? On the other hand, datasets with events of multiple types (and models that can handle multi-type events) will need variable-length sequences. It would be very useful to the reader if the authors could describe these multiple scenarios, and specifically how EasyTPP handles each one at the implementation level.\n\nIf given satisfactory answers to the above, I am willing to raise my score."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4863/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4863/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4863/Reviewer_2AV3"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4863/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698280901290,
        "cdate": 1698280901290,
        "tmdate": 1700704170111,
        "mdate": 1700704170111,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "LS2iHhtZu8",
        "forum": "PJwAkg0z7h",
        "replyto": "PJwAkg0z7h",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4863/Reviewer_btMZ"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4863/Reviewer_btMZ"
        ],
        "content": {
            "summary": {
                "value": "To promote reproducible research in this field, this article proposes an open and central benchmark for point process research. The benchmark provides a complete pipeline and software interface. The effectiveness of this benchmark is demonstrated by the unified comparison of various model results."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The most important contribution lies in providing a simple and standardized framework to allow users\nto apply different TPP models to any datasets, which promotes reproducible research in this field."
            },
            "weaknesses": {
                "value": "The main concern is contribution. Considering the quality of the ICLR community, although it is particularly urgent to propose a unified comparison and processing framework for point processes, the contribution is still limited."
            },
            "questions": {
                "value": "Would you mind elaborating further on the broader impact this benchmark will have on the community?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4863/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4863/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4863/Reviewer_btMZ"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4863/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698675611091,
        "cdate": 1698675611091,
        "tmdate": 1699636469980,
        "mdate": 1699636469980,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "0amopdnMH2",
        "forum": "PJwAkg0z7h",
        "replyto": "PJwAkg0z7h",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4863/Reviewer_MAje"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4863/Reviewer_MAje"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a software package that abstracts the implementation of several temporal point process models."
            },
            "soundness": {
                "value": "1 poor"
            },
            "presentation": {
                "value": "1 poor"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "1. Good motivation"
            },
            "weaknesses": {
                "value": "1. Lack of technique contribution\n2. Unclear presentation"
            },
            "questions": {
                "value": "1. This paper lacks technical innovation. I don't think a software-level abstraction is a good fit for ICLR.\n2. The description of the system design and interface lacks details.\n3. It's unclear what points the authors intend to demonstrate in the experiment section."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4863/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698790121142,
        "cdate": 1698790121142,
        "tmdate": 1699636469901,
        "mdate": 1699636469901,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "oe8zLA3DC6",
        "forum": "PJwAkg0z7h",
        "replyto": "PJwAkg0z7h",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4863/Reviewer_Xrns"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4863/Reviewer_Xrns"
        ],
        "content": {
            "summary": {
                "value": "The authors contribute the EasyTPP package for temporal point processes (TPPs). TPPs have been of increasing interest to the machine learning community in recent years, with many deep learning-based TPP models being able to outperform classic parametric TPP models in prediction tasks. There have not been many software packages implementing many different TPP models, which has made it difficult to compare and evaluate different models across standardized benchmark data sets and evaluation metrics. The EasyTPP package implements many recent TPP models and can be used with either PyTorch or TensorFlow. The authors utilize the package to benchmark these TPP models across a variety of data sets and prediction tasks.\n\n*After author rebuttal:* I have read through the other reviews and author rebuttal and still strongly support the paper. I further expand on my reasoning in a reply to the author comment titled \"Technical Contribution and Broader Impact.\""
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "4 excellent"
            },
            "strengths": {
                "value": "- Addresses a major need in the machine learning community interested in TPPs--the lack of a standardized benchmarking tool. Most researchers are piecing together implementations from other papers in order to make comparisons. Existing software packages, such as PoPPy are out of date and not maintained. The proposed EasyTPP package could fill a major need for the community.\n- Implements a comprehensive list of models and evaluation metrics, together with several representative data sets.\n- The authors perform a thorough comparison of existing models using their EasyTPP package, which should also be useful to researchers in the area."
            },
            "weaknesses": {
                "value": "- The authors compare against the classical Multivariate Hawkes Process (MHP) but don't specify what type of kernel they use (I assume exponential) or structure of the excitation matrix.\n\nMinor concerns:\n- Some typos, e.g. Multivariate Hakwes Process (MHP)"
            },
            "questions": {
                "value": "1. Is there an easy way to incorporate marks into your package? From the description in the paper, it seems like you can easily handle different event types through a multivariate TPP, but I don't see any discussion of marks. In many application settings, we can have a feature vector for each event, which can be modeled as a mark."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "10: strong accept, should be highlighted at the conference"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4863/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4863/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4863/Reviewer_Xrns"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4863/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699019694473,
        "cdate": 1699019694473,
        "tmdate": 1700704109969,
        "mdate": 1700704109969,
        "license": "CC BY 4.0",
        "version": 2
    }
]