[
    {
        "id": "ubZZhDIJ6b",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8883/Reviewer_zJ5m"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8883/Reviewer_zJ5m"
        ],
        "forum": "PN9uaKA1nV",
        "replyto": "PN9uaKA1nV",
        "content": {
            "summary": {
                "value": "The paper described a method to fill in templates with terms taken from medical domain knowledge graphs and LLM suggestions. Once the prompt are obtained they are fed to ChatGPT to create synthetic datasets that can be used for MLM fine-tuning and later used for wide variety of NLP tasks."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The concept of using LLMs to generate training data is important and should be explored more to achieve best practices."
            },
            "weaknesses": {
                "value": "- The paper mentioned privacy as an issue but I think that the method will not address any privacy issues that are accruing in the original LLM\n- Hard to understand what is the base model used for MLM training, is it PubMedBERT? If so, PubMedBERT outperforms all of the other attempts\n- Baselines descriptions could be more elaborated"
            },
            "questions": {
                "value": "The most important question is what is the additional pre trained classifier\nIt's unclear from the paper"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8883/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1697223440543,
        "cdate": 1697223440543,
        "tmdate": 1699637118107,
        "mdate": 1699637118107,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "YuLlYuucy3",
        "forum": "PN9uaKA1nV",
        "replyto": "PN9uaKA1nV",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8883/Reviewer_CY6f"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8883/Reviewer_CY6f"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes CLINGEN to generate synthetic clinical text data using LLMs to enhance clinical NLP models. The prompt for LLMs incorporates clinical information and the generated synthetic data has a similar distribution as the original datasets, is more diverse, and helps NLP models perform better in few-shot settings (7 clinical NLP tasks, 16 datasets, compared to 9 baseline methods)."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. The work has conducted thorough experiments on 7 clinical NLP tasks and 16 datasets in the few-shot settings and shows a clear advantage of the proposed method CLINGEN. The limitations of previous related works are also clearly discussed, quantified and demonstrated. The proposed method has shown promising results to mitigate the limitations.\n\n2. The work has potential significance in the clinical NLP domain, where gold standard data can be limited and private patient needs to be protected. Synthetic data generation can be useful to address both challenges. The work has shown a promising avenue to utilise synthetic clinical data.\n\n3. The paper is overall well-written and clear."
            },
            "weaknesses": {
                "value": "1. The prompt design is quite simple, i.e. the method itself lacks novelty. \n\n2. The works claim to \"infuse\" clinical knowledge into the prompt but the prompt simply incorporates clinical topics/concepts (picked from a knowledge graph and LLMs) like \"Stoke\", rather than actual clinical knowledge (for example, diabetes, stroke, and CHF are risk factors for CKD). Using the word \"infuse clinical knowledge\" over-claims the novelty of the method. \n\n3. It is unclear how the prompts in Appendix F are determined. Also, the work does not experiment with different prompt designs."
            },
            "questions": {
                "value": "One useful and missing reference: Ive J, Viani N, Kam J, Yin L, Verma S, Puntis S, Cardinal RN, Roberts A, Stewart R, Velupillai S. Generation and evaluation of artificial mental health records for natural language processing. NPJ digital medicine. 2020 May 14;3(1):69.\n\nThe paper did not discuss patient privacy in clinical NLP. Synthetic data should be anonymous and can help AI researchers build models without touching real private patient data.\n\nTextual data is an important component in clinical data but structured data (vital signs, lab tests) is also critical. This work focuses on clinical text synthetic data generation only and more types of data can be considered as future works. However, the capability of LLMs to generate synthetic structured clinical data is questionable.\n\nThe clinical topics/concepts in section 4.1.1 are picked from KG and LLMs. How many topics are from KGs and how many are from LLMs? How is this ratio determined? Would a different ratio impact results? Why not ask a clinician to hand-pick clinical topics?\n\nThe current SOTA results (regardless of fully supervised or few-shot) should be added to Table 1 as reference points.\n\nD_train in Equation 1 has only K (K<=5) samples per label?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8883/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698797607108,
        "cdate": 1698797607108,
        "tmdate": 1699637117995,
        "mdate": 1699637117995,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "gweK50esdo",
        "forum": "PN9uaKA1nV",
        "replyto": "PN9uaKA1nV",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8883/Reviewer_D87k"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8883/Reviewer_D87k"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a new approach called CLINGEN for generating synthetic clinical text data using large language models (LLMs). The key idea is to leverage both external clinical knowledge graphs (KGs) and the knowledge encoded in LLMs to create informative and diverse prompts for guiding the LLM to generate high-quality and realistic synthetic data.\n\nSpecifically, CLINGEN extracts clinical topics from KGs and LLMs and writing style suggestions from LLMs. It composes this knowledge into prompts with a random topic and style to encourage diversity. The resulting synthetic data is used to train task-specific models.\n\nThe authors comprehensive benchmark experiments are conducted."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "-The writing is clear and easy to undersand.\n-Proposes a simple yet effective strategy to harness both structured KG knowledge and unstructured knowledge in LLMs to create informative prompts.\n-Provides thorough empirical evaluation across diverse clinical tasks and datasets demonstrating consistent gains."
            },
            "weaknesses": {
                "value": "-The proposed prompting strategy is intuitive but lacking in novelty. Leveraging both KGs and LLMs is expected to help.\n- To best of my knowledge, the generated data is still in-domain data, generating the style the same as the training data. So, it is not surprised  for me that using more data for training can improve model performance. It is more make sense to improve small model's over medical capacity , instead of overfit on a specific task with more training data. \n-No rigorous comparison with other prompting optimization methods in the literature."
            },
            "questions": {
                "value": "- I am not sure why the two stages training is conducted. Was the results yo mix train your training data with  generated data together for training?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission8883/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission8883/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission8883/Reviewer_D87k"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8883/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698809617053,
        "cdate": 1698809617053,
        "tmdate": 1699637117829,
        "mdate": 1699637117829,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "qtmWv8DhU7",
        "forum": "PN9uaKA1nV",
        "replyto": "PN9uaKA1nV",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8883/Reviewer_jB98"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8883/Reviewer_jB98"
        ],
        "content": {
            "summary": {
                "value": "The paper aims to do synthetic clinical text generation using LLMs for clinical NLP tasks using the outlined approach - \n\n(1) Extract clinical knowledge in the form of sample related entities or relations from external KG (nodes and edges from KB) or query relevant knowledge from LLM (prompt LLM to list 100 entities of a certain entity type). \n(2) Include task names and  writing style into the prompt (e.g “medical literature” or “patient-doctor dialogues” ).\n(3) Generate data using few-shot learning\n(3) Use a pretrained model to fine tune on synthetic data.\n\nThe paper does a very comprehensive evaluation of  synthetic clinical data generation across 7 clinical NLP tasks and 16 datasets. Benchmarked with ZeroGen and DemoGen. Metrics included - evaluation task metrics, Entity Coverage. Entity Frequency, Central Moment Discrepancy (CMD), t-SNE  embeddings comparing synthetic and ground truth data. Includes a detailed ablation and parameter study."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The paper does a good job doing comprehensive evaluation and ablation study. The paper is well written."
            },
            "weaknesses": {
                "value": "To better assess the importance of the work, it would be beneficial to clarify the questions listed below."
            },
            "questions": {
                "value": "(1) The reviewer likes that the paper did a direct comparison with the prompts from GPT-3.5. However, I'm interested to know if the current medical LLMs are proficient in the tasks described. Should they already excel in these areas, it might somewhat diminish the necessity for the proposed approach.\n(2) What are the limitations of your approach - what tasks is it limited to? How will it perform on more complex tasks such as descriptive QA (since most of the evaluation is on classification tasks)? Will it work on medical records?\n(3) Some of the tasks still have some issues in regards to entity coverage and it looks like generally the performance is low on these tasks. Are these common entities that are missed and not identified by LLM or KB ? How will this looks like if a medical LLM was used for generation ?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8883/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698981843640,
        "cdate": 1698981843640,
        "tmdate": 1699637117702,
        "mdate": 1699637117702,
        "license": "CC BY 4.0",
        "version": 2
    }
]