[
    {
        "id": "v1zbNobca0",
        "forum": "pSf8rrn49H",
        "replyto": "pSf8rrn49H",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5617/Reviewer_5G9e"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5617/Reviewer_5G9e"
        ],
        "content": {
            "summary": {
                "value": "The paper addresses the emergent and crucial issue of model unlearning. Notably, many contemporary generative models face issues of infringement, as some artists are reluctant to have their work used in training such models. The authors introduce a dual-phase approach: the LoRA fine-tuning stage for concept elimination, followed by a memory stage to enhance generation quality for non-infringing images. The paper mainly evaluates the proposed method on well-defined concepts such as Picasso and Mickey."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. The topic is novel and the authors state the importance of the topic very clearly.\n2. The proposed method is interesting. It is good to see that the LoRA module could be used for concept extraction."
            },
            "weaknesses": {
                "value": "1. The evaluation is weak. The current results cannot be used to fully support the effectiveness of the proposed method. Actually, the evaluation of this kind of task is also very important."
            },
            "questions": {
                "value": "1. With the concept of removed model weights, what about the impact on the FID on larger datasets such as Laion and COCO?\n2. How to forget those concepts that are not well defined by text words?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5617/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5617/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5617/Reviewer_5G9e"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5617/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698732863817,
        "cdate": 1698732863817,
        "tmdate": 1699636580070,
        "mdate": 1699636580070,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "O6SalcOKLN",
        "forum": "pSf8rrn49H",
        "replyto": "pSf8rrn49H",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5617/Reviewer_Pa89"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5617/Reviewer_Pa89"
        ],
        "content": {
            "summary": {
                "value": "This paper presents a conceptual framework to facilitate proper credit attribution in the text-to-image procedure and enable digital copyright protection. Three operations are proposed in this framework: addition, extraction, and combination. These basic operations are expected to give good incentives to each participant in the market and enable enough flexibility to thrive in the market. Then, an inverse LoRA approach is adopted to instantiate the extraction operation and a data-free layer-wise distillation is used to combine the multiple extractions or additions. The experiments conducted for style transfer and cartoon IP recreation demonstrate the effectiveness to extent of the proposed method."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "1 poor"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. This paper pays attention to a critical issue: digital copyright protection and credit attribution in the text-to-image generation procedure.\n2. The idea and design are preliminary and somehow make sense."
            },
            "weaknesses": {
                "value": "1. The paper is poorly written and can be largely improved. As illustrated in the abstract, the framework aims to address the tension between the users, the content creators and the generative models. However, there are no figures, workflow or formulation that strictly define and describe how the proposed model interacts with these roles.\n2. Most components to construct the model are widely adopted. What are the real merits of the work?\n3. The design of the three operations feels quite ad hoc, and there is no explanation as to why these three operations precisely address the problem. Whether these three operations form a complete set or can represent all possible operations remains unanswered. It seems that some potential points have been mentioned rather cursorily, and there hasn't been a comprehensive exploration of this issue."
            },
            "questions": {
                "value": "Please see the weakness."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5617/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698736114699,
        "cdate": 1698736114699,
        "tmdate": 1699636579966,
        "mdate": 1699636579966,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "I99uauKAyp",
        "forum": "pSf8rrn49H",
        "replyto": "pSf8rrn49H",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5617/Reviewer_3Us4"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5617/Reviewer_3Us4"
        ],
        "content": {
            "summary": {
                "value": "The paper addresses a very important problem with Gen AI models, copyright infringing. Specifically, the work proposes a new framework for fair and transparent attribution in T2I  models to solve the copyright concern, with three basic operations addition, extraction and combination. A key novelty of the work is the proposal of Inverse LoRA algorithm to extract copyrighted concepts from the base model. Experiments and results demonstrate the utility of the proposed framework."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "I applaud authors for attacking an important and challenging problem of copyright infringing. I thoroughly enjoyed reading the paper and really liked the overall framework (with some concerns though as highlighted in weaknesses) and believe the work could have high impact use cases, especially in industrial applications of genAI. The results provided in the paper, though limited, look great."
            },
            "weaknesses": {
                "value": "I do not find any major weaknesses with this work. However, I feel the paper could be further improved with more qualitative results for extraction, which is the key novelty of the work. I find the proposed method to be not very intuitive (section 2.2.1 and 2.2.2) and struggle to understand concretely how exactly it is able to achieve the extraction. Given limited quantitative results and comparisons, it would be helpful to see a diverse set of qualitative results. Also, I see that the paper mentions human evaluation in page 7, but doesn’t present any human eval results. I feel human eval results further help in justifying the proposed framework."
            },
            "questions": {
                "value": "Please see weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5617/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698949360361,
        "cdate": 1698949360361,
        "tmdate": 1699636579854,
        "mdate": 1699636579854,
        "license": "CC BY 4.0",
        "version": 2
    }
]