[
    {
        "id": "DfPb7MjemU",
        "forum": "ptXo0epLQo",
        "replyto": "ptXo0epLQo",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3812/Reviewer_4hmE"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3812/Reviewer_4hmE"
        ],
        "content": {
            "summary": {
                "value": "From the perspective of information theory, this paper decomposes the Total Correlation term into two distinct bounds: the information bottleneck and the conditional entropy bottleneck. It assigns specific weights to these bounds to balance their influence. Furthermore, the authors evaluate their learning objective across multiple datasets."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- From an information theory perspective, the authors derive a lower bound of total correlation. They simultaneously address both the disentanglement and informativeness of the latent variable.\n- The writing throughout the paper is lucid and well-structured, making it accessible for readers.\n- The research showcases effectiveness by employing diverse evaluation metrics and testing their approach across various datasets."
            },
            "weaknesses": {
                "value": "- The novelty is limited. Earlier research, referenced by the authors, already explored the decomposition of Total Correlation. The primary contribution seems to be the weighted combination of these two decompositions, which might appear incremental.\n- They claim that the VIB term promotes compression of the latent representation, and the CEB term promotes balance between the information contained in each latent dimension. However, the paper lacks a clear illustration of:\n  - How the information bottleneck correlates with disentanglement.\n  - The connection between diversity and the conditional entropy bottleneck.\n- A more profound point of contention is the origin of the VIB and the CEB terms. Both terms are derived from the same TC term, yet they supposedly represent different characteristics. The paper doesn't sufficiently elucidate why this is the case, which could have made for a compelling discussion."
            },
            "questions": {
                "value": "- How does the parameter alpha influence the results?\n- What about the traversal outcomes for the CelebA dataset?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3812/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3812/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3812/Reviewer_4hmE"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3812/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698398094778,
        "cdate": 1698398094778,
        "tmdate": 1700723767235,
        "mdate": 1700723767235,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "cT5mrWm4mc",
        "forum": "ptXo0epLQo",
        "replyto": "ptXo0epLQo",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3812/Reviewer_hWoC"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3812/Reviewer_hWoC"
        ],
        "content": {
            "summary": {
                "value": "In this paper, the author introduce α-TCVAE, a variational autoencoder optimized using a new total correlation (TC) lower bound that both maximizes disentanglement and latent variables informativeness. The new TC bound is grounded in information theory and can be reduced to a convex combination of the known VIB and CEB terms. Moreover, the paper also presents quantitative analyses and correlation studies which support the idea that smaller latent domains lead to better generative capabilities and diversity."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- The total correlation between x and z has not been previously used in disentangled representation learning, although similar concepts exist, such as mutual information in InfoGAN.\n- The paper  first paper propose to discuss diversity in the context of disentangled representation learning, drawing from previous research in GANs (e.g., FID).\n- The paper considers reinforcement learning as a downstream task for disentangled representations."
            },
            "weaknesses": {
                "value": "- The paper proposes maximizing an upper bound of the correlation between x and z for disentanglement, but β-TCVAE penalizes total correlation between different z's. The connection between these two approaches is unclear, and the use of α-TCVAE may be misleading. If there is a connection, it should be further clarified.\n- The authors should explain why maximizing the upper bound of the correlation between x and z promotes disentanglement, and why increasing variable informativeness enhances diversity.\n- The traversal results shown in Appendix Figure 12 are poor in terms of both disentanglement and generation quality. Additionally, the paper lacks traversal images results for real world natural images (not MPI3D-real), such as CelebA.\n- The paper should provide an analysis of the sensitivity of the $\\alpha$ parameter.\n- If the answer to weakness 1 is the latter, it seems that this work is relatively incremental, as it only adds a conditional TC term to the β-TCVAE. Considering this point, the authors should clarify it in the rebuttal stage."
            },
            "questions": {
                "value": "See weakness."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3812/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3812/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3812/Reviewer_hWoC"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3812/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698589477267,
        "cdate": 1698589477267,
        "tmdate": 1699636338548,
        "mdate": 1699636338548,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "27253aSOSj",
        "forum": "ptXo0epLQo",
        "replyto": "ptXo0epLQo",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3812/Reviewer_wnca"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3812/Reviewer_wnca"
        ],
        "content": {
            "summary": {
                "value": "The paper proposes a new method for learning disentangled representations, alpha-TCVAE. \nIt is based on a new lower bound for TC loss, that convexly combines VIB and CEB terms.\nFor alpha = 0, the alpha-TCVAE reduces to beta-VAE.\nExperiments show that alpha-TCVAE brings some improvement in disentanglement quality measures and diversity of generated samples. \nComparisons with beta-TCVAE, beta-TCVAE, FactorVAE, beta-VAE+HFS, VAE and StyleGAN are provided.\nAn additional experiment shows usefullness of alpha-TCVAE for reinforcement learning."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. A new approximation to the TC loss is provided.\n2. In Appendix E, authors show that α-TCVAE can learn and represent generative factors that are not present in the ground-truth dataset. This is a very surprising observation, probably authors shoud consider making it more visible by moving it to the main part of the manuscript.\n3. Have you used augmentations during training? Because new factors of variations (like camera elevation) mights be side effect of some augmentations like crop. \n4. A comparison with the recent model β-VAE+HFS is provided.\n5. The paper contains interesting insights about connections between disentanglement and diversity.\n6. An application to RL is provided.\n7. The paper is well written and easy to follow, the language is fine."
            },
            "weaknesses": {
                "value": "1. The improvements over other VAE-based methods are very moderate, sometimes lower than std.\n2. The popular dSprites dataset is missing; also popular measures like MIG, DCI-C, DCI-I are missing.\n3. The term Iθ(z, x) is not defined in Section 3.\n4. The experimental setting, when a diversity is evaluated by doing traversals by +-6,8,10 std. looks strange for me.\nSuch points will be never sampled from the noise. \n5. Where did hyperparameters from Appendix B come from? For example, Roth et al, 2023 provided a grid search for them. As far as rival methods are concerned, you can take hyperparameters from original papers (but in this case original training pipeline and architectures must be also used). If the hyperparameters for rival methods are selected arbitrary, experimental results are not valid!\n6. Figure 1 is not convincing. For example, row 3 for alpha-TCVAE, contains an image with a defect: non-round violet border. \nHigh diversity obviously can be achieved by generating wrong images."
            },
            "questions": {
                "value": "1. In Figure 2, what does green horizontal line mean?\n2. In Figure 3, you write that \"The scores for the images of our model, α-TCVAE, are consistently better than baseline VAE models (lower FID is better), and only slightly worse than StyleGAN.\"\nBut from Figure 3, I see that blue circles (sampling from \"noise\") for all VAE-based models have significantly higher FID than StyleGAN. \nProbably, you compare traversal from VAE and \"noise\" samples from StyleGAN, but it seems not fair to me.\n3. How the matrix for the Vendi score is formed?\n4. FID from \"traversals\" image generation is much lower than from straightforward generation from noise. Do you have an explanation?\nAlso, it is interesting to compare VAE models via Precision/Recall (Kynkäänniemi, T., Karras, T., Laine, S., Lehtinen, J., & Aila, T. (2019). Improved precision and recall metric for assessing generative models. Advances in Neural Information Processing Systems, 32.)\n\n**post rebuttal**. Most of my questions have been addressed, authors even did some additional computations. So, I am raising my score."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3812/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3812/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3812/Reviewer_wnca"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3812/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698754821554,
        "cdate": 1698754821554,
        "tmdate": 1700839653954,
        "mdate": 1700839653954,
        "license": "CC BY 4.0",
        "version": 2
    }
]