[
    {
        "id": "xfCYl1EiEy",
        "forum": "QbXo9pbJpp",
        "replyto": "QbXo9pbJpp",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7627/Reviewer_xLkZ"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7627/Reviewer_xLkZ"
        ],
        "content": {
            "summary": {
                "value": "The paper presents a method called LoRe-CIA for out-of-distribution (OOD) generalization in graph neural networks (GNNs). The notable contributions of the paper include proposing a novel regularization term called LoRe, which encourages the learning of invariant representations across different environments. The LoRe term is combined with the Contrastive Invariant Alignment (CIA) objective to improve OOD generalization performance. Experimental results on the GOOD benchmark dataset demonstrate that LoRe-CIA outperforms several state-of-the-art methods in terms of OOD generalization accuracy."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The paper innovatively focuses on not fully explored node-level OOD generalization in graphs, revealing limitations of existing methods and introducing a novel approach, LoRe-CIA. High-quality work grounded in both theory. Addresses key challenges in graph-based OOD generalization and offers a robust solution with LoRe-CIA. Well-structured and clearly articulated, the paper provides a logical flow from problem formulation to solution, enhancing readability and comprehension."
            },
            "weaknesses": {
                "value": "The paper does not discuss the computational complexity of LoRe-CIA. Given that graph neural networks can be computationally intensive, an analysis of the algorithm's scalability to larger graphs would be beneficial. It would be better to add more recent models in experiments."
            },
            "questions": {
                "value": "In Table 2, when examining LoRe-CAI on the CBAS dataset, is there a specific reason why the variance of the results appears to be zero?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7627/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698678020533,
        "cdate": 1698678020533,
        "tmdate": 1699636926536,
        "mdate": 1699636926536,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "Ck4aYVsMBk",
        "forum": "QbXo9pbJpp",
        "replyto": "QbXo9pbJpp",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7627/Reviewer_q5yH"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7627/Reviewer_q5yH"
        ],
        "content": {
            "summary": {
                "value": "This paper studies the out-of-distribution node classification. The authors propose a toy model considering the connections among nodes to demonstrate the limitations of IRMv1 and VREx in learning the underlying invariant features, such that similar frameworks like EERM well as fail. Then the authors incorporate the causal objecting matching objective to contrast intra-class samples across environments, called Cross-environment Intra-class Alignment (CIA). To address the collapse issue of the learned representations, the authors further propose a localized weighting variant of CIGA, called LoRe-CIA, that reweights the contrasting pairs according to the shortest path distance. In experiments with GOOD datasets, LoRe-CIA that does not use environment partitions, demonstrates competitive performance with respect to other methods that uses environment partitions."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "(+) The studied problem is important;\n\n(+) The theoretical failure results of IRM and VREx is interesting;\n\n(+) The proposed localized reweighting scheme is new and interesting;"
            },
            "weaknesses": {
                "value": "(-) The main motivation setting seems to be too hypothetical;\n\n(-) The novelty of the proposed method is limited;\n\n(-) The improvements are limited;\n\n(-) Some related works have not been fairly discussed;"
            },
            "questions": {
                "value": "Although I like the idea of the paper, it seems the paper could be improved significantly by clarifying the following points:\n\n1. The main motivation setting seems to be too hypothetical. \n- Although the proposed toy example seems to be more general than EERM, what are the realistic examples for the proposed data model? Without proper explanation and discussion, it is hard to claim that “This is the general case of real-world OOD graphs.”\n- What does the superscript $e$ means in $A^e$? How environment changes could affect the generation of X?\n- Moreover, the failure proofs seem to heavily rely on the assumption that “GNNs that are sufficiently deep (deeper than the number of layers of the causal pattern of a node) are typically used.”. Is it really true? \n\n2. The novelty of the proposed method is limited and some related works have not been fairly discussed. \n- The proposed method is a simple modification of Mahajan et al. (2021). How does the modification work to make up the environment information? \n- If it’s only for the collapse issue, as already demonstrated in Figure 1, properly tuning the hyperparameter $\\lambda$ already solves the problem well. How the $\\lambda$ is tuned for CIA? \n- What’s the relation between LoRe-CIA and CIA? Does CIA serve as a upper bound for LoRe-CIA? Why not incorporating LoRe into CIA with environments directly to resolve the collapse issue?\n- What is the exact implementation of LoRe-CIA?\n- The failures of IRM and VRex, and the success of intra-class contrastive learning are not surprising, as they are already shown by Chen et al., (2022). It is desirable to properly discuss the distinctions of the work with respect to previous works, thus the readers could better understand the place of the work in the literature.\n\n3. The improvements are limited:\n- When comparing to baselines that do not use environments, LoRe-CIA does not show clear advantage, and most of the improvements are within standard deviation.\n- It is unclear how the hyperparameters such as $\\lambda$ and hop numbers are tuned."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission7627/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7627/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7627/Reviewer_q5yH"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7627/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698759248754,
        "cdate": 1698759248754,
        "tmdate": 1700738359396,
        "mdate": 1700738359396,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "Y7fFmc55vW",
        "forum": "QbXo9pbJpp",
        "replyto": "QbXo9pbJpp",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7627/Reviewer_vEQV"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7627/Reviewer_vEQV"
        ],
        "content": {
            "summary": {
                "value": "The paper studies node-level OOD generalization. It establish cases where invariant learning methods like IRM and VREx given environment labels learn spurious features when the depth of the GNN exceeds the causal depth. Then it shows the cross-environment intra-class alignment of nodes avoid some spurious features. The paper also proposes LoRe-CIA, which does not require environment labels but selects node pairs that exhibit large differences in spurious features but minimal differences in causal features for alignment. Experiments are conducted to evaluate the methods."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The paper studies an algorithmic case and clearly analyzes IRM, VREx and CIA from a theoretical perspective.\n\n2. The paper presentation is clear and easy to follow.\n\n3. The proposed method does not require ground-truth environment labels. The conducted experiments look correct."
            },
            "weaknesses": {
                "value": "1.  The setting in 3.1 assumes $L > 2k$ and GNNs are sufficiently deep, which is doubtful. Typically graph tasks would not use very deep GNNs due to the well-known fact that deep GNNs have over-smoothing issues and compromise performances. Therefore this assumption may not hold. Moreover, there's no validation for the number of layers of the causal pattern of a node in any real-world dataset, thus no conclusion whether this $L > 2k$ setting is applicable for any graph tasks.\n\n2. From my understanding, CIA's major superiority over other methods using environment labels like VREx roots in its consideration of both class and environment label information at the same time. However, LoRe-CIA does not use environment labels. According to [1], learning invariant/spurious features without environment partition is fundamentally impossible if not given further inductive biases or information. Thus, there appears to be no guarantee that LoRe-CIA can learn the information supporting CIA, i.e., LoRe-CIA might not be able to identify node pairs with significant differences in spurious features and small differences in causal features.\n\n3. Sec 4.2 assumes 1. change rate of node’s spurious features w.r.t spatial location is faster than that of the causal feature; 2. label distribution of node's different-class neighbors reflects the distribution of spurious features. This assumption is quite strong and seems not applicable widely. There are graphs exhibiting various behavior, such as heterogeneous/homogeneous graphs. Further discussions on when these assumptions hold should be included.\n\n\n[1] ZIN: When and How to Learn Invariance Without Environment Partition?"
            },
            "questions": {
                "value": "See weaknesses"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7627/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698786276996,
        "cdate": 1698786276996,
        "tmdate": 1699636926311,
        "mdate": 1699636926311,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "AJOa9A3c7D",
        "forum": "QbXo9pbJpp",
        "replyto": "QbXo9pbJpp",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7627/Reviewer_v4b8"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7627/Reviewer_v4b8"
        ],
        "content": {
            "summary": {
                "value": "This paper presents a novel method to improve out-of-distribution (OOD) generalization for node-level tasks on graph data. It introduces a theoretical model to assess OOD techniques in node-level OOD classification and proposes an enhanced invariant learning objective that considers both graph topology and node features. The method is evaluated on benchmark datasets, demonstrating superior OOD detection and classification performance. The paper contributes a theoretical analysis of OOD methods on graphs, an innovative approach for invariant learning, and empirical benchmark evaluations."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- **Motivation**: The paper addresses an important challenge in graph learning: achieving OOD generalization on real-world graphs.\n\n- **Theoretical guarantee**: This approach is grounded in a theoretical model that analyzes the performance of several OOD methods, including V-REx and IRM, in node-level OOD classification problems. The theoretical model presented in the paper also offers insights into the performance of OOD methods, which could inform future research in this area.\n\n- **Statement of intuition**: The paper provides explanations of the theoretical model and the proposed approach. I particularly appreciate the part where the authors discuss the intuitions presented in the main paper."
            },
            "weaknesses": {
                "value": "- **Theoretical model**: In Remark, the authors noted, \"In this toy model, the distribution shift is caused by both changes in topological structures (Ae) and node features (Xe2). This represents the general case of real-world OOD graphs.\" It would be beneficial to see a more detailed analysis of the model's assumptions and limitations. Specifically, what cases are not covered by the model?\n\n- **Efficiency explanation**: In the abstract and introduction, the authors mentioned that the proposed approach enables \"more efficient elimination of spurious features.\" However, the paper does not provide an analysis of the computational complexity of this approach, and the experimental section lacks relevant information about its runtime.\n\n- **Presentation**: The paper's structure and clarity could be further improved. For instance, in Figures 1 and 2, the shapes representing labels are hard to tell at the first sight. In Section 4.2, the statement \"the rate of change of a node’s spurious features with respect to spatial location on the graph is faster than that of the causal feature\" could benefit from a more specific explanation of what \"rate\" means in this context. Additionally, while the content is generally clear, the writing could be further refined.\n\n- **Real-world graph datasets**: Since CBAS is a synthetic dataset, its weight in the study may be smaller than the other two datasets. It might be worthwhile to include more real-world datasets to validate the generalization ability of CIA/LoRe-CIA across a wider range of distributions."
            },
            "questions": {
                "value": "- What are the cases that are not included in the theoretical model?\n- What is the evidence that supports the claim about CIA is a more efficient approach?\n- In Section 4.2, \"...the rate of change of a node’s spurious features with respect to spatial location on the graph is faster than that of the causal feature...\", what does \"rate\" mean specifically?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission7627/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7627/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7627/Reviewer_v4b8"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7627/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699230202657,
        "cdate": 1699230202657,
        "tmdate": 1700742609854,
        "mdate": 1700742609854,
        "license": "CC BY 4.0",
        "version": 2
    }
]