[
    {
        "id": "nIXOxtHUtX",
        "forum": "qDhq1icpO8",
        "replyto": "qDhq1icpO8",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3957/Reviewer_kNXT"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3957/Reviewer_kNXT"
        ],
        "content": {
            "summary": {
                "value": "This paper addresses the challenge of estimating causal effects from observational data while dealing with unobserved confounders. The paper introduces a conditional IV (CIV) approach called CBRL.CIV, which relaxes the strict conditions and allows for non-linearity. Theoretical analysis supports the soundness of CBRL.CIV, and extensive experiments demonstrate its competitive performance in handling non-linear scenarios compared to state-of-the-art IV-based estimators."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. CIV offers a more powerful and flexible approach to handle causal inference with unmeasured confounders.\n2. The experimental results are extensive and convincing."
            },
            "weaknesses": {
                "value": "My main concern is the similarity of this work to Wu.2022 in ICML. Even though the contribution of this work is introducing CIV to handle the restrictive conditions of IV, you methods are similar to Wu et.al. Hence, can you state the difference, or the unique technical contribution of CIV for representation learning?"
            },
            "questions": {
                "value": "See Weaknesses"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3957/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3957/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3957/Reviewer_kNXT"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3957/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698555081335,
        "cdate": 1698555081335,
        "tmdate": 1699636356780,
        "mdate": 1699636356780,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "GAfmTERIao",
        "forum": "qDhq1icpO8",
        "replyto": "qDhq1icpO8",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3957/Reviewer_A6cp"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3957/Reviewer_A6cp"
        ],
        "content": {
            "summary": {
                "value": "This paper tackles the complex task of estimating causal effects in observational data while considering unobserved confounders. It introduces a novel approach called CBRL.CIV, which leverages a conditional instrumental variable (CIV) to relax the stringent requirements of standard instrumental variables (IV), such as linearity assumptions and strict unconfounded instrument conditions. Through theoretical analysis and extensive experiments on synthetic and real-world datasets, the paper demonstrates the effectiveness of CBRL.CIV in eliminating confounding bias, particularly in non-linear scenarios, making it a promising alternative to existing IV-based estimators."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. Using CIV to relax the restrictive conditions of IV methods is practical for most realistic scenes. \n2. The overall presentation and writing structure is clear and well motivated.\n3. Extensive experimental results are convicing."
            },
            "weaknesses": {
                "value": "1. Using confounder balancing to migrate the gap between treated and controlled groups are very commo. I wonder the specific beneficial point on the combination of CIV and confounder balancing."
            },
            "questions": {
                "value": "See Weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3957/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3957/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3957/Reviewer_A6cp"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3957/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698645502434,
        "cdate": 1698645502434,
        "tmdate": 1699636356694,
        "mdate": 1699636356694,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "8mVsSSKfu0",
        "forum": "qDhq1icpO8",
        "replyto": "qDhq1icpO8",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3957/Reviewer_9EAs"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3957/Reviewer_9EAs"
        ],
        "content": {
            "summary": {
                "value": "This paper presents a novel approach designed to tackle the complexities associated with conditional instrumental variables (CIVs). These are specific variables that, while not qualifying as unconditional instruments, fulfill the IV assumptions when conditioned on a suitable adjustment set.  The paper identifies that the predominant challenge with these CIVs emerges from distributional imbalances among groups delineated by the values in the conditioning set. To mitigate this, the paper proposes a framework that leverages regularization techniques to minimize these distributional discrepancies."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1.\tThe paper is good by its deep exploration of the challenges associated with estimating causal effects in the presence of non-linear relationships and unobserved confounders. It specifically addresses the imbalance issues inherent in applications of CIVs in non-linear settings with finite samples. This is a significant contribution, as CIVs are more practical and less restrictive than traditional IVs in real-world scenarios.\n2.\tThe paper proposes a novel Confounding Balancing Representation Learning (CBRL.CIV) method for non-linear CIV regression in causal effect estimation. Notably, CBRL.CIV efficiently mitigates the confounding biases between $S$ and $W$, as well as between $W$ and $Y$.  \n3.\tThe paper delves into the theoretical underpinnings of CBRL.CIV, highlighting its robust capability to generalize across varied groups. This ensures a harmonious balance across the CIV, treatment, and outcome regression networks.\n4.\tThrough experiments on both synthetic and real-world datasets, the effectiveness of CBRL.CIV has been validated in estimating average causal effects. Such empirical evidence is crucial for the adoption and trustworthiness of the proposed method in real-world applications."
            },
            "weaknesses": {
                "value": "Causal inference fundamentally depends on certain assumptions and the proposed CBRL.CIV method is no exception. If these prerequisites aren't satisfied in specific scenarios, the efficacy of the CBRL.CIV method might be compromised. Thus, a discussion on the potential negative impacts of using CBRL.CIV under such conditions would be beneficial.\n\n**Presentation**:\n1.\tFigure 2 in the main content and Figure 3 in the appendix should use the same legend. \n2.\t When the authors or the publication are included in the sentence, the citation should not be in parenthesis, e.g., “it is well-known that the causal effect of the treatment on the outcome is non-identifiable Pearl (2009); Shpitser & Pearl (2006).” The citation should be in parenthesis using \\citep{}.\n3.\tIn Eq. (12), there is a missing square, and the same missing happens in the pseudocode of Algorithm 1."
            },
            "questions": {
                "value": "Sww weakness"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3957/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698751169759,
        "cdate": 1698751169759,
        "tmdate": 1699636356617,
        "mdate": 1699636356617,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "AG8WIV6HQ3",
        "forum": "qDhq1icpO8",
        "replyto": "qDhq1icpO8",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3957/Reviewer_MNhf"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3957/Reviewer_MNhf"
        ],
        "content": {
            "summary": {
                "value": "This paper introduces a method aimed at addressing the challenge of conditional instrumental variables, which refer to variables that may not be valid unconditional instruments, but satisfy the instrumental variable assumptions when conditioned on an appropriate adjustment set. The paper argues that the primary issue associated with conditional instrumental variables lies in the distributional imbalance observed among the groups defined by the values within the conditioning set. To address this, the paper proposes a methodology that uses regularization similar to the approach employed by Shalit et al. [2017] to minimize these distributional shifts."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The paper studies balancing in the conditional instrumental variable setting, and they use an approach reminiscent of Shalit et al [2017] to penalize changes in the conditional distribution of the treatment and instrument are stable across conditions. \n\nI think that it is under appreciated that conditional IVs are possible (although they are implicit in most standard IV assumptions), so I'm glad this topic is getting attention. \n\nI reviewed an earlier version of this paper and most of my critiques from then have now been fixed (with the exception of the experiments below)."
            },
            "weaknesses": {
                "value": "The experiments remain the weakest part of this paper. The result of the proposed method are very impressive relative to the baselines, but it is not at all clear how fair the comparison was. The synthetic data is a novel benchmark, so I would expect that the baselines would all underperform without some hyper parameter tuning, but there is no mention of this (the authors do tune the hyper parameters of the proposed method).\n\nMore importantly, both IHDP and Twins are datasets that are used in the unconfounded setting, so it's not clear that they even have an instrument (particularly not a conditional instrument) or unobserved confounding. \n\nCode is supplied but only for the proposed method (not the baselines), and the data generating process is only supplied"
            },
            "questions": {
                "value": "How were the baselines tuned?\n\nWhy are they so much higher variance than the proposed method?\n\nIf you consider a setting with a standard IV, do the baselines then outperform your method?\n\nHow did you select instruments for IHDP and Twins?\n\nWhat is a plausible source of unobserved confounding for IHDP and Twins?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3957/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699216590674,
        "cdate": 1699216590674,
        "tmdate": 1699636356550,
        "mdate": 1699636356550,
        "license": "CC BY 4.0",
        "version": 2
    }
]