[
    {
        "id": "jL3h8X1EYP",
        "forum": "qDMyhAxok3",
        "replyto": "qDMyhAxok3",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5669/Reviewer_NzbM"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5669/Reviewer_NzbM"
        ],
        "content": {
            "summary": {
                "value": "The paper proposes a generative model for neuronal morphologies (in skeleton form), implemented as a conditional VAE with an LSTM encoder/decoder. Neurons are grown using an autoregressive sampling procedure inspired by natural growth processes. The proposed model is shown to consistently perform better than MorphVAE (the only other deep learning-based alternative) under multiple metrics and for different tissue samples."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- The idea to generate branches progressively is interesting and makes intuitive sense.\n- Terminology is clearly defined and illustrated in Sec. 2. \n- The authors promise to release the source code of their method.\n- Evaluations show consistently improved results in comparison to MorphVAE.\n- In addition to morphological metrics, a classifier-based approach is used to verify plausibility and BND to evaluate diversity of the generated morphologies."
            },
            "weaknesses": {
                "value": "- Ablations of MAE and local/global conditioning are relegated to an appendix and restricted to a single dataset. Please consider including and discussing them in the main text. Perhaps some of the formulas for the LSTMs could be moved to the appendices to make space for this."
            },
            "questions": {
                "value": "- The importance of neuronal morphology for diseases such as Alzheimer's feels out of place in the abstract. The statement itself is true of course, but it's unclear how having a computational model of such morphologies would make studying these diseases any easier. I suggest replacing it with some other potential applications.\n- In the global condition, are the non-branch coordinates completely discarded or still used somehow?\n- In section 3.3 describing the sampling procedure a \"reference morphology T\" is described. Does that mean that the sampled neurons will always have the exact same tree structure as T?\n- Have you performed any studies on the impact of the embedding size? (both for your model and MorphVAE). This hyperparameter does not appear to be explored much in the text.\n- Does Fig. 4 suggest overfitting? How is it possible that the generated neurons remain so close to the original morphology?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5669/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698778377543,
        "cdate": 1698778377543,
        "tmdate": 1699636591105,
        "mdate": 1699636591105,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "2VnSHpzjq7",
        "forum": "qDMyhAxok3",
        "replyto": "qDMyhAxok3",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5669/Reviewer_7LXV"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5669/Reviewer_7LXV"
        ],
        "content": {
            "summary": {
                "value": "- S1. MorphVAE encoded sequences of arbitrary number of consecutive vertices along a branch with an LSTM to learn a fixed length representation. It also used an LSTM to generate a new branch conditioned on that representation. \n\n - S2. As I understand, the proposed neuron generation method is:\n\n    1. initialize `active_vertices` with soma vertex\n    2. at each step, generate two branches, conditioned on already generated graph\n    3. generated branches are allowed to be null.\n    4. replace `active_vertices` with tips of non-null generated branches\n    5. repeat 2 $\\rightarrow$ 4 until `active_vertices` is empty\n\n - S3. Conditioning on the already generated graph requires a fixed length representation of a graph. Authors propose to do this in 2 ways:\n\n    1. _global context_ aggregates fixed length branch-level representations at different branch orders $\\dagger$\n\n    2. _local context_ uses a discount scheme to weigh contribution at different branch orders. \n\n - S4. MorphVAE combine \"walks\" (sampled branches) with a heuristic procedure to construct a neuron tree. \n\n - S5. This manuscript uses a similar scheme to generate branches, but proposes a recursive procedure to generate the neuron tree. \n\n - S6. Authors provide a comparison of trees generated by either method based on 4 datasets."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "1 poor"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- Manuscript builds on ideas in MorphVAE and proposes a meaningful extension.\n - The auto-regressive scheme of generating morphologies is interesting, and perhaps a good direction to think about the problem of generative models for neurons."
            },
            "weaknesses": {
                "value": "- W1. The writing and notation would benefit from being more concise and self-contained. For example, various metrics are only referred to by their acronyms in the main text. Separating the biological motivation/justification in a single paragraph instead of describing it after each method step would also help towards this end. Some symbols aren't introduced at all. \n\n - W2. The proposed method seems to be so over-fit to training data, that the morphologies hardly differ from the given sample (e.g. examples in Fig 4a-c., and also Fig. 23-26)? Is this not a major problem?\n\n - W3. Building on W2., consider a _model_ that simply jitters branch points of the reference morphology by a small amount. Based on evaluations presented in the manuscript, this procedure would\n    - obtain near-perfect match on the metrics in Table on p.7.\n    - match distributions in Fig. 3\n    - be hardest to distinguish for classifiers (Sec. 4.3)\n    - have higher BlastNeuron distances with simple heuristics (e.g. deletion of small fraction of terminal branches)\n\n    From the manuscript and the metrics chosen to justify the generated morphologies, it is unclear to me why one should prefer the proposed method over this simple procedure to generate morphologies. \n\n - W4. The language is often not careful; some strong biological claims are made that are not well substantiated. Examples:\n\n    > Since the neuronal morphology is static, the generation order of the branch pairs in each layer does not matter.\n\n    > Remark. A typical neuron is comprised of a soma, dendrites, and an axon. Dendrites perform a random walk from the soma, while the elongation and bifurcation of axons exhibit specificity."
            },
            "questions": {
                "value": "- Q1. If the intention is to also use such models to study morphology as it relates to neuronal development, the following view should probably be reconsidered?\n    > Since the neuronal morphology is static, the generation order of the branch pairs in each layer does not matter.\n\n - Q2. It looks like a typo (should be 3 instead of 3k), but just to make sure please clarify:\n    > Most nodes on the tree have no more than 3k k-hop neighbors, thereby limiting the receptive field of nodes.\n\n - Q3. I assume $k$ here refers to the depth of the tree?\n    > For a branch $b_i$, its corresponding node feature at the k-th iteration $\\hat{h}(k)$ is calculated by\n\n - Q4. $\\textbf{r}_{b_i}$ is not defined in the section on global context."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5669/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698810361997,
        "cdate": 1698810361997,
        "tmdate": 1699636590988,
        "mdate": 1699636590988,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "gr5v94PK5w",
        "forum": "qDMyhAxok3",
        "replyto": "qDMyhAxok3",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5669/Reviewer_s2ri"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5669/Reviewer_s2ri"
        ],
        "content": {
            "summary": {
                "value": "The authors present MorphGrower, a model for neuron morphology generation based on reference morphologies as inputs. Their method features conceptual advances over the previous state of the art in the field, MorphVAE. A comprehensive evaluation suggests that these advances yield considerable benefit across a range of quantitative measures of performance."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "4 excellent"
            },
            "strengths": {
                "value": "MorphGrower constitutes a significant advance in learning-based neuronal shape generation compared to the pioneering MorphVAE. In particular, MorphVAE generates neurons by sampling soma-to-tip branches and agglomerating a set of such branches via threshold-based node merging. This can yield topologically infeasible morphologies; Furthermore, agglomeration by averaging node positions has a smoothing effect which is detrimental to the yielded shape variability.\nTo counter these deficiencies, MorphGrower generates shapes recursively, \"layer by layer\", where \"layer\" refers to branch distance from the soma (where a \"branch\" spans from bifurcation or soma to bifurcation or tip). By recursion, an encoding of the local path to a current branching point as well as an encoding of the full previous layer is fed as condition to a branch pair encoder and -decoder."
            },
            "weaknesses": {
                "value": "MorphVAE provides an embedding for whole neuronal morphologies (via pooling of walk embeddings), which can be leveraged for shape clustering and cell type classification. This feature is not straightforwardly contained in MorphGrower as the respective encoder operates recursively on neuron branches. While MorphGrower is clearly pitched as focusing on neuronal shape generation, an explicit discussion of the aforementioned distinction in scope from MorphVAE would still be helpful for the reader. \n\nWhile the provided evaluation of neuronal shape generation is comprehensive and shows clear benefits of MorphGrower over MorphVAE, it would still be beneficial to also report the shape characteristics statistics employed in MorphVAE (cf. their Fig. 5). Furthermore, it appears that MorphVAE has been re-trained by the authors with hyper parameters different from the original model, which are then however applied to (partly) the same date -- would it be possible to directly use the resp. models trained by the MorphVAE authors, or at least their exact hyperparameters?\n\nFurther details:\n\nFor the branch pair decoder, it would be helpful if you could discuss respective permutation equivariance -- do you include both orders of each branch pair during training to train towards equivariance? or is the architecture inherently permutation equivariant? (if so this is not straightforwardly obvious)\n\nIn your comparative evaluation vs MorphVAE, it would be beneficial if you could provide a more comprehensive discussion of hypotheses regarding the sources of the observed differences. E.g., MorphVAE caps walk lengths, which clearly entails an underestimate of some of the measures you evaluate, yet this source of underperformance is not discussed."
            },
            "questions": {
                "value": "Would it be possible to directly use the models (or at least hyper parameters) employed by the MorphVAE authors, at least for your comparative evaluation on data also used in the MorphVAE work?\n\nCould you extend your evaluation of morphological statistics to the measures evaluated in the MorphVAE work?\n\nFurthermore, please explicitly discuss the distinct scope of MorphGrower vs MorphVAE."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5669/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698850291396,
        "cdate": 1698850291396,
        "tmdate": 1699636590873,
        "mdate": 1699636590873,
        "license": "CC BY 4.0",
        "version": 2
    }
]