[
    {
        "id": "Y50t5dpeP4",
        "forum": "qIn2IgMWYg",
        "replyto": "qIn2IgMWYg",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5128/Reviewer_VN3Q"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5128/Reviewer_VN3Q"
        ],
        "content": {
            "summary": {
                "value": "To ensure the reliability of a DNN model and achieve the trustworthiness of deep learning, it is critical to enhance the interpretability and explainability of deep neural networks. Attribution methods are effective means of Explainable Artificial Intelligence (XAI) research. This paper, inspired by the iterative generation of Diffusion models, proposes an iterative search attribution (ISA) method by capturing the importance of samples during gradient ascent and descent and clipping the unimportant features in the model.  The method achieves SOTA performance."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. The paper is well-written, with good organization and expressions.\n2. The paper has the corresponding code released.\n3. The achieved experimental results are State-of-the-art.\n4. The justification of the proposed method, i.e., ISA, with both gradient descent and ascent considered is reasonable.\n5. The authors perform detailed ablation studies to validate the proposed methodology."
            },
            "weaknesses": {
                "value": "1. How the paper is related to the diffusion models is unclear. Diffusion models apply iterative sampling whilst this paper is more on searching.\n2. Though the method achieved good experimental results regarding the performance, and the qualitative evaluation, its efficiency is not largely improved, due to the iterative nature of the algorithm.\n3. From Figure 3, it seems that the step size, learning rate, and scale parameters are quite sensible regarding the performance, any explanation for this?"
            },
            "questions": {
                "value": "1.  Could discuss more on why iterative search is good.\n2. Figure 3 shows several parameters are sensitive, please provide explanations. \n3. The efficiency of the method is not improved a lot, which should be discussed, especially regarding the iterative method."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5128/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5128/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5128/Reviewer_VN3Q"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5128/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698549265403,
        "cdate": 1698549265403,
        "tmdate": 1699636505437,
        "mdate": 1699636505437,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "DHmGkCaRvJ",
        "forum": "qIn2IgMWYg",
        "replyto": "qIn2IgMWYg",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5128/Reviewer_8Joh"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5128/Reviewer_8Joh"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes an Iterative Search Attribution (ISA) method to enhance the interpretability of deep neural networks (DNNs) by improving the accuracy of attribution. The authors introduce a scale parameter during the iterative process to ensure that the parameters in the next iteration are always more significant than the parameters in the current iteration. Experimental results demonstrate that the ISA method outperforms other state-of-the-art baselines in image recognition interpretability tasks."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The key contributions are laid out lucidly, helping readers discern the paper's main takeaways.\nThe method clips relatively unimportant features, leading to more accurate attribution results."
            },
            "weaknesses": {
                "value": "1. The comparison methods are not novel enough. There are some newer methodscan be compared(e.g. Explain Any Concept: Segment Anything Meets Concept-Based Explanation).\n2. The experiments are relatively simple and do not adequately demonstrate the importance of the method in enhancing model interpretability.  \n3. The absence of corresponding theoretical analysis makes the method less convincing."
            },
            "questions": {
                "value": "See above."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5128/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698743338852,
        "cdate": 1698743338852,
        "tmdate": 1699636505326,
        "mdate": 1699636505326,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "uvzZw4HSuE",
        "forum": "qIn2IgMWYg",
        "replyto": "qIn2IgMWYg",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5128/Reviewer_df7s"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5128/Reviewer_df7s"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a new method for attributing a neural network prediction to input features. The proposed method integrates the gradient with respect to input features over both the gradient ascent and descent paths. The paper provides experiments on ImageNet where it shows better performance compared to prior methods under Insertion score."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The paper tackles an interesting problem, namely providing better saliency maps. It proposes interesting and novel modifications to existing gradient-based attribution methods, and seems to make some improvement upon existing methods."
            },
            "weaknesses": {
                "value": "1- The paper makes many ad-hoc design choices which are not well justified. The provided explanations seem unclear to me (Section 4.2). It is helpful to provide experiments that show how each design choice affects the attribution, as well as more formal explanations (using clear mathematical notation).\n\n2- While the ablation studies show which hyper-parameters were most useful, they lack explanation of why and clear connection to the motivation for introducing the respective parameters.\n\n3- The metrics, Insertion and Deletion, are not formally defined. Since these two metrics are the basis of the main results in Table 1, it is important to clarify their definition and justify their meaningfulness. It is particularly useful to show what is the real-world consequences of lower Insertion or Deletion.\n\n4- The paper mentions that Grad-CAM and Score-CAM perform poorly in non-CNN models, however, all the results in the paper are reported with CNN based models, so a comparison to these methods are required.\n\n5- The paper can improve in writing (also Figure 1 is not clear to me). Please make sure claims are either backed by specific citations or experiments, for example: “Unfortunately, these two methods are more suitable for CNNs and perform poorly in non-CNN cases”.\n\n6- minor typo: Section 4.2 must be \\Delta x_k not x_t"
            },
            "questions": {
                "value": "My suggestions are included in the issues I raised in the weaknesses section."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5128/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698818894379,
        "cdate": 1698818894379,
        "tmdate": 1699636505235,
        "mdate": 1699636505235,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "CFYK609pbJ",
        "forum": "qIn2IgMWYg",
        "replyto": "qIn2IgMWYg",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5128/Reviewer_PAUU"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5128/Reviewer_PAUU"
        ],
        "content": {
            "summary": {
                "value": "This paper proposed a gradient-based iterative attribution method, the Iterative Search Attribution (ISA), which combines gradient descent and gradient ascent to construct the integration path. Experiments demonstrate the effectiveness of the proposed ISA."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "1 poor"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- the idea of combining both gradient descent (GD) and gradient ascent (GA) in constructing the integration path in the gradient-based attribution method is interesting (and, based on their results, useful).\n- the qualitative results in Figure 2 look promising."
            },
            "weaknesses": {
                "value": "- the discussion about the local and global attribution methods is vague. \n    - are \"local\" and \"global\" properties of the attribution method concerning the input space? namely, a local attribution method only interprets the NN within a neighborhood of an input $x_0$, while a global attribution method will assess the importance of features in $x_0$ with respect to the whole range of possible input (full input space), thus reflecting the property of the NN itself. \n    - If so, one may argue that the gradient-based methods are also local as they depend on specific anchor points.\n- the discussion about the relative importance of the features with \"larger attribution\" in GA and GD cases in Sec.4.2 is totally confusing and I fail to see connections to the algorithm\n- the algorithm is not clearly described and has minor typos, e.g.,\n    - $A_a$ is not introduced and initialized \n    - lines 4 and 8: $x_t = x_t \\dots$ should be $x_{t+1}=x_t \\dots$\n    - line 14: what does symbol $min_k$ mean? taking the lowest $k$ features from from $Attr_\\gamma$ (then $attr_\\gamma$ is a $k$-dim vector)? \n- the constraints in Sec. 4.3 seem unnecessary and the theoretical reason for choosing them is not stated.  In addition, the introduced hyper-parameter $S$ could break the previous constraint, i.e., $max(attr_\\gamma) < min(attr_{\\gamma+1})$.\n- the author should pay more effort to justify their claim that \"the Insertion score serves as a more representative indicator of the performance of attribution algorithms.\" (at least should be more than just one paragraph!)\n    - especially, it is interesting to note that the ISA always has the worst deletion score in Table 1"
            },
            "questions": {
                "value": "- could you provide more concrete descriptions (and comparisons) about the local and global attribution methods?\n- could rephrase your arguments in Sec. 4.2 to make it clear to understand?\n- could you theoretically justify the proposed constraints stated in Sec. 4.3? Also, what if you do not add $\\gamma$ to $attr_\\gamma$?\n- could you provide in-depth (better to be quantitative) arguments about the claim that \"the Insertion score serves as a more representative indicator of the performance of attribution algorithms.\"?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5128/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699111206028,
        "cdate": 1699111206028,
        "tmdate": 1699636505146,
        "mdate": 1699636505146,
        "license": "CC BY 4.0",
        "version": 2
    }
]