[
    {
        "id": "CWmY8PkwrW",
        "forum": "qjFnENGhDE",
        "replyto": "qjFnENGhDE",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3281/Reviewer_onGj"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3281/Reviewer_onGj"
        ],
        "content": {
            "summary": {
                "value": "The authors mainly study a variant of FTRL that incorporates adaptive regularization (RegFTRL). They show that RegFTRL converges in a last-iterate sense to approximate Nash equilibria, and to exact Nash equilibria through the use of adaptive regularization. They also propose FollowMu, an implementation of RegFTRL that uses a neural network as a function approximator, for model-free reinforcement learning. Finally, they conduct experiments to support the theoretical findings."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The paper focuses on an important problem that has received considerable attention recently. Unlike much of prior work, the paper focuses on using (adaptive) regularization to guarantee last-iterate convergence, in lieu of using optimism or extra-gradients. Such approaches tend to perform well in practice, so any new theoretical insights about their behavior are definitely valuable. The presentation overall is reasonable, and the results appear to be sound."
            },
            "weaknesses": {
                "value": "The main issue pertains the novelty of the results. There are many existing papers with closely related results, such as 1) \"Last-iterate\nconvergence with full- and noisy-information feedback in two-player zero-sum games;\" 2) A unified approach to reinforcement learning, quantal response equilibria, and two-player zero-sum games;\" 3) \"Modeling strong and human-like gameplay with KL-regularized search;\" and 4) an unpublished paper \"No-Regret Learning in Strongly Monotone Games Converges to a Nash Equilibrium.\" Some of those papers are cited, but the discussion is inadequate, such as the comparison with magnetic mirror descent. Overall, it is known in the literature that in strongly monotone games algorithms such as FTRL exhibit last-iterate convergence, and so one can use adaptive regularization to extend such results in (non necessarily strongly) monotone games as well (by adding a strongly convex regularizer that makes the game strongly monotone). It is not clear to me how the new results are novel compared to the existing literature. Regarding the experimental evaluation (Section 5.1), experiments on very small games such as Kuhn or Leduc can be misleading, and it's hard to draw any definite conclusions. I would recommend using larger games."
            },
            "questions": {
                "value": "A couple of questions for the authors:\n\n1. What is more concretely the problem of using optimism or extra-gradient in the context of Figure 1? You write that \"...can impede\nconvergence, particularly when the real-time policy exhibits chaotic behavior,\" but I don't think I am following this. \n\n2.  I am not sure I see the purpose of Section 2.3. Can the authors explain?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3281/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3281/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3281/Reviewer_onGj"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3281/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698624238344,
        "cdate": 1698624238344,
        "tmdate": 1699636276738,
        "mdate": 1699636276738,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "o8iVVNSAxB",
        "forum": "qjFnENGhDE",
        "replyto": "qjFnENGhDE",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3281/Reviewer_3dkM"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3281/Reviewer_3dkM"
        ],
        "content": {
            "summary": {
                "value": "This paper focuses the problem of learning Nash equilibrium in two-player zero-sum games with last-iterate convergence guarantees. The authors proposed an algorithm called Regularized Follow the Regularized Leader (RegFRTL), which is variant of FTRL with adaptive regularization. For a fixed regularization, it is shown that RegFTRL has linear convergence rates to the unique Nash equilibrium of the regularized normal-form game (NFG) and extensive-form game (EFG). Moreover, by decreasing the regularization term or changing the referenece policy periodically (every $N$ iterations), it is proved that RegFTRL under entropy regularization converges to exact Nash equilibria (without a rate) in normal form two-player zero-sum game. Finally, the authors proposed an algorothm called FollowMu, which utilize the actor-critic framework parameterized by neural networks and empirical estimator of $Q$ function. Experimental results show fast convergence of RegFTRL and FollowMu in both NFGs and EFGs."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "This paper focuses on an important problem of last-iterate convergence in games. The proposed approach is general for various regularization functions and has convergence results for both the normal-form games and extensive-form games. This paper is fairly well-written and easy to follow."
            },
            "weaknesses": {
                "value": "My main concerns are the novelty of the approach, and insufficient discussion on relation to previous works.\n\n1. The proposed approach in this paper is very similar to the approach proposed in [1]. In [1], the authors proposed FTRL-SP and prove it has (1) linear last-iterate convergence rates in the regularized game (2) sublinear last-iterate convergence rates to exact Nash equilibrium in monotone games, which covers two-player zero-sum games as a special case. Moreover, the results of [1] holds under both full-information and noisy feedback. Thus some of results in the current paper is subsumed by [1] which also gives several weakness:\n (a) The current results does not provide convergecne rates to exact Nash equilibrium \n (b) The current results hold only for two-player zero-sum games but not the more general monotone games.\n (c) The current results hold only for full-information feedback. \n2. By introducing regularization to the underlying two-player zero-sum game, the game becomes strongly monotone (strongly-convex-strongly-concave). Since RegFTRL is equivalent to running FTRL on a regularized strongly monotone game, the linear last-iterate convergence of RegFTRL follows form the fact that Mirror Descent (MD) or Follow the Regularized Leader (FTRL, the lazy projection version of MD) has linear last-iterate convergence. This approach is also studied in many recent works [1,2] and the paper should discuss the difference and their unique contribution more clearly. \n3. \" In practical terms, the implementation of the optimistic update approach often necessitates the computation of multiple gradients at each iteration, making it intricate and resource-intensive. \" This is not true for OMWU or OGDA (refers to Optimistic Gradient Descent-Ascent) which only requires computation of one gradient in each iteration. \n4. Some missing references on related works. Recent works [3, 4] have proved tight last-iterate convergecne rates of extragradient and OGDA *without* the unique Nash equilibrium assumption in monotone games. More recently, [5] proved last-iterate convergence rates in two-player zero-sum games (also without the unique Nash equilibrium assumption) with *bandit feedback* using *only* regularization. The result of [5] also shows that regularization is enough for last-iterate convergence rates for zero-sum games, with even more limited feedback.\n\n\n[1] Slingshot Perturbation to Learning in Monotone Games. Abe et al., ArXiv 2023\n\n[2] Last-Iterate Convergence with Full and Noisy Feedback in Two-Player Zero-Sum Games. Abe et al. AISTATS 2023\n\n[3] Finite-Time Last-Iterate Convergence for Learning in Multi-Player Games. Cai et al., NeurIPS 2022 \n\n[4] Last-Iterate Convergence of Optimistic Gradient Method for Monotone Variational Inequalities, Gorbunov et al. NeurIPS 2022\n\n[5] Uncoupled and Convergent Learning in Two-Player Zero-Sum Markov Games. Cai et al. NeurIPS 2023"
            },
            "questions": {
                "value": "I would like to know if the current approach gives more general results: (a) extension to monotone games; (b) last-iterate convergence *rates* to Nash equilibrium; (c) convergence (*rates*) under noisy feedback / bandit feedback."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3281/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3281/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3281/Reviewer_3dkM"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3281/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698636379373,
        "cdate": 1698636379373,
        "tmdate": 1699636276659,
        "mdate": 1699636276659,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "mGCkoZqUKH",
        "forum": "qjFnENGhDE",
        "replyto": "qjFnENGhDE",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3281/Reviewer_43MX"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3281/Reviewer_43MX"
        ],
        "content": {
            "summary": {
                "value": "This paper presents a last-iterate convergent algorithm for equilibrium computation in NFGs and EFGs that does not rely on optimism or uniqueness assumptions. In NFGs, it achieves convergence to an exact Nash equilibrium, whereas in EFGs it converges to a QRE. The paper also presents an implementation of the algorithm which utilizes neural network based function approximation, which is useful in large-scale settings. Finally, it presents numerical evidence to demonstrate the convergence of the framework of algorithms presented."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "1 poor"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. The paper makes a solid technical contribution towards understanding last-iterate convergence in games. In particular, obviating the need for optimism and the uniqueness of equilibrium assumption is quite interesting.\n2. The paper presents numerical simulations of the algorithmic framework, demonstrating fast convergence in NFGs and EFGs, likely competitive with the SOTA."
            },
            "weaknesses": {
                "value": "1. The paper requires significant proofreading. There are many typos and missing articles (e.g., \"continue-time\" and \"continues-time\" should be \"continuous-time\" on page 5) and quantities aren't necessarily always clearly defined (e.g., $r^h$ should be either explicitly given a name or otherwise introduced at the bottom of page 3 since the way it is currently written it is assume that the reader should know what $r^h$ is/that it already has been introduced). \n2. The preliminaries could be made more substantial. A discussion of FTRL (at least explicitly mentioning the FTRL update) would be appropriate in the preliminaries (or earlier in the introduction)."
            },
            "questions": {
                "value": "1. Perhaps you can note once after the preliminaries all proofs are included in the appendix instead of explicitly creating a proof environment for each theorem statement to state that the proof can be found in the appendix.\n2. Have you considered mentioning the last-iterate analysis of OGDA that has been done by Wei et al. 2021 in the related work section? \n3. Why do the plots in Figures 3 and 4 start at $10^2$ and $10^3$? It seems important to note the performance early on as well. \n4. Is there a reason you are not comparing to SOTA CFR variants (e.g. CFR$^+$ [a], DCFR [b], PCFR$^+$ [c]) in your EFG experiments in Figure 4?\n\n[a] Solving Large Imperfect Information Games Using CFR$^+$. Oskari Tammelin, 2014.\n[b] Solving Imperfect-Information Games via Discounted Regret Minimization. Noam Brown and Tuomas Sandholm, 2019.\n[c] Faster Game Solving via Predictive Blackwell Approachability: Connecting Regret Matching and Mirror Descent. Gabriele Farina, Christian Kroer, and Tuomas Sandholm, 2019."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3281/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3281/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3281/Reviewer_43MX"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3281/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698735052793,
        "cdate": 1698735052793,
        "tmdate": 1699636276590,
        "mdate": 1699636276590,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "YWPbwvg1p1",
        "forum": "qjFnENGhDE",
        "replyto": "qjFnENGhDE",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3281/Reviewer_s7M3"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3281/Reviewer_s7M3"
        ],
        "content": {
            "summary": {
                "value": "The paper provides theoretical results for the regularized follow-the-regularized-leader (RegFTRL) algorithm, demonstrating last-iterate convergence in both normal-form and extensive-form games. It highlights a trade-off in the selection of the regularization parameter. Additionally, the authors propose two strategies: a gradual decrease of the regularization parameter and an adaptive adjustment of the reference strategy. Finally, the paper introduces an algorithm based on RegFTRL, extending its applicability to reinforcement learning."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The results presented in this paper have several advantages:\n\n1. the guarantee is for the last iterate, which may make it more favorable in practice;\n\n2. It does not need the uniqueness assumption that appears in other work."
            },
            "weaknesses": {
                "value": "**Novelty:**\n\nThe results presented are not surprising, as one might anticipate that incorporating regularization would enable the algorithm to achieve linear convergence in the last iteration. There are already existing works in the literature that demonstrate last-iterate convergence, such as [Wei et al., 2021], which diminishes the novelty of this result. The significance of the last-iterate result is also questionable, as it is just about the algorithm's output.\n\n**Presentation:**\n\nThe preliminary section in Section 2 could benefit from clearer writing and more precise notation. For example, the notation $V^{h, \\tau}$ is introduced in Section 2.1, but later, in Section 2.3, the paper uses $V^i$, with the superscript taking on a different meaning. \n\nAdditionally, the paper would be strengthened by an expanded discussion on certain results, such as after Theorem 2. A comparison with existing results regarding the convergence rate, given an appropriately chosen regularization parameter, would provide valuable context and insights.\n\n**Rigor:**\n\nCertain sections of the paper lack the necessary rigor. In Section 3.3, two approaches are presented: decreasing $\\tau$ and changing reference strategies. However, the theoretical results in Theorems 2 and 3 are derived under the assumption of a constant $\\tau$, and thus do not directly apply when $\\tau$ is decreasing. A more rigorous approach would involve providing a specific sequence for $\\tau$ and establishing the corresponding convergence rate, rather than merely stating that \"The speed of convergence will be adversely affected as the weight parameter $\\tau$ decreases,\" as is currently done. Regarding the changing reference strategy in Theorem 4, further clarification on the choice of $\\tau$ and the associated rate would enhance the paper's comprehensiveness."
            },
            "questions": {
                "value": "While the value function Q is approximated using an actor-critic approach in equation (3), is it correct to assume that the Q function in equation (2) is known?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3281/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698859917738,
        "cdate": 1698859917738,
        "tmdate": 1699636276507,
        "mdate": 1699636276507,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "QcFhu9DLyP",
        "forum": "qjFnENGhDE",
        "replyto": "qjFnENGhDE",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3281/Reviewer_gsq4"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3281/Reviewer_gsq4"
        ],
        "content": {
            "summary": {
                "value": "This study introduces Regularized Follow-the-Regularized-Leader (RegFTRL), an innovative method for equilibrium learning in two-player zero-sum games. RegFTRL, an improved form of FTRL, incorporates a dynamic regularization mechanism that includes the familiar entropy regularization. Within normal-form games (NFGs), RegFTRL demonstrates a promising quality of swift, linear convergence to an estimated equilibrium and can adjust to achieve exact Nash equilibrium. When applied to extensive-form games (EFGs), the entropy-regularized version of RegFTRL, specifically through the Multiplicative Weights Update (MWU) technique, also attains linear convergence to the quantal response equilibrium without depending on optimistic updates or unique conditions. This illustrates that regularization alone can ensure direct convergence. The paper also presents FollowMu, an applied variant of RegFTRL using neural networks for function approximation in learning within evolving sequential settings. Empirical evidence confirms RegFTRL's theoretical advantages and shows that FollowMu performs well in EFGs."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "4 excellent"
            },
            "strengths": {
                "value": "I can succinctly state that a high-quality paper's value is self-evident and does not require elaborate explanation. Regarding zero-sum games, exponential convergence has already been established by seminal works such as Wei et al. (ICLR 2020) and Panageas (NeurIPS 2019). However, this paper presents a method characterized by its simplicity of proof and seamless application to extensive-form games (EFGs). On the basis of its theoretical contributions, this is the main reason I view the paper favorably."
            },
            "weaknesses": {
                "value": "Part of the results have been already proposed in the literature via different analysis.\nI think that authors already understood that their presentation could be improved especially in presenting of the algorithm\nbut I understand that it is due to the page limits"
            },
            "questions": {
                "value": "I did not have the time to delve in the details of the proof due to the always pressing schedule of ICLR but I would like to ask some questions to be sure that I understand correctly the result:\n\n1) Do you request uniqueness of NE in zero-sum game?\n2) In NFGs (0-sum), your algorithm converge always to an \\eps-NE?\n3) What is the reason that you pass to FollowMu in the experimental section?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 5,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3281/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699161609566,
        "cdate": 1699161609566,
        "tmdate": 1699636276449,
        "mdate": 1699636276449,
        "license": "CC BY 4.0",
        "version": 2
    }
]