[
    {
        "id": "sdrTfQtWEu",
        "forum": "qtE9K23ISq",
        "replyto": "qtE9K23ISq",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission304/Reviewer_qeEH"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission304/Reviewer_qeEH"
        ],
        "content": {
            "summary": {
                "value": "Existing UDG ( Unsupervised Domain Generalization) methods usually require samples to have domain labels for better learning of domain invariant features. The collection of domain labels is also costly in practical scenarios, which limits existing UDG. This paper proposes a BSS ( Batch Styles Standardization) approach in combination with existing SSL ( Self Supervised Learning ) methods, eliminating the need for domain labels. The authors combine the proposed BSS method with several SSL methods, experiment on UDG datasets, and obtain significant improvement in results."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. This paper studies a novel problem, i.e. Unsupervised Domain Generalization without domain label. The basic idea is sound and very worthwhile.\n2. Compared with the existing UDG methods, the experimental accuracy of the author's method has a significant advantage.\n3. The writing is good, and the structure is easy to follow.\n4. The ablation experiment was adequate.\n5. In the part of comparative experiment, the author combined BSS with various types of SSL methods to demonstrate the universality of this method."
            },
            "weaknesses": {
                "value": "1. Inadequate ablation experiments.\n\nIn Section 5.2, the authors do not show the ablation effect of the original SimCLR. Table 4 demonstrates the effectiveness of FA and BSS compared to baseline SimCLR. However, it is not reflected in Section 5.2. So it does not show that FA and BSS are effective compared to \noriginal SimCLR.\n\n2. Perhaps there is a limitation to BSS.\n\nAssuming that domain labels are not available, there is no guarantee that a number of randomly selected images belong to different domains. As the author said, \"Finally, after applying the inverse Fourier transform to the different modified Fourier transforms, the style of the randomly chosen image is transferred to all images, effectively standardizing/harmonizing the style.\"\nIn the worst case, it is possible that a number of randomly selected images all belong to the same domain (same style), and then their magnitude spectra may be similar. If the magnitude spectra of these images are still used to augment all of the images, it may indeed create harder negative samples (because of the similar magnitude spectra). However, it would also create the problem of more similarity between pairs of positive samples, potentially forcing the network to capture more similar style information than domain invariant information in the positive sample pairs."
            },
            "questions": {
                "value": "1. What does \"spurious correlations\" mean? Is it the possibility that in SSL, when repelling negative samples, the main basis for error may be the difference in style?\n2. In section 4.2, \"We did not use ImageNet transfer learning, except on DomainNet to allow fair comparisons with prior UDG works.\" Does it mean that this paper uses an ImageNet pre-trained model when conducting experiments on the DomainNet dataset?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission304/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1697543760924,
        "cdate": 1697543760924,
        "tmdate": 1699635957092,
        "mdate": 1699635957092,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "ccx2PtNpMP",
        "forum": "qtE9K23ISq",
        "replyto": "qtE9K23ISq",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission304/Reviewer_PTUx"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission304/Reviewer_PTUx"
        ],
        "content": {
            "summary": {
                "value": "The paper studies the problem of Unsupervised Domain Generalization (UDG) and proposes Batch Styles Standardization (BSS) for contrastive-based pretraining. It is a Fourier-based method that aims to standardize the style of images in a batch. The method can be plugged into many existing methods easily and shows good performance improvement across multiple benchmarks"
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- The paper is well-written and easy to follow.\n\n- The motivation is clear and the method is simple and neat.\n\n- The reported performance improvement is significant over the previous methods."
            },
            "weaknesses": {
                "value": "My major concern is that some important baselines are missing:\n- What is the performance of the ERM (empirical risk minimization) on those benchmarks? People have observed ERM being a very strong baseline when it comes to domain generalization settings [1, 2].\n- As a small fraction of labeled data is always used, why not try some good semi-supervised learning methods such as FixMatch [3] or AdaMatch [4] (which also deals with domain shift)? And there is also contrastive-based semi-supervised learning such as CoMatch [5]. Since the goal is to improve the performance on unseen target domains, what is the advantage of using a framework of unsupervised pretraining + finetuning?\n- A related remark would be: what is the SOTA methodology when it comes to domain shift? In practice, one may easily resort to some VLMs (e.g. CLIP and its variants) pre-trained on large-scale image-text pair data when facing domain shift problems. As CLIP models have shown very good performance on samples under distribution shift, especially in image classification, I wonder to what extent can the problem be solved by them already. I think it makes more sense to develop techniques on top of these strong baselines, as it is very likely the method or the performance improvement on small-scale datasets or non-SOTA models does not transfer/scale well. It would be much more interesting to see if the proposed BSS still holds the same performance gap on top of CLIP. That being said, this remark is not a criticism of the authors who follow the common practice. But it would be still great if the authors could share their thoughts on this point.\n\nMinor:\n- To be more self-contained, it would be great if the authors could also introduce the contrastive-based UDG methods before Section 3.2.2.\n\n[1] In Search of Lost Domain Generalization, Ishaan Gulrajani et al., ICLR 2021\n[2] OoD-Bench: Quantifying and Understanding Two Dimensions of Out-of-Distribution Generalization, Nanyang Ye et al., CVPR2022\n[3] FixMatch: Simplifying Semi-Supervised Learning with Consistency and Confidence, Kihyuk Sohn et al., NeurIPS 2020\n[4] AdaMatch: A Unified Approach to Semi-Supervised Learning and Domain Adaptation, David Berthelot et al., ICLR 2022\n[5] CoMatch: Semi-supervised Learning with Contrastive Graph Regularization, Junnan Li et al., ICCV 201"
            },
            "questions": {
                "value": "- What are the source domains for PACS pretraining?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "NA"
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission304/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission304/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission304/Reviewer_PTUx"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission304/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698197080866,
        "cdate": 1698197080866,
        "tmdate": 1700665614838,
        "mdate": 1700665614838,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "qkf7sxgnmM",
        "forum": "qtE9K23ISq",
        "replyto": "qtE9K23ISq",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission304/Reviewer_gWCx"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission304/Reviewer_gWCx"
        ],
        "content": {
            "summary": {
                "value": "This paper studies the unsupervised domain generalization problem where there is a labeled training set, an unlabeled training set, and a test set. The main claim is that the style information should be standardized in training, which motivates the authors to propose BSS (Batch Style Standardization) to combine with self-supervised learning methods. Experiments on several benchmark datasets show the effectiveness of the BSS method.\n\n-----Post rebuttal\n\nI increased my score from 3 to 5 since they addressed my concerns. However, I did not give a 6 since I still think the novelty is limited."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The proposed method is simple and useful in image datasets.\n2. The combination of BSS with SSL is interesting.\n3. The results show that the BSS approach is effective compared to other counterparts."
            },
            "weaknesses": {
                "value": "1. The major weakness is novelty. Given that Fourier-based methods have been extensively studied in existing DG literatures, the direct adoption of Fourier features is not entirely novel. Plus, the idea of transforming the styles in batch is deeply related to Mixstyle [Zhou et al., ICLR21] but authors did not compare or discuss the difference.\n2. The motivation of combining BSS with self-supervised learning is not clear. I can only see this: we can always combine them, that's all. I do not see the insights of such combination.\n3. Section 3.2, i.e., the BSS part, is hard to understand. Authors should do their best to better present this part.\n4. Comparision approaches are not enough: authors should compare with existing Fourier methods to validate their effectiveness.\n5. There lacks theoretical support of why such BSS approach can succeed in learning domain-invariant representations."
            },
            "questions": {
                "value": "See weakness."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission304/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission304/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission304/Reviewer_gWCx"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission304/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698403023798,
        "cdate": 1698403023798,
        "tmdate": 1700718320601,
        "mdate": 1700718320601,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "nvR4llSAvR",
        "forum": "qtE9K23ISq",
        "replyto": "qtE9K23ISq",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission304/Reviewer_eMsd"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission304/Reviewer_eMsd"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a batch-standardization method for domain-invariant self-supervised learning. The idea is borrowed mainly from Fourier domain adaptation. However, the new advantage is that it eliminates the requirements of domain labels. This paper validates the effectiveness on various benchmarks, such as PACS, DomainNet."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The biggest advantage of the proposed method is that it does not need domain labels to learn domain invariant features. It indeed reduces the requirements for domain labels. The experimental results show the effectiveness of the proposed BSS on various benchmarks."
            },
            "weaknesses": {
                "value": "[1] Originality: This paper proposes a batch-style standardization method to mix the domain styles in the batch. However, the idea is largely borrowed from Fourier Domain Adaptation [A], FACT[B] and Domain-invariant masked autoencoder [C]. The extension to samples in a mini-batch is also direct and does not need significant designs. Considering the author only claims one novelty, I do not think this paper is above the bar of ICLR.\n\n[A] FDA: Fourier Domain Adaptation for Semantic Segmentation\n[B] A Fourier-based Framework for Domain Generalization\n[C] Domain Invariant Masked Autoencoders for Self-supervised Learning from Multi-domains\n\n\n[2] The experimental results. I have also noticed that CycleMAE, which was published in the last ICLR, also lists the comparison of different pretrained models in Table 5. It shows comparable results with unsupervised learning pretrained models. In addition, the author should compare with CycleMAE [D].\n[D] CYCLE-CONSISTENT MASKED AUTOENCODER FOR UNSUPERVISED DOMAIN GENERALIZATION"
            },
            "questions": {
                "value": "Novelty and experiments are my most important concerns. Please carefully address my concerns listed in the weakness."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission304/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission304/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission304/Reviewer_eMsd"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission304/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698547487179,
        "cdate": 1698547487179,
        "tmdate": 1700703753919,
        "mdate": 1700703753919,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "tZdtRlTon0",
        "forum": "qtE9K23ISq",
        "replyto": "qtE9K23ISq",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission304/Reviewer_qVbh"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission304/Reviewer_qVbh"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes Batch Styles Standardization (BSS) to reduce spurious correlations in conventional self-supervised learning (SSL) representations, thereby making the resulting models generalize better on the test data drawn from an unseen domain. Specifically, the authors leverage the existing Fourier-based augmentation technique to transfer the style of a randomly chosen image to all other images within a batch. They also elaborate how BSS can be integrated with popular contrastive and non-contrastive SSL methods such as SimCLR, SWaV, and MSN. Experiments were conducted on 3 benchmark datasets for domain generalization to evaluate how BSS improves the performance of these SSL methods."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. The paper is well written.\n2. The authors perform a comprehensive literature review on SSL and unsupervised domain generalization.\n3. The paper offers a clear explanation of how Fourier-based augmentation and BSS operate on images, making the methodology more reader-friendly for a broader audience."
            },
            "weaknesses": {
                "value": "For now I do not see any obvious weaknesses or technical flaws in the paper. However, it would be beneficial if the authors could provide further clarity on the novelty aspect. At the moment, it appears to be an application of Fourier-based augmentation to self-supervised learning.\n\nMinor suggestions:\nSimCLR and SWaV should be categorized as contrastive-based SSL methods in the second paragraph of Contributions."
            },
            "questions": {
                "value": "Can authors conduct some investigation on why BSS is sometimes outperformed (though by a small margin) by regular Fourier-based augmentation on the DomainNet dataset?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission304/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission304/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission304/Reviewer_qVbh"
                ]
            }
        },
        "number": 5,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission304/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698802873445,
        "cdate": 1698802873445,
        "tmdate": 1699635956704,
        "mdate": 1699635956704,
        "license": "CC BY 4.0",
        "version": 2
    }
]