[
    {
        "id": "LHUiOqmEBr",
        "forum": "QV6uB196cR",
        "replyto": "QV6uB196cR",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission518/Reviewer_Up8V"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission518/Reviewer_Up8V"
        ],
        "content": {
            "summary": {
                "value": "Due to the depreciation of identifiers causing interference, it's hard to separate groups into treatment and control groups in randomized control experiments. The authors propose VAE-based treatment effect estimators with interference to address the issue. The authors test their model on synthetic data created with the Erdos-Renyi model and the AIRBNB simulations. They conduct extensive experiments comparing different model parameters and compare their work with other methods like HT and DM."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- I love the idea and write-up. \n\n  - The authors address an actual problem likely to be faced in randomized online experiments.  \n  - The authors do a great job of presenting the problem and proposed solution. The introduction is well written, and before they introduce their method, the authors clearly explain the shortcomings of  HT and SUTVA methods. Additionally, the write-up is generally consistent and concise.\n\n- The authors address (and perform experiments) for several different settings, for example, the populations size and impact of neighborhood accuracy on GATES estimation, which was very useful. The graphs are intuitive and comparison with other methods are clear."
            },
            "weaknesses": {
                "value": "While I like most of the paper, I found a few shortcomings and unclear parts I would like the authors to address;\n\n- Although the authors address the potential issues that could arise from inaccurate neighborhoods, it's mainly focused on the removal/addition of edges. I am curious about a setting where the edge exists but is weak. For example, assume a user owns several devices (e.g., same login credentials for Netflix), however, in principle, there are several *different* users using the same credentials. Would it be better to use a probabilistic matrix and rely on a threshold to decide the neighborhood? \n\n\n- While the authors address the issue of varied treatments on devices in the neighborhood, I am curious about a case where the actions determining Y are completely different on each device in N (e.g., in the case of shared Netflix passwords accessed by different members.).  How would that affect Y?\n\n\n- In practical settings, even though users might own different devices, in most cases, they are logged/active on one at a time or restricted to a single access at a time. Would adding the temporal (time) aspect of the model improve treatment estimates?\n\n\n- There are some write-up issues and typos. Although this can be implied, some variables are not immediately defined when used, e.g., in A2. On page 8, the last sentence before section 5.2 seems incomplete. On page 6, it should |M(i)| >> |N(i)| not |M(i)| >> N(i), page 4 last paragraph, \"treatment group in small\" should  \"treatment group is small\", e.t.c.  \n\n\n- Some of the crucial sections are missing. I think having a conclusion/discussion and limitations would help address potential issues that might arise, for example, from unsatisfied assumptions and broader recommendations. I understand this might be a space issue, but if authors can find a way to add them, that might be helpful. \n\n\n- Other issues, mostlyminor: Authors could improve the font of the figures. What do the authors mean by type in this sentence \"if the listing and person have the same type\" on page 8? In the age of GDPR and similar privacy measures, device linking might not just fall short but might be an altogether infeasible approach. Lastly, I find the explanation given for the strong assumption (A7) a bit unrealistic."
            },
            "questions": {
                "value": "I generally like the authors' work and presentation. I have a couple of questions in the weakness section that I would like the authors to address."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission518/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission518/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission518/Reviewer_Up8V"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission518/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698557277336,
        "cdate": 1698557277336,
        "tmdate": 1699635978917,
        "mdate": 1699635978917,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "sR7eA57u4o",
        "forum": "QV6uB196cR",
        "replyto": "QV6uB196cR",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission518/Reviewer_ZXoD"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission518/Reviewer_ZXoD"
        ],
        "content": {
            "summary": {
                "value": "The authors provide a method to estimate the global treatment effects. The theoretical analysis is provided and the experiment results verify the correctness of the theoretical results and the effectiveness of the proposed methods."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The presentation of the paper is good, making it clear for those that are not familiar with the field.\n2.  the assumption is shown clearly together with the theoretical analysis."
            },
            "weaknesses": {
                "value": "1. the contribution of the work should be listed more clearly, compared with the existing methods. The table can be showed if needed.\n2. the novel of the theoretical results should be verified. I am not sure which thm is essential and novel in the work. I am not sure whether the prop. is directly from given related works.\n3. more experiments results need to be provided with larger dataset and the more complex real world settings\n\n\nI am not an expert in causal inference therefore some of my questions might not be reasonable. I will change my score according to the following rebuttal and other reviewers."
            },
            "questions": {
                "value": "1. The analysis in the work is all about the linear model, how about non-linear ones?\n2. how are the proposed methods different from the classical VAE, if so, if more advanced ones can be adopted?\n3. will the noise distribution influences the methods; for the time series data, will the noise correlation or process take effects?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "1: You are unable to assess this paper and have alerted the ACs to seek an opinion from different reviewers."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission518/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698579388600,
        "cdate": 1698579388600,
        "tmdate": 1699635978845,
        "mdate": 1699635978845,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "WHF2huQeOr",
        "forum": "QV6uB196cR",
        "replyto": "QV6uB196cR",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission518/Reviewer_QWuy"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission518/Reviewer_QWuy"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a new approach for estimating the global average treatment effect (GATE) considering identity fragmentation. The authors conducted both theoretical analysis and experiments to validate their approach, demonstrating its effectiveness compared to standard estimators."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "1 poor"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "S1. An approach to estimate causal effects in the presence of identity fragmentation, enhancing the accuracy and reliability of A/B testing in online platforms.\n\nS2. The approach proves effective in the experiments."
            },
            "weaknesses": {
                "value": "W1. Poor presentation.\n\nW1-a. Some variables, such as X, lack clear definition or explanation, particularly in their role in estimating true neighbors within the model. This lack of detail or oversimplification can lead to confusion when attempting to understand the motivation and core concepts presented in the paper, significantly impacting its quality.\n\nW1-b. The utilization of the trained model, specifically in the format of equation A2, within the estimation process of the GATE value is not elucidated. This omission introduces ambiguity when attempting to compare it with previous methods in the experimental section.\n\nW2. Unconvincing experiments.\n\nW2-a. The settings appear to intentionally align with the assumptions of the proposed model without practical justification.\n\nW2-b. The experimental environments are not clearly outlined, including specific settings of the baseline estimators and the methodology used for calculating metrics in the figures."
            },
            "questions": {
                "value": "1 In equation A2, c0, c1, g, and w are referred to as neural network functions, yet no further details are provided. This omission makes it challenging to infer the specific characteristics or behavior of the proposed approach.\n\n2 Regarding your simulation environment:\na. The relationship between the covariate X and the randomly generated \"random device graphs\" remains unclear. Given the methodology described, it appears that X plays a vital role in determining neighboring relationships. A more detailed explanation is needed to elucidate this connection.\nb. The similarity between the equation for generating ground truth and model A2 raises questions. Is there a specific reason for this resemblance, and could it potentially confer an advantage to the proposed model in certain settings? Further clarification on this matter would be beneficial.\nc. The computation of the bias metric in the experiment figures is not discernible from the paper alone. Providing insight into how this metric is calculated would enhance the reader's understanding of the experimental methodology."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission518/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698735399170,
        "cdate": 1698735399170,
        "tmdate": 1699635978778,
        "mdate": 1699635978778,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "fsdgBBnDDe",
        "forum": "QV6uB196cR",
        "replyto": "QV6uB196cR",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission518/Reviewer_iRkW"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission518/Reviewer_iRkW"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a mechanism to perform A/B testing and estimating the global average treatment effect (GATE) in a setting where users interact with online service via multiple devices and the precise mapping of users to devices is unknown, i.e., there is identity fragmentation. The methodology rests on the key assumption that, for each user, a superset of their real devices is known. The paper ventures to show that GATE is possible under such a setting and proposes a good estimator."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The paper makes an interesting contribution in an active research area.\nEventually, the results present the developed method to show less bias than others."
            },
            "weaknesses": {
                "value": "The core assumption is the availability of a model M which provides information on the true underlying user-device graph adjacency matrix A, in the sense that one can get the predicted or assumed neighbors of a device. These neighbors are assumed to be always superset of the true neighbors, as stated in Equation A7, in conformity with the assumptions stated elsewhere in the paper. This assumption is justified by a geographi argument. However, this assumption is not revisited again in Section 5, where experiments are presented. It is not clear what extent those supersets are meant to have. Perhaps that related to the strength of interference r, yet that is not clearly stated. In Section 5.3 the size of the fraction of extraneous neighbors in M(i) is eventually taken in consideration. However, this parameter was not discussed in previous experiments. The notion of extraneous neighbro is not discussed prior to that.\n\nParts of the paper are incomplete. Section 5.1 ends abruptly. Conclsusions do not exist."
            },
            "questions": {
                "value": "Why is M(i) not discussed in the first experiments?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission518/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699274340268,
        "cdate": 1699274340268,
        "tmdate": 1699635978692,
        "mdate": 1699635978692,
        "license": "CC BY 4.0",
        "version": 2
    }
]