[
    {
        "id": "RlTEQbXIp0",
        "forum": "rnHqwPH4TZ",
        "replyto": "rnHqwPH4TZ",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission901/Reviewer_UhCD"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission901/Reviewer_UhCD"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a technique called trajectory stitching (T-Stich) to reduce the overall inference time of DPMs while maintaining the generation quality. The method is mainly designed based on two insights. First, differently-sized models trained on the same data distribution share similar encodings thus one can switch between these models during the denoising steps. Second, although the smaller models have lower generation quality than larger models, they are sufficient in earlier denoising steps which generate image global structures. Thus, the proposed T-Stich method reduces the inference time by utilizing a smaller and faster model in the earlier steps and switches to the more capable but more expensive larger model in later steps and controls the trade-off between quality and speed by adjusting the fraction of steps using the large model. Experiments on different pre-trained DPM models show the proposed method can reduce the latency while maintaining generation quality. In addition, it shows using a general model in the early steps and a stylized model in later steps can provide better prompt alignment than completely using the stylized model."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "S1. The proposed method is intuitive and simple. It is very easy to incorporate this method for any diffusion model as long as there are model variants of different sizes and inference costs that are trained on the same data distribution.\n\nS2. The writing is easy to follow and the presentation is mostly clear.\n\nS3. There is a good amount of experiments on different diffusion models and example images showing the proposed method can reduce the inference cost while maintaining comparable image quality when compared to the single model for all timesteps vanilla approach."
            },
            "weaknesses": {
                "value": "W1. This paper uses a too simple and strict design of using a weaker model in earlier steps and switching to a stronger model in later steps. However, there is not enough justification or comparison to other baseline approaches. How does it compare to more flexible baselines, e.g. interleaving strong model steps and weaker model steps throughout the whole process, or gradually reducing the probability p of using the weaker model e.g. from p=1 at t=T to and p=0 at t=0?\n\nW2. Lack of comparison to other related works on multi-expert DPM approaches like [1] and [2]. Under the same inference time budget, how does the proposed approach compare to [1]? Does using a larger pre-trained model in the earlier steps and using a smaller model in later steps have better or worse generation quality compared to [1] which adopts differently designed architectures tailored toward the low-frequency features for the earlier steps or the high-frequency information for later denoising steps?\n\nW3. In Figure 15, even the simple baseline of directly reducing the sampling steps outperforms the proposed method at the 10-50 steps range for s=1.5 and 10-20 steps range at s=2.0. This means the T-stitch approach could achieve better generation quality and latency tradeoff if combined with reducing steps and this was not investigated. More importantly, this result shows the proposed t-stitch approach does not have a strong performance even compared to this simple baseline and more comparisons to other approaches in the literature like [1] and [2] are needed.\n\nReferences:\n[1] Y. Lee, J.-Y. Kim, H. Go, M. Jeong, S. Oh, and S. Choi, ‘Multi-Architecture Multi-Expert Diffusion Models’,\n[2] Y. Balaji et al., ‘ediffi: Text-to-image diffusion models with an ensemble of expert denoisers’"
            },
            "questions": {
                "value": "Q1. Have you considered and compared to more flexible baselines, e.g. interleaving strong model steps and weaker model steps throughout the whole process, or gradually reducing the probability p of using the weaker model e.g. from p=1 at t=T to and p=0 at t=0?\n\nQ2. Under the same inference time budget, how does the proposed approach compare to [1]? Does using a larger pre-trained model in the earlier steps and using a smaller model in later steps have better or worse generation quality compared to [1] which adopts differently designed architectures tailored toward the low-frequency features for the earlier steps or the high-frequency information for later denoising steps?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "N/A"
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission901/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698732901901,
        "cdate": 1698732901901,
        "tmdate": 1699636016895,
        "mdate": 1699636016895,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "kJ1Fj6BlSA",
        "forum": "rnHqwPH4TZ",
        "replyto": "rnHqwPH4TZ",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission901/Reviewer_omxW"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission901/Reviewer_omxW"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a accelerating sampling method of diffusion model. Based on the phenomenon that different diffusion models learn similar encodings under the same training data distribution, this paper proposes to use a small model in the early sampling period to learn the global structures, while a larger model being adopted in the later sampling period to learn high-frequency details."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1.\tThe proposed method can conveniently adopt the existing pretrained diffusion models without finetuning, to accelerate the sampling speed.\n2.\tThe proposed method which using a small general expert at the beginning sampling stage of stable diffusion results in better prompt alignment.\n3.\tWhile a two-stage sampling is used in this paper, the proposed method can also be expanded to multi-stage."
            },
            "weaknesses": {
                "value": "1. Two models mean more storage consume, or if they are sent into the GPU in order, they will be in and out for every batch, which is not convenient.\n2. The authors are recommended to compare the speed of their proposed method with the other accelerating methods mentioned in the second paragraph of Introduction."
            },
            "questions": {
                "value": "Please refer to my comments on weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission901/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698853750627,
        "cdate": 1698853750627,
        "tmdate": 1699636016815,
        "mdate": 1699636016815,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "x9r4SWzmmZ",
        "forum": "rnHqwPH4TZ",
        "replyto": "rnHqwPH4TZ",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission901/Reviewer_tbyv"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission901/Reviewer_tbyv"
        ],
        "content": {
            "summary": {
                "value": "This paper introduced trajectory stitching (T-Stitch), a simple approach to accelerate the sampling process of diffusion models by dynamically allocating computations to the sampling trajectory. The motivation for this work was the observation from prior works that different DPMs trained in the same data distribution learn similar score estimation regardless of model sizes and architectures. Further investigations show the frequency bias of diffusion models at varying noise levels. Altogether, this motivates this work to stitch the early sampling trajectory from smaller models with ones of larger models, where smaller models and larger models correspond to global shape and local textures, respectively.\n\nThe proposed technique accelerates the sampling speed by 40% w/o quality degradation or retraining. It is also complementary to advanced diffusion samplers based on better ODE discretization. Surprisingly, T-Stitch improves the prompt alignment of stylized latent diffusion models (LDMs)."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "This work has clear merits in its motivation and easy-to-understand simple technique. I enjoy the clarity of writing. It is also reminiscent of speculative decoding for language models. Importantly, this stitching is built upon the dynamics of diffusion models, clearly distinguishing it from model-wise stitching and being off-the-shelf for pretrained models. The experiments show the Pareto frontier produced by T-stitch and its advantage over the baseline setup."
            },
            "weaknesses": {
                "value": "However, the drawbacks of this work are also apparent. Despite improving the prompt alignment of stylized Stable Diffusion (SD) models, there needs to be a clear investigation into why this could happen. It demonstrated clever empirical usage of prior observations but still failed to dig into the phenomena to offer better depth and insights.\n\nThe technique drawback, although preventing it from reaching more elevated quality, is not a barrier to accepting this work. I'd agree that the current scope has met the bar of ICLR. Good work!"
            },
            "questions": {
                "value": "Please see above."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission901/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699145611486,
        "cdate": 1699145611486,
        "tmdate": 1699636016745,
        "mdate": 1699636016745,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "GXfeIQu6pU",
        "forum": "rnHqwPH4TZ",
        "replyto": "rnHqwPH4TZ",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission901/Reviewer_9mJB"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission901/Reviewer_9mJB"
        ],
        "content": {
            "summary": {
                "value": "In summary, T-Stitch is a simple yet effective way to accelerate sampling in large diffusion models by strategically combining them with smaller models, with little or no drop in sample quality. The results demonstrate it is broadly applicable across model architectures.\n\n- It proposes a method called \"Trajectory Stitching\" (T-Stitch) to accelerate sampling in pretrained diffusion models without loss of quality. The key idea is to use a smaller, faster diffusion model for the initial sampling steps and switch to a larger, higher quality model later in the process.\n- It is based on the observation that different diffusion models trained on the same data distribution learn similar latent representations, especially in early sampling steps. So the small model can handle the initial coarse sampling while the large model refines details later.\nExperiments show T-Stitch can accelerate sampling in various diffusion architectures like DALL-E, Stable Diffusion, etc without quality loss. For example, with DiT models it allows replacing 40% of steps with a 10x faster model without performance drop on ImageNet.\nT-Stitch also improves prompt alignment in finetuned diffusion models like stable diffusion. This is because finetuning can hurt prompt alignment which the small general model can complement.\n- The method is complementary to other sampling acceleration techniques like model compression, distillation etc. Those can be applied to the part handled by the large model.\n- T-Stitch achieves better speed vs quality tradeoffs compared to model stitching techniques like SN-Net which permanently stitch model components. T-Stitch stitches sampling trajectories."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "Overall, T-Stitch demonstrates a simple, generalizable, and effective approach for diffusion sampling acceleration that complements existing techniques. The strong experimental results and ablation analysis make a compelling case for the method.\n- Novel Idea: Trajectory stitching is a simple yet novel idea of accelerating diffusion sampling by combining models of different sizes. Prior work mostly focused on using a single model. The insight of leveraging similarity in early sampling latents is clever.\n- Broad Applicability: The method is shown to be broadly applicable across various diffusion model architectures like DALL-E, Stable Diffusion, U-Nets etc. It also improves finetuned models like stylized Stable Diffusion. This demonstrates the generality of the approach.\n- Pareto Optimality: T-Stitch provides better speed vs quality tradeoffs compared to techniques like model stitching and even some training based methods. The Pareto frontier is improved.\n- Realistic Setting: The method is evaluated in realistic settings using widely adopted models like Stable Diffusion. Showing acceleration and prompt alignment improvement makes it highly practical."
            },
            "weaknesses": {
                "value": "- Memory Overhead: Adopting additional smaller models during sampling increases memory usage, which could be a concern for very large models.\n- Finicky Tuning: Getting the right model stitching fractions to optimize the speed-quality tradeoffs may require finicky tuning based on the models and datasets. More principled guidelines could help.\n- Theoretical Analysis: While FID evaluates sample quality well, measuring sample diversity could be helpful to ensure stitching does not negatively impact it. The paper lacks theoretical analysis and justification on why stitching trajectories preserves sample quality, beyond empirical evidence."
            },
            "questions": {
                "value": "1. For finetuning experiments, can you elaborate on the exact finetuning procedure? Was it only on stitched intervals?  How do fully finetuned models compare?\n2. The prompts used for stable diffusion examples are quite simple. Have you tried more complex prompts and datasets? How robust is the method?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission901/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699500777001,
        "cdate": 1699500777001,
        "tmdate": 1699636016683,
        "mdate": 1699636016683,
        "license": "CC BY 4.0",
        "version": 2
    }
]