[
    {
        "id": "PBRUDWXQBL",
        "forum": "RUvzlotXY0",
        "replyto": "RUvzlotXY0",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3128/Reviewer_eQMG"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3128/Reviewer_eQMG"
        ],
        "content": {
            "summary": {
                "value": "The paper introduces HiCBridge, a new method for improving the resolution of Hi-C genomic data. HiCBridge utilizes a direct diffusion process to overcome the limitations of previous techniques, yielding higher quality data. It outperforms existing models in accuracy and reliability, offering a robust tool for genomic research."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "The paper introduces an original technique leveraging a direct diffusion bridge to enhance Hi-C data resolution, showcasing creativity in addressing the limitations of existing deep learning methods. The quality of research is evident through rigorous evaluation against standard metrics and the demonstration of reproducibility, indicative of robust experimental design. Clarity is a strength of the paper, with concise explanations of complex methodologies and clear communication of results. The significance of the work is considerable, offering a tool with potential for broad applications in genomic research, with implications for understanding genomic architecture and influencing disease research. Overall, the paper represents a meaningful advance in bioinformatics, combining originality and quality with clear presentation and significant potential impact."
            },
            "weaknesses": {
                "value": "The methodology underpinning HiCBridge, while innovative, could be more transparent, particularly in how it fits within broader Hi-C analysis workflows and its robustness to data biases and hyperparameter variations. A thorough comparative analysis against a wider array of both deep learning and traditional approaches could better contextualize its performance claims. The validation of HiCBridge could also be strengthened by testing across diverse Hi-C datasets to ensure its generalizability. Furthermore, elucidating the biological significance of the resolution enhancement through detailed case studies would demonstrate the practical impact of the method. The paper would benefit from a discussion on computational efficiency, an essential consideration for large-scale genomic data analysis. Lastly, an in-depth consideration of the method's limitations, such as the effects of sequencing depth and data noise, would provide a more balanced view and inform future enhancements. Addressing these areas could significantly solidify the paper's contributions and utility in the field."
            },
            "questions": {
                "value": "What are the potential limitations of HiCBridge, particularly concerning sequencing depth, input data resolution, and noise in Hi-C datasets?\nHow might these limitations affect the application of HiCBridge in different research scenarios?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "none"
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3128/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699065822584,
        "cdate": 1699065822584,
        "tmdate": 1699636259805,
        "mdate": 1699636259805,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "m7br2eNWTc",
        "forum": "RUvzlotXY0",
        "replyto": "RUvzlotXY0",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3128/Reviewer_iBuE"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3128/Reviewer_iBuE"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes an Hi-C enhancement using Direct Diffusion Bridge (HiCBridge) model. The proposed method learns the mapping from low-resolution to high-resolution Hi-C data without experiencing mode collapsing issues commonly observed in Generative Adversarial Networks (GANs) or texture blurring that can occur in standard supervised deep learning approaches. The proposed model demonstrates good performance on standard vision metrics, various biological metrics, and downstream tasks across diverse cell types and resolutions."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "+ As to the overall paper structure, I think it is clear and easy to follow.\n\n+ The method used in the paper is reasonable. In simpler terms, the direct diffusion bridge allows us to calculate the likelihood of a diffusion process reaching a particular state at a specific time, without needing to consider the entire path the process took. \n\n+ The experimental results underscore the versatility and reliability of HiCBridge+ across various resolutions and human cell types. These findings may have the potential to be a valuable tool for advancing chromatin research."
            },
            "weaknesses": {
                "value": "- The authors seem to have only used existing DDPM model to generate new low-resolution Hi-C data corresponding to the high-resolution ones. The authors have primarily relied on existing methods to generate the data, which, in itself, does not constitute a significant contribution. It is crucial for the authors to clearly explain the problem they aim to address and the challenges associated with it.\n\n- The authors claim that the conventional regression models, which are based on the Mean Squared Error (MSE) loss, cause the model to regress to the mean in the target domain. This regression leads to blurring and loss of details. However, the author do not provide visual results to demonstrate this issue. The authors should elaborate on the challenges posed by the problem. Describing the difficulties and complexities associated with addressing the problem will highlight its importance and demonstrate the need for the proposed solutions.\n\n-----------------------After Rebuttal---------------------------\n\nThank you for your feedback. The rebuttal addressed my concerns well. Considering other reviews, I have decided to increase my score."
            },
            "questions": {
                "value": "Please refer to the weakness part."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3128/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3128/Reviewer_iBuE",
                    "ICLR.cc/2024/Conference/Submission3128/Senior_Area_Chairs"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3128/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699086341997,
        "cdate": 1699086341997,
        "tmdate": 1700746679880,
        "mdate": 1700746679880,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "5YX7D4iZoM",
        "forum": "RUvzlotXY0",
        "replyto": "RUvzlotXY0",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3128/Reviewer_CoBE"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3128/Reviewer_CoBE"
        ],
        "content": {
            "summary": {
                "value": "The paper propose to use Direct Diffusion Bridge to enhance the resolution of HI-C data. To promote the generalization in real-world situations, the authors introduce diffusion models to generate training data with more variation. Rich experimental results support excellent performance as well as its application to Hi-C analysis of human cells."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "-\tThe paper proposes a diffusion based method to enhance resolution of HI-C data, which avoids over-smooth of standard supervised learning or training instability of GANs. The performance seems more competitive compared with previous methods.\n-\tThe authors provide rich figures and tables to vividly and rigorously support their claims.\n-\tThe paper is well-organized and easy to follow."
            },
            "weaknesses": {
                "value": "-\tAlthough the application of diffusion-based methods to Hi-C is meaningful, the method seems lack of novelty. The authors should explain carefully the difference between the core method and previous Direct Diffusion Bridge. \n-\tI suggest the authors add comparison about memory and time consumption to help readers get a full picture of their method."
            },
            "questions": {
                "value": "-\tCan you provide visualization of generated training data?\n-\tDuring the process of enhancing resolution, new content will sprout. I am concerned whether the method will generate inrelevant or even harmful content, which may incur severe results."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3128/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699090189655,
        "cdate": 1699090189655,
        "tmdate": 1699636259639,
        "mdate": 1699636259639,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "8HIR1vwe86",
        "forum": "RUvzlotXY0",
        "replyto": "RUvzlotXY0",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3128/Reviewer_jkUa"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3128/Reviewer_jkUa"
        ],
        "content": {
            "summary": {
                "value": "This paper addresses the resolution limitations inherent in Hi-C analysis—a genomic technique that elucidates the three-dimensional architecture of chromosomes. Hi-C's utility in revealing critical genomic structures such as A/B compartments and chromatin loops is constrained by the resolution of the data, which refers to the granularity of the contact matrix generated from sequencing reads. The resolution challenge is compounded by the quadratic increase in sequencing efforts required for finer resolution, thus escalating the costs. Previous attempts to enhance the resolution of Hi-C data have leveraged deep learning approaches like HiCPlus and HiCNN; however, these methods are often limited by the computational demands and the quantity of high-resolution data needed for training.\n\nIn this context, the authors propose HiCBridge, a novel method that employs a Direct Diffusion Bridge (DDB) to learn the transformation from low to high-resolution Hi-C data. This method is designed to circumvent the shortcomings of conventional deep learning techniques that may result in overly smooth textures or mode collapse. HiCBridge integrates diffusion model-based data augmentation to handle a wider array of real-world data variations, thereby enhancing the model's applicability and robustness. The model's potential to bolster downstream genomic analyses—such as 3D structure matching and loop position reconstruction—positions it as a significant advancement in genomic research, offering a path to high-resolution Hi-C data without the prohibitive costs of extensive sequencing."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "Originality\nThe submission presents a novel approach to enhancing the resolution of Hi-C data through the Direct Diffusion Bridge (DDB), distinguishing itself from prior work that primarily relies on conventional deep learning methods. The originality of the paper lies not just in the application of diffusion models—a relatively recent trend in machine learning—but in the specific formulation of using such models to bridge low-resolution and high-resolution Hi-C data. This creative combination of diffusion processes with genomic data analysis is novel, as it deviates from the usual convolutional neural network (CNN) approaches that dominate the field. \n\nQuality\nThe paper conducts experiments on multiple standard datasets, and presents a good ablation analysis.\n\nClarity\nThe paper is well written. I find it easy to read, the figures along with the captions are appropriate and aid understanding of the paper."
            },
            "weaknesses": {
                "value": "1. The robustness of the model against various datasets and its performance under different conditions (such as varying levels of input resolution) would need thorough examination.\n2. The paper would benefit from a more detailed comparison with state-of-the-art models. This includes not only performance metrics but also computational efficiency, scalability, and the amount of training data required. \n3. The model's generalizability to different types of Hi-C data, such as those from various species or cells in different states, should be assessed. If the model has only been tested on a narrow range of data, its practical applicability could be limited.\n4. The paper should address the interpretability of the HiCBridge model. Understanding how the model makes its predictions is crucial, particularly in genomic studies where the biological implications of the findings are as important as the findings themselves."
            },
            "questions": {
                "value": "see weaknesses"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "none"
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3128/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699142494871,
        "cdate": 1699142494871,
        "tmdate": 1699636259538,
        "mdate": 1699636259538,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "YMH0dbgaWp",
        "forum": "RUvzlotXY0",
        "replyto": "RUvzlotXY0",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3128/Reviewer_LnZX"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3128/Reviewer_LnZX"
        ],
        "content": {
            "summary": {
                "value": "This paper borrows idea from the Direct Diffusion Bridge that establishing the diffusion process between the clean and corruption for Hi-C data super-resolution. And a diffusion-based data augmentation method is proposed for adapting to the real-world situations. Extensive experiments demonstrate the effectiveness of the proposed method."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. This paper introduces a diffusion-based data augmentation method to alleviate the real-world variation.\n2. Extensive experiments on Hi-C data analysis demonstrate the effectiveness of the proposed method."
            },
            "weaknesses": {
                "value": "1. The contribution of this paper is limited. The proposed HiCBridge directly borrows idea from the Direct Diffusion Bridge without any improvement. While the proposed diffusion-based data augmentation (Algorithm 1 and 2) is also trivial. It seems like the paper tends to apply the existing method to the new task, but lack of novelty.\n2. It is not clear how the Algorithm 1 can be used to generate the low-resolution data as your target distribution is based on x0 (high-resolution Hi-C data). Please check whether the x0 in Algorithm 1 should be x1.\n3. It seems like the diffusion augmentation is unusable in higher resolution cases for inferior performance, according to the Table 4."
            },
            "questions": {
                "value": "lease refer to the paper weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 5,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3128/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699172090390,
        "cdate": 1699172090390,
        "tmdate": 1699636259465,
        "mdate": 1699636259465,
        "license": "CC BY 4.0",
        "version": 2
    }
]