[
    {
        "id": "PVakXtAHKv",
        "forum": "rvDQtdMnOl",
        "replyto": "rvDQtdMnOl",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4407/Reviewer_gmV7"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4407/Reviewer_gmV7"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a fragment-based approach to propagate long-range information in Graph Neural Networks (GNNs). A set of fragments is constructed using the BRICS fragmentation method, which leverages chemical structures to define well-behaved fragments. The framework operates at two levels: first, it performs a message-passing step on the short-range graph, and then uses these results to define fragment-level features that are also message-passed at the fragment-level graph. The method demonstrates competitive accuracy on the MD22 benchmark, which contains large structures, and shows some improvements over short-range baselines."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- The paper is clearly written and pedagogical.\n- Various ablation studies were conducted on both the long-range modules and the fragmentation methods.\n- Results show improvements over short-range baselines for large molecules.\n- Some limitations of the fragmentation methods are discussed."
            },
            "weaknesses": {
                "value": "- The main weakness of the method, as shared in the paper, is the definition of fragments. First, as mentioned, it is not clear how to define these for most systems, including materials. My biggest concern is the issue of smoothness. In molecular dynamics (MD) simulations, it is crucial to ensure that the predictions are smooth. I can envision many MD scenarios where such partitioning might cause problems, and I would be very interested in seeing the behavior of this model over long simulations.\n\n- The Equiformer and VisNet models have 4 layers with a 4Å cutoff, resulting in a receptive field of 32Å in diameter. Most of the MD22 molecules fit well within their receptive fields. While this does not detract from the improvement offered by the method, it should be clearly highlighted.\n\n- The importance of long-range effects beyond a 12Å radius is subtle, as large effects are usually screened in most systems. One would expect to see little difference in errors between a short-range and a long-range model. However, observables computed from MD simulations might vary significantly, as these long-range effects do not average out over long timescales. To capture these observables accurately, the most crucial factor is the decay of interactions, rather than raw accuracy. There is no reason to believe that your approach would correctly capture this decay, enabling accurate observables in these simulations. I want to stress that long-range effects in large biomolecular systems are mostly relevant for observables, and justifying the method solely through raw accuracy has limited scientific relevance.\n\n- One of the main challenges of long-range modeling is transferability, especially for models without typical decay behaviors. I would be very interested in seeing how this model extrapolates to longer, unseen molecules, and whether it performs better than a local model in this context. This is the only relevant setting for practical applications, particularly for modeling systems where ab initio computations are not feasible."
            },
            "questions": {
                "value": "- How well do you expect your model to transfer to new, unseen systems, particularly those of larger sizes?\n\n- Could you plot the typical decay learned by your interactions, assuming the fragmentation approach allows for it? You could try separating two molecules and plotting the energy as a function of distance. Without sensible decay, the model stands little chance of extrapolating effectively."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4407/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4407/Reviewer_gmV7",
                    "ICLR.cc/2024/Conference/Submission4407/Senior_Area_Chairs"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4407/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698774382466,
        "cdate": 1698774382466,
        "tmdate": 1700513143281,
        "mdate": 1700513143281,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "U5E9z1VDan",
        "forum": "rvDQtdMnOl",
        "replyto": "rvDQtdMnOl",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4407/Reviewer_GkgW"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4407/Reviewer_GkgW"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes new message-passing neural networks that capture long-range interactions by generalizing equivariant graph neural networks inspired by fragmentation-based approaches. For the implementation, BRICS fragmentation was leveraged. The authors demonstrated the effectiveness of the proposed method with a recently proposed architecture ViSNet and achieved considerable improvement in large molecule benchmarks: MD and Chignolin datasets. To evaluate the proposed method’s applicability, the authors provided results with other EGNNs such as Equiformer, PaiNN, and ET. They show consistent improvement."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. **Strong empirical results** The proposed method achieved competitive performance in MD22 and Chignolin datasets. In Table 2 for MD22, the proposed method with ViSNet shows achieved the best performance in various settings. More importantly, the proposed method, LSRM, shows consistent improvement compared to the vanilla model without LSRM.\n2. **General applicability** The proposed method with various EGNNs base networks shows consistent performance improvement. \n3. **Computational efficiency** The proposed method shows great performance without significant computational overhead. Rather, the proposed method has the smallest model size and the shortest training time.\n4. **Comprehensive experimental results** The paper provides many details and additional experiments."
            },
            "weaknesses": {
                "value": "1. **Limited impact.** The technical contributions of this paper has limited impact. Although the method show overall comparable performance, it is a model that is manually-designed by domain knowledge.\n2. **Narrow perspective.** Basically, the proposed method uses two different types of graphs. Then the problem can be viewed as learning on heterogeneous graphs. In recent years, learning graph neural networks on heterogeneous graphs by manually/automatically transforming graphs has been actively studied. The authors may want to include the related work and potentially compare with them. Beyond long-range dependency, non-local/semantic relations also have been utilized. \n3. **Far-fetched claim.** In Figure 2., I do not see anything but overall performance gap. I do not think that the graphs support the claim that LSRM helps models to capture long-range dependency. All three models exhibit similar behaviors."
            },
            "questions": {
                "value": "1. How about inference time? It was not clear how ViSNet has more parameters than ViSNet-LSRM. Also, the training time was reported, but inference time was not available. In real-world applications, inference time is more important for deployment. I believe that shorter training time would imply shorter inference time, but it should be explicitly discussed to be more comprehensive. Fig. 2, (c)(f) partially show the inference time for the subset of baselines\n2. Figure 3 is confusing. The legend should be updated. \n3. Table 4 is not explicitly referred to in the text, although the paragraph of the text of Q3 in Section 5.2 discusses the result. It will be a quick fix. \n4. Typo (?) in Proposition 4.1 Hamdard -> Hadamard product (?)"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4407/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698821447488,
        "cdate": 1698821447488,
        "tmdate": 1699636414553,
        "mdate": 1699636414553,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "h1tPYcwuou",
        "forum": "rvDQtdMnOl",
        "replyto": "rvDQtdMnOl",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4407/Reviewer_4VzQ"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4407/Reviewer_4VzQ"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a novel framework for molecular dynamics simulations using machine learning. The framework, called Long-Short-Range Message-Passing (LSR-MP), combines equivariant graph neural networks (EGNNs) with fragmentation-based methods to capture both short-range and long-range interactions among atoms. The authors demonstrate that LSR-MP can achieve state-of-the-art results on large molecular datasets, while being more efficient and effective than existing methods. The authors also conduct ablation studies and analysis to validate the importance of incorporating long-range components and the advantages of using BRICS fragmentation."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- **Problem Definition**: This paper addresses a challenging and important problem of modeling large molecular systems with high accuracy and low computational cost.\n\n- **Methodology**: This paper introduces a novel message-passing framework that leverages domain knowledge from quantum chemistry to incorporate long-range interactions efficiently and effectively.\n\n- **Performance**: This paper shows significant performance improvements over existing methods on various benchmarks, while using fewer parameters and offering faster speed.\n\n- **Generalizability**: This paper illustrates the general applicability and robustness of the LSR-MP framework by applying it to different EGNN backbones and showing consistent improvements.\n\n- **Implementation**: This paper provide sufficient details on experimental setups and how the method is implemented."
            },
            "weaknesses": {
                "value": "- **Novelty**: I could not find any distinct weaknesses in this paper, but I might have missed one since I am not an expert in Molecular Modeling. One major concern is regarding the novelty of the proposed long-range message-passing module. As far as I know, long-range message-passing is one of the highlighted research topics in GNN literature. It would be better to discuss this line of work."
            },
            "questions": {
                "value": "- As far as I know, there are many long-range message-passing modules designed for graph-structured data. Can you compare the proposed method with other long-range message-passing modules?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "N/A"
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4407/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4407/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4407/Reviewer_4VzQ"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4407/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698842118625,
        "cdate": 1698842118625,
        "tmdate": 1699636414437,
        "mdate": 1699636414437,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "uP7zvCta1w",
        "forum": "rvDQtdMnOl",
        "replyto": "rvDQtdMnOl",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4407/Reviewer_cAHU"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4407/Reviewer_cAHU"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a new framework for machine learning of molecular dynamics, called Long-Short-Range Message-Passing (LSR-MP). LSR-MP combines short-range and long-range message passing on graphs to capture both local and non-local interactions in chemical and biological systems. LSR-MP uses a fragmentation-based method inspired by quantum chemistry to divide large molecules into smaller subsystems and model their long-range interactions efficiently and effectively. LSR-MP is implemented on top of an existing equivariant graph neural network (EGNN) called ViSNet, and achieves state-of-the-art results on large molecular datasets with fewer parameters and faster speed. LSR-MP is also applied to other EGNN models and shows consistent improvements, demonstrating its general applicability and robustness."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The paper presents a novel and elegant framework for long-short-range message passing on graphs, which can capture both local and non-local interactions in chemical and biological systems. \nThe paper draws inspiration from quantum chemistry and adopts a fragmentation-based method to divide large molecules into smaller subsystems and model their long-range interactions efficiently and effectively. This is a clever and creative way to overcome the computational and memory challenges of existing methods. The paper implements the proposed framework on top of an existing equivariant graph neural network (EGNN) called ViSNet, and demonstrates its superior performance on two large molecular datasets, MD22 and Chignolin. The paper shows that the proposed method achieves state-of-the-art results with fewer parameters and faster speed than the baselines, which is impressive and convincing.\nThe paper also applies the proposed framework to other EGNN models, such as PaiNN, ET, and Equiformer, and shows consistent improvements across different architectures and datasets. This demonstrates the general applicability and robustness of the proposed framework, and suggests that it can be easily integrated with other existing methods."
            },
            "weaknesses": {
                "value": "The paper does not provide a clear analysis of the stability, and error bounds and how sensitive the performance of the method is to the choice of these modules and parameters."
            },
            "questions": {
                "value": "Q1. How do you justify the choice of the LSR-MP framework as a generalization of the existing EGNNs? What are the advantages and limitations of this framework compared to other possible ways of incorporating long-range interactions, such as attention mechanisms, continuous filters, or Fourier features?\n\nQ2. How do you ensure the stability and accuracy of the BRICS fragmentation method for different types of molecules and systems? How sensitive is the performance of the LSR-MP framework to the choice of the fragmentation method and the number and size of the fragments?\n\nQ3. How do you evaluate the scalability and efficiency of the LSR-MP framework for larger and more complex molecular systems? What are the computational and memory costs of the LSR-MP framework, and how do they compare with the conventional quantum chemical methods and other machine learning methods? How do you handle the trade-off between accuracy and efficiency in the LSR-MP framework?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4407/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699451410770,
        "cdate": 1699451410770,
        "tmdate": 1699636414366,
        "mdate": 1699636414366,
        "license": "CC BY 4.0",
        "version": 2
    }
]