[
    {
        "id": "VCb3hWdE4H",
        "forum": "SMZGQu6lld",
        "replyto": "SMZGQu6lld",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6679/Reviewer_vjeb"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6679/Reviewer_vjeb"
        ],
        "content": {
            "summary": {
                "value": "This paper proposed a novel LLM-based method for the prediction of crystal properties. The authors collect a dataset including crystal text descriptions with their properties, and use a T5-based finetune network to achieve SOTA performance on their benchmark. Also, the authors perform their model on two property prediction tasks with ablation."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "(1). The authors conducted enough experiments to show the efficiency and capabilities of their model. The experiment is solid and convincing.\n(2). This paper is well-written and easy to follow. The author’s motivation for this work is clear.\n(3) The problem with crystal is important. And focusing on language and LLM is an important view for this problem."
            },
            "weaknesses": {
                "value": "1. Some details are not clear. How large is the pre-trained T5 model you used? The T5-small, T5-base, or T5-large? Specify this is important for the comparison of your efficiency. \n2. The authors mentioned there’s some related work that also used finetuned LLMs for crystal representation. These works collect crystal text descriptions based on Robocrystallographer too. However, the authors did not compare their dataset with theirs about the text content and text quality. So, the experiment is not solid."
            },
            "questions": {
                "value": "(1). You have mentioned there’s some related work that also used finetuned LLMs for crystal representation. They collect crystal text descriptions based on Robocrystallographer too. Could you compare your dataset with theirs about the text content and text quality? Showing the advantage of your dataset is important for your contribution to data collection.\n\n(2). Section 5.1 “The possible reason for this improvement might be that LLMProp can easily access the most important information for volume prediction, e.g. space group information, from the text descriptions compared to GNNs.” Could you please make some more ablation about your text information to prove your statement? Also, this is important to measure the importance of different types of information.\n\n(3). Could you please make a task description to show the importance of the two tasks (Band gap and volume) in the experiments? Many other properties are predicted in related works such as energy per atom and bulk modulus. Why did you choose these two tasks?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6679/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698673825518,
        "cdate": 1698673825518,
        "tmdate": 1699636765005,
        "mdate": 1699636765005,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "q6myy1ckQu",
        "forum": "SMZGQu6lld",
        "replyto": "SMZGQu6lld",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6679/Reviewer_Vdge"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6679/Reviewer_Vdge"
        ],
        "content": {
            "summary": {
                "value": "The paper studies the physical and electronic property prediction problem and proposes to use large language models to predict the properties of crystals from the text descriptions. The paper provides an input processing strategy to prepare the input text of the language model and adapt T5 for predictive tasks."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "1. The studied problem is interesting and AI for science is also an important research area.\n2. The paper is well-organized and easy to follow."
            },
            "weaknesses": {
                "value": "1. Although the task of crystal property prediction is an interesting problem for AI for science, the innovation of methodology is not surprising. This paper only uses the language model to make the prediction which is less novelty.\n2. There are several recent works focusing on the text-rich graph where each node has text descriptions by jointly leveraging the GNN and LLM. These works are also related to the problem studied in this paper and should be discussed and compared.\n3. The specific challenge in this problem is not clarified."
            },
            "questions": {
                "value": "1. What is the specific challenge in the problem of crystal property prediction?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6679/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698719227705,
        "cdate": 1698719227705,
        "tmdate": 1699636764859,
        "mdate": 1699636764859,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "Vuy24vk0ei",
        "forum": "SMZGQu6lld",
        "replyto": "SMZGQu6lld",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6679/Reviewer_WsXq"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6679/Reviewer_WsXq"
        ],
        "content": {
            "summary": {
                "value": "This paper investigates the task of predicting crystal properties with LLM decoder-only model. The model is trained on the constructed benchmark dataset (TextEdge) which contains crystal structure, description, properties such as band gap. The experimental result shows that the proposed method LLM-Prop is slightly better than previous method MatBERT and ALIGNN."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- The paper extends the previous crystal representations task based on text into the property prediction task based on text.\n- The benchmark dataset TextEdge should be helpful in the predicting crystal properties domain."
            },
            "weaknesses": {
                "value": "- My top concern is the technical depth of the paper. For the method, this paper is an implementation for predicting crystal properties task with decoder part of T5. The discussion of choice of T5 is weak and Input Processing is also trivial. \n- For the Data collection in Sec 3.1, I did not see the challenging part and discussion about the process of data collection including quality control. I am not sure about the quality of data at all."
            },
            "questions": {
                "value": "N/A"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6679/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698721763674,
        "cdate": 1698721763674,
        "tmdate": 1699636764743,
        "mdate": 1699636764743,
        "license": "CC BY 4.0",
        "version": 2
    }
]