[
    {
        "id": "VXAaDGF4hp",
        "forum": "SYBdkHcXXK",
        "replyto": "SYBdkHcXXK",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission661/Reviewer_uz5r"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission661/Reviewer_uz5r"
        ],
        "content": {
            "summary": {
                "value": "In this paper, the authors introduce a challenging yet critical topic for semantic segmentation, i.e., pixel-wise aliasing. They categorize the hard pixel error into three types: false response, merging mistakes and displacements. Creatively, the de-aliasing filter and frequency mixing modules are introduced to alleviate the aliasing degradation. Experiments demonstrate that these findings can consistent improve the semantic segmentation performance."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "1 poor"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "#1 The topic is attractive where the unexplored aliasing phenomenon for semantic segmentation are carefully investigated. This funding can motivate the researcher in the related community. \n#2 The authors utilize the DAF and FreqMix to remove the aliasing in Fourier domain and balance high-frequency components in the encoder block. Converting the features to frequency domain by DFT is straightforward, but finding the aliased false prediction for semantic segmentation is interesting."
            },
            "weaknesses": {
                "value": "#1 Lacking visualization for the three type of errors in the experiment. Though the authors provide the results on ADE20K, it does not clearly present the visualization to the correction of three type of errors for semantic segmentation. In addition, how the DAF and FreqMix help locate these errors are not visualized."
            },
            "questions": {
                "value": "#1. The authors must provide more visualizations on the three types of errors and the corresponding feature maps in frequence domain. \n#2. As to the DAF and FreqMix, how the filtered feature maps can help find the location of error map should be invastigated. \nOverall, the topic for finding the aliasing is interesting, the reviewer encourage the author further explore this missing parts in the semantic segmentation."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission661/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698764351677,
        "cdate": 1698764351677,
        "tmdate": 1699635993414,
        "mdate": 1699635993414,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "TC5pfRQVWO",
        "forum": "SYBdkHcXXK",
        "replyto": "SYBdkHcXXK",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission661/Reviewer_LE8t"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission661/Reviewer_LE8t"
        ],
        "content": {
            "summary": {
                "value": "The work proposes a new anti-aliasing scheme by redefining the cutoff frequency. This is done by considering the expansion in both the channel dimension and the spatial dimension. The proposed aliasing score showed a strong correlation with various segmentation errors. Additionally, the authors introduced a new anti-aliasing and spectral filter that enhances the segmentation performance."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. Investigates the critical yet under-explored question regarding the effect of aliasing in computer vision models.\n2. The proposed fixes enhance performance.\n3. The paper is well-written and clearly explained."
            },
            "weaknesses": {
                "value": "1. The proposed module, FreqMix, requires additional forward and inverse Fourier transforms at each layer. Compared to other methods, this increase in time complexity (inference and training) needs to be discussed.\n2. Experiments are limited. It is necessary to conduct evaluations on other benchmark datasets, such as MS COCO and Pascal VOC.\n3. Improvements are marginal."
            },
            "questions": {
                "value": "1. I need more clarification about the robustness of ESR (equivalent sampling rate). Clearly, the filters are orthogonal for the shown example (Fig 3). So there is no loss of information.\nBut what if the filters are not orthogonal to each other? Assume a worst-case scenario where all filters are equal. In that case, the proposed ESR will give us a wrong sampling rate. So, is the proposed ESR intended to replace the regular “sampling rate,” or is it intended as a heuristic to select cutoff frequency? If it is the second, then the paper should clarify it.\n2. Section 3.2, “Metrics for three errors.” — I think the middle one should be the definition of MErr.\n3. “aligning with the observations in Figure 1 that false responses and merging mistakes predominantly exist in areas with relatively low aliasing scores.” — could you clarify how we are associating aliasing scores with a region of an image? \n4. “However, for deeper features at the second and third stages, the aliasing ratio decreases.\nThis decrease does not signify a reduction in aliasing; rather, it occurs because the earlier high level of aliasing results in severe degradation. Consequently, the features become ‘hard pixels,’ meaning that the following stage struggles to extract useful information and loses response to objects.” — How can we confirm that it is caused by the side effect of aliasing? Applying significant noise can generate an out-of-distribution (OOD) sample of the internal layers, which can also lead to poor feature extraction."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission661/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission661/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission661/Reviewer_LE8t"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission661/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699480239463,
        "cdate": 1699480239463,
        "tmdate": 1699635993320,
        "mdate": 1699635993320,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "Hifo7NSJtL",
        "forum": "SYBdkHcXXK",
        "replyto": "SYBdkHcXXK",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission661/Reviewer_qrZx"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission661/Reviewer_qrZx"
        ],
        "content": {
            "summary": {
                "value": "The paper proposes two novel de-aliasing filter (DAF) and frequency mixing (FreqMix) modules to alleviate aliasing degradation by accurately removing or adjusting frequencies higher than the Nyquist frequency. The paper observes three different wrong segmentation types potentially caused by aliasing (a) False response, (b) Merging mistake (c) Displacement. In addition, the paper designed a simple de-aliasing filter to precisely remove aliasing as measured by their aliasing score. Additionally, we propose a novel frequency-mixing module to dynamically select and utilize both low and high-frequency information. The work has really comprehensive ablation studies, and the induction logic is comprehensive. They have proved their proposed method surpasses strong baselines Mask2Former, PointRend."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. The experiment of the paper is very comprehensive and solid. The authors provide analysis of (1) the relationship between blur kernel size with Boundary, Three type errors, and Aliasing score.  (2) Noise level in effect to aliasing. (3) their cut-off frequency in relationship with accuracy and aliasing. (4) In comparison with other anti-aliasing modules. (5) Show effectiveness with model scaling up. (6) In Comparison with SoTA segmentation model.\n\n2. The paper introduces the concept of equivalent sampling rate for the Nyquist frequency calculation and proposes an aliasing score for quantitative measurement of aliasing levels."
            },
            "weaknesses": {
                "value": "Actually, I think from a research perspective, I believe the paper is valid and sound so I recommend accepting this paper. However, from a higher level of view, many traditional problems including anti-aliasing have been eroded by the current trend of Large Models. The effectiveness of more training data or advances in pre-trained model weights will shrink the marginal gain of those methods. Especially for the transformer-based architecture, the downsample operation is no longer max-pooling even adaptive-pooling. this potentially alleviates the aliasing problem itself."
            },
            "questions": {
                "value": "It would be really appreciated if the authors shared their thoughts on whether aliasing is still a problem if the backbone downsampling is fully adaptive in a transformer-based architecture."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission661/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission661/Reviewer_qrZx",
                    "ICLR.cc/2024/Conference/Submission661/Senior_Area_Chairs"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission661/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699570499750,
        "cdate": 1699570499750,
        "tmdate": 1701024747036,
        "mdate": 1701024747036,
        "license": "CC BY 4.0",
        "version": 2
    }
]