[
    {
        "id": "tS2rKn5A2v",
        "forum": "sZACTXpSc6",
        "replyto": "sZACTXpSc6",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4853/Reviewer_L8Et"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4853/Reviewer_L8Et"
        ],
        "content": {
            "summary": {
                "value": "The paper proposes a strategy to select a fixed number of estimated Gaussian noises from the buffer per timestep t_i, and then used the selected ones in estimating the next diffusion state via the implicit Adams numerical method.  The selection strategy intends to minimize the prediction error of the estimated Gaussian noises. Different experiments are performed, showing the effectiveness of the new sampling method."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The paper proposes a new method for selecting a fixed number of the estimated Gaussian noises from the buffer per timestep to better compute the next diffusion state. It seems that the search procedure is performed online for each individual sampling, which is interesting."
            },
            "weaknesses": {
                "value": "(1). The method needs to introduce a buffer to store all the historical estimated Gaussian noises up to the most recent timestep. As the timestep t_i approaches to 0, the buffer size is increasingly large which is undesirable from a practical point of view.\n\n(2). As the buffer becomes large along with the timestep, one can imagine that it would take more time to do searching. Therefore, the method requires not only more memory but also more sampling time."
            },
            "questions": {
                "value": "(1) I think Theorem 2 is not properly formulated because the term \"large enough\" cannot be quantified. \n\n(2) I don't get which line in Algorithm 1 performs selection of the estimated Gaussian noises from the buffer.\n\n(3) It is not clear from the paper how the search is performed. Is it greedy search?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4853/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698169523897,
        "cdate": 1698169523897,
        "tmdate": 1699636468867,
        "mdate": 1699636468867,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "IjqIVLYYmh",
        "forum": "sZACTXpSc6",
        "replyto": "sZACTXpSc6",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4853/Reviewer_hCzL"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4853/Reviewer_hCzL"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes an error-robust Adams solver (ERA-Solver) that consists of a predictor (similar to the Adams-Bashforth method) and corrector (similar to the Adams-Moulton method). The authors propose an error-robust selection strategy to select the former evaluations rather than the last $k$ evaluations in the predictor. The experiment result shows it can achieve good sample qualities at a few NFEs."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "$\\cdot$ The writing of this paper is clear and easy to follow.\n\n$\\cdot$ The authors take the score estimation error into consideration in the sampling process, which is novel. The authors conduct some simple experiments to verify that as $t\\rightarrow 0$, the error in terms of $\\epsilon$ becomes larger."
            },
            "weaknesses": {
                "value": "$\\cdot$ Some experiment comparison results are unfair. For example, in Table 5 in this paper, on the LSUN-bedroom dataset, the DPM-Solver++[2] achieves 6.04 FID in 20 NFEs. However, in the DPM-Solver[1] paper, DPM-Solver achieves 3.09($\\epsilon = 1e-3$)/2.60($\\epsilon = 1e-4$) FID in 20 NFEs. This paper and [1] both use the pretrained diffusion models offered in [3]. I guess the reason is that in this paper the authors use the 'time linear space' schedule for timesteps while [1] use the 'logSNR linear space' schedule. I suggest the authors should compare these methods in a better setting.\n\n\n\n[1] DPM-Solver: A Fast ODE Solver for Diffusion Probabilistic Model Sampling in Around 10 Steps, Lu et al.\n\n[2] DPM-Solver++: Fast Solver for Guided Sampling of Diffusion Probabilistic Models, Lu et al.\n\n[3] Diffusion Models Beat GANs on Image Synthesis, Dhariwal et al."
            },
            "questions": {
                "value": "See weaknesses"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4853/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4853/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4853/Reviewer_hCzL"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4853/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698736465751,
        "cdate": 1698736465751,
        "tmdate": 1699636468766,
        "mdate": 1699636468766,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "lk8gDOpMNx",
        "forum": "sZACTXpSc6",
        "replyto": "sZACTXpSc6",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4853/Reviewer_khj4"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4853/Reviewer_khj4"
        ],
        "content": {
            "summary": {
                "value": "Some fast sampling methods of DDPMs rely on the equivalence between sampling and solving an ODE on the noise process. They then leverage various ODE solvers. The main remark of the paper is to notice a significant discrepancy between the theoretical noise and the noise practically estimated by the trained diffusion model. This noise is also specific to each dataset. The authors hence propose a technical solution to include this uncertainty in the ODE solver and show numerically how their approach outperforms existing approaches on several classical datasets."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "1 poor"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "The remarks and technical solutions of the authors for accelerating ODE-based fast sampling DDPMs are novel and well-conducted."
            },
            "weaknesses": {
                "value": "There are three weaknesses in this paper:\n- The motivation of the paper is not compelling. The argument is that the main drawback of DDPMs is the sampling time and that there are only two areas of research: 1) fast ODE samplers and 2) distillation or learning-based samplers. The authors need to mention latent diffusion models, which are the go-to solution for fast sampling for the generating tasks mentioned in the paper, i.e., classical natural image problems. How does their approach even compare to latent diffusion models? \nFor the authors' argument to be compelling, I suggest they experiment with their approach to generating tasks where latent diffusion models are complex to leverage, i.e., in tasks where we need access to a good latent representation of the data. Alternatively, it would be interesting to see how their approach can be used to accelerate the sampling of latent diffusion models further. Because otherwise, the paper is interesting as a new technical solution but will not be helpful in practice.\n- There are plenty of typing errors and sentences that need meaning. With all the corrector error systems, this is not very pleasant to read. For instance, in the introduction, there are almost systematically missing spaces between words and citations. Alternatively, even a sentence in the abstract that is hardly understandable \"are not able to robust with the various error patterns in the noise estimated ...\".\n- The numerical experiment only showcases FID scores; why not use other scores, such as improved recall and precision?"
            },
            "questions": {
                "value": "None"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4853/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698766076222,
        "cdate": 1698766076222,
        "tmdate": 1699636468667,
        "mdate": 1699636468667,
        "license": "CC BY 4.0",
        "version": 2
    }
]