[
    {
        "id": "sWbRA7uCgs",
        "forum": "THJEa8adBn",
        "replyto": "THJEa8adBn",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8279/Reviewer_xDdp"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8279/Reviewer_xDdp"
        ],
        "content": {
            "summary": {
                "value": "This paper provides theoretical results adapting the idea of density ratio modeling from offline RL to the setting of online RL and provides sample complexity guarantees for the proposed algorithms. The main contribution of the paper is the algorithm called GLOW which provides polynomial sample complexity bounds in the online RL setting by minimizing the weighted average Bellman error using clipped density ratios along with realizability assumptions in function approximation. To further improve the sample efficiency, authors propose a meta-algorithm H2O that can reuse any offline algorithm to output an online exploration policy in the Hybrid RL setting (i.e. online RL with some available offline data). \n\n\n\n*I would also like to note here that I am perhaps not the target audience of this work and though I am aware of some of the related works on this topic, I may not be the best judge of this paper's contributions.*"
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. This paper exhaustively compares to the relevant prior work in the field and positions the contributions of this work with the literature in offline and Hybrid RL. In several parts of the paper, authors intuitively explain some of the challenges faced in adapting the density ratio modeling to online RL and the need for certain regularization formulations to achieve desired approximation error bounds. These add to the readability of the paper. \n\n2. This paper claims to be the first to provide theoretical guarantees showing that value function realizability and density ratio realizability alone are sufficient for sample-efficient RL under coverability. It is a step towards unifying some of the advances made in offline RL with the requirements of sample-efficient online RL algorithms."
            },
            "weaknesses": {
                "value": "While the paper focuses on providing theoretical bounds regarding sample efficiency of the proposed algorithms, it lacks any attempts at empirical verification of the same. Comparing to Song et al. which the authors highlight for introducing the Hybrid RL setting, I would expect similar experiments (eg. Song et al. present experimental results in Montezuma's revenge) in this paper to demonstrate the performance of the theoretically motivated framework in practice. Perhaps it would also help to include a discussion of the practicality of the assumptions made in the theoretical proofs and what, if any, are the challenges of implementing the proposed algorithms in standard RL benchmarks."
            },
            "questions": {
                "value": "1. Why did the authors not consider empirical verification of their proposed framework in Sec 4? Is there any understanding of the validity of the assumptions made in the paper when applied to RL algorithms in practice?\n\n2. In the first line on page 4, \"that $\\frac{d^\\pi_h}{d^{\\pi'}_h}$ for all ...\", is there some missing text after $\\frac{d^\\pi_h}{d^{\\pi'}_h}$?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8279/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698649879968,
        "cdate": 1698649879968,
        "tmdate": 1699637029499,
        "mdate": 1699637029499,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "Ge3Jnx1IQ1",
        "forum": "THJEa8adBn",
        "replyto": "THJEa8adBn",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8279/Reviewer_reZc"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8279/Reviewer_reZc"
        ],
        "content": {
            "summary": {
                "value": "This paper endeavors to establish a bridge between offline and online reinforcement learning. More specifically, it introduces a novel algorithm named GLOW, which excels at conducting sample-efficient online exploration while assuming the presence of value-function and density-ratio realizability. Furthermore, the authors extend these findings to encompass the hybrid reinforcement learning setting."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "This paper is well-crafted, presenting its content in a clear and easily understandable manner. The majority of the results are extensively scrutinized and discussed, adding to the paper's overall quality. The introduction of a new density-based online algorithm effectively bridges the gap between offline and online RL. Furthermore, the paper's concerted effort to tackle the enduring and vital issue of removing the completeness assumption is a critical contribution to the field. This problem has long been a pressing concern in online reinforcement learning and is integral to the significance of this work."
            },
            "weaknesses": {
                "value": "- Bypassing the need for strong completeness-type assumptions by introducing an additional density ratio realizability assumption is not a novel approach, particularly in the context of offline reinforcement learning (see [Zhan et al., 2021] and a missing related work [1]). So the results in this work are not very surprising.\n\n- Dentity-based algorithms may not be as suitable for online reinforcement learning, given the perceived strength of Assumption 2.2. While the authors have included two examples in Appendix D.1, these examples are already familiar to us and do not pose a significant challenge. If the authors could provide additional examples, such as those involving low (Bellman) eluder dimension or bilinear class, it would make the results more remarkable. \n\n[1] Importance Weighted Actor-Critic for Optimal Conservative Offline Reinforcement Learning. Hanlin Zhu, Paria Rashidinejad, Jiantao Jiao"
            },
            "questions": {
                "value": "see the Weakness part."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8279/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698766953416,
        "cdate": 1698766953416,
        "tmdate": 1699637029381,
        "mdate": 1699637029381,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "qcGe8kRbSi",
        "forum": "THJEa8adBn",
        "replyto": "THJEa8adBn",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8279/Reviewer_4ukw"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8279/Reviewer_4ukw"
        ],
        "content": {
            "summary": {
                "value": "The convergence of offline and online reinforcement learning theories has led to the emergence of density ratio modeling in offline RL. However, this concept has been absent in online RL due to the challenge of collecting a comprehensive exploratory dataset. This paper introduces GLOW, an online RL algorithm that can explore and learn efficiently when there is an exploratory distribution with good coverage (coverability condition), even in the presence of value functions and density ratios. GLOW handles unbounded density ratios through truncation and employs optimism for exploration, but it is computationally inefficient. To address this, a more efficient variant called HYGLOW is introduced for Hybrid RL, combining online RL with offline data. HYGLOW is derived from a meta-algorithm called $H_2O$, which offers a provable reduction from hybrid RL to offline RL."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. The paper is fairly well organized and the problem is well motivated (to analyze the notion of density ratio in online RL). \n\n2. The theoretical guarantee is solid and the explanation of concepts is also very comprehensive."
            },
            "weaknesses": {
                "value": "While the paper primarily delves into theoretical aspects and introduces the GLOW algorithm with statistical guarantees, it's worth noting that GLOW is computationally inefficient. Therefore, there is a need to develop more computationally efficient variants to showcase the algorithm's practical effectiveness."
            },
            "questions": {
                "value": "The idea of using density ratios in online RL is new. However, I am still curious about the specific benefits for online RL. Does it enlarge range of MDPs which can be solved by online RL algorithms (it may be computationally inefficient)? What is the advantage of using density ratios for guiding exploration in online RL compared to other classical methods like Upper Confidence Bound ?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission8279/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission8279/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission8279/Reviewer_4ukw"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8279/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699479063280,
        "cdate": 1699479063280,
        "tmdate": 1699637029276,
        "mdate": 1699637029276,
        "license": "CC BY 4.0",
        "version": 2
    }
]