[
    {
        "id": "xczltKKxuq",
        "forum": "tiKHRTqaUD",
        "replyto": "tiKHRTqaUD",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6117/Reviewer_SRMH"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6117/Reviewer_SRMH"
        ],
        "content": {
            "summary": {
                "value": "This paper considers the RL problem with mixed-signed reward functions, where there are costs in the MDP steps. The authors proposes C-OPAC2 method to solve the problem. At the same time, the author suggests useful tricks including resetting $Q$ and policy network and  remove the maximization term. The superiority of the method is validated from the robotic navigation task."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The paper considers an important problem in RL community, where costs exists are constraints are required to satisfy.\n2. The experiment studies demonstrate great potential of the proposed method."
            },
            "weaknesses": {
                "value": "1. Although the studied problem is interesting, the manuscript is not written and hard to follow. \n2. Some notations in Algorithm 1 are not mentioned in Section 3 and Section4, we suggest the authors to explain some important notations in Section 3&4.\n2. For mixed-signed reward, it is suggested to give more practical examples, otherwise the statements seems confusing. The authors first claim the mixed-signed reward, later in equation 8, the $c(t)$ is cost. Then in Section 4.2.1, the $C(\\tau)$ is constraint. So the constraint could be part of negative reward?\n3. In abstract, the authors mentions removing maximization term and reseting the networks, however, this seems not the crucial part of the manuscript."
            },
            "questions": {
                "value": "1. The authors considers the constrained RL problem, and it is suggested to consider and compare some related reference [1]\n2. In Section 3, the author mentions ``'When Q is underestimated, |$Q_c$| will tend to be overestimated and |$Q_r$| underestimated,'. Why will  |$Q_c$| will tend to be overestimated and |$Q_r$| underestimated, could the author give more insights or theoretical explanations? Why not both Q networks underestimated?\n3. There are some concerns why we use two Q networks for $Q_r$ and $Q_c$, even if the reward are assigned at the same time, we can still use one network to estimate. \nThe reviewer will consider the increase the rating when the concerns are fully resolved.\n\n[1]: Reward Constrained Policy Optimization. https://arxiv.org/abs/1805.11074"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission6117/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission6117/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission6117/Reviewer_SRMH"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6117/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698500162006,
        "cdate": 1698500162006,
        "tmdate": 1699636661769,
        "mdate": 1699636661769,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "ITc7ylB0Hn",
        "forum": "tiKHRTqaUD",
        "replyto": "tiKHRTqaUD",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6117/Reviewer_FTtw"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6117/Reviewer_FTtw"
        ],
        "content": {
            "summary": {
                "value": "This study focuses on environments with \"mixed-sign\" reward functions. The authors investigate the root cause of the poor performance and discover that it arises from an asymmetric error in estimating the magnitude of returns associated with terms of different signs. And provide a novel algorithm (OPAC^2) building around the off-policy actor-critic. The experiments demonstrate that the proposed algorithm outperforms state-of-the-art methods augmented by resetting."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The proposed method is detailed and easy to follow.\n2. The proposed algorithm seems competitive in both constrained and unconstrained settings."
            },
            "weaknesses": {
                "value": "1. The authors analyze why mixed-sign rewards are problematic in Sec.3, which is not so obvious to me. Could you please provide some more pieces of evidence to help me understand this?\n2. I'm not quite sure why resetting can improve this issue. Do you have any intuition on this? \n3. Similarly, I don't quite understand the intuition behind OPAC. Are there any ablation studies available?\n4. Do you compare OPAC with other Constrained RL algorithms?"
            },
            "questions": {
                "value": "Please refer to Weaknesses"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6117/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698590137817,
        "cdate": 1698590137817,
        "tmdate": 1699636661641,
        "mdate": 1699636661641,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "o3ebcqphl4",
        "forum": "tiKHRTqaUD",
        "replyto": "tiKHRTqaUD",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6117/Reviewer_mpXe"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6117/Reviewer_mpXe"
        ],
        "content": {
            "summary": {
                "value": "The paper is about RL with \"mixed-sign\" rewards, i.e., the reward function includes independent incentive and cost terms. The authors then argue that learning based on maximizing the summation of two Q-function approximations would lead to overestimates. Relying on these observations, the authors explore two approaches based on resetting and an off-policy actor-critic that does not include Q maximization in the policy improvement step. Experiments are conducted using OpenAI SafetyGyms to compare these new approaches with the standard SAC and TD algorithms."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The problem of solving RL with mixed-sign rewards is relevant and worthy of attention. The exploration based on decomposing the Q and V network, and resetting, seems to be a good approach. Experiments show that the new algorithm performs well compared to SAC and TD. The proposed algorithm is not difficult to implement."
            },
            "weaknesses": {
                "value": "I believe the paper's contributions are somewhat incremental and unclear at several points. Please find my comments below:\n\n- I assume the main selling point of the work is Section 3, where the authors discuss the limitations of learning two Q-functions. This section, however, is not clear and not convincing. First, the authors state that under mixed-sign rewards, the Q function can be decomposed into two Q functions, one for the rewards and one for the costs. Why should this decomposition be considered and analyzed? Why shouldn't we keep the overall Q function and learn it based on the total reward $r_{total}$? I can see that the decomposition would lead to over or underestimations for both the rewards and the costs, as the summation would fail to manage how the costs and rewards contribute to the overall rewards. So, it may not be a suitable approach to handle mixed-sign reward situations.\n- Later on, Algorithm 1 is also based on two Q and two V functions. This raises the question of how this way of learning compares to learning one Q function based on $r_{total}$. In other words, can we say anything about the equivalence or convergence of this decomposition approach compared to single-Q learning?\n- The constrained approach requires introducing the threshold $d$.\" I am not sure how this can be done systematically as all we know are only the costs and rewards and an upper bound on the accumulated costs is essentially not available. In the experiments, the authors say that \"we chose a target cost level equal to half the cost accumulated by a fully-trained TRPO agent unaware of cost.\" It is very unclear why it should be chosen this way. This needs more justifications.\n- The constrained RL approach based on Lagrange multipliers is simply to convert the overall rewards from $r+c$ to $r+\\beta c$. This does not seem to be a good approach. \n- The Resetting approach is clearly not new. The authors simply apply this to their problem context and find improvements. So it should not be considered a major contribution"
            },
            "questions": {
                "value": "Please see the Weaknesses above"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "NA"
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission6117/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission6117/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission6117/Reviewer_mpXe"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6117/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698811930338,
        "cdate": 1698811930338,
        "tmdate": 1699636661523,
        "mdate": 1699636661523,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "ATqO3ZTwwS",
        "forum": "tiKHRTqaUD",
        "replyto": "tiKHRTqaUD",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission6117/Reviewer_VQxc"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission6117/Reviewer_VQxc"
        ],
        "content": {
            "summary": {
                "value": "This paper explores the challenges of reinforcement learning (RL) in settings where the environment returns both positive and negative rewards. The authors highlight the limitations of standard off-policy RL algorithms such as SAC and TD3 in handling such scenarios and discuss methods like periodic network resets and constrained-MDPs to mitigate these issues. They propose a method called, constrained off-policy actor-critic algorithm that combines elements of said approaches to build a method that can work in such scenarios. The performance of their method is evaluated using some of the OpenAI Safety Gym benchmark tasks."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The paper effectively motivates the difficulties of employing standard RL algorithms in scenarios where the environment provides both positive and negative rewards. The writing is clear and engaging with a well-structured flow up to section 4.2.1."
            },
            "weaknesses": {
                "value": "- This is an empirical paper as the proposed method is nothing but the combination and examination of existing ideas without introducing new ones. Being an empirical paper is not a negative point, however, it requires comprehensive and thorough results. Unfortunately, it is not the case in this paper. In particular, the paper uses OpenAI Safety Gym benchmark to evaluate their method but failed to include more Safe-RL methods, like [1], etc. It was shown in previous papers that CMDP methods work the best in this benchmark and using standard RL methods ( MDP-based not CMDP) don't result in good performance. \n\n\n- The authors' main contribution appears to be Algorithm 1, which is briefly described in Section 4.2.1. There are many issues here. First of all, this algorithm has many moving parts and is a rather very complicated method. For instance, it requires assigning 5 different learning rates (i.e. $\\lambda_\\beta, \\lambda_\\phi, \\lambda_\\psi, \\lambda_\\theta, \\lambda_\\alpha$) which clearly shows level of complexity in this method. In addition, while this method sometimes shows some improvement in some of the benchmarks, it remains unclear what drives these enhancements. It's crucial to note that the proposed algorithm is evaluated against not right baselines which are not designed for this specific problem setting. The results are also mixed and this method doesn't show a consistent trend in the experiments. For instance, compare results of DoggoGoal and CarPush in Figure 2. Finally, writing of section 4.2.1 and experiments section need major work as it's either too shallow (e.g. 4.2.1) or excessively and unnecessarily detailed, making it challenging to follow ( e.g. especially in the experiment section).\n\n-  The idea of having an environment that returns multiple rewards is a valid idea. However, limiting it to just positive and negative rewards seems narrow. This scenario appears more akin to a constrained markov decision process (CMDP), where one function serves as a reward, and the other as a cost. Authors could have studied this topic in a multi-objective RL setting where there are multiple rewards and the goal is to find a policy that is \"optimal\" across different rewards. This is a well-studied topic ( see [2], etc) and this paper seems to have selected a setting which is very limited. \n\nDespite this paper studies an important problem, unfortunately, it presents several shortcomings as mentioned above and is not yet ready for ICLR at the current form and requires major work.\n\n[1] Conservative Safety Critic, https://arxiv.org/abs/2010.14497\n\n[2] A Distributional View on Multi-Objective Policy Optimization https://arxiv.org/abs/2005.07513"
            },
            "questions": {
                "value": "In page 4, it is mentioned that \"When the reward function has independent terms of different signs, errors in the magnitude of the estimates for |Qr| and |Qc| will grow in opposite directions\". This might be true in very limited cases, but I don't think that always holds. Do you have any mathematical or numerical evidence that justify your claim?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "N/A"
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission6117/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699517341977,
        "cdate": 1699517341977,
        "tmdate": 1699636661386,
        "mdate": 1699636661386,
        "license": "CC BY 4.0",
        "version": 2
    }
]