[
    {
        "id": "J3hURTNOk2",
        "forum": "TjCDNssXKU",
        "replyto": "TjCDNssXKU",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5350/Reviewer_yLBk"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5350/Reviewer_yLBk"
        ],
        "content": {
            "summary": {
                "value": "The paper proposed Temporal Hierarchies from Invariant Context Kernels, a method for extracting a hierarchical world model using the proposed Context-specific RSSM (which extends the existing RSSM model (Hafner et al., 2018)) using a coarsely-updating context variable. CRSSM predicts in two levels, selectively updating parts of its latent state (context) sparsely in time. They combine the hierarchical world model (CRSSM) with Dreamer (Hafner et al., 2020) to propose THICK Dreamer, a model-based RL method that combines value estimates from low- and high-level predictions of state and context variables to compute a long-horizon value function. The authors evaluate THICK on MBRL tasks and qualitatively show context switches in their world model."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1) The paper is easy to follow and well-structured with the main contributions listed clearly in the introduction. The proposed world model, Context-specific RSSM, makes a simple yet effective addition to RSSM, and the authors contextualize it well within the existing RSSM model. Contrasting with the existing literature in this area, I find the model visualizations to be very clear and self-explanatory.\n2) The authors show interesting qualitative results using CRSSM, extensive evaluation of their world model when fitted in Dreamer and PlaNet for MBRL, and provide thorough details about their task setups in the appendix adding to the reproducibility of this work."
            },
            "weaknesses": {
                "value": "1) Looking at figure 7, there does not seem to be a significant difference between the performance of Dreamer and the proposed method. Can the authors justify the marginal performance improvement? \n2) The reported results using Director show close to 0 success on all the tasks. Can the authors explain why was that the case?"
            },
            "questions": {
                "value": "None"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "No concerns."
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5350/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5350/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5350/Reviewer_yLBk"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5350/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698856812866,
        "cdate": 1698856812866,
        "tmdate": 1699636538877,
        "mdate": 1699636538877,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "piUpp6xT77",
        "forum": "TjCDNssXKU",
        "replyto": "TjCDNssXKU",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5350/Reviewer_h1NE"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5350/Reviewer_h1NE"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a novel way of learning a hierarchical world model. On top of Dreamer's world model implementation, RSSM, this paper introduces Context-specific RSSM (C-RSSM) with a slowly (sparsely) changing discrete context state $\\mathbf{c}_t$, which represents some static scene info that is preserved for a long time horizon. The continuously changing states $\\mathbf{h}_t$ and $\\mathbf{z}_t$ are then conditioned on this context state $\\mathbf{c}_t$. With the trained C-RSSM, a high-level transition is defined as a contiguous transition segment with the same $\\mathbf{c}_t$. The high-level world model (THICK) can be trained to predict the context and stochastic state of the next segment. The paper utilizes C-RSSM and THICK for model-based RL by combining with Dreamer and model-based planning by using MPC. The experiments on MiniHack, PinPad, and robotic manipulation environments show that THICK+Dreamer and THICK+MPC outperform the flat world model baselines when the task horizon becomes longer."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "* This paper tackles an important problem of learning a hierarchical world model. \n\n* The idea of learning a sparsely changing context state is intuitive and using context switches to define high-level transitions is a sensible choice. Moreover, this enables THICK to naturally incorporate variable-length skills.\n\n* The learned hierarchical world models (THICK and C-RSSM) can be integrated with both model-based RL and model-based planning.\n\n* The paper is clearly written and the figures help us understand the complex concepts of the proposed method.\n\n* The experimental results support that the hierarchy in the world model improves long-horizon prediction."
            },
            "weaknesses": {
                "value": "* The design choices of the proposed approach are not explained and justified. Especially, the high-level world model learns to predict the future state and action just before the context switch, rather than the context and state right after the context switch. Predicting a low-level action sometime in the future sounds very difficult to me. Although this design choice also makes sense and works in practice, it would be great to explain the rationale behind this specific design choice. \n\n* Section 2.1 introduces the coarse prior of the stochastic state but it is unclear what is the rationale behind this design. It would be great to further explain why C-RSSM needs both coarse and precise priors. Similarly, more explanation about the need for coarse predictions in Equation 8 would help understand the proposed method.\n\n* Generally, the experimental results of THICK+Dreamer and THICK+PlaNet are similar to those of DreamerV2 and PlaNet. Despite its novelty, these weak experimental results may make its impact less significant. Stronger results in more diverse environments would be greatly appreciated. If possible, it would be great to see its performance on the common RL benchmarks, such as Atari and DMC tasks.\n\n* The paper claims that Thick Dreamer is more sample efficient than DreamerV2 in PinPadFour and PinPadFive but the improvement is relatively marginal to strongly claim this.\n\n* Moreover, the experiments on the PinPad environments use Plan2Explore to fill in initial exploratory data. As RL is inherently a combination of exploration and exploitation, it would be important to see how it works for exploration. Thus, it is recommended to include experiments on RL from scratch.\n\n* Although the investigation of world model hierarchies is important, many deep learning approaches seem in favor of scaling model sizes instead of injecting hierarchies. In this sense, it might be interesting to see comparisons between scaling models [a] vs. C-RSSM.\n\n\n[a] Deng et al. Facing Off World Model Backbones: RNNs, Transformers, and S4. NeurIPS 2023"
            },
            "questions": {
                "value": "Please address the weaknesses mentioned above.\n\n\n### Minor questions and suggestions\n\n* It might be better if Figure 2 could illustrate that $\\mathbf{c}$ is changing slowly and the high-level transition happens when $\\mathbf{c}$ has changed.\n\n* In Equation 11, $\\delta$ starting from 0 makes more sense?\n\n* In Equation 21, $t < K$ should be $\\tau(t) < K$ or $A_{\\tau(t):K}$ should be $A_{t+1:K}$?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5350/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699197254046,
        "cdate": 1699197254046,
        "tmdate": 1699636538691,
        "mdate": 1699636538691,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "U8VW26MBub",
        "forum": "TjCDNssXKU",
        "replyto": "TjCDNssXKU",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5350/Reviewer_sX3c"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5350/Reviewer_sX3c"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a method called THICK for learning hierarchical world models with adaptive temporal abstractions from discrete latent dynamics. The key idea is to use a context-specific recurrent state space model (C-RSSM) to create a sparsely changing context latent variable. This context encodes higher-level transitions that are used to train a high-level predictor. The high-level model predicts states that lead to context changes, enabling temporal abstract predictions. The hierarchical predictions can be integrated into model-based RL and planning methods."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- The C-RSSM provides a simple yet effective way to learn sparsely changing context variables from pixel observations without supervision.\n\n- The high-level model is trained in a self-supervised manner to anticipate context changes based on the C-RSSM's discrete dynamics.\n\n- The method is generally applicable across various environments with visual observations.\n\n- Experiments show that the learned hierarchies capture meaningful abstractions related to subgoals.\n\n- Integrating THICK's hierarchical predictions improves sample efficiency of model-based RL in long-horizon tasks.\n\n- The high-level plans can be visualized, enhancing model interpretability."
            },
            "weaknesses": {
                "value": "1) The sparsity hyperparameter for the C-RSSM needs to be tuned for each environment.\n\n2) The high-level model operates at a fixed abstract timescale, less flexible than methods with hierarchical policies. \n\n3) The high-level plans are not actively updated during execution, being replanned only at context changes.\n\n4) The expressiveness of temporal abstractions may be limited compared to methods with backing task priors or curriculum learning.\n\nHowever, I think this paper still take a step further to hierarchical world model."
            },
            "questions": {
                "value": "1) How does the performance compare to hierarchical RL methods like h-DQN or FeUdal Networks?\n\n2) Could the hierarchy be extended to have multiple abstraction levels instead of just two?\n\n3)  How well does THICK scale to even longer time horizons or higher-dimensional state spaces?\n\n4)  Could active exploration be used to shape useful context abstractions instead of relying on a sparsity loss?\n\n5) Is there some mechanisms could be add to make the high-level plans more reactive to execution errors or environment changes?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5350/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699554954307,
        "cdate": 1699554954307,
        "tmdate": 1699636538607,
        "mdate": 1699636538607,
        "license": "CC BY 4.0",
        "version": 2
    }
]