[
    {
        "id": "105WCNdhLZ",
        "forum": "tkmO6bXT54",
        "replyto": "tkmO6bXT54",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4181/Reviewer_9T2x"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4181/Reviewer_9T2x"
        ],
        "content": {
            "summary": {
                "value": "To handle imbalanced data, the authors propose RG (Regrouping) by\nclustering instances in the majority class, create pseudo-classes\nfrom the classes, and learned a classifier with more classes.  If the\nscore for the minority class is larger than the pseudo-class, the\nminority class is predicted; otherwise, the majority class is\npredicted.  For multi-class data, all classes except the smallest\nclass are regrouped.  The proposed approach is quite straightforward.\n\nFor binary classification, RG was evaluated on two datasets.  For\nmulti-class classification, RG was evaluated on one dataset."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "The problem of imbalanced data in multi-class classification is\ninteresting.  RG outperforms existing techniques in balanced accuracy\n(BA) in one dataset."
            },
            "weaknesses": {
                "value": "The efficacy of RG is not well demonstrated.  In Table 1, RG only\noutperforms in one of 3 metrics in one of 2 datasets.  For the\nmulti-class problem only one dataset is used.\n\nThe choice of datasets could be improved.  The 9 classes in CIFAR 10\nare quite different and merging to simulate a single majority class\nmight have a quite diversified class.  For example, a majority class\nhas many images of dogs, but the different kinds (subclasses/clusters)\nof dogs have commonalities to be dogs.  Hence, Binary CIFAR 10 might\nnot be a good dataset to use.  Binary HAM10000 on \"dermatoscopic\nimages of 7 common skin lesions\" is more appropriate.\n\nThe presentation could be improved.  For example:\n\nSec 2.2: Sum aggregation was discussed, but it seems to be not used\nin any experiments.  Also, the motivation for Sum aggregation was not\ndiscussed.\n\nSec. 2.2 does not discuss how clusters are formed via regrouping.\nk-means is mentioned in 4.1 Setting of experiment."
            },
            "questions": {
                "value": "RG+WCE: since RG tries to balanced class sizes, why do you need WCE\n(weighted cross entropy)?  Why did WCE help?  Could you describe WCE\nor cite a source?\n\np7.  \"Considering that AUPRC is agnostic to the decision rule and is\noften approximated by AP given finite sample sizes\"--any citations or\nevidence to support the statement?\n\nFig. 5, caption: airplane, not apple ?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "n/a"
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4181/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1697843865717,
        "cdate": 1697843865717,
        "tmdate": 1699636384097,
        "mdate": 1699636384097,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "VP6nKJGV6l",
        "forum": "tkmO6bXT54",
        "replyto": "tkmO6bXT54",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4181/Reviewer_AJcJ"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4181/Reviewer_AJcJ"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a regrouping method to improve the performance of imbalanced learning, which decomposes the majority classes into subclasses by clustering and trains the model under the extended classes. The authors analyzed the ability of the proposed RG , demonstrating its ability to facilitate learning efficient representation and synchronizing the training progress across different classes, and verified the performance thorough a range of experiments."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1) ReGrouping method is different from the conventional loss reweighting or re-sampling methods that changes the class importance explicitly. By regrouping, the learning pace of each class (especially for rare classes) can be directly intervened as shown in the loss variation illustration in Figure 5. \n\n2) The authors provided some interesting validations to support the design about the proposed method like the synchronous learning, and presented how to design the clustering number and extend to multi-class learning as well as the underlying tricky points for the optimal performance. \n\n3) The authors conducted a range of experiments on both binary and multi-class imbalanced learning tasks, demonstrating superior performance compared to state-of-the-art methods in terms of balanced accuracy (BA) and average precision (AP) metrics."
            },
            "weaknesses": {
                "value": "Although the methods shows the interesting points of the proposed regrouping method, some critical concerns remained and are summarized as follows.\n\n1) The novelty concern can be a big problem. As the authors mentioned about the COG method (local clustering for imbalanced learning in Wu, et. al., 2010), both the proposed method and COG shares the same spirit for imbalanced learning, and the technical major difference is COG follows the SVM classifier. Despite in different data context, they are both for imbalanced learning, which weakens the novelty of this work.\n\n2) The technical description is not sufficient, as we can see that there is lack of the clustering ways for pseudo labels that are used in the regrouping method. This also connects the lack of the corresponding experiments to verify the clustering impact on the final performance. Especially, as shown in Figure 5 and Figure 6, how to assign the pseudo labels does matter about the performance, which makes the readers care about the clustering effectiveness.\n\n3) The experiments are also not very persuasive although some experiments have shown the improvement about RG. The major concern is about the datasets and the baselines especially for the multi-class classification experiments. There are a range of explorations in long-tailed learning for multi-class classification problems. However, we cannot find any sufficient comparison with the recent advances like Decoupling, LA (logit adjustment), BCL and so on. For the datasets in long-tailed learning, CIFAR100-LT, ImageNet-LT or INaturalist are all widely adopted benchmarks, which should be included in this submission."
            },
            "questions": {
                "value": "Overall, I am interested in this regrouping idea for imbalance learning, although it has been proposed in previous explorations. What is the intrinsic difference for imbalanced learning should be highlighted, instead of some minor difference as in the description of the submission. For other questions, please see above weakness."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4181/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698466375024,
        "cdate": 1698466375024,
        "tmdate": 1699636383970,
        "mdate": 1699636383970,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "cgnHTLlvT8",
        "forum": "tkmO6bXT54",
        "replyto": "tkmO6bXT54",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4181/Reviewer_nZ1i"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4181/Reviewer_nZ1i"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a simple solution for class imbalanced problem by grouping the majority class to smaller sub-classes. The paper is well-written and easy to read."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "Showcasing how multi-class classification by regrouping the majority class to smaller sub-classes work better than a binary classification."
            },
            "weaknesses": {
                "value": "- In the experiments there are no error bars. \n- There is no experiment that any model that is not data hungry has been applied to compare it with DNN."
            },
            "questions": {
                "value": "- I would like to see the experiments results with error bars included. For example if you run the experiment n times and calculate standard deviation.\n- I would also like to see how the results change if you apply non-hungry methods such as Gaussian processes.\n- Sometimes groping the classes to small sub-groups is a difficult task by itself, how do you decide what type of data you can use to have this meaningful sub-groups? What happens if you can't put them into smaller groups?\n- What are the limitations of your method?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4181/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698755581378,
        "cdate": 1698755581378,
        "tmdate": 1699636383879,
        "mdate": 1699636383879,
        "license": "CC BY 4.0",
        "version": 2
    }
]