[
    {
        "id": "ybgpiwvG1G",
        "forum": "tmBKIecDE9",
        "replyto": "tmBKIecDE9",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4172/Reviewer_j8Na"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4172/Reviewer_j8Na"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes Motif: 1) replacing human labeling in preference-based RL with LLM labeling, and 2) joint optimization of preference-based and extrinsic rewards to solve the NetHack environment. After collecting sufficiently covered offline data from the existing RL methods, preference labels are annotated using LLaMA 2. Motif trains the preference reward model from those data and leverages it for online training from scratch, jointly maximizing preference-based and extrinsic rewards. Motif exhibits strong performance in staircase tasks from NetHack."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "### quality and clarity\n- This paper is well-written and easy to follow.\n\n### significance\n- The empirical results are strong. It would be notable to solve the difficult, sparse-reward NetHack environments that previous intrinsic-motivation methods cannot solve by leveraging preference-based reward."
            },
            "weaknesses": {
                "value": "- I think the point of this paper is that \"joint optimization of preference-based and extrinsic reward helps resolve the sparse reward problems\". As the source of feedback, either humans or LLMs are OK. I think describing this as LLM's contribution might be an overstatement.\n- As a preference-based RL method, I guess there are no differences from the original paper [1]. In the LLM literature, [2] leverages GPT-4 to solve game environments, and [3] incorporates LLM-based rewards for RL pretraining.\n- Terminology: I'm not sure if a preference-based reward should be treated as an \"intrinsic\" reward. I think it is extrinsic knowledge (from humans or LLM).\n\n[1] https://arxiv.org/abs/1706.03741\n\n[2] https://arxiv.org/abs/2305.16291\n\n[3] https://arxiv.org/abs/2302.06692"
            },
            "questions": {
                "value": "- Which RL algorithm is used for Motif? I may miss the description in the main text.\n- Are there any reason why employ LLaMA 2 rather than GPT-3.5 / 4?\n\n(Minor Issue)\n- In Section 2, `... O the observation space ...` might be `... O is the observation space ...`."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "N/A"
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4172/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698610293239,
        "cdate": 1698610293239,
        "tmdate": 1699636383241,
        "mdate": 1699636383241,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "QAyb3tGtSA",
        "forum": "tmBKIecDE9",
        "replyto": "tmBKIecDE9",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4172/Reviewer_2GW2"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4172/Reviewer_2GW2"
        ],
        "content": {
            "summary": {
                "value": "This paper provides Motif, a method for training a reinforcement learning (RL) agent with AI preferences. The main idea of Motif is to use AI preferences (or Large Language Model (LLM) preferences), instead of human preferences, for the preference-based RL. More specifically, Motif trains an intrinsic reward model on a LLM preference dataset, and then trains a RL agent by harnessing the intrinsic reward model. In summary, Motif consists of three phases: (1) dataset annotation by a LLM, (2) reward training on a LLM preference dataset, and (3) RL training with the reward model. This paper applies Motif to the NetHack Learning Environment (NLE). The paper uses Llama-2-70B as a preference annotator, and CDGPT5 as a baseline NetHack agent. This paper shows that RL agents trained with Motif's intrinsic reward surprisingly outperform agents trained using the score itself."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "4 excellent"
            },
            "strengths": {
                "value": "- S1. First of all, this paper is well-written and well-organized.\n- S2. The idea of using a LLM as a preference annotator for preference-based RL is interesting and promising.\n- S3. This paper provides a loss function (equation 1) to train an intrinsic reward model.\n- S4. This paper shows that training agents with intrinsic rewards is very effective."
            },
            "weaknesses": {
                "value": "- W1. One of my main questions is whether Motif can be generally applied to other environments. Even though the NetHack Learning Environment (NLE) is a very challenging environment, it seems that the NLE may be one of environments that a LLM can easily annotate preferences."
            },
            "questions": {
                "value": "- Q1. Can Motif be applied to other environments beyond the NetHack Learning Environment (NLE)?\n- Q2. What a RL algorithm is used for RL fine-tuning?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4172/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4172/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4172/Reviewer_2GW2"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4172/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698689381017,
        "cdate": 1698689381017,
        "tmdate": 1699636383170,
        "mdate": 1699636383170,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "YmGIe1M2XC",
        "forum": "tmBKIecDE9",
        "replyto": "tmBKIecDE9",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4172/Reviewer_VWkY"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4172/Reviewer_VWkY"
        ],
        "content": {
            "summary": {
                "value": "The paper introduces Motif, a method for integrating the common sense and high-level knowledge of LLMs into reinforcement learning agents. Motif works by eliciting preferences from the LLM based on pairs of event captions. These preferences are then translated into intrinsic rewards for training agents. The authors test Motif on the NetHack Learning Environment, a complex, open-ended, procedurally-generated game. The results show that agents trained with Motif's intrinsic rewards outperform those trained solely to maximize the game score. The paper also delves into the qualitative aspects of agent behavior, including alignment properties and the impact of prompt variations."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The paper is clear and well presented.\n2. The idea of using intrinsic rewards generated from an LLM's preferences is both innovative and practically useful, potentially paving the way for more human-aligned agents.\n3. The method scales well with the size of the LLM and is sensitive to prompt modifications, offering flexibility and adaptability.\n4. The paper provides a comprehensive analysis, covering not just the quantitative but also the qualitative behaviors of the agents."
            },
            "weaknesses": {
                "value": "1. The paper could benefit from a more extensive comparison to other methods, especially those that also attempt to integrate LLMs into decision-making agents.\n2. There is a lack of discussion on the computational cost and efficiency aspects of implementing Motif.\n3. While the paper makes a strong case for Motif, it doesn't delve deeply into the limitations or potential drawbacks of relying on LLMs for intrinsic reward generation."
            },
            "questions": {
                "value": "1. Could the authors offer insights into why agents trained  on extrinsic only perform worse than those trained on intrinsic only rewards?\n2. What's the best strategy to optimally balance intrinsic and extrinsic rewards during training?\n3. Can the authors elaborate on the limitations of using LLMs for generating intrinsic rewards? Are there concerns about misalignment or ethical considerations?\n4. How robust are agents trained with Motif against different types of adversarial attacks or when deployed in varied environments?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4172/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698723817523,
        "cdate": 1698723817523,
        "tmdate": 1699636383094,
        "mdate": 1699636383094,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "VZz21uJuD5",
        "forum": "tmBKIecDE9",
        "replyto": "tmBKIecDE9",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4172/Reviewer_wqBP"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4172/Reviewer_wqBP"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a method called Motif for tackling the exploration problem in RL by making use of an LLM to learn an intrinsic reward function, which is used to learn a policy using a standard RL algorithm. The testbed for this approach is the NetHack Learning Environment, a popular procedurally generated environment with sparse reward. This approach leads to strong improvements in performance over prior approaches without demonstrations and also results in human understandable behaviours."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- Figure 1 provides a nice clean bird's eye view of the overall approach and helps with readability.\n- The evaluation of the agent for not just the game score but also other dimensions provides a helpful qualitative assessment of the proposed approach and baselines through the spider graph in Figure 4.\n- The ablation experiments for the approach are quite exhaustive, covering scaling laws, prior v/s zero knowledge, rewordings of the prompts, etc."
            },
            "weaknesses": {
                "value": "- Using a 70-billion LLM to generate a preference dataset from given captions is quite expensive; while I understand this is out of the scope of the paper, perhaps using a large VLM to annotate frames without captions might have been more economical?\n- Given that one of the key contributions of the paper is the intrinsic reward function that is learnt from preferences extracted from the LLM, it might be worthwhile having a baseline that gives preferences using a simpler model (say sentiment analysis) and learn the RL policy using this intrinsic reward model."
            },
            "questions": {
                "value": "- In the part on \"Alignment with human intuition\", the paper mentions that the agent exhibits a natural tendency to explore the environment by preferring messages that would also be intuitively preferred by humans. Is this a consequence of having a strong LLM, or is it due to the wording of the prompt?\n- An ablation over $\\alpha_2$ has been provided in the appendix, but the value of the coefficient for the intrinsic reward $\\alpha_1$ is kept fixed at 0.1; could you explain the reason behind that?\n- In Figure 6c, the score for the reworded prompt is quite low but its dungeon level keeps steadily rising compared to the default prompt. Is this a case of the agent hallucinating its dungeon level due to a very high intrinsic reward, or is it something else?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4172/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4172/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4172/Reviewer_wqBP"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4172/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699223413133,
        "cdate": 1699223413133,
        "tmdate": 1700668318869,
        "mdate": 1700668318869,
        "license": "CC BY 4.0",
        "version": 2
    }
]