[
    {
        "id": "x0lC1jsG0I",
        "forum": "TTrzgEZt9s",
        "replyto": "TTrzgEZt9s",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7912/Reviewer_Ed47"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7912/Reviewer_Ed47"
        ],
        "content": {
            "summary": {
                "value": "The paper provides a practical algorithm to solve DRO problems. The algorithm enjoys a linear convergence rate and it does not require tuning multiple hyperparameters. The author further demonstrated the proposed algorithm can achieve 2-3x speedup compared to other methods vias read-data sets."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. The paper is well-written and the contribution is significant. The algorithm is easy to understand and easy to implement. The authors also provide intuition behind the algorithm via texts and figures."
            },
            "weaknesses": {
                "value": "1. The paper needs to solve an optimization problem with n variables in each iteration (line 10 in Algorithm 1). It is very computationally expensive if n is large. I wonder whether the algorithm can reduce to another one-step stochastic gradient descent in this step. For example, the two-time scale method in distributionally robust RL [1].\n\n[1] Yang, Wenhao, et al. \"Avoiding model estimation in robust Markov decision processes with a generative model.\" arXiv preprint arXiv:2302.01248 (2023).\n\n2. The paper only provides theoretical results for the case $\\mu>0$. I am not sure if it is necessary or if it is only for theoretical convenience. It is known that the DRO objective $\\mathcal{R}_\\sigma$ could induce smoothness. Some discussions are needed and numerical examples with $\\mu=0$ will also help."
            },
            "questions": {
                "value": "The papers (including the appendix) are long. I am not sure whether it is suitable for a conference review.\n\nI am curious that whether there are some unbiased estimators could be used, e.g., Wang et al (2023).\n\nWang, Shengbo, et al. \"A finite sample complexity bound for distributionally robust Q-learning.\" International Conference on Artificial Intelligence and Statistics. PMLR, 2023."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission7912/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7912/Reviewer_Ed47",
                    "ICLR.cc/2024/Conference/Submission7912/Senior_Area_Chairs"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7912/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698544464925,
        "cdate": 1698544464925,
        "tmdate": 1700592043398,
        "mdate": 1700592043398,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "tOQ10JJ9xH",
        "forum": "TTrzgEZt9s",
        "replyto": "TTrzgEZt9s",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7912/Reviewer_ss6k"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7912/Reviewer_ss6k"
        ],
        "content": {
            "summary": {
                "value": "In this paper the authors have developed an iterative algorithm to solve optimization problems with spectral risk measures. \nThis is equivalent to optimization a distributionally robust optimization problem where the ambiguity set is the space of all probability distributions with a term to penalize the distance from the uniform distribution.\nTheir algorithm consists of 3 key components\n1. Gradients steps of the spectral risk measure\n2. Bias reduction for the gradient estimates\n3. Variance reduction for the gradient estimates\n\nEach of these steps can be done efficiently. \nThe authors also prove that the algorithm converges to the correct solution linearly\nFinally, the authors illustrate the performance of their algorithm through numerical experiments on a variety of tasks."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "4 excellent"
            },
            "strengths": {
                "value": "**originality**: I think this work is original. This paper develops a new iterative algorithm for DRO problems with ambiguity sets connected to spectral risk measures. \n\n**quality**: The work is sound and presents justifies the algorithm with both theoretical and experimental results\n\n**clarity**: the work is well presented and the numerical results are clearly explained.\n\n**significance**: I believe the work is significant since it expands the type of DRO problems that can be solved with iterative algorithms and hence the size of DRO problems that can be solved which has always been a key limitation of it."
            },
            "weaknesses": {
                "value": "I feel the discussion on the connection to DRO is quite limited. The ambiguity sets for equation (2) is the entire space of distributions which is quite large and not very useful. I believe the presence of the penalty term shows that this problem can be equivalent to a tighter ambiguity set (maybe restricted by the divergence metric used in the objective) and it would be good if the authors can discuss this. \n\nf-divergences are quite a broad type of divergence as discussed in the appendix. The 3 types of divergences considered in the experimental section are quite limited. It would be good if authors can also discuss some of the other popular divergences such as KL-divergence etc. and compare the developed algorithm to existing approaches for DRO problems with these divergences."
            },
            "questions": {
                "value": "1. What is the scale of the problems you can solve. How much time does it take to solve the problem. \n2. Will the algorithm work if used along with a projection step to solve constrained optimization problems?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7912/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698835602229,
        "cdate": 1698835602229,
        "tmdate": 1699636971008,
        "mdate": 1699636971008,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "7X37vH5PRa",
        "forum": "TTrzgEZt9s",
        "replyto": "TTrzgEZt9s",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7912/Reviewer_ucUf"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7912/Reviewer_ucUf"
        ],
        "content": {
            "summary": {
                "value": "The authors studied DRO with spectral risk measure and modeled the ambiguity set as $f$-divergence. Strong duality result, together with a stochastic optimization algorithm, was proposed to optimize the formulation. The idea of their proposed algorithm is to reduce the bias and variance of gradient estimators while maintaining small computational costs when performing iteration updates. Convergence analysis revealed that their algorithm converges linearly for \"smooth regularized losses\". A comprehensive numerical study is performed to show the superior performance of their algorithm."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "4 excellent"
            },
            "strengths": {
                "value": "- It seems the strong duality of $f$-divergence DRO when considering spectral risk measure in Proposition 3 is new in the literature. Appendix B shows a range of nice properties regarding the formulation (2).\n-  The designed Prospect Algorithm is novel and operates by reducing the bias and variance of gradient estimators while maintaining small computational costs. Nice convergence guarantees are established in Theorem 1 provided that the regularization for $f$-divergence is lower bounded and the regularization value of the model parameter $w$ is positive.\n- A comprehensive numerical study is performed to show the superior performance of their algorithm."
            },
            "weaknesses": {
                "value": "See Questions part."
            },
            "questions": {
                "value": "- In contrast to the standard DRO that models $\\mathcal{P}$ as a probability simplex on $n$ atoms, the authors consider the spectral risk measure such that $\\mathcal{P}=\\text{CovexHull}(\\text{Permutaions of }(\\sigma_1,\\ldots,\\sigma_n))$. I was confused about the motivation for using such a spectral measure. In which scenarios will people focus on this type of measure? The authors should give more justification on this part.\n- When deriving the strong duality result in Proposition 3, the authors assume that the conjugate function of $f$, denoted as $f^*$ satisfies $|f^*(y)|<\\infty, \\forall y\\in\\mathbb{R}$. However, when studying the standard $f$-divergence DRO with $\\mathcal{P}$ being the probability simplex on $n$ atoms (see Section 3.2 in (Shapiro Alex, 2017)), one does not require such an Assumption. Could the authors justify why we need this restrictive assumption? Also, I think the authors missed this important citation.\n\nRef: Shapiro A. Distributionally robust stochastic programming[J]. SIAM Journal on Optimization, 2017, 27(4): 2258-2275.\n- In Proposition 4, the assumption that $f$ is $\\alpha_n$-strongly convex may be restrictive. Is it possible to relax this assumption into strictly convex?\n- It is difficult to tell why Proposition 5 holds. The authors should add complete proof regarding this proposition. Besides, in Eq. (15) I find the authors implicitly assume the conjugate function $f^*$ is differentiable. I am wondering if the authors assume the differentiability of the function $f$, or the condition $f^*$ is differentiable can be derived based on some conditions?\n- In page 28-32, page 35-37, and page 39-40, some equations are highlighted in color. What is the meaning of those highlighted colors?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission7912/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7912/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7912/Reviewer_ucUf"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7912/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698950766730,
        "cdate": 1698950766730,
        "tmdate": 1699636970893,
        "mdate": 1699636970893,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "SlgNZIECHC",
        "forum": "TTrzgEZt9s",
        "replyto": "TTrzgEZt9s",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7912/Reviewer_12Ff"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7912/Reviewer_12Ff"
        ],
        "content": {
            "summary": {
                "value": "The authors propose Prospect, a distributionally robust algorithm that requires the tuning of only one hyperparameter. The algorithm's formulation includes a reweighed empirical risk and an f-divergence term to account for the cost requires to shift from a uniform representation of the training data. The authors propose both bias and variance reduction procedures to ensure that both quantities vanish, hence guaranteeing convergence.  Prospect is proved to enjoy a linear convergence for any positive shift cost on regularized convex losses and is empirically competitive with the considered baselines."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "The paper has multiple strengths in terms of originality, quality and significance. The clarity component is lacking in the ways that I will explain in the weaknesses section. \n\n- The paper has solid contributions compared to prior work. \n- The theoretical analysis is sound and well supported. \n- The authors also discuss the case where the hypotheses of this work are violated and argue that their algorithm still converges in that case. \n- The empirical evaluation considers 3 important problems and covers both classification and regression. \n- The proposed algorithm and all baselines are trained to convergence as shown in all figures. The hyperparameter selection seems to also have been done in a fair manner."
            },
            "weaknesses": {
                "value": "I enumerate below the weaknesses of this work, which to me are important to address but do not undermine the overall quality of this work. I hope the authors will be able to address them during the rebuttal.\n\n- Presentation and clarity: Although the authors clearly attempt to make the paper as clear as possible, some key notions are never introduced. For instance, CVaR was never formally introduced. It is also unclear to me what 0.5-CVaR, 2-extremile, and 1-ESRM really mean mathematically speaking. The entire notion of spectral risk-based needs to be explained much more clearly. I also don't understand Figure 6, and overall the captions of the figures could be more descriptive. The abstract is heavily jargony, and so is a lot of the introduction text. I would appreciate a clearer presentation of this work, its motivation, and key notions at least in the introduction. \n\n- Baselines: I find the baselines considered by this work to be very restrictive. Some of the problems considered in the experiments section violate the hypotheses that lead to Prospect's theoretical guarantees, and therefore it would only be fair to compare it to other algorithms that do not enjoy the same guarantees and do not have only one hyperparameter to tune. In fact, the number of hyperparameters being only one is not as big of an advantage as portrayed in my opinion, since more practical algorithms would have default values for their hyperparameters that would work well in practice. I recommend comparing additionally to at least Adam and SGD with momentum."
            },
            "questions": {
                "value": "Please refer to the weaknesses section."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission7912/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7912/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7912/Reviewer_12Ff"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7912/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699251620730,
        "cdate": 1699251620730,
        "tmdate": 1700668343603,
        "mdate": 1700668343603,
        "license": "CC BY 4.0",
        "version": 2
    }
]