[
    {
        "id": "r1rWKa5gtV",
        "forum": "u7559ZMvwY",
        "replyto": "u7559ZMvwY",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4921/Reviewer_onZy"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4921/Reviewer_onZy"
        ],
        "content": {
            "summary": {
                "value": "The paper introduces an adversarial defense technique called Adversarial Training on Purification (AToP). AToP conceptualizes AP into two components: perturbation destruction by random transforms and fine-tu . ning the purifier model using supervised AT. The random transforms aim to enhance the robustness to unseen attacks, while the purifier model reconstructs clean data from corrupted data, ensuring correct classification output regardless of the corruption. The purifier model is fine-tuned through an adversarial loss calculated from the classifier output. The paper presents experiments on CIFAR and ImageNette datasets, comparing AToP with other AT and AP methods. The results demonstrate that AToP achieves good generalization ability against unseen attacks, and maintains standard accuracy on clean examples."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- The paper addresses a significant problem in the field of deep learning, namely the vulnerability of neural networks to adversarial attacks.\n- The proposed AToP technique offers a promising solution that combines the advantages of AT and AP, achieving good robustness, standard accuracy, and robust generalization to unseen attacks.\n- The proposed AToP framework is well-defined, with a clear explanation of its components and their roles in achieving optimal robustness, standard accuracy, and robust generalization to unseen attacks.  \n- The experiments are conducted on CIFAR and ImageNette dataset \n- I appreciate the evaluation with BDPA   \n- The paper is well-structured, with a clear and concise presentation of ideas."
            },
            "weaknesses": {
                "value": "- Overall the technical novelty of this work is limited. In essence, AToP combines the orthogonal techniques of AT and AP. \n- The authors mainly evaluate ResNet and Wide-ResNet architecture. Hence it is not clear if this work generalizes to other model architectures. \n- These days, transformer architectures are gaining popularity. How does the proposed AToP perform on such architectures, such as ViT?\n- While I appreciate the evaluation on BPDA, the authors should include a separate section on “obfuscated gradients”, where they follow the guidelines of BPDA and [A] to test for obfuscated gradients.  \n\n[B] On Evaluating Adversarial Robustness; arXiv 2019"
            },
            "questions": {
                "value": "Please address the points in my weaknesses section."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4921/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4921/Reviewer_onZy",
                    "ICLR.cc/2024/Conference/Submission4921/Senior_Area_Chairs"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4921/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698136299783,
        "cdate": 1698136299783,
        "tmdate": 1700630636074,
        "mdate": 1700630636074,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "yXMRad9hnv",
        "forum": "u7559ZMvwY",
        "replyto": "u7559ZMvwY",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4921/Reviewer_n69U"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4921/Reviewer_n69U"
        ],
        "content": {
            "summary": {
                "value": "1. This paper aims to enhance the adversarial robustness of deep models.\n\n2. Combining adversarial training and purification techniques, a new pipeline is proposed, i.e., adversarial training on purification.\n\n3. Different from purification methods that purify adversarial examples with a pre-trained generative model before classification, \nthe generative model can be finetuned by adversarial training in the proposed pipeline. Moreover, the introduce random transformations play an important role in defensing adversarial attacks."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The paper is written clearly and easy to follow.    \n2. Models trained by the proposed method show promising robustness and generalization."
            },
            "weaknesses": {
                "value": "1. What if there are no random transformations in the proposed pipeline?\n    Does the robustness come from the gradient vanishing from random operations?\n\n2. For adversarial training methods, auto-attack is one of the most effective attack methods to evaluate model robustness. This is because models with adversarial training usually show much better results under FGSM, PGD, and other attacks than under the auto-attack. \n\n    However, as indicated by Table 7 and Table 8 in this paper, the trained model even achieves much better robustness under auto-attack than under PGD20, FGSM attacks.\n    From this perspective, the comparisons in Tables 2,3,4,5 can be unfair because models with adversarial training show worst-case robustness under auto-attack while it is not the case for the model trained by the proposed method.\n\n3. Considering the issue in 2, to demonstrate their robustness, the models trained by the proposed methods should be fully tested under different attacks. For example, the CW attack with a large number of steps, and the PGD attack with 1000 steps."
            },
            "questions": {
                "value": "See above weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "No ethics concerns."
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4921/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698652611119,
        "cdate": 1698652611119,
        "tmdate": 1699636477715,
        "mdate": 1699636477715,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "Zq4nNa1aeT",
        "forum": "u7559ZMvwY",
        "replyto": "u7559ZMvwY",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4921/Reviewer_jVyX"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4921/Reviewer_jVyX"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes Adversarial Training on Purification (AToP) for adversarial defense, which is expected to improve the robustness while achieving good generalization ability. The proposed method consists of two components: perturbation destruction by random transformations and a purifier model that aims to recover the clean image which is adversarially finetuned. The experiments suggest that AToP can improve the robustness against both seen and unseen attacks without significantly sacrificing the accuracy on clean images, and achieve state-of-the-art results on several benchmarks."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- This paper makes an early attempt to finetune an adversarial purification model with adversarial training, and suggests that this can be beneficial.\n- The experiments are complete and the results seem promising.\n- The figures are clear and meaningful."
            },
            "weaknesses": {
                "value": "- Clarity of Section 3.2. \n  - Eq. (8) seems to be a mix of the loss functions for the generator (purifier) $g$ and the discriminator $D$, which are supposed to be different in GAN training. Besides, since AToP is not limited to GAN-based purifier models, it is better to present a general form of the loss function.\n  - It is stated that \"the discriminator $D$ is responsible for distinguishing between real examples (*including clean or adversarial examples*) and the purified examples\", but this is not reflected by Eq. (8) since only the clean sample $x$ is involved in $L_{df}$.\n  - Line 5 of Algorithm 1 is confusing. The notation $g_{\\theta_g}$ is not explained.\n- Some experimental details are not clearly stated.\n  - For evaluation, it is claimed that \"we randomly select 512 images from the test set for robust evaluation.\" It is not clear whether this applies to all results or all compared methods. The comparison may be unfair if different models are evaluated on different test sets.\n  - The \"Ours\" in Table 2,3,4 are not specified: Which RT and purifier model are used? What are the hyper-parameters for the training attack?\n- The results for AToP in Table 8 may be unreasonable. Specifically, considering the accuracy of the same model against different attacks, it is shown that FGSM < PGD < AutoAttack, which is exactly the reverse of common expectations since AutoAttack is believed to be a much stronger attack while FGSM should be the weakest attack. These results may significantly challenge the reliability of the robustness evaluation and should be seriously discussed."
            },
            "questions": {
                "value": "- Why FGSM is used for adversarial finetuning instead of PGD or other attacks?\n\n- Can the reconstruction loss in Eq. (8) be applied to the reconstruction of adversarial images? Specifically, is it likely that adding $\\mathbb{E}[\\Vert x-g(t(x+\\delta),\\theta_g) \\Vert]$ to the loss will increase the performance?\n\n- Why does reconstruction loss take $\\ell_1$-distance?\n\n- What is the expected scope of purification models that AToP can generalize to?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4921/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4921/Reviewer_jVyX",
                    "ICLR.cc/2024/Conference/Submission4921/Senior_Area_Chairs"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4921/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698833182677,
        "cdate": 1698833182677,
        "tmdate": 1700729516596,
        "mdate": 1700729516596,
        "license": "CC BY 4.0",
        "version": 2
    }
]