[
    {
        "id": "csYGUgxyvN",
        "forum": "UBVNwD3hPN",
        "replyto": "UBVNwD3hPN",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1285/Reviewer_XJ4N"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1285/Reviewer_XJ4N"
        ],
        "content": {
            "summary": {
                "value": "The primary contribution of this paper is the introduction of the CivRealm environment, which is built on Civilization VI, a complex and popular video game. This environment offers a platform to study long-term planning, multi-agent interactions, and intricate decision-making etc."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- The paper doesn't just introduce an environment but also provides benchmark tasks and baseline.\n- The API provides a comprehensive log of game state and actions.\n- It allows AI agents to interact at both high (strategic) and low (tactical) levels.\n- It focus on long-term planning which is crucial to agents"
            },
            "weaknesses": {
                "value": "As a work in the area of datasets and benchmarks, I think a lot of the details are in the code, and I don't have good confirmation of those details just by virtue of the text in the paper. This environment is based on an open-source game http://freeciv.org/. I don't know how different is the open-source game and the environment introduced by the authors. It would be excellent if authors could give reviewers an early release of code to review."
            },
            "questions": {
                "value": "This environment is based on an open-source game http://freeciv.org/. From the development aspects, what is the main modifications/effort has been done upon the open-source game?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission1285/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1285/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1285/Reviewer_XJ4N"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1285/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698647481729,
        "cdate": 1698647481729,
        "tmdate": 1700682673315,
        "mdate": 1700682673315,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "hpFxQl449O",
        "forum": "UBVNwD3hPN",
        "replyto": "UBVNwD3hPN",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1285/Reviewer_4Csd"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1285/Reviewer_4Csd"
        ],
        "content": {
            "summary": {
                "value": "The paper introduces a novel testbed environment inspired by the Civilization game, called *CivRealm*, which is a multi-agent multi-goal long-horizon challenging environment. The authors also implement RL and LLM baseline agents and show that they struggle to make substantial progress in the full game."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. The authors present a novel and challenging testbed for agent studies, which is a big contribution.\n2. The experiments on the proposed agents also set up baselines that follow-up works can improve upon.\n3. The environment also has mini-games that can benefit the (multi-agent) RL community.\n4. The paper is clearly written and easy to follow."
            },
            "weaknesses": {
                "value": "1. Some details are not clear enough. As this is a multi-agent environment, what are the baseline RL and LLM agents play against? I didn't seem to find such details in the description.\n2. The proposed baselines are not working in the (full game) environment. Maybe it is better to also set different difficulty levels (e.g. by different task horizons) for the full game so that later research can more easily be evaluated on the benchmark.\n3.  Is Figure 2 the real situation that the LLM agents discover or the expected situation? If it is what the LLM agents discover, why does Tit still behave poorly?\n4. The text in Figure 4 is too small to view."
            },
            "questions": {
                "value": "1. Why the success rate of the RL agent in some mini-games (e.g., SettlerBuildCity) is higher for the hard setting than for the easier settings?\n2. Can the authors comment on the reason for instability and the sudden drop in performance in Figure 9?\n3. It would be great if the authors could provide videos of the experiments or visualization ways in the future code repo."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1285/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698734719154,
        "cdate": 1698734719154,
        "tmdate": 1699636055437,
        "mdate": 1699636055437,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "JelbU9YL6v",
        "forum": "UBVNwD3hPN",
        "replyto": "UBVNwD3hPN",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1285/Reviewer_3D5Q"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1285/Reviewer_3D5Q"
        ],
        "content": {
            "summary": {
                "value": "This is a dataset and benchmark paper that introduces the CivRealm environment. It supports a number of game features based on the Civilization game, including an agent-agnostic framework, a friendly interface, and a tensor-based agent interface, supporting a variety of custom tasks with custom goal definitions, etc. This is a very exhaustive benchmark for a long-horizon strategy-based game. The paper also discusses the performance of three methods (one tensor-based and one LLM-based)."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. This dataset and associated framework is very useful and will support a lot of research for multi-agent settings involving various kinds of agents. \n2. The whole framework is very novel."
            },
            "weaknesses": {
                "value": "I'm not sure how robust the client-server architecture used in the framework is. There are no comments on the robustness of this."
            },
            "questions": {
                "value": "1. How robust is the server-client architecture? Did you do any experiments to test it?\n2. Is there support for designing custom games? I see Lua script being mentioned to specify the reward structure, new goals, etc. Is there also a support for new maps?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission1285/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1285/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1285/Reviewer_3D5Q"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1285/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699029167063,
        "cdate": 1699029167063,
        "tmdate": 1699636055338,
        "mdate": 1699636055338,
        "license": "CC BY 4.0",
        "version": 2
    }
]