[
    {
        "id": "VPTDRCjLWd",
        "forum": "UDNJdVjhyg",
        "replyto": "UDNJdVjhyg",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5784/Reviewer_Dct6"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5784/Reviewer_Dct6"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a measure of graph information by graph entropy. Since direct optimization of graph entropy is known to be NP hard, this paper provides an approximation of the graph entropy for the practical use of this entropy.\nThis paper also provides experimental results."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1) Formulation of the proposed objective function Eq.(14). This is also supported by some standard Shannon entropy theories (Thm4.1-Cor4.4)"
            },
            "weaknesses": {
                "value": "1) The proposed method is almost off-the-shelf application of the existing results and methods. Maybe Eq.(9) is a proposal, which is a direct application of Def 3.1 to entropy. However, I speculate the rest of the discussion is off-the-shelf.\n\n\n2) This might be related to 1). It is hard to distinguish which are the authors' results and which are the existing results. For the numbered theoretical claims, as far as I understand only Car 4.6 is the authors result. Then, why the others are not in the preliminaries? All the discussion between Eq. (6) and Eq.(23) is not the authors' own?"
            },
            "questions": {
                "value": "1) While I appreciate the authors conduct experiments on many methods in Table 1 and Table 2, I am wondering if the authors have any other baseline of an entropy component other than InfoMax?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "N/A"
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5784/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5784/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5784/Reviewer_Dct6"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5784/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1697980726206,
        "cdate": 1697980726206,
        "tmdate": 1699636608545,
        "mdate": 1699636608545,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "H6FLhNyb2r",
        "forum": "UDNJdVjhyg",
        "replyto": "UDNJdVjhyg",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5784/Reviewer_zWFj"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5784/Reviewer_zWFj"
        ],
        "content": {
            "summary": {
                "value": "This paper proposed a new approach to derive graph-level representation using graph entropy. Since the computation of graph entropy is a NP-hard problem, they provided thorough derivation to approximate the graph entropy through graph neural networks. Specifically, they derived the loss function to be the combination of Shannon entropy and chromatic entropy, on top of which they added orthonormal loss and coloring loss for regularization. Ablation study is done for these components for their impact."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "• Provided a novel way to design graph level representation. The maximization of graph entropy aims to capture the most information from a given graph, focusing on the orthogonal vertices. \n• Clearly outlined the derivation of the loss function of graph level entropy maximization. They also provided a clear summary of the notations in Appendix (table 5). It would be better if the author can include the shapes of dimensions of the variables. \n• Good ablation study in terms of the components in the loss function."
            },
            "weaknesses": {
                "value": "• Compared to InfoGraph, this paper proposes to use 3 GNNs (graph representation, node representation and coloring representation), for the calculation of the loss function. This could be a problem in terms of model size and running time. The authors provided very limited comments and experiments on this matter. \n• Despite more parameters introduced in the proposed method, the performance improvement on different datasets is generally small, especially on larger and more complex datasets. \n• For time analysis in table 14, only the running time for InfoGraph is presented. What about other networks? More importantly, what about GeMax compared with InfoMax? \n• Figure 2 and Figure 3 & 4 in appendix have many duplicated components. Figure 2 and Figure 3 are especially similar. The author should find a way to condense the information shown.   \n• The author seems to use the same citation for “InfoMax” and “InfoGraph”. Their method is comparable to “InfoMax” used in “InfoGraph”, but as they mentioned in table 1 and table 2, “InfoMax” can be applied to other architectures as well. The authors should make it clearer."
            },
            "questions": {
                "value": "• Using the same model, what are the number of parameters and training time/inference time when using InfoMax and GeMax loss function? \n• Does the choice of the 3 GNNs matter? Would the model performance improve when using different GNN structures for node, graph and color representation? If so, can the author provide comments on whether the performance improvement is due to the GNN architecture, or the loss function design?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5784/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698546005034,
        "cdate": 1698546005034,
        "tmdate": 1699636608452,
        "mdate": 1699636608452,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "ZyNSTZD79S",
        "forum": "UDNJdVjhyg",
        "replyto": "UDNJdVjhyg",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5784/Reviewer_Jju5"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5784/Reviewer_Jju5"
        ],
        "content": {
            "summary": {
                "value": "The paper studies graph representation learning, a domain that seeks to represent graphs as vectors for use in various tasks like graph classification. The authors emphasize the need for diverse representations that can comprehensively capture graph information. They propose using graph entropy to quantify this information, offering a novel approach compared to more conventional methods."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The theoretical analysis is interesting. \n2. The paper studies an interesting problem."
            },
            "weaknesses": {
                "value": "1. Authors miss a lot of new graph contrastive learning published in 2022-2023, e.g., [1,2]\n2. Improving GCL using information theory has been studied in [3]. [4] also involves entropy for graph contrastive learning. \n3. Authors should consider large-scale graph classification datasets. \n\n[1] Spectral feature augmentation for graph contrastive learning and beyond, AAAI\n\n[2] Self-supervised Graph-level Representation Learning with Adversarial Contrastive Learning, TKDD\n\n[3] Infogcl: Information-aware graph contrastive learning\n\n[4] Entropy Neural Estimation for Graph Contrastive Learning"
            },
            "questions": {
                "value": "See above"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5784/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5784/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5784/Reviewer_Jju5"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5784/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698819713504,
        "cdate": 1698819713504,
        "tmdate": 1699636608328,
        "mdate": 1699636608328,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "21j9vZu2wy",
        "forum": "UDNJdVjhyg",
        "replyto": "UDNJdVjhyg",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5784/Reviewer_QWua"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5784/Reviewer_QWua"
        ],
        "content": {
            "summary": {
                "value": "Authors propose a framework how to jointly learn graph representation together with node-level representations. \nIn order to do so, they formulate an optimization problem (Eq. 9), as the problem of maximizing graph entropy (Graph entropy Körner (1973), \nthat takes prob. distribution and elements of Vertex packing polytope) subject to constraint of using orthonormal representations (Lovász, 1979) and to represent each graph as a vector and represent its vertices as vectors, i.e. (g_j , Z_j ) = F (G_j ).\nTo solve the problem, they use Graph Neural Networks with appropriate parameterization, regularizations and losses."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "Authors use well grounded mathematical objects to describe graphs: like Graph entropy Körner (1973) and orthonormal representations (Lovász, 1979).\nExtensive theoretical and experimental understanding of the subject."
            },
            "weaknesses": {
                "value": "Presentation needs to be improved. Mathematics of paper is not illuminating, but rather obfuscating the exposition of paper. \nIf you want that your contribution gets more recognition, try to give more insights why certain steps are done."
            },
            "questions": {
                "value": "1. UNSUPREVISED NODE-LEVEL LEARNING experiments i.e. table 4 does not look convincing enough. \nWhy did you removed InfoGraph-InfoMax, GraphCL-InfoMax, AutoGCL-InfoMax\nThis baselines were present in previous tables.\n\nPerformance for edge prediction tasks is quite close to LGAE.\nDo you have any guess why that is the case?\nHave you tried other node-level classification tasks?\n\n2. However, on Graph-level, your methodology looks superior. Can you elaborate w.r.t. Ablation study, what is the major lesson that a reader can learn about your framework w.r.t. InfoMax.\n\n3. Can you explain main benefits of your approach w.r.t. \nAndo, Rie, and Tong Zhang. \"Learning on graph with Laplacian regularization.\" Advances in neural information processing systems 19 (2006).\n\nCan you make some comparison with\nGuattery, Stephen, and Gary L. Miller. \"Graph embeddings and laplacian eigenvalues.\" SIAM Journal on Matrix Analysis and Applications 21.3 (2000): 703-723."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5784/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698839123900,
        "cdate": 1698839123900,
        "tmdate": 1699636608222,
        "mdate": 1699636608222,
        "license": "CC BY 4.0",
        "version": 2
    }
]