[
    {
        "id": "CCYG1roVMX",
        "forum": "udO3k28bEw",
        "replyto": "udO3k28bEw",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2975/Reviewer_DHxZ"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2975/Reviewer_DHxZ"
        ],
        "content": {
            "summary": {
                "value": "This theoretical paper discusses and analyzes the collapse problem in the Deep Metric Learning area. The author leverages the theory of isometric approximation to show an equivalence between the triplet loss sampled by hard negative mining and an optimization problem that minimizes a Hausdorff-like distance between the neural network and its ideal counterpart function. The main conclusion is equation 17, indicating that network collapse tends to happen when batch size is too large or the embedding dimension is too small. Effective experiments were conducted to visualize and support the conclusion."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "The collapse problem is a famous problem blocking DML training. Current literature misses the systematic explanation of this phenomenon. The theory of the paper is helping understand the reason behind the problem and will benefit the DML research community. \n\nThe starting point of the definition of triplet-separated accurately describes and fits the optimization of triplet loss. \nBy leveraging the isometric approximation theorem, the path to achieve the proof to the corollary 3.4 is clear and sound. \nFinally, the experiments with different settings to proof the conclusion is equation 17 is wee conducted and integrated"
            },
            "weaknesses": {
                "value": "The illustrative examples are not clear. Figure 2 is clear on the examples. But the figure 3 is not clear.\n1. The line in figure 3 overlaps too much. would be good to redraw it.\n2. it is not clear of diso(fθ,FTS) in the figure.\n\nFigure 4 can be extended to multiple views to illustrate the progress of the collapse as the example shown in [1]. and if the diso(fθ,FTS) value can be added in the vis, it will be valued.\n\nminer issue in the typos: section 1 \"CUBwah et al. (2011))\" \n\n[1]: Hong Xuan, Abby Stylianou, Xiaotong Liu, and Robert Pless. Hard negative examples are hard but useful.InEuropeanConferenceonComputerVision, pp.126–142.Springer,2020."
            },
            "questions": {
                "value": "Some extended questions:\nHow is the lower bound curve (17) related to the retrieval performance?\nTriplet loss is rarely used in Self-supervised learning with a random initialization network. Maybe one of the reasons is also collapse. Can your theory explain the problem? is the DML problem similar to the SSL problem in the embedding level?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2975/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698222780484,
        "cdate": 1698222780484,
        "tmdate": 1699636241813,
        "mdate": 1699636241813,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "ZKgkZPK8qR",
        "forum": "udO3k28bEw",
        "replyto": "udO3k28bEw",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2975/Reviewer_hpyY"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2975/Reviewer_hpyY"
        ],
        "content": {
            "summary": {
                "value": "The paper focuses on addressing the issue of network collapse in deep metric learning, specifically in the context of the triplet loss. Network collapse refers to a situation where the network projects all data points onto a single point, leading to ineffective embeddings. The authors propose utilizing the mathematical theory of isometric approximation to establish an equivalence between the triplet loss with hard negative mining and an optimization problem that minimizes a Hausdorff-like distance. This theoretical framework provides the justification for the empirical success of hard negative mining in preventing network collapse. Experimental results on multiple datasets and network architectures validate the theoretical findings."
            },
            "soundness": {
                "value": "1 poor"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "-\tThe paper offers a theoretical framework based on isometric approximation theory to explain the behavior of the triplet loss with hard negative mining. This provides a solid foundation for understanding and addressing network collapse in deep metric learning\n-\tThe paper investigates the factors that contribute to network collapse, specifically focusing on the batch size and embedding dimension. Through experiments on multiple datasets and network architectures, the authors demonstrate that larger batch sizes and smaller embedding dimensions increase the likelihood of network collapse. \n-\tThe authors conduct experiments on various datasets and network architectures, demonstrating the effectiveness of hard negative mining in preventing network collapse. The empirical results corroborate the theoretical findings and enhance the credibility of the proposed approach."
            },
            "weaknesses": {
                "value": "-\tThe paper primarily focuses on hard negative mining as a solution to network collapse but does not thoroughly compare its performance with alternative methods or strategies. A comprehensive comparison with other approaches would provide a more comprehensive understanding of the effectiveness of hard negative mining and its relative advantages or disadvantages compared to other techniques. Without such comparisons, it is difficult to assess the competitiveness of the proposed method.\n-\tWhile the paper presents experimental results on multiple datasets and network architectures, it does not provide precise quantitative measurements of the performance improvements achieved by preventing network collapse through hard negative mining. Without specific metrics, such as accuracy or loss values, it is challenging to assess the magnitude of the improvement or compare it with alternative approaches. Including quantitative evaluations would enhance the rigor and credibility of the proposed method.\n-\tThe absence of mining time analysis and discussion on the time complexity limits the applicability of the proposed method to real-time or time-sensitive applications. Real-time systems often require fast and efficient processing, and the computational cost of hard negative mining can be a critical factor in determining the feasibility of the approach. Considering the practical implications and performance trade-offs in real-time scenarios would enhance the relevance and applicability of the proposed method.\n-\tThe paper primarily focuses on the theoretical framework and experimental results of hard negative mining in preventing network collapse. However, the experiments are conducted on a limited set of network architectures, and it does not include widely used backbone architectures such as ResNet-50 or Inception-BN. These mainstream architectures are commonly employed in deep metric learning and computer vision tasks. The lack of evaluation on such architectures limits the generalizability and applicability of the proposed method to real-world scenarios."
            },
            "questions": {
                "value": "See Weaknesses"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2975/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698894846453,
        "cdate": 1698894846453,
        "tmdate": 1699636241710,
        "mdate": 1699636241710,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "SMCYBfp9D4",
        "forum": "udO3k28bEw",
        "replyto": "udO3k28bEw",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2975/Reviewer_Mw75"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2975/Reviewer_Mw75"
        ],
        "content": {
            "summary": {
                "value": "This paper delves into the issue of triplet loss collapse, offering a theoretical insight into its causes. The proposed method employs isometric approximation to demonstrate that hard example mining is effectively equivalent to minimizing a distance akin to the Hausdorff distance. Experimental results on two widely used metric learning datasets reveal that network collapse tends to occur with either a large batch size or a small embedding size."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- This paper addresses a significant issue related to triplet loss collapse, a topic of keen interest within the research community.\n\n- The paper offers a novel theoretical perspective on the problem of triplet loss collapse by introducing the innovative concept of isometric approximation, contributing a fresh angle to this field."
            },
            "weaknesses": {
                "value": "- It would be beneficial to see a more thorough analysis of various triplet loss variants, particularly with regard to different triplet sampling methods. This in-depth examination is essential for a comprehensive understanding of the effectiveness of triplet loss in different settings.\n\n- The figures and examples in this paper suffer from both low quality and a lack of informativeness. They do not effectively convey the discussed settings, making it difficult for readers to comprehend the content.\n\n- The experimental evaluations in this paper are notably limited, making it challenging to substantiate the claims put forth. For instance, the use of a very large batch size with semi-hard triplets in FaceNet raises questions that require further clarification or justification."
            },
            "questions": {
                "value": "See weakness."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2975/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699343620196,
        "cdate": 1699343620196,
        "tmdate": 1699636241631,
        "mdate": 1699636241631,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "pgJggU850O",
        "forum": "udO3k28bEw",
        "replyto": "udO3k28bEw",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2975/Reviewer_QYwJ"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2975/Reviewer_QYwJ"
        ],
        "content": {
            "summary": {
                "value": "In this paper, the authors attempt to analyse the network collapse phenomenon associated with hard negative mining for triplet loss. Such network collapse is not omnipresent and vary depending on the task at hand. The authors attempt to explain this phenomena by drawing a equivalence between the hard negative-mining triplet loss and the Hausdorff-like distance metric by using isometric approximation. Such approximations help to establish a relationship between the network collapse and the batch size or the dimension of the embedding, which provide insights into using different batch size or embedding dimensions for different variety of tasks across a number of tasks (such as person re-identification). Therefore the authors have provided theoretical insights as to why such collapsing happens for learning a distance metric with hard negative sampling, and ways to overcome them by performing experiments across different datasets and different backbones."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The connection between network collapse with the batch size or embedding dimensions; using isometric approximation is novel and interesting.\n\nThe authors have provided a detailed analysis of their proposed approximation between the hard negative-mining triplet loss and the Hausdorff-like distance metric along with detailed proofs in the appendix.\n\nThe authors have provided a substantial number of experiments across different datasets and different network backbones to show the effectiveness of their proposed work."
            },
            "weaknesses": {
                "value": "The major weakness of the paper is only showing the effectiveness of their proposed method for hard negative mining strategies for learning the distance metric. There have a considerable number of new sampling strategies which improve upon hard negative mining, especially aimed to tackle the slow convergence rate and the network collapsing phenomena. A different variety of loss functions have also been developed  to tackle the above mentioned issues. Therefore the impact of this paper is limited by the choice of the single \"hard mining strategy\". The methods in [A, B, C, D] aim to reduce the dependency of the batch size or the size of the embedding. A similar study has also been conducted in [E]. These methods need not always provide any theoretical explanations (which is a big plus for this paper), but they attempt to solve and tackle similar issue (network collapse). So it will be interesting if such equivalence can be drawn with such methods, which is missing in the paper.\n\n[A] W. Zheng, J. Lu and J. Zhou, \"Deep Metric Learning With Adaptively Composite Dynamic Constraints,\" TPAMI 2023.\n\n[B] Zheng, Wenzhao, et al. \"Dynamic metric learning with cross-level concept distillation.\" ECCV 2022.\n\n[C] Zhang, Borui, et al. \"Attributable visual similarity learning.\" CVPR 2022.\n\n[D] Zheng, Wenzhao, Jiwen Lu, and Jie Zhou. \"Deep metric learning via adaptive learnable assessment.\" CVPR 2020.\n\n[E] Musgrave, Kevin, Serge Belongie, and Ser-Nam Lim. \"A metric learning reality check.\"  ECCV 2020."
            },
            "questions": {
                "value": "(1) Will such approximation hold true for any other sampling strategy or loss functions as mentioned in the Weakness section?\n\n(2) In [A], the authors experiment with learnable $\\beta$'s. Can the authors more some insights as to what would happen if $\\alpha$ is also learned, instead of keeping it fixed.\n\n(3) Have the authors done any experiments on face recognition datasets similar to [B, C]? It will be interesting to see if the proposed explanations hold true for experiments on face recognition too.\n\n[A] Wu, Chao-Yuan, et al. \"Sampling matters in deep embedding learning.\" ICCV 2017.\n\n[B] Wang, Hao, et al. \"Cosface: Large margin cosine loss for deep face recognition.\" CVPR 2018.\n\n[C] Deng, Jiankang, et al. \"Arcface: Additive angular margin loss for deep face recognition.\" CVPR 2019."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2975/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699562535026,
        "cdate": 1699562535026,
        "tmdate": 1699636241546,
        "mdate": 1699636241546,
        "license": "CC BY 4.0",
        "version": 2
    }
]