[
    {
        "id": "V9fbnmGzBR",
        "forum": "uizIvVBY8P",
        "replyto": "uizIvVBY8P",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5199/Reviewer_1EUX"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5199/Reviewer_1EUX"
        ],
        "content": {
            "summary": {
                "value": "Many anomaly detection papers assume that only normal instances are present in the training, and train the model unsupervised.\nHowever, in the real world, there are situations where even a few labeled abnormal instances are available.\nIn this case, studies have shown that even a very small number of anomalies can significantly improve the performance of the detector.\nIn addition, anomaly detectors are often trained under the assumption that the data distribution is stationary, but in real-world deployments, the distribution changes over time.\nTherefore, the authors propose a supervised anomaly detection method using continual learning.\nThe method consists of a Variational AutoEncoder (VAE) and a binary classifier.\nThe VAE uses the reconstruction error to determine whether the input data is an unseen anomaly, and the binary classifier determines whether the input data is a seen anomaly, and calculates the anomaly score by aggregating the results of both models.\nIn addition, the VAE's decoder is used to generate data, which is then used for generative replay to prevent catastrophic forgetting in continual learning."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- The paper is well organized and the notation is easy to follow.\n- The structure of the model and the organization of the methods (such as loss) are theoretically clean and natural. The authors naturally integrated supervised anomaly detection with continual learning.\n- The proposed method works with various types of input data, such as images and tabular data.\n- It is impressive that the method utilizes CVAE and a binary classifier to learn the process of generating rare abnormal instances by gradient descent, which is then used for generative replay."
            },
            "weaknesses": {
                "value": "The main weakness is that experimental results do not sufficiently support the superiority of this method.\n\n- On tabular datasets such as UNSW, bank, and credit, the model does not significantly outperform the other baselines. In many cases, the performance is similar to that of the binary classifier, suggesting that the performance is due to the binary classifier included in the method rather than the proposed method.\n- The experimental baselines are too simple. BC and VAE are components of the proposed method, and there are many methods that might outperform DevNet and Deep SAD, at least in the image domain (Liu et al., 2023). Many anomaly detection methods in the image domain are not designed for continual learning, but since EWC and A-GEM can be applied, it would be meaningful if the proposed method outperforms in this setting.\n- In the image domain, the proposed method shows better performance than other baselines, but it seems that experiments on larger datasets are needed to show the practicality of the proposed method. The method was only tested on FMNIST and MNIST with MLP structure, but it would be useful to test it on larger datasets such as CIFAR10 and CelebA.\n---\n**Liu et al.** [Deep Industrial Image Anomaly Detection: A Survey](https://arxiv.org/abs/2301.11514). *arXiv*, 2023"
            },
            "questions": {
                "value": "- Similar to other continuous-learning papers, it would be nice to be able to see how performance changes with additional training on each task."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5199/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5199/Reviewer_1EUX",
                    "ICLR.cc/2024/Conference/Submission5199/Senior_Area_Chairs"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5199/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698799267456,
        "cdate": 1698799267456,
        "tmdate": 1700537871604,
        "mdate": 1700537871604,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "P9bOOzztEE",
        "forum": "uizIvVBY8P",
        "replyto": "uizIvVBY8P",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5199/Reviewer_QxJr"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5199/Reviewer_QxJr"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a new approach to the task of continual supervised anomaly detection. This paper designs a pipeline with three specific components: a variational autoencoder, a binary classifier, and an anomaly generation mechanism. This paper conducts experiments on five datasets to validate performance."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "•\tThis paper proposes a new pipeline for continual supervised anomaly detection that aligns well with the practical application needs.\n•\t The performance gains for AUC on five datasets look good, especially on the FMNIST and MNIST datasets."
            },
            "weaknesses": {
                "value": "•\tThe novelty of the proposed framework is limited. The overall network architecture consists of a VAE and a classifier without any particularly unique components. \n\n•\tThis paper does not include a comparison with some of the latest supervised anomaly detection methods such as DRA[1], PRN[2], BGAD[3], which might be relevant for a more comprehensive evaluation.\n\n[1] Ding C, Pang G, Shen C. Catching both gray and black swans: Open-set supervised anomaly detection. CVPR 2022.\n\n[2] Zhang H, Wu Z, Wang Z, et al. Prototypical residual networks for anomaly detection and localization. CVPR 2023.\n\n[3] Yao X, Li R, Zhang J, et al. Explicit Boundary Guided Semi-Push-Pull Contrastive Learning for Supervised Anomaly Detection. CVPR, 2023."
            },
            "questions": {
                "value": "Is there a more detailed explanation regarding the impact of the number of seen anomalous samples on the experimental results?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5199/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698938203492,
        "cdate": 1698938203492,
        "tmdate": 1699636516649,
        "mdate": 1699636516649,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "h95VJyKy6g",
        "forum": "uizIvVBY8P",
        "replyto": "uizIvVBY8P",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5199/Reviewer_vozw"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5199/Reviewer_vozw"
        ],
        "content": {
            "summary": {
                "value": "The authors propose a method for semi-supervised anomaly detection in the setting of continuous learning. They combine a binary classifier for the labeled anomalies together with a VAE reconstruction score for the anomaly detection part. The continuous learning is addressed by, one, using the latent space of the VAE to sample data from past tasks, and, two, using the gradient of the binary classifier to sample labeled anomalies in the same latent space via iteration from a starting point."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The paper is easily readable.\nThey perform experiments on various types of datasets. \nThey perform an ablation study."
            },
            "weaknesses": {
                "value": "It represents a straightforward combination of ideas.\nThe argument that one cannot keep data due to privacy reasons also applies for resampling data from an autoencoder. If it is a very good reconstruction, it would equally cause privacy issues.\nThe important and relevant case of slow distribution shift is only partially addressed, via the credit data. Doing so in more and more controllable settings would be of interest.\nA comparison against reusing past training data would be of interest - in particular from tasks a few epochs ago. Reason being that a slow shift of parameters would also affect sampling of data from not so recent past tasks.\nMNIST and FMNIST might be too simple as problem. A more complex image dataset is missing."
            },
            "questions": {
                "value": "NA"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5199/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699131500885,
        "cdate": 1699131500885,
        "tmdate": 1699636516564,
        "mdate": 1699636516564,
        "license": "CC BY 4.0",
        "version": 2
    }
]