[
    {
        "id": "3VCBcueAyR",
        "forum": "uMAujpVi9m",
        "replyto": "uMAujpVi9m",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3164/Reviewer_bxUv"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3164/Reviewer_bxUv"
        ],
        "content": {
            "summary": {
                "value": "The authors propose a novel self-supervised pretraining approach called ProFSA to learn effective pocket representations by leveraging protein-only data. The key idea is to extract pseudo-ligand-pocket pairs from proteins by segmenting structures into fragments and designating the surroundings as pockets."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The authors present a novel pairwise data synthesis pipeline by extracting pseudo-ligand-pocket pairs from protein data\n2. The authors develop large-scale datasets and new pretraining methods to exploit the full potential of pocket representation learning, emphasizing the interactions between pockets and ligands.\n3. ProFSA achieves significant performance gains in a variety of downstream tasks."
            },
            "weaknesses": {
                "value": "1. The evidence for the construction of the pseudo-ligand is not clear.\n2. Ablation studies evaluating the impact of critical design choices like fragment sizes, distance thresholds for pockets would provide useful insights.\n3. While terminal corrections are applied to address biases from breaking peptide bonds, the pseudo-ligands may still exhibit substantial discrepancies from real drug-like ligands."
            },
            "questions": {
                "value": "1. Why do the authors choose peptides to replace small molecules, and is this choice reliable? Have the authors considered other potential ways to further close the gap between pseudo-ligands and real ligands, either through data processing strategies or by fine-tuning on downstream tasks?\n2. Section 3.1, second paragraph, line 4, what do the N Terminal and C Terminal refer to?\n3. Why fixed the molecule encoder in contrastive learning, i.e., the encoder that encodes the pseudo-ligand.\n4. Could ProFSA be extended to other tasks like protein-protein interaction prediction? How might the pipeline and contrastive approach need to be adapted?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3164/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698730663384,
        "cdate": 1698730663384,
        "tmdate": 1699636263882,
        "mdate": 1699636263882,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "Jv6QGKyDWD",
        "forum": "uMAujpVi9m",
        "replyto": "uMAujpVi9m",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3164/Reviewer_kXw3"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3164/Reviewer_kXw3"
        ],
        "content": {
            "summary": {
                "value": "This paper enhances protein pocket pretraining by introducing a new large pseudo ligand-pocket dataset. The dataset is constructed by segmenting a fragment from a protein and treating the neighboring area of the fragment as a pocket. Several important strategies are adopted to make the generated fragment-pocket pairs more like real ligand-pocket pairs. This results a dataset with 5.5 million pseudo ligand-pocket pairs. Contrastive learning is conducted using the generated dataset, in which a pretrained small molecular encoder is used to extract features for the fragments to align with a pocket encoder to be pretrained. Experiments are conducted on both pocket-only tasks and a pocket-molecule task."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1.The strategy of constructing pseudo ligand-pocket dataset is novel and has the potential to be extended to construct larger datasets. \n\n2.Effective strategies are introduced to make the pesudo ligand-pocket pairs effective to mimic real ones and a practical contrastive learning strategy is adopted to address the difference between the segmented fragments from real ligands."
            },
            "weaknesses": {
                "value": "1. One weakness is that the proposed method is only evaluated on limited tasks. \n\n2. The baselines in the  experiment are quite old, with the latest method published in 2020 except Uni-Mol."
            },
            "questions": {
                "value": "1. Will the proposed method work on other tasks, such as protein-ligand binding pose prediction?\n2. Is there any new methods on the POCKET MATCHING task? If so, please include them in comparison."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3164/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698752480728,
        "cdate": 1698752480728,
        "tmdate": 1699636263752,
        "mdate": 1699636263752,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "LbKCNmwdYS",
        "forum": "uMAujpVi9m",
        "replyto": "uMAujpVi9m",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3164/Reviewer_FNxz"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3164/Reviewer_FNxz"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a novel approach called ProFSA for pretraining pocket representations based on the guided fragment-surroundings contrastive learning. Furthermore, a novel scalable pairwise data synthesis pipeline is designed to extract pseudo-ligand-pocket pairs from protein-only data. Extensive experiments demonstrate the potential of ProFSA as a powerful tool in the field of drug discovery."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. The paper is well-structured and clearly articulates the research methodology and findings. The overall presentation is easy for readers to grasp the key ideas of this paper.\n\n2. By utilizing pseudo-ligand construction and pocket construction, authors develop an innovative strategy for mining extensive protein-only data from the PDB repository, which can effectively alleviate the scarcity of experimentally determined pocket-ligand pairs.\n\n3. A contrastive learning approach in the protein-fragment space is introduced to attain ligand-aware pocket representations. By sampling negative samples from protein pockets and pseudo-ligands, the pocket encoder can learn to identify the true positive sample when given the other one.\n\n4. Extensive experiments demonstrate the potential of ProFSA as a powerful tool in the drug discovery field."
            },
            "weaknesses": {
                "value": "1. I'm not fully satisfied with the Related Work section. More work should be presented, such as [1], [2] and [3].\n\n2. Why is COSP introduced as a component of the pocket pretraining method in Section 2.2, but not included as a baseline in Table 3?\n\n3. In section 3.2, the authors mention that the \"the first loss is to differentiate the corresponding ligand fragment from a pool of candidates for a given pocket.\" The first loss is constructed by sampling negative samples from protein pocket. Therefore, I think the purpose of the first loss is to identify the true protein pocket when given a pseudo-ligand.\n\n4. I am confused about how ProFSA works without the distributional alignment  mechanism. In this context, what determines the length of the pocket representation?\n\n[1] Liu S, Guo H, Tang J. Molecular geometry pretraining with se (3)-invariant denoising distance matching[J]. arXiv preprint arXiv:2206.13602, 2022.\n[2] Wu F, Li S, Wu L, et al. Discovering the representation bottleneck of graph neural networks from multi-order interactions[J]. arXiv preprint arXiv:2205.07266, 2022.\n[3] Karimi M, Wu D, Wang Z, et al. DeepAffinity: interpretable deep learning of compound–protein affinity through unified recurrent and convolutional neural networks[J]. Bioinformatics, 2019, 35(18): 3329-3338."
            },
            "questions": {
                "value": "Please see the questions in weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "1: You are unable to assess this paper and have alerted the ACs to seek an opinion from different reviewers."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3164/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3164/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3164/Reviewer_FNxz"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3164/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698803235306,
        "cdate": 1698803235306,
        "tmdate": 1699636263688,
        "mdate": 1699636263688,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "9ap4s1SZlZ",
        "forum": "uMAujpVi9m",
        "replyto": "uMAujpVi9m",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3164/Reviewer_yfM3"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3164/Reviewer_yfM3"
        ],
        "content": {
            "summary": {
                "value": "This paper primarily aims to enhance the pocket pretraining method, as existing approaches only consider pockets during pretraining. There are two main contributions in this paper: (1) The authors introduce a novel method, ProFSA, for pocket pretraining, which extracts additional information from corresponding ligands. However, the number of pocket-ligand complex structures is quite limited in existing datasets. (2) To address this issue, the authors generate over 5 million complexes by segmenting fragments and their corresponding pockets in protein structures. By aligning features of fragments and pockets, the pocket encoder learns the interaction between fragments and pockets. The authors design downstream tasks such as pocket druggability prediction, pocket matching, and ligand binding affinity prediction to demonstrate the effectiveness of ProFSA."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "The authors propose a new perspective of pretraining pockets and construct a large-scale dataset, which data distribution is also considered, to make the efficient pre-training possible.\n\nThe results are competitive, especially for zero-shot settings.\n\nAbundant experiments and ablation study support the argument and result of the authors."
            },
            "weaknesses": {
                "value": "1. The technical novelty is limited.\n  - The pocket encoder is borrowed from Uni-Mol.\n  - The contrastive loss is the vanilla form of classical contrastive learning.\n\n2. The bound of Theorem 3.1 is trivial. The authors claim that the bound naturally exists for these representations extracted by pretrained molecule models. However, it's a bit counterintuitive, because many models not pretrained on molecule datasets also fulfill this prior. So, can these models be used for this task? **I strongly suggest removing this part from the paper**.\n\n3. Some issues about dataset creation:\n - 3.1. The authors consider the distribution of ligand size and pocket size when designing the dataset. However, molecules possess more properties that can also lead to imbalance. It would be better to, at least, add some discussion about this issue.\n - 3.2. In the second stage of the data construction process, the approach to defining pockets needs further explanation or an ablation study.\n\n4. Experiments: It would be better to add some biological justification or visualization of the results.\n\nFor this paper, one fact is that the technical novelty is below the bar of ICLR. However, I admire the simple but effective model for the right question. It's a struggle for me to make a decision. I will maintain a neutral attitude and make my final decision after the discussion."
            },
            "questions": {
                "value": "See weakness."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "None"
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3164/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3164/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3164/Reviewer_yfM3"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3164/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698835886192,
        "cdate": 1698835886192,
        "tmdate": 1700545194816,
        "mdate": 1700545194816,
        "license": "CC BY 4.0",
        "version": 2
    }
]