[
    {
        "id": "gPXK6TX8Tp",
        "forum": "uNkKaD3MCs",
        "replyto": "uNkKaD3MCs",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1050/Reviewer_ddCD"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1050/Reviewer_ddCD"
        ],
        "content": {
            "summary": {
                "value": "This paper propose a new method that enhances OOD detection by using multiple prototypes per class to capture data diversities, achieving leading results on the CIFAR-100 benchmark.\n* PALM introduces a distance-based OOD detection using hyperspherical embedding space and a mixture of prototypes for superior differentiation.\n* The system automatically learns prototypes, employing both MLE and contrastive losses to enhance class distinction.\n* Empirical studies showcase PALM's effectiveness in both supervised and unsupervised OOD detection scenarios."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "* The manuscript is articulately presented with clear and coherent language.\n* The core idea is presented in a lucid manner, ensuring ease of comprehension for readers.\n* The experiments provide compelling evidence for the effectiveness of the proposed approach, e.g., 10-point gain on Places365 (Table 1)."
            },
            "weaknesses": {
                "value": "Major Points:\n\n1. **Hyperparameter Settings:** While it's commendable that ablation studies were performed for the introduced hyperparameters like $K$ (number of prototypes) and $\\alpha$ (momentum), how do we choose these hyperparameters for different models or datasets? Is there a potential performance dip with varying settings?\n\n2. **ID Accuracy Impact:** What's the influence of PALM on ID classification accuracy?\n\n3. **Intra-class Heterogeneity:** Fig. 5(c) shows varying prototype effects across datasets. Is this due to different levels of intra-class variability? Do authors have any insights or experiments on why this happens? \n\n4. **Technical Contribution:** The paper's core idea, i.e., prototypical learning with a mixture of prototypes, seems like a straightforward and easy extension of CIDER. I acknowledge the improvements shown in experiments and welcome further discussion on this.\n\nMinor Points:\n\n1. Figure 5 is presented before Figure 4.\n\n2. Figures 4 & 6 are too small to recognize when printed. Consider resizing for clarity."
            },
            "questions": {
                "value": "Please see the content in Weakness."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission1050/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1050/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1050/Reviewer_ddCD"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1050/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698544889380,
        "cdate": 1698544889380,
        "tmdate": 1699636031403,
        "mdate": 1699636031403,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "CxlJAP3lNX",
        "forum": "uNkKaD3MCs",
        "replyto": "uNkKaD3MCs",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1050/Reviewer_dG1q"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1050/Reviewer_dG1q"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes PALM (PrototypicAl Learning with a Mixture of Gaussian) to address the out-of-distribution detection problem via a distance-based method underlied by a mixture of prototypes. This work is a direct extension of the compactness and dispersion regularized loss (CIDER) by Ming et al. to a probabilistic setting. Although CIDER, and other distance-based OOD detection methods have shown strong results against OOD benchmarks, they indeed tend to make stringent assumptions in their formulation . For instance, CIDER models all samples of each class with only one single prototype, and requires data samples of each class to be compact around a single prototype. These oversimplifying assumptions make the methods quite limiting. This paper addresses some of those limitations to formulate and shape the embedding space."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "This paper is well-written and mathematically sound. The method PALM that is proposed nicely extends an already strong OOD detection method called CIDER. PALM is extensively analyzed via a thorough ablation study, and extensively evaluated against multiple OOD benchmark datasets and methods. PALM boats strong ID-OOD discrimination in almost all of the experiments by outperforming previous supervised and unsupervised methods by a large margin."
            },
            "weaknesses": {
                "value": "1. PALM, like its predecessor CIDER, heavily relies on the hyperspherical representation of the learned embeddings to formulate and shape the embedding space. In CIDER, this representation was crucial in achieving strong ID-OOD separability and ID classification. However, since PALM is a mixture of Gaussian, that assumption that the embeddings need to be normalized to unit-norm or need to lie in a hyper spherical space may not necessarily be needed. I wonder if this assumption could be lifted so as to make PALM more general.\n\n2. The second limitation pertains to how the prototypes are updated. While in small data regimes, one can expect the observations to behave similarly in nature, (i.e.; samples of the same class appear somewhat similar throughout the training process), in large data regimes, it's very likely to have samples of the same class behaving differently. In other words, even within the ID distribution, there could be outliers that could affect the ID classification. As a result, maintaining one value of $\\alpha$ throughout the training process for the prototypes update seem quite limited to me. One suggestion to the authors is to make $\\alpha$ adaptive by integrating its learning as part of the whole training process.\n\n3. It is unclear from the manuscript how the mixture proportions $\\omega_{i, k}$ are learned. As the authors may know, GMMs are very sensitive to the initialization of the mixture proportions. A suboptimal initialization may lead to the model getting stuck in a local minimum.\n\n4. It has sounded quite unintuitive to me why the likelihood of a sample would be expressed as a mixture of prototypes given the strong ID separability flavor the authors would want to endow to their ID detection method. This concern is somewhat assuaged by the assignment pruning, but I think more justification is needed as to why one would want to enforce separability and yet mix the prototypes.\n\n5. By having K dedicated prototypes for each class, PALM significantly increases the memory footprint unlike its predecessor CIDER and other distance-based OOD detection methods. This needs to be addressed in the manuscript."
            },
            "questions": {
                "value": "It'd be great if the authors could address the limitations that I raised above."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission1050/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1050/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1050/Reviewer_dG1q"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1050/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698766362057,
        "cdate": 1698766362057,
        "tmdate": 1700057670718,
        "mdate": 1700057670718,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "2jfJ0eAQsc",
        "forum": "uNkKaD3MCs",
        "replyto": "uNkKaD3MCs",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1050/Reviewer_wPGj"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1050/Reviewer_wPGj"
        ],
        "content": {
            "summary": {
                "value": "The paper introduces the PrototypicAl Learning with a Mixture of prototypes (PALM) for Out-of-distribution (OOD) detection in machine learning. Unlike traditional methods that oversimplify data assumptions, PALM models multiple prototypes per class for accurate representations. Experimental results highlight PALM's effectiveness, especially on the CIFAR-100 benchmark."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "-The paper provides extensive experimental settings, particularly in the ablation studies.\n-The proposed method introduces an automatic prototype learning framework that incorporates a mixture of prototypes to represent hyperspherical embeddings, effectively capturing the natural diversities within each class.\n-The proposed method achieves a significantly improved performance."
            },
            "weaknesses": {
                "value": "-I have some concerns about scalability. The introduction of multiple prototypes and their dynamic updating could lead to scalability issues, especially when handling very large datasets or a vast number of classes.\n-The effectiveness of PALM is highly dependent on the quality of the prototypes. If the prototypes do not accurately represent the underlying data distribution, the model may face challenges in OOD detection.\n-In terms of computational cost, PALM might demand additional computational resources."
            },
            "questions": {
                "value": "The experimental results from tables 1, 2, and 3 all indicate that PALM does not achieve optimal performance on the texture dataset as it does in other tasks. I am quite curious as to why this phenomenon occurs."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1050/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698766982797,
        "cdate": 1698766982797,
        "tmdate": 1699636031235,
        "mdate": 1699636031235,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "q52aQiGfd5",
        "forum": "uNkKaD3MCs",
        "replyto": "uNkKaD3MCs",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1050/Reviewer_qjVi"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1050/Reviewer_qjVi"
        ],
        "content": {
            "summary": {
                "value": "This paper presents an outlier detection model, which assumes each class has multiple centroids in feature space, instead of one centroid that many existing models assume. A model called PALM is proposed that minimizes the MLE loss and prototype contrastive loss. The prototype centroid is updated during the model training. Experiment results demonstrate that the proposed model outperforms baselines in OOD and unsupervised OOD tasks."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "Overall, the novelty of this work is clearly presented, understandable and consistent with the intuition. Experiment comparison is comprehensive."
            },
            "weaknesses": {
                "value": "There have been some OOD detection benchmark datasets, such as Openood: Benchmarking generalized out-of-distribution detection. Advances in Neural Information Processing Systems 2022, 35, 32598-32611. Most of the datasets used in experiments are based on standard benchmark datasets. How are these datasets, such as CIFAR are used for OOD in this work?\n\nOne of the reasons that the proposed model outperforms the compared baselines is it better estimates the class or sample distribution due to the multi-centroid assumption. How about the comparison with generative based models, such as GAN based model?\nReference\nOut-of-domain detection based on generative adversarial network. In Proceedings of the 2018 Conference on Empirical Methods in Natural Language Processing (pp. 714-718).\n\nSome technical details are not clearly described. For example, how to have diag(u) and diag(v) in Eqn. (6). Appendix C.1 is not about the detail of this."
            },
            "questions": {
                "value": "Please refer to the above section."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1050/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698881093168,
        "cdate": 1698881093168,
        "tmdate": 1699636031130,
        "mdate": 1699636031130,
        "license": "CC BY 4.0",
        "version": 2
    }
]