[
    {
        "id": "gn3jzbXr59",
        "forum": "V3j5d0GQgH",
        "replyto": "V3j5d0GQgH",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4997/Reviewer_YQxK"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4997/Reviewer_YQxK"
        ],
        "content": {
            "summary": {
                "value": "This paper aims to address the long-tailed data in FL. The authors propose a new method called FedLoGe to improve both local and global model performance of FL under this scenario. FedLoGe introduces a Static Sparse Equiangular Tight Frame Classifier (SSE-C) to enhance data representations. It also contains feature realignment at both global and local levels."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- The long-tailed problem in FL is an emerging problem that is worth studying.\n- The paper is generally well structured.\n- Figure 2 provides a good illustration of the proposed method.\n- The proposed method seems to work and the experiments demonstrate the effectiveness of the proposed method.\n- Evaluation are conducted on various backbones and different scales of datasets."
            },
            "weaknesses": {
                "value": "- The content of the paper is not very easy to follow. For example, the message from Figure 1 is a bit hard to interpret. In the first paragraph of the third page (where Figure 1 (a) is explained), it is not quite clear what large mean and small mean imply.\n- Notations seem to be inconsistent, the notation for the number of clients is K in Section 3, but N in Section 4.\n- Probably a typo: “…. personalized classifier by multiple the norm of … “ Should it be “by multiplying… “?\n- The method of fixing the classifier and backbone alternatively for training is proposed in previous papers on personalized FL.\n- Some settings are not clear: e.g., the number of clients participating in training each round and the number of local epochs."
            },
            "questions": {
                "value": "- How many clients participate in training each round?\n- Does the paper focus on cross-silo FL, cross-device FL, or both?\n- Why the proposed method can improve performance on FL with long-tailed problem?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4997/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4997/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4997/Reviewer_YQxK"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4997/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698515549090,
        "cdate": 1698515549090,
        "tmdate": 1699636487526,
        "mdate": 1699636487526,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "yvLDlkPzKY",
        "forum": "V3j5d0GQgH",
        "replyto": "V3j5d0GQgH",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4997/Reviewer_tSL5"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4997/Reviewer_tSL5"
        ],
        "content": {
            "summary": {
                "value": "This paper presented a model training framework that enhances the performance of both local and generic models in Fed-LT settings in the unified perspective of neural collapse. The proposed framework is comprised of SSE-C, a component developed inspired by the feature collapse phenomenon to enhance representation learning, and GLA-FR, which enables fast adaptive feature realignment for both global and local models. As a result, the proposed method attains significant performance gains over current methods in personalized and long-tail federated learning."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "S1. This work focuses on addressing the data imbalance issue to simultaneously enhance the efficacy of the generic global model and its performance at the local level, which is an interesting topic.\n\nS2. This paper is well-written and has a good presentation.\n\nS3. The proposed SSE-C can address the problem of feature degeneration well, which is a promising finding."
            },
            "weaknesses": {
                "value": "W1. Convergence analysis is missing, which is very important for the optimization process of federated learning. Please analyze it from the experimental and theoretical point of view.\n\nW2. Lack of discussion about privacy. Federated learning is proposed to protect the privacy of the client, but the method in this paper has the risk of gradient disclosure, please add the discussion of privacy in this work.\n\nW3. The communication overhead of the model seems to be very large, which will restrict the practical application. Please increase the experiment and analysis of the communication overhead.\n\nW4. The related work is simply a list of existing methods. Please add a discussion of the differences between this work and previous work to further clarify the contribution of this paper."
            },
            "questions": {
                "value": "Please see the Weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4997/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4997/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4997/Reviewer_tSL5"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4997/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698723844233,
        "cdate": 1698723844233,
        "tmdate": 1700638411435,
        "mdate": 1700638411435,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "acsSMjGE9o",
        "forum": "V3j5d0GQgH",
        "replyto": "V3j5d0GQgH",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4997/Reviewer_YHb3"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4997/Reviewer_YHb3"
        ],
        "content": {
            "summary": {
                "value": "The paper considers federated learning with long-tailed global distribution and non-iid client distributions. the authors propose a Federated Local and Generic Model Training (FedLoGe) to train a model that can perform well both on long-tailed global distribution and local client distributions. First, the proposed Static Sparse Equiangular Tight Frame Classifier fosters the acquisition of potent data representations. Second, the Global and Local Adaptive Feature Realignment (GLA-FR) is used to align global features with client preferences."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "1 poor"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "* (originality) The authors proposed a novel method by neural collapse and realignment of local and global classifiers. Though neural collapse has been used for handling data heterogeneity, the realignment is novel to address the local-generic problem.\n* (significance) The proposed method can significantly outperform baselines in the concerned settings.\n* (clarity) The figure 2 is appreciated for clarifying the method.\n* (quality) The experiments are well designed for the problem setting. Multiple baselines are compared to demonstrate the effectiveness of the proposed method both in boosting local and generic performance."
            },
            "weaknesses": {
                "value": "* (quality) The generic-local setting looks self-contradictive to me. When the personalized federated learning targets training models personalized for each client, is it necessary to consider a model adapted for global or generic distribution? In personalized federated learning, the assumption is that each client has its own data distribution and it aims to learn a model adapted for the specific distribution. If the global or generic distribution is considered, which client will be expected to use the model?\n* (significance) Because of my concerns about the problem setting, I am afraid that the proposed method may have a limited impact on a few specific problems.\n* (clarity) The technical motivation is not clear. The neural collapse has been used for handling data heterogeneity and classifiers should be fixed by the neural collapse theorem. It is unclear why the realignment is still needed. Why the fixed classifier cannot be used for all clients?\n* (clarity) The paper is hard to follow. Specifically, the motivation experiments in the introduction are hard to understand. Why the mean and variance of class means are evaluated in Figure 1? I cannot follow the logic in the discussion quoted below.\n> However, preliminary experiments benchmarking ETF with CIFAR-100 in Fed-LT suggest that only a few features have relatively large means, while most of the small-mean features are contaminated by severe noise, as shown in Fig. 1(a). Such observations are inconsistent with the feature collapse property, and we coin it as feature degeneration.\n\n  How do the mean and variance of features relate to the feature collapse?"
            },
            "questions": {
                "value": "* Please provide clear motivation for the generic-local setting. When the personalized federated learning targets training models personalized for each client, is it necessary to consider a model adapted for global or generic distribution? In personalized federated learning, the assumption is that each client has its own data distribution and it aims to learn a model adapted for the specific distribution. If the global or generic distribution is considered, which client will be expected to use the model?\n* How do the mean and variance of features relate to the feature collapse in the quoted content?\n> However, preliminary experiments benchmarking ETF with CIFAR-100 in Fed-LT suggest that only a few features have relatively large means, while most of the small-mean features are contaminated by severe noise, as shown in Fig. 1(a). Such observations are inconsistent with the feature collapse property, and we coin it as feature degeneration."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4997/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4997/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4997/Reviewer_YHb3"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4997/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698812825673,
        "cdate": 1698812825673,
        "tmdate": 1700622748653,
        "mdate": 1700622748653,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "LjvBCJ1Fk1",
        "forum": "V3j5d0GQgH",
        "replyto": "V3j5d0GQgH",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4997/Reviewer_Nmh4"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4997/Reviewer_Nmh4"
        ],
        "content": {
            "summary": {
                "value": "This paper addresses Federated Learning with global long-tailedness. The proposed method is inspired by the neural collapse idea and contains three steps: 1) global representation learning with SSE-C classification head, and 2) & 3) global and local feature realignment.  In step 1, a classifier head is learned with sparsity while maintaining the Equiangular Tight Frame (ETF) properties, which is then broadcast to clients for learning backbone $\\theta$ and personalized classifier head $\\psi$. In step 2 & 3, the backbone $\\theta$ and global classifier $\\psi$ and local classifier $\\phi$ is respectively updated and realigned. Empirical results on a few benchmarks show the effectiveness of the proposed approach over prior work on data heterogeneous FL or Long-tailed FL."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "\\+ This paper tackles a crucial and intriguing problem in federated learning with global long-tailedness.\n\n\\+ The key idea of using ETF to build a classifier as regularized consensus is well-motivated.\n\n\\+ Experiments and ablation studies are well-designed and comprehensively conducted."
            },
            "weaknesses": {
                "value": "\\- Too many technical details are missing. For example, it is vague to me why performing personal classifier realignment in Eq (7) helps in tackling local data heterogeneity. \n\n\\- Authors need to provide detailed motivation of each step in the proposed algorithm, such as the motivation of keeping two classifier heads for clients: $\\phi_k$ and $\\psi_k$, and realignment of the global classifier $\\psi$ in Eq 6.\n\n\\- Writing: Certain citation formats need to be fixed; Figure 1 is difficult to comprehend.\n\n\\- Missing discussion and comparison with related work on long-tailed FL. Authors should specify the technical contributions of the proposed method over other prior work, especially FedETF, which shows much resemblance to the proposed work."
            },
            "questions": {
                "value": "How to optimize Eq (4) that contains a maximization over $j$? \n\nWhat is the purpose of introducing sparsity to the SSE-C classifier, besides its empirical effectiveness?\n\nWhy do we need two classifier heads  $\\phi_k$ and $\\psi_k$ for each of the clients $k$ instead of just one?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4997/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699462621395,
        "cdate": 1699462621395,
        "tmdate": 1699636487276,
        "mdate": 1699636487276,
        "license": "CC BY 4.0",
        "version": 2
    }
]