[
    {
        "id": "6cdkqXgqfe",
        "forum": "V5tdi14ple",
        "replyto": "V5tdi14ple",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8001/Reviewer_1bgq"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8001/Reviewer_1bgq"
        ],
        "content": {
            "summary": {
                "value": "This paper combines large language models (LLMs) and theorem provers to improve the symbolic reasoning capabilities of the former. Basically, LLMs translate mathematical statements into Isabelle code, which is then used to check for correctness.\nThe proposed approach is evaluated experimentally with favourable results compared to the state-of-the art."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "1) The proposed translation includes both symbolic and neural filters to improve the statement translation reliability.\n\n2) The related work is discussed in detail."
            },
            "weaknesses": {
                "value": "1) The originality and theoretical contribution of this paper is rather limited, as this is mainly the clever combination of two existing tools.\n\n2) The experimental comparison is mainly wrt vanilla voting methods. Also, there is no explanation about the reasons of the particular approached selected for comparison, and there is no comparison with the numerous other methods mentioned in the related work."
            },
            "questions": {
                "value": "p. 3: Is it the case that every yes/no question is translated into a request for proof?\nWhat if I ask \"Is there a proof that \\pi is irrational?\""
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "N/A"
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission8001/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission8001/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission8001/Reviewer_1bgq"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8001/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698487477204,
        "cdate": 1698487477204,
        "tmdate": 1699636986099,
        "mdate": 1699636986099,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "4012kKFi9h",
        "forum": "V5tdi14ple",
        "replyto": "V5tdi14ple",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8001/Reviewer_HYaT"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8001/Reviewer_HYaT"
        ],
        "content": {
            "summary": {
                "value": "This paper provides a methodology, DTV, whereby LLMs can leverage libraries of formal mathematics and theorem provers to generate sound mathematical solutions.  This approach outperforms a 'majority voting' benchmark by about 12% on the GSM8K (grade school math questions), and 7% on the full test suite.\n\nDTV operates as follows: given an informal (natural language) problem statement, an LLM produces an informal solution.  The LLM then translates both of these into formal statements.  Manually developed filters then eliminate some of the proposed solutions, whose steps are then checked in a theorem prover.  An answer is selected by majority voting over verified solutions."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "4 excellent"
            },
            "strengths": {
                "value": "**originality**\n\nThe paper is, to my knowledge, original.  Better yet, it is obvious in retrospect.\n\n**quality**\n\nThe paper is well executed.\n\n**clarity**\n\nThe paper is well written.\n\n**significance**\n\nOne of the most obvious drawbacks of LLMs is their lack of soundness.  At the same time their power and flexibility are very impressive.  This paper presents a method for capitalizing on the strength of LLMs while reducing their weaknesses.  I am very confident that the autoformalization literature will continue to gain importance, and that this paper contributes to that literature."
            },
            "weaknesses": {
                "value": "Minor typos:\n1. \"treated unverified\" -> \"treated as unverified\"\n1. \"autoforamlization\" -> \"let's see if authors will blindly make any crazy edit a reviewer suggests\""
            },
            "questions": {
                "value": "1. Figure 1, caption: how would results change if, instead of majority voting over all verified solutions, the 'smallest' solution was selected?\n\n1. is it meaningful to run a head-to-head comparison of DTV and Jiang et al.?\n\n1. very minor curiosity (not necessary for the paper): what's the most impressive result that DTV was able to derive?\n\n1. is it possible to estimate how much of a performance improvement there might be if GPT3.5 ran the solution formalization and self-critique filter?  How much extra time this would cost?\n\n1. again, out of curiosity (rather than for the paper): is there a branch of the autoformalization project working on extending the formal libraries?  I'm wondering whether Gowers' Polymath, or Tao's recent interest in Lean could help plug gaps in formal libraries.\n\n1. relatedly, could DTV help with Hales' Formal Abstracts project, https://formalabstracts.github.io/ ?  (This seems to have been dormant.)\n\n1. Figure 3: to clarify the caption - the generated formal statement is too high level for Isabelle to solve in a single step; however, the formalized individual steps are granular enough to allow proof and verification?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission8001/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission8001/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission8001/Reviewer_HYaT"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8001/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698735798744,
        "cdate": 1698735798744,
        "tmdate": 1700278091290,
        "mdate": 1700278091290,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "7oa2VVm1Uc",
        "forum": "V5tdi14ple",
        "replyto": "V5tdi14ple",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8001/Reviewer_HDyn"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8001/Reviewer_HDyn"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a technique to improve the performance of LLM in solving mathematical reasoning problems. Although it is reported that LLMs show high performance on \nthese problems, they still make errors in their reasoning steps. The proposed method, Don't trust, verify (DTV), tries to improve the performance of LLMs by leveraging external automated theorem provers. Given a problem written in an informal statement, DTV generates both an informal solution and a formal statement by using an LLM. Then, DTV uses an automated theorem prover to verify the answer. Finally, DTV decides its output by performing majority voting among verified answers. Experimental results show that the proposed method\ncan improve the performance of an LLM in multiple reasoning benchmarks."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "**A clearly written paper:** T his paper is very clearly written. I feel no difficulty reading the paper.\nThe background and related work section are good enough to make the position of the paper clear.\n\n**Tuckles to a well-motivated problem by a simple method:** To improve the performance of the LLM by combining it with external tools is an important research topic.\nThe proposed method requires less additional cost. Therefore, it has the potential to be a handy tool for this kind of problem.\n\n**The proposed method is original and carefully designed:**\nAlthough some ideas of DTV come from DTP (Jiang et al., 2023), there are a considerable amount of differences between DTP and DTV. DTV seems carefully designed for the reasoning \ntask."
            },
            "weaknesses": {
                "value": "**Experimental results are not strong:**\nExperimental results show that the proposed method can improve the performance compared with majority voting. However, there are some concerns.\n1. The results in Table 1. compare DTV with GPT-3.5 with baseline methods using Minerva 62B. It is an unfair comparison since the performance improvement comes\nfrom the power of GPT-3.5, and we should compare the results of baseline methods using GPT-3.5. Without GPT-3.5, the improvement by DTV seems marginal.\n2. The paper claims that DTV improves the performance of LLMs and sets simple baseline methods using just LLMs. To prove the claim true, the paper should show experimental results\nwhen we combine DTV with multiple LLMs, as is reported in (Wang et al., 2022).\n\n**Concerns about the number of samples and the efficiency of the DTV:**\nCompared with majority voting, the proposed method needs at least three times more queries to an LLM to obtain a sample solution (informal solution generation, formal statement generation, and formal sketch generation, and I think the self-critique filter needs more queries per sample). As reported in (Wang et al., 2022), the performance of majority voting improves as we generate more samples. Therefore, the paper should report how the performance of DTV and majority voting changes when we change the number of samples n, and should \ndiscuss whether such additional cost of DTV pays off. That is, if we need $m$ queries to obtain a sample solution of DTV, then I think the performance of the proposed method\nshould be compared with the majority voting of $nm$ samples."
            },
            "questions": {
                "value": "1. Could you please show how the performance of DTV and Wang 2022 changes with number of samples $n$?\n2. How many queries to an LLM does the proposed method need to obtain a sample solution? \n1. Could you please show how the performance changes if we use different LLMs?\n\n## Minor comment \nThe paper should use \\citet{} command to avoid statements like \"(Cobbe et al., 2021) explores training informal ... (page 1) \""
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission8001/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission8001/Reviewer_HDyn",
                    "ICLR.cc/2024/Conference/Submission8001/Senior_Area_Chairs"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8001/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698807269717,
        "cdate": 1698807269717,
        "tmdate": 1700196529409,
        "mdate": 1700196529409,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "Q7MHKuqzx7",
        "forum": "V5tdi14ple",
        "replyto": "V5tdi14ple",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8001/Reviewer_wLE8"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8001/Reviewer_wLE8"
        ],
        "content": {
            "summary": {
                "value": "The paper advocates using theorem provers to verify answers generated by language models for quantitative mathematical problems. One starts with a problem in natural language, use language models to generate potential solutions, extract the solutions together with the problem statement and send them to another language model for autoformalization. If the formalized proof is verified by the target theorem prover, then we are sure that one solution is correct without the need of techniques such as majority voting. Additionally, we obtain a rigorous mathematical proof with all gaps closed.\n\nAlthough the big framework of this work is similar to what has been proposed in previous works such as Draft, Sketch, and Prove: Guiding formal theorem provers with informal proofs, the experiments conducted here is much more comprehensive, and a few extra mechanisms to help with the performance have also been introduced, such as the filters for faithful translations."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- Comprehensive empirical evaluation and analysis. The results establish the effectiveness of the approach.\n- Excellent section of limitations addressing my concerns that otherwise would have gone into the weakness section below.\n- It is good that this is not merely a large scale version of DSP — new mechanisms such as filters for faithful translations are good to have.\n- The paper is well written and easy to follow."
            },
            "weaknesses": {
                "value": "Since the authors already included many of my potential criticisms into the section of limitation (which I really like), only a few ones sit here:\n\n- While DTV consistently outperforms baselines at different model sizes as seen in Table 2, the benefits from using DTV seem to be decreasing as the model size scale up (i.e, Minerva 8B -> 540B).\n\n- It would be good if there is a paragraph describing how a solution is extracted from an informal answer provided by an LLM. If possible, a discussion on “extraction based on the final answer” versus “extraction based on the informal reasoning” would also be nice."
            },
            "questions": {
                "value": "See above."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8001/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698829283993,
        "cdate": 1698829283993,
        "tmdate": 1699636985592,
        "mdate": 1699636985592,
        "license": "CC BY 4.0",
        "version": 2
    }
]