[
    {
        "id": "CAghudiolv",
        "forum": "VAwgL8kPvr",
        "replyto": "VAwgL8kPvr",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2340/Reviewer_aZ9T"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2340/Reviewer_aZ9T"
        ],
        "content": {
            "summary": {
                "value": "The paper suggests integrating weight-sharing NAS for the compression of pre-trained language models. This approach consists of three components: a weight-sharing super-network trained using the sandwich rule in conjunction with an in-place knowledge distillation (KD) strategy; a sub-network selection based on the Pareto front; and a varied search space, extending from a larger scope with masks applied to each head/neuron to a smaller scale focusing solely on the quantity of heads, units, and layers."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. **NAS's Role in Compressing BERT**: A practical application for NAS is in the compression of BERT.\n2. **Method Advantages for Sub-Network Selection**: This technique facilitates a multi-objective search for choosing multiple sub-networks, unlike earlier methods which allowed only single-network pruning and selection at a time."
            },
            "weaknesses": {
                "value": "1. **No experiments on LLM, but the topic of this paper is about LLM**. The title of the paper suggests a focus on Large Language Models , leading me to expect analyses or experiments involving LLMs like LLaMA, or at least T5-large, especially since the terms 'LLM' are predominantly used in the paper rather than 'language model' or 'pre-trained language model'. However, upon delving into the experimental section, it's surprising to find that the actual experiments exclusively involve **BERT**. There is no mention of LLMs in the experiment, nor is there any comparison or discussion on how the application of Neural Architecture Search might differ between LLMs and PLMs.\n\n2. **More Baselines are needed**. The authors appear to have selected some baselines that may be relatively less challenging to outperform, such as Retraining-Free Pruning and self-defined baselines. Retraining-Free Pruning, focusing on rapid compression of BERT without retraining, isn't directly comparable with the methods in this paper, which involve around 12 hours of training (as indicated by 50,000 seconds in Figure 5) on the MNLI dataset. Moreover, the proposed method underperforms DistillBERT in more than half of the datasets (including MRPC, COLA, SST2, QNLI, MNLI). Other baseline methods are self-created, and there's a notable omission of any recent advancements in structural pruning methods for BERT in the past five years (e.g., DynaBERT, CoFi). Comparison with those methods are needed. Additionally, the related work section only references four papers on structural pruning for BERT, whereas the authors could have expanded their literature scope by referring to a broader survey[1] on this topic.\n\n3. **Missing Important Comparison**. The paper misses an essential comparison with another study[2] that also employs NAS for compressing BERT. Given the relevance and slight methodological variation (NAS applied to pre-trained versus fine-tuned BERT) between the two studies, a comparison seems crucial. Both papers aim to achieve compression in downstream tasks, yet this paper lacks experimental evidence or analysis showing whether its method offers any advantages over the other one. This comparison is particularly pertinent since the approach to compression, whether on a pre-trained or fine-tuned model, could lead to different outcomes, and their exploration is essential for a comprehensive understanding.\n\n[1] Survey on Model Compression and Acceleration for Pretrained Language Models. \n[2] NAS-BERT: Task-Agnostic and Adaptive-Size BERT Compression with Neural Architecture Search"
            },
            "questions": {
                "value": "Could you clarify the process used to calculate the runtime for each technique as shown in Figure 5? The RFP (Retraining-Free Pruning) paper mentions that pruning takes merely 0.01 hour, approximately 36 seconds. However, in your study, this duration extends to about 20,000 seconds. What factors contribute to this substantial discrepancy in runtime measurements?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission2340/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2340/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2340/Reviewer_aZ9T"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2340/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698381676198,
        "cdate": 1698381676198,
        "tmdate": 1699636166362,
        "mdate": 1699636166362,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "CpeoswrgLR",
        "forum": "VAwgL8kPvr",
        "replyto": "VAwgL8kPvr",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2340/Reviewer_t4jT"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2340/Reviewer_t4jT"
        ],
        "content": {
            "summary": {
                "value": "The paper studys a important research direction for NAS: structural pruning using NAS. The paper explores weight-sharing based neural ar\u0002chitecture search (NAS) as a form of structural pruning to find sub-parts of the fine-tuned network that optimally trade-off efficiency. Authors valicate the effectiveness of the proposed method for fine-tuned BERT models."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The writing of this paper is commendable as it is well-structured and easily comprehensible.  I believe that utilizing Neural Architecture Search (NAS) for pruning structured architectures is one of the crucial research directions in the field of NAS. This paper provides detailed experimental evidence of the effectiveness of their approach, particularly on the GLUE benchmark."
            },
            "weaknesses": {
                "value": "One significant aspect that requires attention is the performance on the GLUE benchmark. It is worth considering an alternative branch of NAS, which involves directly searching for new architectures using distillation techniques for fine-tuned models such as AdaBERT, TinyBERT, and NAS-BERT. These methods have demonstrated the ability to achieve 50% pruning without any notable performance degradation and even achieve an impressive 80% reduction in parameters with minimal impact on performance. It would be beneficial to include and discuss these baselines in the paper. Moreover, it would be interesting to explore the potential combination of the proposed methods with these existing models and highlight the advantages of the proposed approach. I believe that incorporating these insightful discussions would greatly enhance the paper."
            },
            "questions": {
                "value": "See weakness."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2340/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698735988496,
        "cdate": 1698735988496,
        "tmdate": 1699636166275,
        "mdate": 1699636166275,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "qe1qqALEs8",
        "forum": "VAwgL8kPvr",
        "replyto": "VAwgL8kPvr",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2340/Reviewer_2Az8"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2340/Reviewer_2Az8"
        ],
        "content": {
            "summary": {
                "value": "This paper proposed weight-sharing-based NAS to compress fine-tuned pre-trained LLMs by slicing subnetworks. By utilizing a multi-objective approach, they can find the Pareto optimal set of architectures that balance model size and validation error. The NAS approach achieves up to 50% compression with less than 5% performance drop for a fine-tuned BERT model on 7 out of 8 text classification tasks."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "The paper has detailed literature research and multiple baseline models for comparison and the selected topic is very important given that LLM is more and more important in our everyday life. Improving the LLM efficiency is critical.\n\nThe paper also provided in-depth ablation study."
            },
            "weaknesses": {
                "value": "When looking the metrics, it seems the newly proposed NAS model mainly performs better when the model is pruned heavily. The model inference time is not the best when compared with other models."
            },
            "questions": {
                "value": "In Figure 4, the graph shows: On 7 out of 8 dataset the new NAS strategy is able to prune 50% with less than 5% drop in performance (indicated by the dashed line) in performance. It seems more than 1 datasets dropped more than 5% when pruning 50% of parameters?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2340/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698813761231,
        "cdate": 1698813761231,
        "tmdate": 1699636166166,
        "mdate": 1699636166166,
        "license": "CC BY 4.0",
        "version": 2
    }
]