[
    {
        "id": "FmfC9EPHWj",
        "forum": "vBw8JGBJWj",
        "replyto": "vBw8JGBJWj",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1841/Reviewer_UkJP"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1841/Reviewer_UkJP"
        ],
        "content": {
            "summary": {
                "value": "* A tool for metagenomic binning (clustering) has been developed, consisting of two main components: a learning stage where representations of unitigs (nodes) and contigs (paths) from the unitig assembly graph are considered, along with the constraints that prevent two contigs from belonging to the same bin; and a binning stage where the labels are initialized, propagated, and refined.\n* The primary novelty of the proposed method arises from the direct learning approach applied to the unitig assembly graph, rather than reconstructing a contig assembly and learning from it. Additionally, a clustering method has been introduced as a replacement for Kmeans, leveraging the learned representations to address the issue of imbalanced bin size.\n* UnitigBin has been evaluated on 12 datasets against baseline methods. The binning results have been assessed by evaluating both the completeness and contamination of the bins using checkM and by evaluating the accuracy of clustering via Precision, Recall, F1, and ARF scores."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "* The evaluation is comprehensive. It compares different categories of baseline binning methods, including traditional approaches, deep-learning-based binning tools, and assembly graph-based binning tools. Ablation studies and runtime analyses were also conducted, demonstrating the usefulness and efficiency of each component of the proposed framework.\n* The binning results from the proposed method show a significant improvement over the baselines on both measures, the completeness and contamination of the bins using checkM and the accuracy of clustering via Precision, Recall, F1, and ARF scores.\n* A p-batch training technique is proposed to address the computational challenge without compromising efficiency."
            },
            "weaknesses": {
                "value": "* It shows that the overall performance is heavily reliant on the choice of downstream clustering methods. Using Kmeans on the learned representation yields surprisingly poor results, which raises the question of whether the representation learning is beneficial in this application.\n* Considering the additional computational complexity introduced when learning directly from Unitig assembly graphs, it is not entirely clear why the proposed method can capture additional information that may have been overlooked in prior work that learned from reconstructed contig assembly graphs."
            },
            "questions": {
                "value": "* Is there any evidence or an intuitive explanation of what additional information is captured by learning directly from the unitig assembly graph instead of the reconstructed contig assembly graph, and how this contributes to the improvement in binning performance? Conducting an ablation study by running a similar framework directly on the unitig assembly graph and demonstrating performance differences could be helpful for illustration."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission1841/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1841/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1841/Reviewer_UkJP"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1841/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698716246824,
        "cdate": 1698716246824,
        "tmdate": 1699636114037,
        "mdate": 1699636114037,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "vysv4UJpMY",
        "forum": "vBw8JGBJWj",
        "replyto": "vBw8JGBJWj",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1841/Reviewer_WrPh"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1841/Reviewer_WrPh"
        ],
        "content": {
            "summary": {
                "value": "In this paper, the authors introduce a novel binning tool, UNITIGBIN, which encodes unitig-level assembly graphs while considering constraints generated by single-copy marker gene information. After obtaining the embeddings of the sequences, UNITIGBIN bins the contigs (formed by combining one or multiple connected unitigs) using a binning framework consisting of 1) binning initialization, 2) iterative matching, 3) propagating and 4) refining. The results from datasets with assembly graphs generated by two different assemblers demonstrate that UNITIGBIN outperforms the compared methods in overall."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "This paper offers a practical approach for transitioning from contig-level representation learning to unitig-level."
            },
            "weaknesses": {
                "value": "The novelty appears somewhat limited, as the approach primarily combines existing representation learning techniques and the constraint-based graph representation learning-based binning method RepBin, albeit with the conversion of assembly graphs from contig-level to unitig-level. Additionally, the binning steps appear to be a combination of Metacoag (binning initialization) and RepBin (propagating and refining) with limited improments. The authors should provide a more detailed and distinct description of the similarities and differences.\n\nThe experiments are inadequate in terms of comparing the results obtained from unitig-level assembly graphs with those from contig-level assembly graphs. These experiments are significant for demonstrating the transition from unitig-level assembly graphs to contig-level assembly graphs.\n\nThe experiments are insufficient. Most of the datasets are small-scale single-sample datasets. For a more robust comparison of binning performance, it is recommended to utilize the CAMI I and CAMI II benchmark datasets.  In addition, the recently introduced Metadecoder has shown its effectiveness as a method. SemiBin2, an improvement over Semibin1, presents a novel approach specifically designed for long read data. It is highly recommended that the authors include these methods in the benchmark analysis.\n\nWe recommend that the authors employ Checkm2 to assess MAG quality, as it outperforms the original version of CheckM in predicting MAG quality, even for those with sparse genomic representation or reduced genome size.\n\nThis method is tailored to address a particular problem and may pose challenges when attempting to adapt it for use in different domains."
            },
            "questions": {
                "value": "Please provide more details about the datasets, for example, the number of the sequencing samples, the way to obtain the ground truth.\nThe definition of single-copy marker genes and the introduction of semibin appear to lack precision"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1841/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698815186045,
        "cdate": 1698815186045,
        "tmdate": 1699636113947,
        "mdate": 1699636113947,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "OExa22rE8F",
        "forum": "vBw8JGBJWj",
        "replyto": "vBw8JGBJWj",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1841/Reviewer_22Pk"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1841/Reviewer_22Pk"
        ],
        "content": {
            "summary": {
                "value": "The paper presented a graph neural net based approach for the application of binning metagnomic contigs, ie. clustering genomic subsequences into bins representing a constituent organism. The paper showed numerical results where the presented approach outperformed the other tested approaches on 12 public datasets."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The application seems to be novel by introducing the popular-studied approach of graph neural nets. The experiment includes 12 datasets and compares against 3 categories of tools."
            },
            "weaknesses": {
                "value": "I like how the authors keep the section of Problem Statement, but I don’t follow the exact problem to be solved however. The paragraph on Page 3 in Problem Statement only talked about the notation but does not specify what the task is, or what the desired output should be. Further, it wasn’t clear what objective is aimed at – which also motivates my question for how we make sure the objective function in each component maps to the objective of binning?\n\nSeparately, in the experiment setup, it’s unclear how the training/testing/validation is conducted; also while the results reported in Table 2 are promising, it’s unclear how significant they are.\n\nSince one motivation described in the Intro is that the presented approaches will respect the constraints – it’d be good to explicitly evaluate how it was done as compared to other methods, either in an explicit metric (or perhaps I mis-interpret the existing one?) or through an example."
            },
            "questions": {
                "value": "1) Suggest to motivate the readers more by explicitly describing the problem formulation including what objective is desired; ideally this can be formulated as an mathematical objective function and tied to the choice of loss function in the later learning component.\n\n2) Suggest to describe the experiment setup including what training/testing/validation data is included and clarify the statistical significance of the result comparison; if this is not feasible, provide justification and identify future steps.\n\n3) It’s not clear from the experiment results why particularly GNN is needed – suggest to provide perhaps case studies to show how GNN is able to capture the information that the other approaches cannot, since introducing GNN is considered as the main contribution of the work."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1841/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698973455162,
        "cdate": 1698973455162,
        "tmdate": 1699636113867,
        "mdate": 1699636113867,
        "license": "CC BY 4.0",
        "version": 2
    }
]