[
    {
        "id": "M3ZaNASXvz",
        "forum": "VJEcAnFPqC",
        "replyto": "VJEcAnFPqC",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7555/Reviewer_V1TB"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7555/Reviewer_V1TB"
        ],
        "content": {
            "summary": {
                "value": "This paper sheds light on step-wise inference in LLMs by casting the problem as a graph navigation problem. A dataset of random DAGs is generated with start and goal nodes and an autoregressive transformer is trained to navigate the graph from start to goal by next step prediction. The problem can be mapped to step-wise inference in LLMs and the paper investigates several settings in which this is manifested."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "I have found the problem setting of the paper interesting - these are important questions and some of the more challenging aspects of LLMs are investigated here.\n\nThe casting to DAG navigation is a good choice - it covers a lot of potentially related inference problems with a simple model which is easy to generate data for and train."
            },
            "weaknesses": {
                "value": "I think my main issue with the paper is that LLMs are trained on very very different data (though in a roughly similar setup).\nI am not sure the mapping between DAG navigation and what LLMs actually learn is as simple as claimed in the paper as LLMs need to do many other things when trained."
            },
            "questions": {
                "value": "Would the authors shed more light on the limitations and dissimilarities between the proposed model and actual LLM training?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7555/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698788515170,
        "cdate": 1698788515170,
        "tmdate": 1699636914438,
        "mdate": 1699636914438,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "C6RgfMwjfr",
        "forum": "VJEcAnFPqC",
        "replyto": "VJEcAnFPqC",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7555/Reviewer_JQZB"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7555/Reviewer_JQZB"
        ],
        "content": {
            "summary": {
                "value": "To analyze the stepwise inference in large language models, the authors examine a synthetic graph navigation problem and replicate several phenomena originally observed in LLMs. This work provides a simplified platform for researchers to study properties of LLM."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "4 excellent"
            },
            "strengths": {
                "value": "1. A comprehensive framework of DAG is provided as substitute for stepwise inference in LLM\n2. Reasoning gap, the diversity-accuracy tradeoff, in-context control are replicated in well-designed experiments, showing the effectiveness of the proposed enviroment.\n3. Well-written, easy to follow."
            },
            "weaknesses": {
                "value": "1.While several phenomena originally observed in LLMs were replicated in this DAG couterpart. It will be more convincing if some extraoplated property in DAG system can be found in LLMs which was not discovered before.\n\n2. Emergent abilities of large language lodels were thought to be a consequence of unpredictable scaling, therefore, I doubt if a simpilified DAG substitute can replicate this behaviour."
            },
            "questions": {
                "value": "I will increase my score if my concern is well addressed."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7555/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698810628848,
        "cdate": 1698810628848,
        "tmdate": 1699636914331,
        "mdate": 1699636914331,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "zA5QeBC62B",
        "forum": "VJEcAnFPqC",
        "replyto": "VJEcAnFPqC",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7555/Reviewer_3PuG"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7555/Reviewer_3PuG"
        ],
        "content": {
            "summary": {
                "value": "The paper proposes to study the step-wise inference mechanism by exploring the graph navigation problem."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "+ Originality:\n\n    The idea of modeling step-wise inference as graph navigation is interesting."
            },
            "weaknesses": {
                "value": "- Quality:\n\n    i) Although the authors claim to reveal the connection between graph navigation and the step-wise inference mechanism in transformer, the experiments, to my understanding, are solely about training transformers on the synthesized graph dataset. It remains unclear to me how this set-up can be translated into the study of step-wise inference mechanism, despite the conceptual similarity between DAG and the step-wise inference mechanism. It is unclear whether this finding on the synthesized graph dataset can be safely transferred to real-world large-scale dataset.\n\n    ii) The definition of hierarchical graph and random graph is confusing to me. It seems possible to convert the random graph in fig. 10 into a hierarchical graph by simply re-grouping the nodes.\n\n- Significance:\n\n    The highlighted finding, i.e., the step-wise inference gap is influenced by (i) the underlying DAG structure, and (ii) the length of the training samples is only studied in a very shallow level. The DAG structure in the context seems to be not well-defined and well-categorized. The discussion about the length of the training samples mainly focuses on how it affects the length of the model output."
            },
            "questions": {
                "value": "Please see the weaknesses section."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "None"
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission7555/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7555/Reviewer_3PuG",
                    "ICLR.cc/2024/Conference/Submission7555/Senior_Area_Chairs"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7555/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698827653242,
        "cdate": 1698827653242,
        "tmdate": 1700684079256,
        "mdate": 1700684079256,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "4dgSAK7DDt",
        "forum": "VJEcAnFPqC",
        "replyto": "VJEcAnFPqC",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7555/Reviewer_7XTH"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7555/Reviewer_7XTH"
        ],
        "content": {
            "summary": {
                "value": "This paper introduces and explores a novel paradigm that casts stepwise inference, a crucial element in logical reasoning, as a graph navigation challenge. Using directed acyclic graphs (DAGs) inspired by computational graphs and execution traces, the paper proposes a synthetic autoregressive language model setup for solving navigation tasks. The primary aim is to simplify, control, and interpret the mechanisms behind stepwise inference in Large Language Models (LLMs). This work serves as a foundational step towards creating a controllable and interpretable data generation process, offering insights into the stepwise inference in autoregressive transformers, which can inspire future research in logical reasoning and stepwise inference."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. This paper presents an innovative framework that leverages stepwise inference within transformer models to navigate complex graph structures, showcasing a significant advance in understanding logical reasoning paths. The method enhances the interpretability of models but with a deeper mechanistic insight.\n2. The paper integrates theoretical concepts with empirical validation, showcasing a comprehensive study on synthetic graph navigation tasks. Experimental design and results, particularly the diversity vs. accuracy trade-off, provide a compelling case for the model's efficacy and reliability.\n3. The paper also introduces a data generating process that augments the richness of training datasets, allowing for more robust model training."
            },
            "weaknesses": {
                "value": "1. While the paper claims to address stepwise inference in transformers and introduces a graph navigation model, the experiments seem to focus narrowly on synthetic tasks without sufficient evidence of the model's generalizability to a more realistic or applicable datasets.\n2. The approach primarily involves modeling the decision-making process using directed acyclic graphs (DAGs). However, there are concerns that the model may overfit these synthetic graph structures. The paper does not adequately address how the model handles noisy real-world graphs, which may exhibit cycles, incomplete information, or random behavior that are common in real-world applications. In this context, a deeper analysis of the robustness of the proposed method is crucial."
            },
            "questions": {
                "value": "Illustrated in the weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7555/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699163550965,
        "cdate": 1699163550965,
        "tmdate": 1699636914073,
        "mdate": 1699636914073,
        "license": "CC BY 4.0",
        "version": 2
    }
]