[
    {
        "id": "gHITGyAfpu",
        "forum": "voVjW1PT2c",
        "replyto": "voVjW1PT2c",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2473/Reviewer_iVGn"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2473/Reviewer_iVGn"
        ],
        "content": {
            "summary": {
                "value": "The manuscript proposes a new method for improving out-of-distribution detection in the presence of a finite set of auxiliary negative samples. The manuscript bounds generalization error using empirical error, reducible error, and distribution shift error. The latter is caused by the finite auxiliary dataset which cannot represent all possible test outliers. Therefore, the manuscript proposes an augmentation technique based on mixup which increases the variety of auxiliary data.  In practice, negative training samples are a convex combination of different auxiliary negatives. During inference, \n OOD samples are detected based on the classification confidence of K+1st class.\nThe proposed method achieves competitive results on relevant benchmarks for OOD detection."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "S1. The method is well motivated by extensive and sound theoretical analysis. Proofs are mostly easy to follow and seem correct.\n\nS2. The proposed augmentation technique for auxiliary datasets yields competitive results."
            },
            "weaknesses": {
                "value": "W1. The presented method relies on anomaly score derived as classification confidence for K+1 class. Can the method work in more general settings with arbitrary anomaly scores (such as entropy or energy)? Demonstrating robustness to various anomaly scores would strengthen manuscript contributions.\n\nW2. Mixup-based augmentation techniques are already considered in [a]. The manuscript should clearly outline the differences.\n\nW3. Missing related works which replace auxiliary negatives with properly trained generative models [b,c,d].\n\n[a] Dan Hendrycks, Andy Zou, Mantas Mazeika, Leonard Tang, Bo Li, Dawn Song, Jacob Steinhardt: PixMix: Dreamlike Pictures Comprehensively Improve Safety Measures. CVPR 2022\n\n[b] Kimin Lee, Honglak Lee, Kibok Lee, Jinwoo Shin: Training Confidence-calibrated Classifiers for Detecting Out-of-Distribution Samples. ICLR 2018\n\n[c] Matej Grcic, Petra Bevandic, Sinisa Segvic: Dense Open-set Recognition with Synthetic Outliers Generated by Real NVP. VISIGRAPP 2021\n\n[d] Shu Kong, Deva Ramanan: OpenGAN: Open-Set Recognition via Open Data Generation. ICCV 2021"
            },
            "questions": {
                "value": "Q1. The error caused by the finite auxiliary negative dataset which cannot cover all possible test outliers is termed distribution shift error.  I suggest renaming the distribution shift error to outlier coverage error.\n\nQ2. Should the first term of Eq. 13 have D_inlier instead of D_aux?\n\nQ3. Proof of Theorem 2, could you elaborate on the equality in the line above the Eq. 16? \n\nQ4. Misspelled \"Theorm 3\" below Eq. 10 in the main text."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission2473/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2473/Reviewer_iVGn",
                    "ICLR.cc/2024/Conference/Submission2473/Senior_Area_Chairs"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2473/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698309333535,
        "cdate": 1698309333535,
        "tmdate": 1700726842840,
        "mdate": 1700726842840,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "EdnjvCgXAy",
        "forum": "voVjW1PT2c",
        "replyto": "voVjW1PT2c",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2473/Reviewer_aAfD"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2473/Reviewer_aAfD"
        ],
        "content": {
            "summary": {
                "value": "Constrained by limited access to auxiliary outliers and the high cost of data collection, the authors propose Provable Mixup Outlier (ProMix), a simple yet practical approach that utilizes mixup to enhance auxiliary outlier diversity. By training with these diverse outliers, the proposed method achieves superior OOD detection. The authors also provide insightful theoretical analysis to verify that the proposed method achieves better performance than prior works."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The paper is written well and is easy to understand.\n2. The studied problem is very important.\n3. The results seem to outperform state-of-the-art."
            },
            "weaknesses": {
                "value": "1. The authors are suggested to be more careful and rigorous with the theoretical terms used in the paper, such as the \"generalization risk\" is not rigorous in theory.\n2. What are the assumptions made in theory? It is better to add more discussions on them and the validity of making the assumptions. \n3. For theorem 2, did the authors consider the sample complexity of both the vanilla auxiliary outlier set and the diverse outlier set? The sample complexity and model complexity should play an important role in the bound during analysis for these two cases.\n4. For theorem 3, I am curious how well the h_mix compared with the predictor h_div. \n5. It is still not intuitively making sense to me why does mixup can create diverse outlier examples. It will not change the data distribution much since it is only doing the interpolation work. What if the auxiliary outlier set is very constrained in the convex high-dimensional input space, would mixup increase the diversity of the outlier set significantly?\n6. If possible, the authors are encouraged to provide empirical evidence on large-scale benchmarks. The current setting does not seem to suggest the diversity will create a performance improvement significantly."
            },
            "questions": {
                "value": "see above"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2473/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698534561241,
        "cdate": 1698534561241,
        "tmdate": 1699636183627,
        "mdate": 1699636183627,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "ZT493auVke",
        "forum": "voVjW1PT2c",
        "replyto": "voVjW1PT2c",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2473/Reviewer_pfu4"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2473/Reviewer_pfu4"
        ],
        "content": {
            "summary": {
                "value": "This work aims to address the challenges in OOD detection, particularly the limitation of current detectors to generalize from the distribution of auxiliary outliers. The authors introduce Provable Mixup Outlier (ProMix), using Mixup to increase the diversity of auxiliary outliers, with insightful theoretical analysis, leading to enhanced OOD detection. Evaluations on benchmarks like CIFAR-10 and CIFAR-100 indicate improved performance over existing techniques."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The paper is well-structured, making it reader-friendly and easy to follow.\n\n2. The theoretical analysis constructed for Mixup is both enlightening and insightful.\n\n3. Extensive ablation studies were conducted, showcasing various experiment setups and results."
            },
            "weaknesses": {
                "value": "1, Novelty Concerns: Applying mixup for OOD detection is not new. Many other works have explored this concept previously [1][2][3].\n\n2. The minor modification the authors propose to the original Mixup (explicitly using the existing model and selecting Mixup outliers with lower OOD scores) lacks clarity in its effectiveness. There doesn't seem to be theoretical justification or ablation studies to validate the efficacy of the modification.\n\n3. The auxiliary dataset used for training is a downsampled version of ImageNet. Compared to the utilized ID datasets CIFAR-10 and CIFAR-100, its diversity seems significantly higher. Therefore, the OOD detection performance gains achieved with such an auxiliary dataset might not be wholly convincing, even though the methods authors compared against also adopt this approach.\n\n4. I’m a little concerned about the performance of Mixup on OOD detection for high-resolution datasets, such as those in [4], especially when using 224x224 ImageNet as the ID dataset.\n\n\n[1] INTRA-CLASS MIXUP FOR OUT-OF-DISTRIBUTION DETECTION\n\n[2] CutMix: Regularization Strategy to Train Strong Classifiers with Localizable Features\n\n[3] MixOOD: Improving Out-of-distribution Detection with Enhanced Data Mixup\n\n[4] OpenOOD: Benchmarking Generalized"
            },
            "questions": {
                "value": "Please see Weaknesses above."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "N/A"
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2473/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698656291108,
        "cdate": 1698656291108,
        "tmdate": 1699636183559,
        "mdate": 1699636183559,
        "license": "CC BY 4.0",
        "version": 2
    }
]