[
    {
        "id": "7H45lGXcLF",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission897/Reviewer_uKaT"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission897/Reviewer_uKaT"
        ],
        "forum": "vxzRcFd837",
        "replyto": "vxzRcFd837",
        "content": {
            "summary": {
                "value": "In this paper, the authors introduce instance-dependent CLL (IDCLL), where non-ground-truth labels that are less relevant to the instances are more likely to be selected as the complementary ones. To address this problem, the authors introduce CLML to enhance the share of complementary labels, and additionally propose COVR as the surrogate loss."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1.\tThe setting studied in this paper is interesting and useful.\n2.\tThe experimental results justify the effectiveness of the proposed algorithm."
            },
            "weaknesses": {
                "value": "1.\tThe authors explain that the reason for bad performance of existing methods in IDCLL is “The sparser complementary label distribution under instance-dependent settings diminishes the capacity of existing CLL methods to effectively share complementary labels, resulting in small logit margin losses and making it challenging to disambiguate for the potential ground-truth labels.” I think this is somehow the observation. The authors try to justify this point by some empirical studies, which I think is not convincing. It would be better if the authors can reveal the intrinsic reason from the aspect of complementary label generation which is related to groundtruth label, namely starting from p(\\bar{Y}=\\bar{y}|Y=y, X=x). For example, the authors found that the sparser complementary label distribution will appear under IDCLL. But why? Maybe it is related to the label generation probability. In other words, I think the authors should make more insightful investigations on this setting.\n2.\tAlthough the proposed loss function is new for CLL, it is actually a very straightforward adaptation from (Ishida et al., 2017). Considering that there have been intensive researches on instance-dependent settings in other problems (e.g., label noise, semi-supervised learning, PU learning, etc.), and similar loss has been developed. I think the proposed loss in this paper is not that interesting nor sufficiently novel.  \n3.\tThe writing of this paper needs improvement. For example, in abstract, I cannot fully understand “capacity to share complementary labels”. Why sharing complementary labels? Who will share these labels? with whom?\n4.\tThe experiments are only conducted on some synthetic datasets. It would be better if the authors can find some benchmark datasets that naturally follow the setting of IDCLL."
            },
            "questions": {
                "value": "I do not have specific questions on this paper."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission897/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1697269668385,
        "cdate": 1697269668385,
        "tmdate": 1699636016488,
        "mdate": 1699636016488,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "CoRfQ3nRtl",
        "forum": "vxzRcFd837",
        "replyto": "vxzRcFd837",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission897/Reviewer_dowv"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission897/Reviewer_dowv"
        ],
        "content": {
            "summary": {
                "value": "This paper introduces instance-dependent CLL (IDCLL), where non-ground-truth labels less relevant to the instances are selected as the complementary ones, which is said to be different from the previous CLL methods that the complementary label is sampled uniformly from all non-ground-truth labels, or from a biased probability depending on the ground-truth label. Further, it empirically demonstrates that existing methods perform bad under the instance-dependent setting, thus introduce complementary logit margin loss (CLML), and the complementary one-vs-the-rest loss (COVR) as the surrogate loss for CLML as well. Experiments on benchmark datasets verify its effectiveness."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "This paper introduces a new instance-dependent CLL (IDCLL), which is different from the previous CLL settings, and attempt to demostate that the previous methods cannot work. Moveover, it proposes a new complementary logit margin loss (CLML) to solve it."
            },
            "weaknesses": {
                "value": "This paper attempts to demostate that the previous methods cannot work.  Why the complementary label distribution under the instance-dependent setting is sparse need more explain. This paper revises the logit margin loss (LML) to complementary logit margin loss (CLML), if it is indeed benifit to the correct classification? Moreover,  there is no comparison with more recent methods in the experiments."
            },
            "questions": {
                "value": "1.\tIt is said that an annotator tends to choose a label that is largely irrelevant to the instance to avoid mistaking the ground-truth label as the complementary one. Is the “irrelevant” non-ground-truth label consistent with the classifier prediction? \n2.\tIf the complementary label is the most irrelevant one to instance, then nearby instances are more likely to share the same complementary label then uniform ones, why the complementary label distribution under the instance-dependent setting is sparse? There should be more explain.\n3.\tThis paper revises the logit margin loss (LML) to complementary logit margin loss (CLML), which enlarges the margin between complementary label and the other labels, in this case, the model will assign the instance to complementary label with smaller probability, or misclassifies instance to the complementary label with smaller probability. However, does it have influence to the marge between ground-truth label and others? Or why it benefits the correct classification?\n4.\tIn experiments, the proposed method is compared with the SOTA methods in instance-dependent CLL (IDCLL) setting, what about the other settings? \n5.\tMoreover, it is suggested to compared with more recent methods in the current two years."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission897/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698500074299,
        "cdate": 1698500074299,
        "tmdate": 1699636016365,
        "mdate": 1699636016365,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "xEaO1PigpA",
        "forum": "vxzRcFd837",
        "replyto": "vxzRcFd837",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission897/Reviewer_8ujZ"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission897/Reviewer_8ujZ"
        ],
        "content": {
            "summary": {
                "value": "This manuscript designs a loss for complementary label learning under the setting of instance-dependent complementary labels."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The CLL is interesting and the writing is easy to follow."
            },
            "weaknesses": {
                "value": "The methods compared in this paper are too old, even a little bit out of date. I am afraid that most of the state-of-the-art\nmethods are not included.\n\nIn Eq.(10), I would like to see the effect of replacing the loss \\ell(z) with MSC or CCE.\n\nSince cll is a special case of pll, methods' comparison should contains the state-of-the-art pll methods."
            },
            "questions": {
                "value": "``Existing methods exhibit a decline in their capacity to share complementary labels under the instance-dependent setting, resulting in small logit margins, thus difficult to identify ground-truth labels.'' Is there some evidence to verify this opinion? It will be more convincing if the authors can provide more analysis.\n\n``Existing CLL methods assume that the complementary label is sampled uniformly from all non-groundtruth labels, or from a biased probability depending on the ground-truth label. However, these assumptions are normally unrealistic, for example, an annotator tends to choose a label that is largely irrelevant to the instance to avoid mistaking the ground-truth label as the complementary one.'' In my view, an annotator always selecting a label largely irrelevant to the instance is unrealistic, in other words, an annotator why not select the ground truth label instead of such a complementary label since it takes the same time-consuming."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission897/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698768041906,
        "cdate": 1698768041906,
        "tmdate": 1699636016260,
        "mdate": 1699636016260,
        "license": "CC BY 4.0",
        "version": 2
    }
]