[
    {
        "id": "3Xj1mBYKzU",
        "forum": "WR9M6AA4LT",
        "replyto": "WR9M6AA4LT",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5757/Reviewer_BbBg"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5757/Reviewer_BbBg"
        ],
        "content": {
            "summary": {
                "value": "The paper studies the problem of using score matching to learn the probability distribution in energy-based models.\nIn energy-based models, when we learn the probability distribution, we often encounter an intractable normalizing factor.\nTo avoid this intractable factor, one can use score matching instead.\nHowever, score matching can be statistically less efficient.\nThis paper works on the connection between the mixing time of a broad class of continuous, time-homogeneous Markov processes with stationary distribution and generator, and the statistical efficiency of an appropriately chosen generalized score matching loss."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- The problem seems well-motivated."
            },
            "weaknesses": {
                "value": "- The presentation is fairly technical and may pose challenges for readers who are not an expert in this particular area."
            },
            "questions": {
                "value": "Note:\n- Theorem 2: What are $\\Gamma_{SM}$ and $\\Gamma_{MLE}$?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5757/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5757/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5757/Reviewer_BbBg"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5757/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698610823116,
        "cdate": 1698610823116,
        "tmdate": 1699636604362,
        "mdate": 1699636604362,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "kTwZYinlxF",
        "forum": "WR9M6AA4LT",
        "replyto": "WR9M6AA4LT",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5757/Reviewer_ufaE"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5757/Reviewer_ufaE"
        ],
        "content": {
            "summary": {
                "value": "The authors study generalized score matching loss, that uses an arbitrary linear operator instead of $\\nabla_x$ in the standard score matching objective. They generalize the result of  Koehler et al. (2022) to this setting. Concretely, they show that for a Markov process with stationary distribution $p$ proportional to $\\exp(-f(x))$ and a generator $\\mathcal{L}$ with Poincare constant $C_P$, one can choose a linear operator such that the error of the corresponding generalized score matching estimator (more precisely, the spectral norm of the covariance of limit distribution, assuming asymptotic normality) can be bounded in terms of $C_P$ and the error of MLE (more precisely, the spectral norm of the covariance of the limit distribution). In addition, they use generalized score matching with additional temperature variable for learning means of Gaussian mixtures with the same covariance matrix."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The results are new and non-trivial. The statements are clear, as well as comparison with results from prior works on score matching."
            },
            "weaknesses": {
                "value": "There are a few things that concern me. So far I'm not convinced that the paper is above the acceptance threshold. Please see the questions below."
            },
            "questions": {
                "value": "Regarding Theorem 2: Could you please explain if there is any interesting technical contribution compared to Theorem 2 in Koehler et al. (2022)? The proof looks like a straightforward generalization of their proof to your settings, or did I miss anything important?\n\nRegarding Theorem 5:\n\n1) The estimator that you use here doesn't seem to be efficiently computable, is that correct? The score matching estimator for exponential families from Koehler et al. (2022) is efficiently computable (please correct me if I'm wrong), so their motivation to study it and compare with MLE is clear to me. What is the motivation of usage of your estimator for this problem if it is not efficiently computable? \n\n2) As I understood, you are interested in the regime $K \\gg d$, so the fact that $C$ from your bound $\\Vert \\Gamma_{SM} \\Vert_{OP} \\le C \\Vert \\Gamma_{MLE}\\Vert_{OP}^2$ does not depend on $K$ is important and nice. However, as you said in the footnote, $ \\Vert \\Gamma_{MLE}\\Vert_{OP}$ may depend on $K$, so $K$ can appear in the end in the error, i.e. $\\Vert \\hat{\\mu_i} - \\mu^*_i \\Vert$ \nmay depend on $K$ even when the corresponding error for MLE doesn't. So it is not clear to me why this dependence on $K$ was important from the very beginning. \n\nIf it was really important, then it would make sense to bound not \n$\\Vert \\Gamma_{SM} \\Vert_{OP}$, but the largest diagonal entry of $\\Gamma_{SM}$ in terms of the largest diagonal entry of $\\Gamma_{MLE}$. In this case , if there is such a bound with a factor that does not depend on $K$, then it should imply a bound on $\\Vert \\hat{\\mu_i} - \\mu^*_i \\Vert$ that does not depend on $K$ (as long as corresponding errors of MLE do not depend on $K$). Is it possible to derive such a bound?\n\n3) There is no comparison with prior works on Gaussian mixtures. While you refer to some of these works in the paper, it is not immediately clear how your result is comparable with them. I think it makes sense to add such a comparison.\n\n4) Can your approach be generalized to more general mixtures of Gaussians, when not all of them have the same covariance (but, say, when all covariances have condition number bounded by $O(1)$)?\n\nAnd a minor thing:\n\nIn Definition 1, is it really fine to use linear operators between the spaces of *all* functions? E.g. in Lemma 1 you use adjoint operators and assume that the operators are between Hilbert spaces."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5757/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5757/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5757/Reviewer_ufaE"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5757/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698848755260,
        "cdate": 1698848755260,
        "tmdate": 1699636604267,
        "mdate": 1699636604267,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "I24P6y7P0U",
        "forum": "WR9M6AA4LT",
        "replyto": "WR9M6AA4LT",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5757/Reviewer_v9Ko"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5757/Reviewer_v9Ko"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a general framework for designing generalized score matching losses with good sample complexity from fast-mixing diffusions. More precisely, for a broad class of diffusions with generator $\\mathcal{L}$ and Pincare constant $C_P$, they can choose a linear operator $\\mathcal{O}$ such that  the generalized score matching loss $E[\\|\\mathcal{O} p / p - \\mathcal{O} p_{\\theta} / p_{\\theta}\\|_2^2] / 2$ has a statistical complexity that is a factor $C_P^2$ worse than that of maximum likelihood. In addition, they analyze a lifted diffusion, which introduces a new variable for temparature and provably show statistical benefits of annealing for score matching. They apply their approach to sample from Gaussian mixture distributions.Their first result generalizes that of Koehler 2022."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "The paper is well motivated and well written. It generalizes a previous paper on score matching (Koehler 2022) to generalized linear operator and correspondingly general score matching loss. The authors are also able to design a Markov chain termed CTLD based on the idea of anneling. Motivated by this chain, they are able to estimate the score function for Gaussian mixture distribution that has multiple modes and control the generalized score matching loss. The framework they propose is novel and quite interesting."
            },
            "weaknesses": {
                "value": "Several assumptions in the paper seem abit strong, and it would be good if the authors can elaborate a bit more on them. For the GMM application, it would be good to compare their result with the previous ones. Finally, I would love to see an experiment that supports their result, but the result itself is also interesting enough."
            },
            "questions": {
                "value": "1. Assumption 1 and 2 of Theorem 2 seems pretty strong. Could the authors give an example where these assumptions hold when $\\mathcal{O} \\neq \\nabla_x$ and not from CTLD? In general, how do we validate these assumptions?\n\n2. What is $\\mathcal{O}$ for CTLD? \n\n3. Maybe the authors can comment a bit on how Theorem 5 compares with the previous results, in particular, can the results of Koehler 2022 also be applied to get an upper bound?\n\n4. Can we apply generalized score matching loss to diffusion sampling? Maybe the authors can comment a bit on the feasiblity of that."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5757/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5757/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5757/Reviewer_v9Ko"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5757/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699290983790,
        "cdate": 1699290983790,
        "tmdate": 1699636604178,
        "mdate": 1699636604178,
        "license": "CC BY 4.0",
        "version": 2
    }
]