[
    {
        "id": "KHYZoQPfkD",
        "forum": "WsHaBoucSG",
        "replyto": "WsHaBoucSG",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5358/Reviewer_1ZPo"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5358/Reviewer_1ZPo"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a collaborative multi-agent navigation via emergent dialogue, where the Tourist and the Guide learn expressions aligned with both the real-world environments and task-specific dialogue intents. The proposed method enables both agents to generate and understand emergent language, and develop optimal dialogue decisions with a long-term goal of solving the task. The paper provides a real-world navigation scene with matterport3D simulator to showcase the effectiveness of the proposed method."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The authors propose a novel multi-agent reinforcement learning (RL) framework complemented by auxiliary pre-training to effectively align emergent language with both the environment and the task.\n2. Experimental results on a real-world navigation scene with matterport3D simulator to showcase the effectiveness of the proposed method."
            },
            "weaknesses": {
                "value": "1. The paper does not provide a detailed analysis of the underlying rules that the emergent language adheres to, which may limit the understanding of the method.\n2. The design of each module of the method is relatively conventional, and no particular contribution was found."
            },
            "questions": {
                "value": "Can you provide some text examples to compare the differences between the text learned from the best baseline and the method learned from your own method?\nCan you explain again what advantages the design of each module in the method has compared to the previous method?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "N/A"
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5358/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698769657787,
        "cdate": 1698769657787,
        "tmdate": 1699636540295,
        "mdate": 1699636540295,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "VhvKBPdjPP",
        "forum": "WsHaBoucSG",
        "replyto": "WsHaBoucSG",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5358/Reviewer_YMT3"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5358/Reviewer_YMT3"
        ],
        "content": {
            "summary": {
                "value": "In this paper, the authors introduce a model of communication between two agents, a Tourist and a Guide. The former must navigate an environment to reach a unknown target location following instructions provided by the latter. The Guide, without knowing the current position of the Tourist, must communicate to provide information about the path to the target position. Using two objective functions, one optimizing for Guide localization of the Tourist and one for optimizing for Tourist navigation, they report better results over previous work on two visual-language navigation datasets."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "I think the authors investigate the interesting problem of embodies agents communicating while having different roles, a follower and a guide. The lack of any human-annotation in the training process makes it for cheap method to train embodies agents and the ablation study conducted supports the modelling choices made by the authors. Furthermore, the usage of realistic datasets shows that the method can scale to natural setups and is an important step towards deploying agents in the wild. \n\nOverall, I find the only weaknesses to be in the lack of an in-depth analysis of the emergent language. (more in the following section) The only analysis shown is qualitative one and is relegated to the appendix. Although, I don't see it a fundamental requirement to accept the paper, what prevented me from giving it a higher score is the lack of a deeper analysis. \n\nFinally, provided a minor restructuring of the manuscript is done, such as moving the analysis to the main body of the paper, I am in favor of including the paper at the conference."
            },
            "weaknesses": {
                "value": "As I mentioned in the previous section, I think the major weakness of the paper is in the lack of deep analysis of the emergent language. Computing metrics of emergent languages like topographic similarity (using environment encodings and agent messages) [1] could give an idea of the structure of the agents' protocols. \n\nA minor weakness that I found is the usage of agents without any pre-encoded linguistic knowledge. Using a LLM as navigation planner, which has shown some potential [2, 3], could solve the problem of training agents that have an opaque communication protocol. \nI am thinking that your method could be used as a fine-tuning approach over existing language-aware models, keeping in mind that the language drift problem [4] should be taken into account. I'd be happy to hear the authors' opinion on this\n\n\n[1] Lazaridou et al.,  Emergence of linguistic communication from referential games with symbolic and pixel input, ICLR 2018\n\n[2] Rana et al, SayPlan: Grounding Large Language Models using 3D Scene Graphs for Scalable Robot Task Planning, CoRL 2023\n\n[3] Rajvanshi et al., SayNav: Grounding Large Language Models for Dynamic Planning to Navigation in New Environments, 2023\n\n[4] Lazardou et al., Multi-agent communication meets natural language: Synergies between functional and structural language learning, ACL 2020"
            },
            "questions": {
                "value": "- At the end of the related work section you claim: \"we also empower the oracle agent to provide instructions progressively\", how is it guaranteed that messages are sent progressively and not all at the beginning? While I'm not challenging your claim, I'm wondering whether it's backed by any analysis work or just by the nature of your sequential communication modules.\n\n- In the training setup section I don't understand why you call the two objective \"pre-training\" tasks. Aren't they used jointly to train the agents? From the paper, I don't understand, the division, if any, between pre-training and training.\n\n- Why do you choose a vocabulary size of 26? I first thought it was to draw a similarity with the English language, but I then realized by looking a figure 3b that it could be the result of an hyperparameter optimization following an ablation study. Could you please clarify?\n\n- In sec 5.5, how do you compute the reduced 2D space? Could please you provide additional details? They could easily be added to the appendix for a camera-ready version\n\n\n---------\n\nmisc/typos\n\n- In section 4.1 you mention Guest position, do you mean Tourist position?\n\n- In the related work section you mention: \"[...] has a similar setting to our work but lets the Guide describe the target position’s observation in a kind of emergent language\". I find \"a kind of emergent language\" unclear, please fix it.\n\n- Please provide a more descriptive Figure 4 caption than the rather vague \"Emergent language analysis\" \n\n- \"Language based\" in the title is probably missing a \"-\" -> Language-based\n\nAnother related paper about navigation and emergent communication is [1]. Despite their communication modules being simpler than your, I think it makes sense to include it in your section surveying the literature.\n\n[1] Patel et al., Interpretation of Emergent Communication in Heterogeneous Collaborative Embodied Agents, ICCV 2021."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5358/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698781076573,
        "cdate": 1698781076573,
        "tmdate": 1699636540083,
        "mdate": 1699636540083,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "ggXuE6BV51",
        "forum": "WsHaBoucSG",
        "replyto": "WsHaBoucSG",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5358/Reviewer_cd7K"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5358/Reviewer_cd7K"
        ],
        "content": {
            "summary": {
                "value": "This study introduces a multi-agent navigation task in which one agent, the Tourist, perceives its immediate surroundings, while the other agent, the Guide, has an overarching view of the environment but lacks knowledge of the Tourist's location. The primary objective is for the Guide to direct the Tourist to a specific destination using evolving multi-turn dialogues. The paper details an empirical study centered on developing agents that can collaborate effectively through multi-turn emergent dialogues. To exemplify this, the authors introduce a collaborative multi-agent reinforcement learning technique that enables both agents to generate and understand emergent language. This method is tested with the Matterport3D simulator."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "4 excellent"
            },
            "strengths": {
                "value": "1. The paper introduces a novel framework for emergent communication based on a vision-language navigation task.\n1. An empirical study is provided as an example. That will be used as a baseline in future studies.\n1. The reviewer believes that the task design will contribute significantly to expanding the study of emergent communication."
            },
            "weaknesses": {
                "value": "1. The paper does not sufficiently assess the quality and characteristics of the emergent language, such as its compositionality and its relation to the plan set out by the Guide.\n1. The figures contain very small text, making them hard to understand.\n1. While the main contribution seems to be the proposal of the task, a large portion of the description is dedicated to the network architecture (Section 3). The authors should provide a more intuitive explanation of the general task framework. Adding pseudocode could help potential readers grasp the proposal more effectively.\n1, The characteristics and details of the compared baseline methods in the experiments are not clear. It would be beneficial to include these descriptions in the Appendix."
            },
            "questions": {
                "value": "The most straightforward communication approach the Guide could adopt is to repeatedly send the shortest path. How does the emergent language compare with such direct communication? If this hasn't been explored, it would be worthwhile to discuss."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "N/A"
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5358/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5358/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5358/Reviewer_cd7K"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5358/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698826663386,
        "cdate": 1698826663386,
        "tmdate": 1699636539826,
        "mdate": 1699636539826,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "ZQqeCPGZWz",
        "forum": "WsHaBoucSG",
        "replyto": "WsHaBoucSG",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5358/Reviewer_oveQ"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5358/Reviewer_oveQ"
        ],
        "content": {
            "summary": {
                "value": "This paper studies how to build agents that can collaborate effectively with multi-turn emergent dialogues, it proposes a multi-agent navigation task, to guide the Tourist (the agent) to reach the target place via multi-turn dialogues. It proposes a collaborative multi-agent reinforcement learning method that enables both agents to generate and understand language, and make decisions with a long-term goal of solving the task. Empirical experiments on R2R and CVDN tasks show promising results."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. It introduces a multi-turn dialog for goal oriented navigation tasks. \n2. It proposes a multi-agent RL algorithm for the task, and shows promising results on two tasks (R2R and CVDN)."
            },
            "weaknesses": {
                "value": "Based on the motivation of this work, CVDN is a natural task for this method. It is better to show the performance on the test splits (unseen) comparing with SoTA methods, rather than only showing the val split."
            },
            "questions": {
                "value": "1. Is it possible to show the results for Test Unseen on R2R? besides the results on val seen and unseen. Similarly for CVDN dataset.\n\nMinor suggestions:\n1. Figure 2 & 3, the font is too small to read."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "N/A"
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5358/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698989497390,
        "cdate": 1698989497390,
        "tmdate": 1699636539747,
        "mdate": 1699636539747,
        "license": "CC BY 4.0",
        "version": 2
    }
]