[
    {
        "id": "hBJuqbqPnt",
        "forum": "WZu4gUGN13",
        "replyto": "WZu4gUGN13",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4317/Reviewer_eXxy"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4317/Reviewer_eXxy"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes to transfer the attributes of fluid from videos for further simulations in novel scenes. The properties shown in videos are encoded into a latent space, which is further used by pretrained probabilistic physics engine to rolloout the dynamics of fluid in unseen scenes. Experiments show the effectiveness of probabilistic simulation models over baselines as well as the superior performance of physical inference from visual observations."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "* A probabilistic simulation model with better performance than existing models.\n* The proposed method is able to transfer the properties from videos to simulate the fluid dynamics in novel scene.\n* The proposed method obtains superior performance in most cases."
            },
            "weaknesses": {
                "value": "1. Since this is a probabilistic model, the predicted dynamics may be different for different sampled feature $\\mathbf{z}_t$. Is there any reference to show the variations of predicted particle states? For example, the model would predict one sequence for multiple times and calculate the standard deviation compared with the ground truth.\n2. What's the unit of measurement in Table 3? Is it millimeter or centimeter?\n3. What's the standard deviation of the prediction errors in Table 2? For example, one scene should include several sequences. The errors may vary from sequence to seqence. What's the variation of the errors?"
            },
            "questions": {
                "value": "* In Fig 4, is it an accurate reference of the results for the phrase \"row 3-6\". It seems like the results start from row 2."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4317/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4317/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4317/Reviewer_eXxy"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4317/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698554301686,
        "cdate": 1698554301686,
        "tmdate": 1699636400305,
        "mdate": 1699636400305,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "g6iObvMMTA",
        "forum": "WZu4gUGN13",
        "replyto": "WZu4gUGN13",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4317/Reviewer_zRiM"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4317/Reviewer_zRiM"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a new learning framework to extract hidden physical properties from a single 3D video to simulate the observed fluid in new scenes. It works in a probabilistic setting with a particle-based model. A parameterized prior gets the visual observations as input and tries to approximate a 'visual posterior' obtained from a learned neural renderer. Numerical results demonstrate the effectiveness of the proposed approach in novel scene simulations and the prediction of the future behavior of the observed fluid."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "I have little background in the main areas of this publication. The overall method appears to be sophisticated, well-designed and sufficiently different from related work as far as I can judge.  The numerical experiments make a solid impression. They test different aspects of the proposed method against competitors, give promising results, ablate at least some design choices (of including stages B and C in the framework), and briefly discuss the extension from simulated to real-world experiments."
            },
            "weaknesses": {
                "value": "I found the paper very dense and extremely hard to follow for someone outside of the field (like myself). A more introductory section including a more formal (mathematical) definition of which functions with what kind of inputs and outputs are approximated by certain networks would have helped me.  Similarly, the description of the experiments and their evaluation could have been clearer including the metrics used for the evaluation (Tables 2 and 3 just say \"prediction errors\", Table 4 does not specify a metric at all, and Table 1 refers to \"average position errors on unseen fluid geometries and boundary conditions\", which I cannot understand either). Yet, such aspects might be clear to anyone more familiar with the topic. As I am neither familiar with graphics, nor with particle-based simulations, nor with learned probabilistic models, I am certainly not a good reviewer for this paper (and I informed the area chair accordingly)."
            },
            "questions": {
                "value": "I fear I'd have to invest significant extra time in reading this (but also prior) work in order to ask meaningful questions."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "1: You are unable to assess this paper and have alerted the ACs to seek an opinion from different reviewers."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4317/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698617437196,
        "cdate": 1698617437196,
        "tmdate": 1699636400218,
        "mdate": 1699636400218,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "EahjMRWYht",
        "forum": "WZu4gUGN13",
        "replyto": "WZu4gUGN13",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4317/Reviewer_QGTH"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4317/Reviewer_QGTH"
        ],
        "content": {
            "summary": {
                "value": "In this manuscript, the authors investigated a transfer learning framework for physics simulation from 3D Video. While conventional methods require known physical states to infer fluid simulation, this study has developed a framework that operates without them, relying on latent features extracted from 3D video inputs."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "I find this paper interesting and agree that getting inspiration from the concept of intuitive physics plays an essential role in the literature. In addition, modeling a model in terms of video-based processing can contribute to future research on understanding human brain mechanisms."
            },
            "weaknesses": {
                "value": "This framework includes many model processing, and it was hard for me to understand the whole structure at the first read. In particular, when I tried to understand the model architecture, I expected Figure 3 to include all the information. However,  Figure 3 lacks information about the neural renderer, and the term \"type-aware preprocessing\" is not used in the main text, leading to comprehension difficulties. Improving the connection between Figures 2 and 3 would enhance readers' understanding."
            },
            "questions": {
                "value": "I expect the authors' future direction of real-world videos. It might be beneficial to describe the current state and the challenges more in the main text in addition to the information provided in the Appendix."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4317/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4317/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4317/Reviewer_QGTH"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4317/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698762915761,
        "cdate": 1698762915761,
        "tmdate": 1699636400150,
        "mdate": 1699636400150,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "TVPIUUd5lQ",
        "forum": "WZu4gUGN13",
        "replyto": "WZu4gUGN13",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4317/Reviewer_5z4H"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4317/Reviewer_5z4H"
        ],
        "content": {
            "summary": {
                "value": "In this work, the authors model a probabilistic particle-based fluid simulator-- which they claim to be the first of its kind, to address the problem of learning inaccessible physical parameters of fluids using visual observations such as density, viscosity, pressure, and transferring these visual fluid properties to simulate new scenes with new initial and boundary conditions."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- The proposed simulator uses consecutive states/image observations to infer fluid dynamics without complete knowledge of the true physical parameters of the fluid.\n- The simulator showcases a direct benefit of inferring latent space components apart from its role in the data-generating process-- namely in terms of intuitive physical inference.\n- The authors also show real-world experiments on high-resolution images from dyed-water fluid tanks to estimate fluid positions, a challenging task due to reflection, refraction, and the need for high-fps multi-view images. \n- The proposed method can take into account the stochasticity of the underlying fluid dynamics unlike other competitive baselines, and not make fluid category-specific initialization assumptions."
            },
            "weaknesses": {
                "value": "- I am not sure about the claim of latent intuitive physics being proposed by them first, especially when similar ideas have existed in the literature on causal representation learning and other intuitive physics methods, albeit in different formats. I think this claim can be softened to say this is the first method to perform this for fluids using 3D exemplars.\n- The authors report that the initial velocities are zero for initial state estimation-- how does this tally up with the initial conditions in the particle datasets considered? Isn't a random rotation, scaling, and initial velocity applied to the initial fluid body?"
            },
            "questions": {
                "value": "- Is the zero initial state velocity a general assumption for all experiments performed? Does this correspond to $(z_{t=1}, \\tilde z_{t=1})$ being zero-initialized?\n- Why is there a difference in the type of posterior used in the pre-training and the inference stages, being particle-based and visual, respectively?\n- Why is the prior learning less prone to overfitting?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "No ethics concerns."
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4317/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698903997891,
        "cdate": 1698903997891,
        "tmdate": 1699636400056,
        "mdate": 1699636400056,
        "license": "CC BY 4.0",
        "version": 2
    }
]