[
    {
        "id": "KIsX1SVvyF",
        "forum": "X5VElAKt2s",
        "replyto": "X5VElAKt2s",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3048/Reviewer_QbwE"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3048/Reviewer_QbwE"
        ],
        "content": {
            "summary": {
                "value": "The paper introduces LoRA ensembling to improve LLMs' performance and uncertainty calibration. The core idea is to train multiple LoRA adapters and ensemble them to get more accurate and calibrated predictions, as typically shown in deep ensembling literature. Experiments results verify that LoRA ensembling improves over baseline approaches."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- The method is built on top of well-known results that model ensembles can lead to more accurate and calibrated predictions.\n- LoRA ensemble alleviates the need to finetune and update the entire model which is computationally prohibitive.\n- Experiment results show that LoRA ensemble does lead to more accurate results as well as reduced calibration error."
            },
            "weaknesses": {
                "value": "- It is rather straightforward to consider LoRA finetuning for ensembling. The technical novelty of the proposed method is a bit limited.\n- There are several relevant and stronger baselines not considered in the experiments, including calibration for in-context learning [1], and self-consistency [2], both of which shows decent improvements on prediction accuracy.\n- The current set of experiments considered is limited to multiple choice questions (predicting only a single token). While the method is indeed compatible with generative tasks, there are no such tasks considered in the experiments. The results would be more convincing with generative tasks since LLMs are commonly used for complex tasks.\n- LoRA ensemble requires finetuning datasets. However, LLMs are commonly used in zero or few-shot ways in many scenarios. How does the method perform if only a few finetuning data is available?\n\n[1] Calibrate Before Use: Improving Few-Shot Performance of Language Models. Zhao et al. 2021.\n\n[2] Self-Consistency Improves Chain of Thought Reasoning in Language Models. Wang et al. 2022."
            },
            "questions": {
                "value": "- The presentation of experiment results are scattered. It would be easier to compare different methods if they are all listed in the same table/figure. Currently, comparisons to different baselines are in separate tables/figures, making it a bit hard to read.\n- In Figure 3, 4, 5, and 6, why ECE increases as number of epoch increases? In this case, isn't the method making calibration worse by LoRA finetuning?\n- In many cases, finetuning on specific dataset can compromise the model's performance on other tasks. Does LoRA ensemble suffer the same problem?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3048/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698816621679,
        "cdate": 1698816621679,
        "tmdate": 1699636250194,
        "mdate": 1699636250194,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "wXDV7zfWvS",
        "forum": "X5VElAKt2s",
        "replyto": "X5VElAKt2s",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3048/Reviewer_o2gF"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3048/Reviewer_o2gF"
        ],
        "content": {
            "summary": {
                "value": "This conference paper discusses issues of Large Language Models (LLMs) in overconfidence and uncertainty in their predictions. To mitigate these issues, the paper proposes a new approach called LoRA ensembles, which leverages low-rank adapters and random initialization to create diverse model components. This method addresses the limitations of traditional ensemble approaches, such as excessive storage requirements and a lack of diversity in fine-tuned LLMs. The authors demonstrate the effectiveness of LoRA ensembles in improving accuracy and calibration for various reasoning tasks compared to alternative fine-tuning methods and introduce the concept of regularized LoRA ensembles to further enhance performance and address potential correlations between components. This research enables the scaling of ensemble methods to LLMs with billions of parameters, offering a promising solution for enhancing the reliability of LLM predictions in safety-critical applications like medical diagnosis, finance, and decision-making processes."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "(1) The paper is well-written and easy to understand.\n\n(2) This paper analyses potentials of LoRA ensemble with various techniques, such as regulizers, Dropout, weight decay. \n\n(3) The ablation study of LoRA with randomness is interesting."
            },
            "weaknesses": {
                "value": "(1) One major concern is the idea is very naive and straightforward. The performance improvement of deep ensemble is already well-known  to the community, and it is in no way surprising that we can combine LoRA with ensemble to improve the performance, uncertainty, etc.\n\n(2) Another concern is that no computational costs is reported in this paper. I understand the inference costs of LoRA ensemble is much lower than traditional finetuning ensemble, but it is good to demonstrate this. \n\n(3) The title in the paper doesn't exactly match the title in the openreview system.\n\n(4) Figure 7 is not easy to understand. It is better to put all variants in one figure or use tables to compare the performance of various combination of methods."
            },
            "questions": {
                "value": "Please see the above weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3048/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698960535746,
        "cdate": 1698960535746,
        "tmdate": 1699636250114,
        "mdate": 1699636250114,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "KB2XHzErfI",
        "forum": "X5VElAKt2s",
        "replyto": "X5VElAKt2s",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3048/Reviewer_zRFn"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3048/Reviewer_zRFn"
        ],
        "content": {
            "summary": {
                "value": "The paper argued ensembling LLMs is computationally challenging due to the sheer size of such models. In light of this, the authors proposed a solution to create an ensemble of models with Low-Rank Adapters (LoRA), referred to as LoRA ensembles. These ensembles are much smaller in terms of parameters and can be efficiently constructed on top of underlying pre-trained models. The results demonstrate that LoRA ensembles, when applied independently or in combination with other regularization techniques, offer improved predictive accuracy and achieve better uncertainty quantification."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- The introduction of LoRA for ensembling is a unique approach, particularly for large models like LLMs. This could be a  useful exploration of how to ensemble such massive models.\n- LoRA ensembles, whether used independently or in conjunction with other techniques, demonstrate enhancements in both prediction accuracy and the quantification of uncertainty.\n- The observation that regularization may benefit calibration over just the improvement from ensembling can hold practical value."
            },
            "weaknesses": {
                "value": "- The paper lacks a comprehensive survey of existing ensemble methods, and it does not adequately discuss or compare with related works such as [1,2,3,4,6] in the literature.\n- The focus of the paper is only on prediction ensembles, which neglects the important weight ensemble methods [1,3,4,6]. The paper argues that maintaining an ensemble of, for instance, 5 LLMs in memory can be challenging in certain scenarios. However, it's worth noting that weight ensembles require the maintenance of just one model. Recent papers adopt online ensemble methods [3] that continuously average weight parameters.\n- The concept of ensembling adapters in LLMs has been previously explored in [5], yet this prior work is neither discussed nor compared in the paper.\n- The method's evaluation is restricted to small datasets, and its scalability remains unverified. Furthermore, the absence of actual ensemble baselines is notable. For example, [1,3] employ ensemble techniques while training the model only once, which is highly relevant to the task addressed in this paper.\n\nA minor issue is the presence of a discrepancy between the title displayed on OpenReview and the actual title in the paper.\n\n[1] Deep Ensembling with No Overhead for either Training or Testing: The All-Round Blessings of Dynamic Sparsity. ICLR 2021\n\n[2] Training Independent Subnetworks for Robust Prediction. ICLR 2020\n\n[3] SWAD: Domain Generalization by Seeking Flat Minima. NeurIPS 2021\n\n[4] DNA: Domain generalization with diversified neural averaging. ICML 2022\n\n[5] AdapterSoup: Weight Averaging to Improve Generalization of Pretrained Language Models. EACL 2023\n\n[6] Averaging Weights Leads to Wider Optima and Better Generalization. UAI 2018"
            },
            "questions": {
                "value": "Please refer to the weaknesses mentioned above."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3048/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3048/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3048/Reviewer_zRFn"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3048/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698988087685,
        "cdate": 1698988087685,
        "tmdate": 1699636250030,
        "mdate": 1699636250030,
        "license": "CC BY 4.0",
        "version": 2
    }
]