[
    {
        "id": "MBfBk12FNu",
        "forum": "xiGwCVzsCi",
        "replyto": "xiGwCVzsCi",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8664/Reviewer_rqKi"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8664/Reviewer_rqKi"
        ],
        "content": {
            "summary": {
                "value": "Due to difficulty learning fair insurance prices because of inaccessible/privatized sensitive attribute data, the authors propose a multi-party training framework to achieve discrimination-free insurance pricing. In their proposed model, the insurer has access to all data except the sensitive attributes and the third party uses the transformed data from the insurer plus the sensitive information to make fair pricing predictions. The authors test their method on the Adult income dataset and compare accuracy for varied values of privacy budget."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- I like the problem the authors investigate. The authors tackle a real challenge faced during fair predictive decision-making. \n\n- The write-up is precise and consistent, and the ideas are well presented. \n\n- I like that authors theoretically and empirically investigated cases of known and unknown pi and showed results for varied privacy budgets."
            },
            "weaknesses": {
                "value": "While I think the authors did a great job laying down the proposed model, I observed some shortcomings that influenced my score. \nBelow are the observed weaknesses (and respective suggestions) and some questions. \n\n- Specific versus general models. Although the authors mention that the biggest strength of their work (especially in comparison to previous works -relatedworks) is their model working under any given loss function, in their theory and empirical work, the focus is on logistic regression. The authors (reasonably) defend this choice as a tradeoff between transparency and complexity, which makes it hard to appreciate author contributions.\n\n- Since noise levels have a significant effect on risk-LDP, I am curious about the effect of overestimating and underestimating noise on fairness and the impact on different sensitive groups, especially in the case of unevenly distributed groups.\n\n- Several challenges are associated with a multi-party framework, for example, information leakage, computation overhead, etc..  I am curious how the proposed method would be comparatively better than those settings where fairness is computed on (single-party) fully differentially private data (X,D) or where causal inference (and other methods) is used to perform fairness in the absence of sensitive attributes. \n\n- Experimental setup and results. There are other (single-party) fair decision-making with private data methods and noisy sensitive attributes that the authors could have compared their work with. Although authors show different error rates with varied privacy budgets, it would have been informative to see how the method compares to other (similar) methods. Additionally, authors say they couldn't find insurance-like data, but there are at least 50 insurance datasets on Data World (and other platforms)."
            },
            "questions": {
                "value": "Although generally, I think the authors did a great job with outlining the problem and proposed solution, I found a couple of shortcomings (questions) raised in the weakness section that influenced my score."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission8664/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission8664/Reviewer_rqKi",
                    "ICLR.cc/2024/Conference/Submission8664/Senior_Area_Chairs"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8664/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698704106777,
        "cdate": 1698704106777,
        "tmdate": 1700538760944,
        "mdate": 1700538760944,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "EowvTW7A4e",
        "forum": "xiGwCVzsCi",
        "replyto": "xiGwCVzsCi",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8664/Reviewer_BixT"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8664/Reviewer_BixT"
        ],
        "content": {
            "summary": {
                "value": "This paper studies the problem of fair pricing in insurance. The insurance industry pursues actuarial fairness, a concept distinctive from the more commonly studied algorithmic fairness, and there lacks effective methods for designing pricing models that are actuarial fair. Motivated by this research gap, this paper proposed a method to train actuarial fair models for the practical scenario where an insurer has access to non-sensitive attributes, and a trusted third-party (TTP) partner has access to the corresponding privatized sensitive attributes. The proposed training method only requires access to privatized sensitive attributes via the TTP. The authors demonstrated the validity of their method by deriving relevant statistical guarantees and showing empirical effectiveness on an income prediction task."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "This paper studied an important practical challenge of training fair ML model when the protected attributes are not readily available. The research problem has practical potentials as it is directly motivated by real-world insurance pricing. Along with the proposed algorithms, the authors provided solid theoretical results about the statistical guarantees for their performance."
            },
            "weaknesses": {
                "value": "This paper focused on ‘actuarial fairness’ definition formulated in an earlier paper. It is unclear whether this formulation is practical, and whether it is a broadly accepted formulation. Further literature review on its usage and potentials in practice will be helpful. On a related note, the term ‘actuarial fairness’ was used in the introduction paragraph without defining what it is. While I understand it was formulated later in the mathematical definition, it will be helpful to see how the insurance industry defines ‘actuarial fairness’ on the conceptual level first. \n\nI also found it difficult to pinpoint what is novel in the paper. One motivation mentioned in the beginning of the paper is that the difference between actuarial fairness and other conventional algorithmic fairness notions calls for new fair algorithms, but it is unclear why a fair algorithm designed under privacy considerations for a conventional fairness concept would not work. It seems that the difficult comes from the unavailable sensitive attribute, but this is not an issue unique to the insurance pricing application. In addition, for the derivation of theoretical results, it would be useful to know whether and how the fairness or the noise or the multi-party training flow leads to challenges."
            },
            "questions": {
                "value": "1.\tIn insurance pricing, are there any popular fairness definitions that are already used in pricing mechanisms? \n\n2.\tHow restrictive are Assumptions A and B in Section 4.3?\n\n3.\tWhat is the interpretation of noise in this context?\n\n4.\tThe algorithms consider that only the protected attributes are sensitive, hence are stored with the third party. Is it reasonable to also consider non-protected attributes (in terms of fairness) are also not readily accessible to the insurer, but need to be obtained via a third party? If so, can the algorithms be generalized?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8664/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698799334771,
        "cdate": 1698799334771,
        "tmdate": 1699637085716,
        "mdate": 1699637085716,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "tlKAJRH2wv",
        "forum": "xiGwCVzsCi",
        "replyto": "xiGwCVzsCi",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission8664/Reviewer_m8tn"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission8664/Reviewer_m8tn"
        ],
        "content": {
            "summary": {
                "value": "This paper discusses a practical method to produce 'discrimination-free prices' for a regression task with a finite number of sensitive attributes. The method essentially consists on training a separate regression model for each sensitive task, then aggregate the predictions according to some predefined (sensitive) group marginal. To introduce some measure of privacy into the model, the sensitive attributes of each sample are shared using randomized response."
            },
            "soundness": {
                "value": "1 poor"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "The method itself is exceedingly simple to implement."
            },
            "weaknesses": {
                "value": "One major concern for me is the novelty of the algorithm, since it amounts to learning a per-sensitive-group regression model and  (weighted) averaging.\n\nThe other large concern relies on the claims that the proposed algorithm is differentially private. I think the authors should specify this claim more precisely, maybe by stating that its assumed x, y are public knowledge and that the model is therefore private wrt only the sensitive attribute."
            },
            "questions": {
                "value": "What are the formal privacy guarantees for the trained model, given that the private release mechanism is applied only on the sensitive attributes and not on the entire sample."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission8664/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission8664/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission8664/Reviewer_m8tn"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission8664/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699227813477,
        "cdate": 1699227813477,
        "tmdate": 1700680677167,
        "mdate": 1700680677167,
        "license": "CC BY 4.0",
        "version": 2
    }
]