[
    {
        "id": "bJkZa2zorK",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1272/Reviewer_cGaK"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1272/Reviewer_cGaK"
        ],
        "forum": "XUzHegCq6f",
        "replyto": "XUzHegCq6f",
        "content": {
            "summary": {
                "value": "The paper presents PPE (Polyak Parameter Ensemble), a technique more commonly known as Exponential Moving Average or Stochastic Weight Average. This tackles common ensembling flaws such as training overhead, inference overhead, and high memory needs. PPE collects checkpoints along training to build an interpolated weight average, enhancing performance. They experiment with varying interpolation coefficients and evaluate the method on the CIFAR dataset as well as in the context of link prediction and multi-hop query answering tasks."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "- The work addresses weight averaging, an important technique to improve the reliability and robustness in deep learning. Works that empirically assess its benefits or theoretically understands it are valuable.\n- They use multiple datasets for evaluation and the gains are consistent."
            },
            "weaknesses": {
                "value": "- The paper doesn't introduce a new strategy. The proposed PPE is very similar to all existing weight averaging strategies, previously described in several referenced works, listed below.\n\n[Cha2021] SWAD: Domain Generalization by Seeking Flat Minima\n[Arpit2022] Ensemble of Averages: Improving Model Selection and Boosting Performance in Domain Generalization\n[Kaddour2022] Stop Wasting My Time! Saving Days of ImageNet and BERT Training with Latest Weight Averaging\n[Sanyal2022] Understanding the Effectiveness of Early Weight Averaging for Training Large Language Models\n[Li2023] Trainable Weight Averaging: Efficient Training by Optimizing Historical Solutions\n[Wortsman2022a] Robust fine-tuning of zero-shot models\n[Wortsman2022b] Model soups: averaging weights of multiple fine-tuned models improves accuracy without increasing inference time\n[Ruppert1989] Efficient estimations from a slowly convergent robbins-monro process.\n\n- The related work section appears deficient as it does not list the works above. While there's considerable discussion on dropout, several essential weight averaging strategies have been omitted.\n\n- The experimental section doesn't sufficiently compare PPE with the other weight averaging or efficient ensembling techniques (such as dropout).\n\n- The paper's contributions are not clearly stated and are not obvious. The sole contribution I can identify is applying weight averaging to new tasks like link prediction and multi-hop query answering. More generally, the introduction does not introduce sufficiently the paper."
            },
            "questions": {
                "value": "- What are the contributions of the paper, especially given that weight averaging is not new?\n- From your experiments, how does the choice of the interpolating coefficient impact the final performances?\n- Do you have any idea/intuition on why the benefits dissipate for very low embedding vector?\n- Could you discuss the similarity and difference with the concurrent work \"[Busbridge2023] How to Scale Your EMA\"?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission1272/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1272/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1272/Reviewer_cGaK"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1272/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1697138359880,
        "cdate": 1697138359880,
        "tmdate": 1699636054060,
        "mdate": 1699636054060,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "PvDRrtDxeX",
        "forum": "XUzHegCq6f",
        "replyto": "XUzHegCq6f",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1272/Reviewer_kkKM"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1272/Reviewer_kkKM"
        ],
        "content": {
            "summary": {
                "value": "This work proposes a method called Polyak Parameter Ensembles which averages the parameters of a neural network over epochs. The authors suggest several methods for aggregating weights including taking an exponential average or a simple mean. The method is compared to standard training on the tasks of link prediction and multi-hop reasoning."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "* The idea of averaging a models parameters across epochs is simple and effective.\n* The experimental results cover an extensive number of datasets with granular evaluations performed within each.\n* I have not seen this method applied to these tasks before which may provide useful empirical evidence."
            },
            "weaknesses": {
                "value": "* As far as I can tell, the proposed method is identical (or almost identical) to stochastic weight averaging [1,2] and descendants of this method. This seems to have been missed in the literature review (although, bizarrely, [1] was cited in a different context in the paper). Therefore this paper appears to be a clear reject.\n* In Fig 2 and on P 3 the author’s attempt to argue that parameters will “hover/circle” around the global optimum. This is a subtly different claim to what previous works have claimed. This is only certainly true in 1d (I.e. fig 2). In high dimensional problems it is likely possible to reach arbitrarily close to the optimum in infinite time.\n* There are several presentation issues:\n   - eqn (1) switches between $\\theta$ and w notation.\n   - eqn (6) has errors in indexing which should start at 1.\n   - $\\alpha$ should not be bold if it is a scalar. Furthermore, $\\odot$ typically denotes the Hadamard product which is not appropriate here.\n   - Several typos such as “stooping” in Sec 3.1 and “seights” in the title of App B.\n* Related work is lacking a broad context on modern deep ensemble and parameter averaging methods.\n* Results on CIFAR-10 are promised but as far as I can tell they are only included in Fig 1.\n\n\n[1] Averaging Weights Leads to Wider Optima and Better Generalization; Pavel Izmailov, Dmitry Podoprikhin, Timur Garipov, Dmitry Vetrov, Andrew Gordon Wilson; Uncertainty in Artificial Intelligence (UAI), 2018\n\n[2] There Are Many Consistent Explanations of Unlabeled Data: Why You Should Average; Ben Athiwaratkun, Marc Finzi, Pavel Izmailov, Andrew Gordon Wilson; International Conference on Learning Representations (ICLR), 2019"
            },
            "questions": {
                "value": "For any reasonable definition of an ensemble, averaging parameters throughout training doesn’t seem like a good fit. Could the authors explain in what meaningful way they view this as ensembling?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission1272/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1272/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission1272/Reviewer_kkKM"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1272/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1697816446383,
        "cdate": 1697816446383,
        "tmdate": 1699636053991,
        "mdate": 1699636053991,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "ahkILq9Ov4",
        "forum": "XUzHegCq6f",
        "replyto": "XUzHegCq6f",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1272/Reviewer_XnC1"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1272/Reviewer_XnC1"
        ],
        "content": {
            "summary": {
                "value": "The manuscript proposes an approach named PPE, by maintaining a running weighted average of the model parameters at each epoch interval, to alleviate the issues of computational overhead, increased latency, and memory requirements while improving the generalization performance.\n\nThe manuscript specifically considers knowledge graph embedding models and only evaluates the proposed methods for the link prediction task."
            },
            "soundness": {
                "value": "1 poor"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "* The manuscript studies a crucial problem in the field.\n* The method introduced in this manuscript is easy to understand.\n* Several benchmark datasets are included for the evaluation."
            },
            "weaknesses": {
                "value": "1. Limited novelty with insufficient supports\n    * Though this manuscript studies a crucial problem in the field, the proposed method is not novel.\n    * The related work does not include the recent line of research on model averaging, e.g., [1, 2, 3, 4, 5], and fails to compare with them.\n    * Only the link prediction task is evaluated.\n    * Some simple baselines, e.g., tail-averaging, t-averaging, exponential averaging, should be included.\n2. No theoretical supports/justifications can be found.\n3. Minor comments:\n    * The significance of considering the knowledge graph embedding model and the link prediction task should be explained. E.g., can we identify some unique challenges that cannot be addressed by existing solutions?\n    * Table 1 is hard to understand, and it is unclear why we need to include it.\n \n\n### Reference\n[1] Stop wasting my time! saving days of imagenet and bert training with latest weight averaging, https://arxiv.org/abs/2209.14981\n\n[2] Rethinking the inception architecture for computer vision, https://arxiv.org/abs/1512.00567\n\n[3] Model soups: averaging weights of multiple fine-tuned models improves accuracy without increasing inference time, https://arxiv.org/abs/2203.05482\n\n[4] How to Scale Your EMA, http://arxiv.org/abs/2307.13813\n\n[5] Trainable Weight Averaging: Efficient Training by Optimizing Historical Solutions, https://openreview.net/forum?id=8wbnpOJY-f"
            },
            "questions": {
                "value": "NA"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1272/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698150945201,
        "cdate": 1698150945201,
        "tmdate": 1699636053892,
        "mdate": 1699636053892,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "0bMsktOqfm",
        "forum": "XUzHegCq6f",
        "replyto": "XUzHegCq6f",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission1272/Reviewer_2Kw3"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission1272/Reviewer_2Kw3"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes Polyak Parameter Ensemble, an efficient technique for building parameter space ensembling.  It maintains an exponentially weighted average of parameters over training epochs to construct an ensemble. The weight for each ensemble component can be automatically determined using a validation set. Experiments demonstrate improvements in generalization in several knowledge graph tasks."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "The method for determining the ensembling weight is a novel and interesting contribution.\n\nThe experiment details are provided, allowing for better reproducibility."
            },
            "weaknesses": {
                "value": "- The idea of averaging over weights during training has been proposed in [1], and is already implemented in PyTorch. Although the author does discuss [1], but the discussion should be way more detailed instead of just having: \"Ensemble learning have been extensively studied in the literature (Bishop & Nasrabadi, 2006; Murphy, 2012; Huang et al., 2017; **Izmailov et al., 2018**).\"\n\n- The experiment sections lack baselines. I agree that polyak averaging style ensembling is more efficient than ensembling over multiple models. But how does it compare with methods, such as Deep Ensemble, in terms of performance?\n\n- I can find Figure. 2 online: https://coffee-g9.hatenablog.com/entry/Polyak_averaging , I believe a proper citation should be added.\n\n\n[1] Averaging Weights Leads to Wider Optima and Better Generalization; Pavel Izmailov, Dmitry Podoprikhin, Timur Garipov, Dmitry Vetrov, Andrew Gordon Wilson; Uncertainty in Artificial Intelligence (UAI), 2018"
            },
            "questions": {
                "value": "Why is the CIFAR-10 performance in Figure. 1 so poor? The test accuracy is ~60, which is far lower than the number from modern networks such as ResNet 18, which can easily achieve a test accuracy of > 80."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission1272/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698635472569,
        "cdate": 1698635472569,
        "tmdate": 1699636053800,
        "mdate": 1699636053800,
        "license": "CC BY 4.0",
        "version": 2
    }
]