[
    {
        "id": "uP9YQYTnQK",
        "forum": "XvSLWB0kfN",
        "replyto": "XvSLWB0kfN",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2782/Reviewer_VFGo"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2782/Reviewer_VFGo"
        ],
        "content": {
            "summary": {
                "value": "This paper presents an analysis of the properties of multilingual image captions produced by either humans or image captioning models. The analysis is based on the XM3600 dataset, and a collection of recently proposed models including LLaVA, BLIP2, GIT, and the Google Vertex API. Each of these models is used to generate image captions in seven languages, after which the original non-English output is translated into English using GPT-4. The analysis is broken down into looking at the complexity of the scene graph, representational diversity, linguistic diversity, and ground-truth coverage. The main claim, across all of these analyses, is that multilingual captions -- translated into English -- increase the diversity of the objects, relations, and linguistic complexity, compared to English-only captions."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "1 poor"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The idea of determining the differences and similarities between image captions in different languages is interesting. It would be useful for the community to know, from an empirical perspective, if there are interesting or noteworthy differences in the captions across sets of languages. An effort to automate this using off-the-shelf language processing tools is a worthwhile endeavour."
            },
            "weaknesses": {
                "value": "The use of machine translation systems to have a working set of data that is only in English is a major weakness of the work. There is no explanation of possibly failed attempts to use non-English parsers or text embedding. Given the lack of meaningful discussion on this part, it is unclear whether this could infact work using the non-English languages directly. \n\nThe main claims of the paper are about how different languages can be shown to express things differently. However, the only example of the differences between English and non-English text, shown in Table 16 in the Appendix, has two dubious examples of the type of diversity found in translated versions of other languages. From these examples and the comments, it looks like the non-English captions include entities that are synonymous with other English entities (see Question 2.)\n\nThe related work section neglects to discuss many years of prior work in multilingual multimodal research, including but not limited to Wang et al. CVPR 2019,  Liu et al. EMNLP 2021, Srinivasan et al. SIGIR 2021, amongst many others. The authors are encouraged to consult a recent survey on this topic: Erdem et al. JAIR 2022.\n\nWang, Xin, et al. \"Vatex: A large-scale, high-quality multilingual dataset for video-and-language research.\" Proceedings of the IEEE/CVF International Conference on Computer Vision. 2019\n\nLiu, Fangyu, et al. \"Visually Grounded Reasoning across Languages and Cultures.\" Proceedings of the 2021 Conference on Empirical Methods in Natural Language Processing. 2021.\n\nSrinivasan, Krishna, et al. \"Wit: Wikipedia-based image text dataset for multimodal multilingual machine learning.\" Proceedings of the 44th International ACM SIGIR Conference on Research and Development in Information Retrieval. 2021.\n\nErdem, Erkut, et al. \"Neural natural language generation: A survey on multilinguality, multimodality, controllability and learning.\" Journal of Artificial Intelligence Research 73 (2022): 1131-1207."
            },
            "questions": {
                "value": "1. What efforts did you make to conduct your analysis in the original languages? In Section 3.1, you write \"we require the consistent application of linguistic tools, such as parsers, which are more mature for English than other languages\".\n2. What are the main types of differences driving the differences in different non-English translated text? What types of objects or entities are being created? The examples in Table 16 are not so convincing to me: \"alleyway\" can be synonymous with \"street\", while \"screen\" can be synonymous with \"monitor\".\n3. Why did you use the GPT-4 API instead of a dedicate machine translation model, such as M2M-100 or NLLB? I could not find any justification for not using a translation model in the paper.\n4. Why are the final conclusions reliable when you have used a machine translation tool to convert the non-English text into English text?\n5. What are the actual benefits of the Google Vertex API? The paper describes that the \"outputs reflect established standards and have gone through quality checks\" but I don't understand what that is supposed to mean.\n6. How much money was spent on API calls? This would be useful for future researchers to know in attempting to reproduce your results."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission2782/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2782/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2782/Reviewer_VFGo"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2782/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698590403528,
        "cdate": 1698590403528,
        "tmdate": 1699636220680,
        "mdate": 1699636220680,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "awmLkpEdE9",
        "forum": "XvSLWB0kfN",
        "replyto": "XvSLWB0kfN",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2782/Reviewer_qG2w"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2782/Reviewer_qG2w"
        ],
        "content": {
            "summary": {
                "value": "The paper delves into an in-depth analysis of semantic concept diversity within vision-language datasets, models, and their applications, spanning a variety of languages.\n\nTo achieve this, the authors have developed metrics specifically tailored for gauging semantic coverage in image descriptions across multiple languages. Utilising these metrics, they conduct a comprehensive evaluation of various existing datasets, including those generated by models and commercial API image descriptions.\n\nThe results suggest the significant impact of language and culture on image description, revealing that individuals from different linguistic and cultural backgrounds tend to highlight distinct semantic content within images. Additionally, models trained on monolingual datasets demonstrate optimal results when tested in the same language, whereas those trained on multilingual data consistently exhibit robust performance across a diverse range of test sets. This phenomenon underscores the extent to which linguistic differences in image descriptions are internalised and reproduced by the models."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "+ The paper touches upon a pressing issue in vision-language research, that is the semantic content diversity of image descriptions in different languages. \n\n+ The paper has done a good job investigating image caption’s linguistic diversity in a comprehensive way. The metrics cover different aspects of semantic content. Existing datasets, model behaviour, and commercial API outputs are all covered in the study."
            },
            "weaknesses": {
                "value": "- Certain findings presented in the paper may be contextually constrained by the scale of the experiments conducted. For instance, in the case of the fine-tuning experiment, it is plausible that the results observed may not extrapolate seamlessly to scenarios of much larger scale, such as foundation model pretraining. Given this potential limitation, a more cautious and nuanced articulation of these conclusions might be more suitable.\n\n- Some segments of the research are founded on datasets of relatively modest size. For instance, the dataset analysis is based on 30 descriptions across two languages (English & Japanese), contributed by 10 individuals per language. This sample size may not fully encapsulate the breadth of diversity and nuance inherent to linguistic expression, potentially limiting the representativeness of the findings."
            },
            "questions": {
                "value": "* Regarding the diversity of the scene graph, I'm curious if issues in normalization could give the impression that multilingual descriptions contain more concepts. Even though you've included a step for canonicalization, can you confirm whether this process accurately aligns 100% of identical concepts? Is it possible that some concepts from multilingual sources, once translated to English, are interpreted as slightly different, leading to inflated diversity scores?\n\n* On a related note, I tend to think that translation inherently introduces linguistic diversity, as it's rarely perfectly accurate. For instance, back translation is a popular method for data augmentation, despite the expectation that the core semantic content should remain consistent. Could you address the possibility that the observed differences in your study are simply artifacts of the translation process? I understand that human evaluation was conducted for GPT-4 translations, but subtle nuances may still have been overlooked."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2782/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698822581659,
        "cdate": 1698822581659,
        "tmdate": 1699636220608,
        "mdate": 1699636220608,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "aY8WeUPDHn",
        "forum": "XvSLWB0kfN",
        "replyto": "XvSLWB0kfN",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2782/Reviewer_DPPs"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2782/Reviewer_DPPs"
        ],
        "content": {
            "summary": {
                "value": "This paper checks the hypothesis that multilingual captions of visual scenes will be more diverse than monolingual ones. This is tested both for captions produced by trained captioning models as well as with human annotators. The languages used in the study are Indo-European (en, de, fr, ru) and East Asian (zh, ja, ko). According to several metrics of caption diversity, it is indeed the case that multilingual captions are more diverse, more so for models than for humans."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "The methods used in the paper are straightforward and the presentation of methods and results easy to follow. Multiple metrics are used in an exhaustive set of experiments. A reasonably diverse set of languages is tested."
            },
            "weaknesses": {
                "value": "The paper does not have any fatal or major weaknesses. \n\nThe aspect which I found disappointing was that while the introductory sections make a big deal out of cross-cultural differences, especially between European (Western) and East Asian cultures, in the empirical part of the paper there is no in-depth analysis which would shed light on specific sources of the increase of diversity due to multilingual captions, and whether these are in line or not with the types of differences claimed in the social science literature. There is the off-hand observation about Japanese captions mentioning more background objects than American ones: but much more could be done here.\n\nMinor: \"linguistic diversity\" doesn't seem to have all that much to do with linguistic information: it's more about psychological attributes."
            },
            "questions": {
                "value": "There seems to be a bit of a confusion regarding the reason from scene descriptions being different in different languages. In the paper you focus on the claim that \"visual perception\" differs between cultures. However it could also be the case (and it's even more plausible) that *perception* itself is relatively constant, but what people *choose to mention* when describing what they perceive is different. What exactly is your claim here?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2782/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698832219413,
        "cdate": 1698832219413,
        "tmdate": 1699636220513,
        "mdate": 1699636220513,
        "license": "CC BY 4.0",
        "version": 2
    }
]