[
    {
        "id": "anLJXOnJUO",
        "forum": "xwZhyKynCB",
        "replyto": "xwZhyKynCB",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4868/Reviewer_LSNr"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4868/Reviewer_LSNr"
        ],
        "content": {
            "summary": {
                "value": "The authors propose a framework for generating existential first-order\nqueries over knowledge graphs, which considers different parameters\nthat make queries harder or easier to evaluate (for example, being\neither graph-shaped or tree-shaped). Besides, they use this framework\nto compare existing complex query answering models, shedding light on\nthe sources of the hardness of existential first-order queries over\nknowledge graphs."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "* The development of methods to compare complex query answering models\n  over knowledge graphs is important. This paper contributes by\n  proposing a comprehensive approach to generate existential\n  first-order queries over knowledge graphs, significantly expanding\n  the benchmarks for such comparisons."
            },
            "weaknesses": {
                "value": "* The presentation of the paper needs to be improved. \n\n* The treatment of parameters upon which the difficulty of conjunctive\n  query evaluation depends is somewhat superficial. Much research on\n  this topic has been conducted in databases, but the authors do not\n  take this into consideration."
            },
            "questions": {
                "value": "(1) The presentation of the paper needs to be improved. In particular,\nsome definitions need to be clarified.\n\n- Definition 4: Consider the formula $P(x) \\wedge \\exists x R(x,y)$. In\n  this case, both $x$ and $y$ are free variables, although only $y$ is\n  considered free according to the definition in the paper. This may\n  seem like a minor point, but the correct definition of this notion\n  is necessary when considering a logic with a bounded number of\n  variables, which is a standard way to construct fragments of\n  first-order logic with tractable query evaluation.\n\n- Paragraph after Definition 9: The authors claim the following:\n  \"... the inference of existential formulas is easier than solving\n  CSP instances since the existential variables do not need to be kept\n  track of\". I do not understand this claim, as the complexity of CSP\n  solving and conjunctive query evaluation is the same (both problems\n  are NP-complete).\n\n- Definition 7: What does it mean that \"$\\phi(a_1, ..., a_k)$ is True\"?\n  Where is this query evaluated? Do you assume a fixed knowledge graph\n  over which all queries are evaluated?\n\n- Definition 7: How is the semantics of negation defined under OWA? Do\n  you consider a certain answer semantics over some possible worlds\n  (otherwise no negative atoms can be inferred)? The authors use the\n  term \"$\\phi(a_1, ..., a_k)$ is True\" without defining it.\n\n- Definition 12: For an abstract query graph G, a grounding is a\n  function I that maps G into a query graph. Do you impose any\n  restrictions on this mapping? For example, could two distinct nodes\n  with the type \"Free variable\" be mapped to the same variable? This\n  is relevant for the bottom-left graph in Figure 2, which is claimed\n  to violate Assumption 14 (this is not true if you can map both\n  yellow nodes to the same variable).\n\n- Paragraph after Assumption 15: The authors mention the following\n  \"Assumption 15 treats negation separately because of the fact that\n  for any KG, any relation r in R, there is |{ (h,t) | h,t in E,\n  (h,r,t) in KG}| << E^2\". I do not understand this notation. On the\n  left-hand side of <<, you count a number of tuples, while on the\n  right-hand side, you are considering the cross product of a set with\n  itself. Isn't this a comparison of a number with a set?\n\n\n(2) The treatment of parameters upon which the difficulty of\nconjunctive query evaluation depends is somewhat superficial. In fact,\nthe authors have made a contribution by lifting the restriction that\nconjunctive queries must be tree-shaped and by considering an approach\nto generate general graph-shaped queries. However, between trees and\ngeneral graphs, there exists a large number of structures that are\ndefined in terms of parameters which have been studied precisely to\nanalyze the complexity of query evaluation. Most notably, the authors\ncould have considered the notions of treewidth and hypertree width,\nwhich are explained in the following references:\n\nJörg Flum, Martin Grohe: Parameterized Complexity Theory. Texts in\nTheoretical Computer Science. An EATCS Series, Springer 2006.\n\nGeorg Gottlob, Gianluigi Greco, Nicola Leone, Francesco Scarcello:\nHypertree Decompositions: Questions and Answers. PODS 2016: 57-74\n\nMoreover, the following book provides a detailed view of fast\nconjunctive query evaluation:\n\nhttps://github.com/pdm-book/community\n\n\n(3) Why do you need to develop your own algorithm to compute the\nanswers to an existential formula, as described in Section 4.3? Why\ncan't you leverage the substantial body of work and existing\nimplementations for answering first-order queries?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4868/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4868/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4868/Reviewer_LSNr"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4868/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698727393204,
        "cdate": 1698727393204,
        "tmdate": 1699636470746,
        "mdate": 1699636470746,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "A8LQkQSh7z",
        "forum": "xwZhyKynCB",
        "replyto": "xwZhyKynCB",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4868/Reviewer_d2wZ"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4868/Reviewer_d2wZ"
        ],
        "content": {
            "summary": {
                "value": "This paper presents a  new framework for studying complex query answering. This framework covers a bigger family of Existential First Order (EFO) queries while previous ones only cover a subset of EFO queries. Besides, the paper introduces a new datasets that contains 741 types of query. The generated queries are several guaranteed to have high quality based on several rules. Finally, the paper implements the entire pipeline for query generation, answer sampling, model training and inference, and evaluation. The paper also includes some evaluation results of existing methods on this benchmark."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "Strengths:\n1) As far as I know, this framework covers the bigest family of EFO queries. The task is much more challenging than that of previous benchmark as they only consider a small subset of the EFO queries. I believe that this framework has enough impact in the knowledge graph reasoning community. \n2) Also, when desiging the benchmark, the authors consider both combinatorial hardness and structural hardness\n3) The paper introduces a comprehensive benchmark dataset consisting of 741 types of query with guaranteed quality."
            },
            "weaknesses": {
                "value": "1) The authors discussed some theoretical properties of EFO(k) queries, but did not provide enough insights on how to design a CQA model for the new types of queries that satisfy these properties. It would significantly increase the impact of the paper if the authors could explictly include such a section.  \n2) It is not clear how the previous model like BetaE/LogicE/ConE etc. are extended to handle cyclic and multigraph queries. These models are known to be able to only handle tree-form queries, as far as I know.\n\n**Post-rebuttal:** After reading the authors' rebuttal and the other reviews, it seems that there are some key limitations that the authors did not address during the rebuttal. Also, there are no methodological contributions or insights for designing new CQA method except a new dataset in this paper. Hence, I downgrade my rating."
            },
            "questions": {
                "value": "In Fig 3, the authors used some figures from public media. I am not sure whether the authors have the license or need to ask for a license."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "NA"
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4868/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4868/Reviewer_d2wZ",
                    "ICLR.cc/2024/Conference/Submission4868/Senior_Area_Chairs"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4868/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698744820836,
        "cdate": 1698744820836,
        "tmdate": 1700830508817,
        "mdate": 1700830508817,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "ahuoMAlUQj",
        "forum": "xwZhyKynCB",
        "replyto": "xwZhyKynCB",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4868/Reviewer_wF2V"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4868/Reviewer_wF2V"
        ],
        "content": {
            "summary": {
                "value": "The paper addresses Complex QA (space of Existential First Order Queries) on a Knowledge Graph. The question is assumed to be represented as a query graph (for first order logic e.g. \"Find a city that is located in Europe and is the capital of a country that has not held the Olympics\") with associated Answer Set for the free variables of that graph, from the KG, based on previous work.\n\nIt proposes a query graph sampling approach to generate graphs, and solve them as constraint satisfaction problems on the KG. These graph-answer pairs are provided as a dataset of 741 query types in first order logic. This I believe is used to train different learning-based methods from prior works, on the query graph to infer the answer set. The evaluation provides the Hit@10 scores for these."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. Dataset of query graphs with Answer Sets (but the quality of the grounding of the query graphs to the real world concepts is not validated in any way. It is unclear how useful the dataset is, or how meaningful the generated query graphs are in terms of real concepts).\n\n2. Heuristic approach for query graph sampling (abstract graph with fixed number of variables, then sampling entities and relations to fill it)."
            },
            "weaknesses": {
                "value": "1. Dataset of query graphs with Answer Sets built from Query graph sampling - It is not validated whether these produce meaningful query graphs when grounded to real-concepts, and how representative is this dataset for Complex QA on a KG with natural questions.\n\n2. There seem to be several key limitations - How does this help with improving Complex questions answering of natural question datasets e.g. WebQSP, Complex WebQSP. First, the approach here does not examine how natural questions from such datasets can be formulated into query graphs with any automatic methods (that are not manual, which would be critical to use this approach). Secondly, it does not suggest how the dataset can improve results on standard QA datasets like Complex WebQSP or the likes for KGQA.\n\n3. I am not clear about how the learning-based methods are relevant here. The dataset is formed by solving some version of CSP (details lacking entirely of their \"own algorithm\" in Sec 4.3), and then what is the relevance of learning based methods to embed the query graph and try to infer the answer? And this still does not connect to the complex natural question KGQA methods to produce answers for natural questions from the KG.  \n- Section 4.3 \"we develop our own algorithm following the standard solving technique of CSP, which ensures\nconsistency conditions in the first step, and do the backtracking to get the final answers in the\nsecond step\".\n\n4. Approach presentation and clarity - The whole Framework section (4.1-4.4) in the main paper is limited, and does not at all deliver what the approach is (and even if we read through the Appendix, its not presented well enough to grasp the key points of the approach at high-level but with sufficient detail). The presentation is poor with unnecessary assumptions and elaborations (unrelated to the proposed contributions) listed in the main paper, and much of the methodology in the Appendix.\n\n5. This paper is derivative \n- It extends to only 2 free variables in practice (and the extension to multiple free variables, over their prior work Yin et al 2023 seems trivial?). \n- The two assumptions they define are extraneous as they themselves suggest this cannot be checked in practice (so the contribution claim that \"Our assumption is more systematic than previous ones as shown by the example in Figure 2.\" is not useful. \n- We include the whole family of EFO1 query, many of them can not be represented by operator tree. This is based on prior work directly, so its not a contribution of this paper. In which case the only contribution seems to be the dataset with 2 free variables and the heuristics extended to sample and ground the query graphs and get its Answer set for the dataset. The usefulness and solidity of the dataset is unexplored to be clearly justifiable as useful.\n- The heuristics to sample and ground the dataset are not obvious, clear, or validated, or effectively presented."
            },
            "questions": {
                "value": "See weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "None"
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4868/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4868/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4868/Reviewer_wF2V"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4868/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698765529408,
        "cdate": 1698765529408,
        "tmdate": 1699636470550,
        "mdate": 1699636470550,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "9I5OcclLOl",
        "forum": "xwZhyKynCB",
        "replyto": "xwZhyKynCB",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4868/Reviewer_Cfvr"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4868/Reviewer_Cfvr"
        ],
        "content": {
            "summary": {
                "value": "The paper proposes a full benchmark for evaluating existential first order queries (in DNF) over knowledge graphs. The benchmark provides a way to generate data, as well as sampling over all possible abstract query types following certain parameters, such as number of variables, as long as they satisfy certain assumptions. \nI think the benchmark might prove useful, and gives us a way of sampling all kinds of queries from datasets. \nI am somewhat uncomfortable with the benchmark design for queries with several variables, as there is no justification for the choices taken by the authors: why would one try to evaluate queries with more than one free variable by means of architectures designed for unary queries? \nRegarding the score, I try to gauge the impact of this benchmark in the community in terms of its difference with standard benchmark of Ren et al. As I see it, the additional power that the authors provide is 1- more unary queries (actually all of them), and 2- support for k-ary queries. I believe this benchmark may impact future contributions in the area of neural query answering, but I don't think just adding more queries would become in an impact that merit publication in ICLR."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- benchmark appears to be working, and code is avaliable for future authors. \n- benchmark goes beyond what is currently used for papers in the area. \n- additional support for answering queries with more than one free variable, even though it is not clear that this is the direction one must go in supporting these queries."
            },
            "weaknesses": {
                "value": "- benchmark does not include ways of generating new data\n- no concern over which queries are more practical than others, results may be altered by queries that would be hard to find in practice. \n- limited impact: I consider this as an add on to complement work by Ren et al."
            },
            "questions": {
                "value": "Please clarify the rationale behind the idea of answering queries with more than 1 free variable by decomposing that queri into several unary pieces. Queries with more than one free variable have a standard interpretation, which is answering tuples, and it is not clear to me that any of the measures would be actually important in practice."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4868/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4868/Reviewer_Cfvr",
                    "ICLR.cc/2024/Conference/Submission4868/Senior_Area_Chairs"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4868/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698786470018,
        "cdate": 1698786470018,
        "tmdate": 1700755730289,
        "mdate": 1700755730289,
        "license": "CC BY 4.0",
        "version": 2
    }
]