[
    {
        "id": "uDRvnLLGEG",
        "forum": "Y3wpuxd7u9",
        "replyto": "Y3wpuxd7u9",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7332/Reviewer_zWZU"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7332/Reviewer_zWZU"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes GoLLIE, a large language model fine-tuned to follow label descriptions and few-shot examples to improve zero-shot information extraction. Key ideas include formulating tasks as Python code, regularizing training, and comprehensive evaluation on diverse IE tasks."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "* LLMs have excelled at numerous complex tasks, but underperformed in IE tasks. This paper addresses this gap, diving deep into the annotation guidelines and error analysis using an LLM approach: zero-shot learning, natural language instructions, programming language output format, and leveraging one model to tackle multiple tasks.\n* The study's thorough experiments span various IE tasks, coupled with an extensive error analysis when applying the unified model across these diverse tasks. Such detailed error analysis offers valuable insights into the model's strengths and limitations.\n* Another significant contribution is crafting prompts for intricate IE tasks. Demonstrating the model's ability to adhere to these instructions, especially given the recognized challenges of current LLMs in following complex instructions, signifies substantial effort and expertise from the IE domain."
            },
            "weaknesses": {
                "value": "* The claim of making use of “annotation guideline” may be an overstatement - this paper only considered label name, label description and few-shot examples, however, annotation guideline in IE domain are very complicated and was curated by linguists. E.g., For TACRED slot filling (https://tac.nist.gov/2015/KBP/ColdStart/guidelines/TAC_KBP_2015_Slot_Descriptions_V1.0.pdf), section 3.6 per:city_of_birth, they use “GPEs below the city level (e.g. 5 boroughs of New York City) are not valid fillers.“ as an example rule to guide annotators. The prompts proposed by this paper might not fully capture the depth of true guideline understanding.\n* The paper omits key references from the era before LLMs that discuss label descriptions and verbalization. Examples include:\n    * Zero-Shot Relation Extraction via Reading Comprehension\n    * An Empirical Study on Multiple Information Sources for Zero-Shot Fine-Grained Entity Typing\n    * Label Verbalization and Entailment for Effective Zero- and Few-Shot Relation Extraction\n\nSmall formatting issues:\n* Use ``’’ instead of ‘’’’.\n* Table 6 could be more user-friendly. Presenting exact numbers (like 10/10,000) would be clearer than percentages.\n\nPlease see more in the question section."
            },
            "questions": {
                "value": "* How does the prompt length vary in the proposed method? Translating IE tasks into Python classes might make them more accessible for LLMs, but could also significantly inflate the token count. For instance, a fine-grained entity type classification task with over 1000 entity types would result in a considerable token overhead.\n* The paper doesn't detail the human (or domain expert) effort required to craft the prompts. Given the variety of labels and tasks covered in the study, it would be beneficial to track this for subsequent research.\n\nThese are important questions that need to be answered in the updated paper."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission7332/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7332/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7332/Reviewer_zWZU"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7332/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698542820186,
        "cdate": 1698542820186,
        "tmdate": 1699636876910,
        "mdate": 1699636876910,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "yEtUdh7S1w",
        "forum": "Y3wpuxd7u9",
        "replyto": "Y3wpuxd7u9",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7332/Reviewer_xrh5"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7332/Reviewer_xrh5"
        ],
        "content": {
            "summary": {
                "value": "The paper introduces GoLLIE (Guideline-following Large Language Model for IE), a model fine-tuned to effectively utilize annotation guidelines for enhanced zero-shot results in Information Extraction tasks. A primary distinction of GoLLIE is its use of a Python code-based representation for both input and output. This method provides a clear, human-readable format, unifying the representation of various IE tasks and addressing challenges associated with traditional natural language instructions. Empirical evaluations validate GoLLIE's superior capabilities in leveraging guidelines, indicating promising directions for future research and model enhancements, including the exploration of more extensive pre-training datasets and refining its response to ambiguous labels."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. The paper presents a novel solution to the long-standing challenge where large models struggled to leverage intricate annotation guidelines inherently. Through targeted fine-tuning and a unified Python code-based representation for both input and output, it significantly improves zero-shot outcomes in IE tasks.\n\n2. The detailed error analysis provides invaluable insights into the challenges of zero-shot IE, especially when leveraging guidelines. The study methodically identifies specific issues like the ambiguity of labels, conflicts between fine-grained and coarse entities, and the repercussions of strong label preconceptions. These findings offer a valuable roadmap for subsequent research in the domain, emphasizing the need for clearer guidelines, broader fine-tuning datasets, and more specific instruction-following capabilities.\n\n3. The paper is well-written and easy to follow."
            },
            "weaknesses": {
                "value": "1. The paper's novelty appears somewhat limited as similar approaches have been explored in past research. [1] proposes a zero-shot entity typing approach that utilizes the type description available from Wikipedia to build a distributed semantic representation of the types.\n\n2. The choice of code-based prompting can potentially hinder usability for general users. Those unfamiliar with coding might find it challenging to interact with or fully leverage the model, thereby narrowing its applicability.\n\n3. The method's efficacy remains unclear due to incomplete experimental validation. Specific concerns include:\n\n   a. **Prompt Style Impact**: The rationale for using a Python code style prompt is not experimentally validated. It's untested whether natural language prompts with guidelines might yield similar outcomes. Although CodeIE validated code style prompts for OpenAI models, the necessity of this design for open-source LLMs during instruction tuning remains unproven.\n\n   b.**Prompt Sensitivity**: The paper omits experiments examining the sensitivity of prompts, leading to concerns about the method's stability. The model's performance under varying definitions, code structures, and code comment styles remains unexplored, making its robustness questionable.\n\n4. The paper lacks experiments analyzing the impact of training dataset diversity on the LLM's ability to follow unseen guidelines. It remains unclear how much data is required to achieve satisfactory performance, leaving questions about the scalability and efficiency of the approach.\n\n\n\n[1] Description-Based Zero-shot Fine-Grained Entity Typing"
            },
            "questions": {
                "value": "1. **Sampling Strategy**: Datasets differ in scale, and a naive mixture could introduce imbalance. How did the authors handle the sampling process for the datasets used in this study? Were experiments conducted to assess the effects of different sampling techniques on the results? This aspect wasn't addressed in the paper and could provide clarity on the method's robustness across varied data distributions.\n2. **Scalability with Numerous Labels**: For datasets with a large number of labels, say in the order of hundreds, the input length for your method could become substantially lengthy, leading to efficiency concerns. In such complex scenarios with multiple labels, how does the inclusion of guidelines impact the performance? This wasn't touched upon in the paper but would provide deeper insights into the method's scalability and effectiveness in real-world applications.\n3. **QLoRA vs. Full Model Fine-tuning**: The authors mentioned employing QLoRA for training, citing its superior performance over fine-tuning the entire model on zero-shot tasks and faster training speed. However, the paper lacks empirical evidence to support this. What are the relative impacts of full-parameter SFT and techniques like LoRA and QLoRA on zero-shot IE performance?\n4. **Benchmark Selection**: Many of the state-of-the-art methods used for comparison in the paper, such as UIE, appear outdated. Why weren't more recent and potentially stronger methods like USM, InstructUIE, and GPT4 considered for benchmarking?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission7332/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7332/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7332/Reviewer_xrh5"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7332/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698564997526,
        "cdate": 1698564997526,
        "tmdate": 1700449612895,
        "mdate": 1700449612895,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "4RvXjBIyqs",
        "forum": "Y3wpuxd7u9",
        "replyto": "Y3wpuxd7u9",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7332/Reviewer_bJoP"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7332/Reviewer_bJoP"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes an LLM fintuned to comply with annotation guidelines for information extraction tasks. Specifically, with a focus on NER, EE, and EAE (19 datasets in total), the task format is unified into a code style: the label class definitions as class docstrings and the candidates as a comment for the arguments.  Some regularization techniques are proposed to ensure that the model follows the guidelines and does not just learn to identify specific datasets. Experiments show that a finetuned version of Code-LLaMA achieves comparable performance compared with a naive baseline finetuned without guidelines, and beats the baseline in zero-shot settings by a large margin."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. This paper proposes to utilize the annotation guidelines to boost the performance of zero-shot information extraction. The idea is intuitive and compelling.\n2. The experimental results properly demonstrate the effectiveness of the proposed method and the bonus of the annotation guidelines.\n3. The presentation of this paper is clear, with few typos."
            },
            "weaknesses": {
                "value": "1. The motivation behind the code style and its effects are unclear. Note that incorporating the annotation guidelines in a natural language style rather than the code style is also feasible. The LLMs pretrained on codes may lack natural language understanding capabilities that are crucial to conducting IE tasks. This may result in the low performance of the baseline. The advantages may lie in the capability of generating outputs following code grammar, which mitigates the need for parsing outputs. The authors should justify the necessity of the code style and its underlying effects compared to the natural language style.\n2. The ablation studies of class order shuffling and guideline paraphrasing are missing."
            },
            "questions": {
                "value": "1. How many samples are used to supervise finetuning LLaMA?\n2. The guidelines used in this paper are specifically the basic definitions of entity/relation/event types, which should have been provided to LLMs. However, the full annotation guidelines usually cover many edge cases and may contain tens of pages. Have the authors considered incorporating more fine-grained guidelines?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission7332/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7332/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission7332/Reviewer_bJoP"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7332/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698718049329,
        "cdate": 1698718049329,
        "tmdate": 1699636876671,
        "mdate": 1699636876671,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "xYwjxxfwLU",
        "forum": "Y3wpuxd7u9",
        "replyto": "Y3wpuxd7u9",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission7332/Reviewer_y8gw"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission7332/Reviewer_y8gw"
        ],
        "content": {
            "summary": {
                "value": "This paper focuses on zero-shot information extraction. Their goal is to train a large model that can generalize well to unseen domains and datasets. They main idea is using code as the intermediate layer for all the information extraction tasks and considering annotation guidelines or additional information during pre-training or testing. This additional information makes the model to understand tasks better and therefore be able to generalize. Experiments demonstrate the potential of the proposed method."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- The performance is impressive.\n- The pre-trained model is valuable."
            },
            "weaknesses": {
                "value": "- My main concern is as follows. Although the authors try to split the datasets for training and testing based on domains. I believe that there is still a large overlap among their output spaces. For example, RAMS, which is considered as one of the training tasks, contains role label *transporter*, *vehicle*, and *place*, while WikiEvents, which is consider as one of the testing tasks, also contains those role labels. In NER tasks, I believe the same situation happens as well. This makes the setting not *truly* zero-shot because the model has already learned those concepts. The model can get improvements just because including more *in-domain* supervised training signals.\n- I think the authors should be careful when referring the state-of-the-art models. In fact, in Table 2, the reported SOTA numbers and models are not SOTA anymore."
            },
            "questions": {
                "value": "- See above."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "N/A"
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission7332/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698809514827,
        "cdate": 1698809514827,
        "tmdate": 1699636876538,
        "mdate": 1699636876538,
        "license": "CC BY 4.0",
        "version": 2
    }
]