[
    {
        "id": "vxA9czyZ11",
        "forum": "Yb5KvPkKQg",
        "replyto": "Yb5KvPkKQg",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2369/Reviewer_cCoz"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2369/Reviewer_cCoz"
        ],
        "content": {
            "summary": {
                "value": "In this paper, the authors studied the image text composed retrieval in the field of fashion, aiming to prevent the model from prematurely excluding the correct candidate results in the early retrieval stage, and improve the recall of the retrieval task. To solve this problem, this paper proposed a composed retrieval model based on multi-granularity uncertainty regularization, which models coarse-grained and fine-grained retrieval simultaneously by considering multi-granularity uncertainty. The experiments showed that compared with existing methods, the proposed model can significantly improve the retrieval accuracy. This paper has strong practical significance and clear research motivation. However, there are also some problems in writing, which need to be strengthened."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "a.\tThis paper found that in the process of image text combination query in the real world, the multi-round interaction process inevitably includes coarse-grained retrieval and fine-grained retrieval, and the traditional fine-grained metric learning method cannot meet the requirements of coarse-grained reasoning.\nb.\tIn this paper, a new multi-granularity uncertainty regularization method is proposed. By uncertainty modeling and uncertainty regularization, fine-grained and coarse-grained matching can be learned during training. By controlling noise levels, the proposed method can be reduced to one-to-one metric learning, which is an extension of the traditional method.\nc.\tIn this paper, a large number of experiments are carried out on three public data sets, and the experiments showed that the proposed method can improve the recall rate of existing methods.\nd.\tSince the proposed method is orthogonal to traditional methods, it can be combined with existing works to further improve their performance."
            },
            "weaknesses": {
                "value": "a.\tFigure 1.a and section 3.1 did not clearly explain why there is uncertainty in triplet matching, and it is recommended to give examples of situations where the description is unclear or the source image is inaccurate.\nb.\tSince this paper mainly built the network using existing works [1][2], but did not describe their implementation, it is recommended to provide a more detailed explanation of the details of the network.\nc.\tThere are some colloquial problems in the language of this paper, and some expressions need to be improved. It is suggested to polish the language.\n\nReference\n[1]\tLee S, Kim D, Han B. Cosmo: Content-style modulation for image retrieval with text feedback[C]//Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition. 2021: 802-812.\n[2]\tChen Y, Gong S, Bazzani L. Image search with text feedback by visiolinguistic attention learning[C]//Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition. 2020: 3001-3011.\n\n\nTypos and minors\nThere are non-standard punctuation marks, such as P8, the third line of \"Parameter sensitivity of the balance weight\", etc. It is recommended to check the whole paper."
            },
            "questions": {
                "value": "please see the weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission2369/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2369/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2369/Reviewer_cCoz"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2369/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698674892104,
        "cdate": 1698674892104,
        "tmdate": 1699636169545,
        "mdate": 1699636169545,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "E0AdSW2sCN",
        "forum": "Yb5KvPkKQg",
        "replyto": "Yb5KvPkKQg",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2369/Reviewer_FQ9t"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2369/Reviewer_FQ9t"
        ],
        "content": {
            "summary": {
                "value": "This paper identifies a training/test misalignment between the fine-grained metric learning and the demand on coarse-grained inference in the real-world image retrieval with text feedback. This paper introduces a new unified method to learn both fine- and coarse-grained matching during training. In particular, we leverage the uncertainty-based matching, which consists of uncertainty modeling and uncertainty regularization."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The application is interesting, matching source image and text with target image.\n2. The paper is overall well-written and easy to follow.2\n3. The designed method is reasonable.\n4. The experimental results look good."
            },
            "weaknesses": {
                "value": "1. The technical novelty and contribution are limited. It is trivial that adding noise to features can enhance the robustness. The other components in this method are trivial.\n2. The qualitative results are insufficient. The authors should provide more qualitative results, and provide in-depth analyses on the cases where the proposed method outperforms or underperforms the baselines."
            },
            "questions": {
                "value": "1. Highlight the technical contributions.\n2. Provide more qualitative results and analyses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "3: reject, not good enough"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2369/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698736495215,
        "cdate": 1698736495215,
        "tmdate": 1699636169478,
        "mdate": 1699636169478,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "Xsql52rvUx",
        "forum": "Yb5KvPkKQg",
        "replyto": "Yb5KvPkKQg",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission2369/Reviewer_oWB8"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission2369/Reviewer_oWB8"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a novel approach to simultaneously model the coarse- and fine-grained retrieval by using multi-grained uncertainty, which contains uncertainty modeling and uncertainty regularization. The corresponding experiments validate the effectiveness of the proposed method on three public datasets."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1.The authors propose a new learning strategy in this paper, which is well-written and easy to follow.\n2.This paper provides comprehensive experimental analysis and ablation discussion."
            },
            "weaknesses": {
                "value": "1.\tThe novelty is not well explained, please explain the difference from existing methods. The authors have to provide convincing proof to show why their proposed learning strategy is significantly different from the former methods. In Table 4(b), the author has provided a very simple discussion and experiment. However, it would be beneficial to include additional comparison methods and provide a more detailed discussion.\n2.\tIn the method section of this paper, it is important to highlight the unique aspects of your proposed learning strategy. While the uncertainty modeling approach presented is easy to follow, it should be acknowledged that its simplicity may also be considered a limitation in terms of novelty.\n3.\tThe comparison baseline of this paper is not sufficiently novel, consider exploring alternative methods that may be more unique. Recent three years of state-of-the-art methods should be included in the comparison experiment section to validate the effectiveness of the proposed method.\n4.\tAs mentioned, the main contribution of this paper includes three points. The description of the first contribution is not clear enough.\n5.\tThe tables in this paper are informative, but several of them require further standardization and uniformity."
            },
            "questions": {
                "value": "None"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission2369/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2369/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission2369/Reviewer_oWB8"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission2369/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698802249825,
        "cdate": 1698802249825,
        "tmdate": 1700645135580,
        "mdate": 1700645135580,
        "license": "CC BY 4.0",
        "version": 2
    }
]