[
    {
        "id": "ThITRFsJdu",
        "forum": "yeeVBMDAwy",
        "replyto": "yeeVBMDAwy",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission221/Reviewer_cv8h"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission221/Reviewer_cv8h"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes effective graph-based semi-supervised learning approaches for sparsely labeled data. To improve the accuracy, the proposed approach adds a term of the label variance to the objective function of graph-based semi-supervised learning. The paper conducted experiments to show the effectiveness of the proposed approach."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "- Graph-based semi-supervised learning is an important research problem in the field. \n- The proposed approach is simple and intuitive. \n- The theoretical properties of the proposed approach are well discussed in the paper."
            },
            "weaknesses": {
                "value": "- The compared approaches in the experiment are somewhat old.\n- Graph structures used in the experiment are unclear from the description of the paper."
            },
            "questions": {
                "value": "The paper compares V-Laplace and V-Poisson to other graph-based approaches in the experiment. However, the compared approaches are somewhat old; the most recent one was published in 2020 (POISSON). Similarly, it compares V-GPN to other GNN approaches. However, they are not state-of-the-art, although GNN is a well-studied technique. Is the proposed approach more accurate than recent approaches?\n\nAlthough k-NN graphs were used in the experiment, the detailed experimental settings are unclear from the descriptions of the paper. k-NN graphs are used in the experiment? What is the number of edges from each node? How do you set edge weight? Is the proposed approach used even if other graph structures are used besides k-NN graphs?\n\nIn the datasets used in the experiment, it seems that labels evenly exist. Could you tell me whether the proposed approach is useful for labels of screwed distribution? Please tell me whether the proposed approach is more accurate than other approaches even if labels do not sparsely exist (i.e., we have plenty of labels)? In addition, how do you determine the number of iterations in the proposed approach?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission221/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission221/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission221/Reviewer_cv8h"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission221/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698389151140,
        "cdate": 1698389151140,
        "tmdate": 1700789566111,
        "mdate": 1700789566111,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "HMrdZW3bvw",
        "forum": "yeeVBMDAwy",
        "replyto": "yeeVBMDAwy",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission221/Reviewer_JXpL"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission221/Reviewer_JXpL"
        ],
        "content": {
            "summary": {
                "value": "The paper introduces a graph-based transductive semi-supervised learning method, which modifies Laplace and Poisson learning techniques by incorporating a variance-enlarged term for regularization. The authors present algorithms for these 'variance-enlarged' learning methods. Additionally, they propose a novel message passing layer with attention for Graph Neural Networks (GNNs) to enhance label variance, based on the 'label propagation' step of their algorithms. These contributions are tested in scenarios with limited labeled data and compare favorably against other methods.\n\nOn the theoretical front, the paper explores both discrete and variational cases. In the discrete case, the variance enlarged approach corresponds to a reduction of the edge-weights, which, under certain conditions, strengthens connections between nodes of the same class and weakens those between nodes of different classes. In the variational case, the minimizer of theoptimization problem is expressed as the solution of a PDE."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- The paper is well written.\n  \n- The paper presents a variety of contributions of theoretical and practical nature.\n  \n- The proposed algorithms are simple yet effective as shown in the experiments section."
            },
            "weaknesses": {
                "value": "I suspect Lemma 4.1 could have an error and therefore all proofs that derive from it. See questions."
            },
            "questions": {
                "value": "1. **Iterative vs. Linear Solution:**\n   \n   - In Algorithm 1, you've chosen an iterative approach for solving V-Laplace Learning. However, the conventional Laplace learning approach can be solved directly through a linear system ([1,2]). I'm curious if your method could also utilize a linear system solution. Is there a specific reason for the iterative approach? Is it faster?\n\n2. **Relation to Previous Work:**\n   \n   - In [2], Laplace learning was associated with the probability of sampling a spanning forest that separates the seeds. Do you think your approach could also have a similar interpretation in this context?\n\n3. **Consideration of Directed Graphs:**\n   \n   - As far as I understand, your approach does not consider directed graphs. Does your approach and the theoretical insights extend to the directed case as well?\n\n4. **Convergence Dependency on Parameters:**\n   \n   - I'm interested in understanding how the convergence of your algorithms is influenced by the value of $\\lambda$. Could you shed some light on this relationship?\n\n5. **Clarification on Lemma 4.1:**\n   \n   - In the final step of Lemma 4.1, it seems that the sum of $q_j$ is factored out of the norm. However, this step isn't clear to me. Could you provide a more explicit explanation of how this is done? To illustrate, if I consider $(u_1,u_2)=(0.5,1)$, $(q_1,q_2)=(0.5,0.5)$, $\\lambda=1$ and $w_{12}=w_{21}=1$, the equation doesn't seem to balance. The right term of the inequality is equal to \n$\\sum_i^n\\sum_j^n(w_{ij}-\\lambda q_iq_j)||u(x_i)-u(x_j)||_2^2=$ \n\n$=2\\left((w_{12}-\\lambda q_1q_2)(u_1-u_2)^2\\right)=2\\left((1-0.5^2)(0.5-1)^2\\right)=0.375$\n\nWhile the left term is equal to\n\n$\\sum_i^n\\sum_j^n(w_{ij})||u(x_i)-u(x_j)||_2^2-\\lambda\\sum_i^nq_i\\left|\\left|u(x_i)-\\sum_j^nq_ju(x_j)\\right|\\right|^2_2=$\n\n$=2\\left(w_{12}(u_1-u_2)^2\\right)-\\left(q_1\\left(u_1-\\left(q_1u_1+q_2u_2\\right)\\right)^2+q_2\\left(u_2-\\left(q_1u_1+q_2u_2\\right)\\right)^2\\right)=$\n$=2\\cdot0.5^2-\\left(0.5\\left(0.5-\\left(0.5\\cdot0.5+0.5\\cdot 1\\right)\\right)^2+0.5\\left(1-\\left(0.5\\cdot0.5+0.5\\cdot 1\\right)\\right)^2\\right)\\\\\n     =0.4375$\n\nThis clarification is crucial as Theorem 3.1 and Proposition 4.3 depend on this Lemma.\n\n6. **Typos**:\n   \n   - In proposition 4.3 references Theorem 4.1. It should be Lemma 4.1.\n   \n   - Table 7  does not contain the accuracies for the V-Poisson method. \n   \n   - Table 5 and 6 do not contain any clarification regarding the meaning of the bold values.\n\n[1] Grady, \"Random Walks for Image Segmentation\" (2006)\n\n[2] Fita Sanmartin et al. “Probabilistic Watershed: Sampling all spanning forests for seeded segmentation and semi-supervised learning” (2019)"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission221/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission221/Reviewer_JXpL",
                    "ICLR.cc/2024/Conference/Submission221/Senior_Area_Chairs"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission221/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698485768069,
        "cdate": 1698485768069,
        "tmdate": 1700653638409,
        "mdate": 1700653638409,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "ORCQPGsVEL",
        "forum": "yeeVBMDAwy",
        "replyto": "yeeVBMDAwy",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission221/Reviewer_CApx"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission221/Reviewer_CApx"
        ],
        "content": {
            "summary": {
                "value": "This paper addresses the issue of traditional graph-based semi-supervised learning leading to degenerate solutions when labeled data is extremely sparse. It introduces VPL, which mitigates this problem by increasing the variance of predictions for unlabeled data. Furthermore, based on classical Laplace learning and Poisson learning, the paper proposes V-Laplace and V-Poisson as improvements. Extensive experiments have demonstrated the effectiveness of these approaches."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- This paper provides an overview of classical graph-based semi-supervised learning tasks, and the proposed idea, while simple, is highly effective. Its parameter-free nature makes it more appealing.\n- The writing in this paper is of excellent quality, and the motivation and introduction of the proposed method are presented in a clear and easily understandable manner.\n- This paper provides a thorough and reliable theoretical analysis.\n- In addition to the general graph-based SSL methods like Laplace Learning, this paper also extends to GNN-based method and proposes V-GPN."
            },
            "weaknesses": {
                "value": "- Disclaimer: I am familiar with GNN-based semi-supervised learning and have knowledge of Laplace Learning and Poisson Learning, but I am not familiar with their applications in non-graph structured data. I noticed that the experiments primarily focus on datasets like (Fashion) MNIST and CIFAR-10. It would be beneficial to expand the experiments to larger datasets, such as ImageNet.\n- Typos: e.g., lambda in the caption of Figure 1.\n\nMy other concern is the practical value of such graph-based (parameter-free) semi-supervised learning methods. As shown in Table 2 and Table 3, despite significant improvements over the baselines, the accuracy of the proposed method still falls short of being satisfactory. To my knowledge, parameterized models like ResNet and ViT-based self-supervised learning methods tend to perform better in cases of label sparsity. Therefore, in resource-abundant scenarios, it seems that having a parameter-free model with relatively poorer performance may not be very meaningful."
            },
            "questions": {
                "value": "I hope the authors can answer the last point in Weaknesses, and I am glad to raise my score if my concern can be addressed."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission221/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission221/Reviewer_CApx",
                    "ICLR.cc/2024/Conference/Submission221/Senior_Area_Chairs"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission221/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698736007176,
        "cdate": 1698736007176,
        "tmdate": 1700726355621,
        "mdate": 1700726355621,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "Gs5NSnG2pW",
        "forum": "yeeVBMDAwy",
        "replyto": "yeeVBMDAwy",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission221/Reviewer_HipA"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission221/Reviewer_HipA"
        ],
        "content": {
            "summary": {
                "value": "Semi-supervised learning (SSL) aims to leverage a vast amount of freely available unlabeled data alongside a small sample of expensive labeled data to improve the classification performance of a learnt model. Graph SSL techniques are a popular class of approaches where by constructing a graph with data points nodes and relationship edges, information can be propagated across the graph to make predictions on unlabeled data. A well-recognized limitation of typical Graph SSL techniques is the problem of degenerate solutions where, when the labeled sample is sparse, the nodes far away from any labeled sample can converge to a constant and uninformative value.\n\nThis paper proposes a simple and intuitive fix to degeneracy issue by regularizing the node values to be different from one another through a term that increases the variance between node values. Clear theoretical insights have been provided to show that, when the graph edges connect same class nodes more often than others, variance enlargement can amplify the importance of edge weights connecting vertices within the same class, while simultaneously diminishing the importance of those connecting vertices from different classes, thus leading to improved solutions.\n\nExperimental results show salient gains due to variance enlargement regularize on a variety of datasets."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "* SSL is an important problem and the paper addresses the crucial issue of node degeneracy in Graph SSL. As such, the problem is well-motivated\n* The solution is simple and intuitive and theoretical connections are provided to explain the inner workings of the proposed technique\n* Experiments are conducted on a wide range of datasets and show significant gains which demonstrates the utility of the technique"
            },
            "weaknesses": {
                "value": "* Many variants of Graph SSL have been proposed in the literature. It will be interesting to discuss the effect of variance enlargement on those also beyond V-GPN that the paper explores."
            },
            "questions": {
                "value": "Can variance enlargement help with other Graph SSL approaches besides GPN? If so, a discussion on where and why it helps and does not help, can be useful and interesting."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission221/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699169973330,
        "cdate": 1699169973330,
        "tmdate": 1699635947632,
        "mdate": 1699635947632,
        "license": "CC BY 4.0",
        "version": 2
    }
]