[
    {
        "id": "mhiqHpsTMd",
        "forum": "YHUGlwTzFB",
        "replyto": "YHUGlwTzFB",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4620/Reviewer_yeNU"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4620/Reviewer_yeNU"
        ],
        "content": {
            "summary": {
                "value": "This paper points out that achieving domain generalization is theoretically impossible without additional information. Therefore, this paper introduces active test-time-training(ATTA), combining active learning with test-time-training, and proposes an effective ATTA algorithm, SimATTA, that innovatively integrates incremental clustering and selective entropy minimization to address catastrophic forgetting and real-time active sample selection issues."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "（1）This paper innovatively combines active learning with TTA, enhancing performance across test domains. and present sample entropy balancing to avoid catastrophic forgetting.\n（2）The paper conducted extensive experiments and compared with the latest state-of-the-art methods on multiple datasets, achieving superior results.\n（3）The paper is well-organized, and it provides extensive proofs for the theorems mentioned."
            },
            "weaknesses": {
                "value": "1. In Section 3.2, the authors state that entropy is essentially a measure of the distribution distance between the model distribution and a test sample, which is not true. While entropy can provide information about the uncertainty of the model, it does not directly measure the distributional distance between the model's distribution and the test samples. This fundamental flaw casts doubt on the proposed method.\n2. Table 3 indicates that, in terms of efficiency, SimATTA takes longer than all previous methods, making it less efficient.\n3. In Appx. H.2., when B<=500, the performance of SimATTA is close to that of other methods, with no distinct advantage\n4. The ablation study is not comprehensive enough to effectively prove the efficacy of both the incremental clustering and selective entropy minimization methods."
            },
            "questions": {
                "value": "Entropy does not directly measure the distributional distance between the model's distribution and the test sample，so the theoretical foundation presented in the paper is shaky. How do you view this issue?\n\nAfter reading the rebuttal, I decided to raise my score."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission4620/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission4620/Reviewer_yeNU",
                    "ICLR.cc/2024/Conference/Submission4620/Senior_Area_Chairs"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4620/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698743928308,
        "cdate": 1698743928308,
        "tmdate": 1700806084512,
        "mdate": 1700806084512,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "d5fpjNSW7q",
        "forum": "YHUGlwTzFB",
        "replyto": "YHUGlwTzFB",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4620/Reviewer_5EyE"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4620/Reviewer_5EyE"
        ],
        "content": {
            "summary": {
                "value": "The paper titled \"Active Test-Time Adaptation: Theoretical Analyses and An Algorithm\" delves into a novel approach for machine learning models that dynamically adapt during test-time  under domain shifts. Traditionally, models rely heavily on heuristic and empirical studies without further adaptation. The authors challenge this convention by introducing a mechanism that allows the model to actively query an oracle (typically a human) during test-time to obtain labels for certain instances. The objective is to enhance the model's performance on the test set by leveraging this limited interaction with the oracle.\n\nThe primary contributions of the paper are as follows:\n\n1. Introduction of the Active Test-Time Adaptation (ATTA) framework.\n2. A novel algorithm for determining which instances should be queried from the oracle, based on their potential impact on the model's performance.\n3. Experimental validation of the ATTA framework on several benchmark datasets, demonstrating significant improvement in performance over non-adaptive baselines."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The concept of actively adapting a model during test-time based on interactions with an oracle is innovative. This breaks away from the conventional train-test paradigm, paving the way for more dynamic and adaptive models.\n\n2. The authors provide a theoretical foundation for the ATTA framework, making a compelling case for its viability and potential benefits.\n\n3. The proposed method is model-agnostic, meaning it can be applied to a wide range of machine learning algorithms, from simple linear classifiers to complex deep learning architectures.\n\n4. The extensive experiments on benchmark datasets provide strong empirical evidence supporting the effectiveness of the ATTA framework. The improvements over non-adaptive baselines are both statistically significant and practically relevant."
            },
            "weaknesses": {
                "value": "1. The ATTA framework's effectiveness hinges on the availability and accuracy of an oracle. In real-world scenarios, obtaining such an oracle (especially a human expert) might be challenging, time-consuming, or expensive.\n\n2. While the approach shows promise on benchmark datasets, its scalability to very large datasets or real-world applications remains untested. The computational overhead of deciding which instances to query and updating the model during test-time could be prohibitive in some scenarios.\n\n3. The paper assumes a limited budget of queries to the oracle. In many real-world scenarios, determining this budget or ensuring its strict adherence might be challenging.\n\n4. Continually adapting the model during test-time based on feedback from the oracle could lead to overfitting, especially if the test set is not representative of the broader data distribution."
            },
            "questions": {
                "value": "See Weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4620/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698891505642,
        "cdate": 1698891505642,
        "tmdate": 1699636441183,
        "mdate": 1699636441183,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "ZdFuEs8nqb",
        "forum": "YHUGlwTzFB",
        "replyto": "YHUGlwTzFB",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4620/Reviewer_BXz7"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4620/Reviewer_BXz7"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a novel, formal problem setting of Active Test-Time Adaptation (ATTA), which incorporates active learning to perform test-time adaptation (TTA). It attempts to mitigate distribution shifts and catastrophic forgetting, while not being provided access to source data, model parameters, or pre-collected target samples. \n\nA theoretical analysis of ATTA in the setting of binary classification is provided. First, the theory establishes a learning bound that has the notions of composition of training data, estimated distribution shift, and ideal joint hypothesis performance. Second, the fore-mentioned theory is utilized to shown that catastrophic forgetting can be mitigated by performing selective sample selection through entropy minimization. \n\nSimATTA, a practical algorithm built upon the ATTA theory, is then developed. It integrates incremental learning and selective entropy minimization techniques. Empirical evaluations on four benchmarks simulating distribution shifts demonstrate the effectiveness of SimATTA when compared to the existing work. It achieves state-of-the-art accuracy under distribution shifts while maintaining the computational complexity that is not significantly higher than that of the prior work."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "4 excellent"
            },
            "strengths": {
                "value": "$\\textbf{Novelty and significance}$:\nIn my opinion, the empirical results, especially addressing RQ1, clearly set this paper apart from previous research, paving the way to overcome distribution shifts under the TTA setting. The proposed algorithm, SimATTA, significantly surpasses the existing TTA algorithms in terms of performance accuracy under distribution shifts. It also appears to exhibit greater resilience to catastrophic forgetting. Additionally, it is supported by a robust theoretical framework.\n\n$\\textbf{Completeness and comprehensiveness}$:\nThe main manuscript and the supplementary material offer a comprehensive context and detailed information about the proposed work. Furthermore, related work addressing distribution shifts under various settings is also adequately discussed."
            },
            "weaknesses": {
                "value": "I found no major weakness from this paper. One minor aspect I would like to highlight concerns the clarity of the experimental settings, such as domain-wise data stream, random stream, post-adaptation, and so on. It took me some time to grasp all of these distinct settings. Perhaps including a dedicated section to explain about these settings would be more helpful."
            },
            "questions": {
                "value": "The “budget” term appears to be a significant factor in the algorithm. However, I’ve not been able to identify its relationship to the cluster centroid number. Could the authors please provide clarification on this matter?\n\nI’m looking forward to seeing the code implementation of SimATTA."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4620/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699405665259,
        "cdate": 1699405665259,
        "tmdate": 1699636441083,
        "mdate": 1699636441083,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "mxERJIJBMH",
        "forum": "YHUGlwTzFB",
        "replyto": "YHUGlwTzFB",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission4620/Reviewer_cDV9"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission4620/Reviewer_cDV9"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a new setting, namely ATTA (Active Test-Time Adaptation), to integrate active learning (a limited number of labeled test samples) within test-time adaptation (TTA) to enhance TTA under domain shifts. The problem itself is practically important and the paper presents a theoretical guarantee and a sound solution (SimATTA) that combines incremental clustering and entropy selection to conduct online sample selection, avoiding catastrophic forgetting issues. The simplicity of the proposed algorithm and its successful application on real datasets are commendable. A thorough empirical study (including ablations) with encouraging results (both in the paper and its supplementary material) shows the effectiveness of the approach in terms of its effectiveness and generalization performance. The paper's clear contribution to the TTA community is evident, and I recommend its acceptance."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "4 excellent"
            },
            "strengths": {
                "value": "**Originality**: The paper introduces a novel setting, active test-time adaptation (ATTA) with theoretical guarantees for alleviating distribution shifts and mitigating catastrophic forgetting and extensive experiments on several benchmarks under domain generalization shifts. Additionally, the Section FAQ & Discussions in supplementary material is highly praiseworthy.\n\n**Quality**: The paper provides a thorough experimental evaluation of the SimATTA algorithm on four datasets (PACS, VLCS, Office-Home, and Tiny-ImageNet-C). The paper also conducts ablation studies to analyze the impact of different components of SimATTA. The paper demonstrates that SimATTA can achieve superior performance and maintain efficiency.\n\n**Clarity**: The paper provides sufficient background information including theory and closely related works to situate the contribution of the ATTA setting and the SimATTA algorithm.\n\n**Significance**: The paper proposes an important and challenging setting of active test-time adaptation (ATTA) and a detailed comparison with related settings (DA/DG, TTA, ADA, ASFDA, and AOL) highlights the value of the proposed ATTA. ATTA also has many potential practical utilities such as an autopilot system and a personalized chatbot discussed in supplementary material."
            },
            "weaknesses": {
                "value": "**Insufficient visualization**: Though the authors have provided detailed algorithms (Alg. 1 and Alg. 2) to show the proposed SimATTA algorithm, it is still hard to follow the whole picture quickly. Thus it could be better to provide a clear diagram to illustrate the framework of the SimATTA algorithm.\n\n**Insufficient justifications**: For example, regarding the **efficiency** and **applicability** of ATTA, some justifications are missing in this paper. First, as shown in Tab. 3, the time cost of ATTA is around ten times than general FTTA (Tent: 68.83, EATA: 93.14, SimATTA: 736.28). The reason might be the clustering-based selection process and fully fine-tuning pre-trained models? Second, though the authors state that \"ATTA can be applied to any pre-trained models including large language models (LLMs)\", they provide no experimental results. \n\n**Inconsistent results**: results of SimATTA ($B\\le$500) in Table 2 (TTA comparisons on PACS) and Table 8 (Ablation study on PACS) are different."
            },
            "questions": {
                "value": "1. As an active sampling algorithm, how to define an informative test sample, especially on streaming data? The authors might provide some visualization results for better understanding.\n\n2. How about the cost of the ATA training set?  It seems that the SimATTA algorithm will keep a training set (the maximum size is $\\mathcal{B}$?) during the test-time adaptation, would this strategy violate the nature of test-time adaptation, i.e., real-time?\n\n3. There are many hyper-parameters in this work, such as two entropy thresholds $e_l$ and $e_h$, number of cluster centroid budget $NC(t)$, centroid increase number $k$, etc. The question is how to choose them for different datasets. In some sense, this is not the weakness/limitation of this particular paper but rather applies to the whole AL paradigm.\n\n4. It is unclear what the meaning of `steps=10` is. And what is the config of SimATTA? SimATTA (`steps=1`) or SimATTA (`steps=10`)?\n\n5. How to deal with an extreme situation in which only one sample is in a mini-batch, i.e., the batch size is 1.\n\n6. Another minor question is, why the performance of Enhanced TTA on Tiny-ImageNet-C (severity level 5) is poor? Also, why the baseline results (CLUE) on VLCS of Tab. 4 are too low, even worse than that of the Random method?\n\n7. In Section 5.2, \"randomly select labeled samples and fine-tune them with `their selected pseudo-label samples.`\" Is it a mistake?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission4620/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699437765133,
        "cdate": 1699437765133,
        "tmdate": 1699636441015,
        "mdate": 1699636441015,
        "license": "CC BY 4.0",
        "version": 2
    }
]