[
    {
        "id": "5sosZvWkuH",
        "forum": "yjX303Smre",
        "replyto": "yjX303Smre",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5988/Reviewer_ydwi"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5988/Reviewer_ydwi"
        ],
        "content": {
            "summary": {
                "value": "The paper proposes a method for learning diverse skills to solve different contexts of the same task. The method is designed to prioritize experts that are promising in different contexts. The algorithm involves training each experts in the corresponding task context and updating the joint distribution of experts and task contexts. Experimental findings indicate that this approach effectively trains experts in two robotics domains and yields a certain degree of diversity among the trained experts."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "1 poor"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The idea is interesting and could has the potential be applied in more complex domains."
            },
            "weaknesses": {
                "value": "1. The motivation behind the research is not clearly articulated. It is unclear whether the authors intend to discover diverse solutions within the same task or seek experts for all tasks/contexts.\n2. The paper lacks sufficient detail regarding the definition of the mixture of experts model, including the definition of an expert. Furthermore, the relationships between context (c), expert (o), and the parameter θ are not adequately explained.\n3. The experimental section appears to be confined to relatively simple scenarios, and the demonstrated diversity of the trained experts is limited."
            },
            "questions": {
                "value": "1. What is the goal of the method? Is it trying to discover diverse solutions or seek experts for different contexts/tasks?\n2. What is the definition of a expert and how it is executed in certain context/task."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5988/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5988/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5988/Reviewer_ydwi"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5988/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698484186877,
        "cdate": 1698484186877,
        "tmdate": 1700548713125,
        "mdate": 1700548713125,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "GvlEYTpzPh",
        "forum": "yjX303Smre",
        "replyto": "yjX303Smre",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5988/Reviewer_w2WU"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5988/Reviewer_w2WU"
        ],
        "content": {
            "summary": {
                "value": "This paper investigates the problem of learning diverse skills in contextual RL problems. It achieves so in the framework of contextual episode-based policy search and aims to learn a mixture of expert policies. It follows the previous work SVSL [Celik et al. 2022] to jointly learn a per-expert context curriculum $\\pi(c|o)$ and a context conditioned policy $\\pi(\\theta|c, o)$. The key contributions of this work is (1) using softmax-based per-expert context distribution to model the curriculum which enables validity and multi-modality of the sampled context curriculum; (2) using trust-region and PPO to stabilize the bi-level policy training. The proposed approach is compared against two baselines BBRL and SVSL on Table Tennis Env and Box Pushing Env and shown to outperform baselines."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "1. The topic of optimizing a set of expert policies with diverse strategies for the same task is beneficial to improving robustness of the robotic control and helps capture the multi-modality nature of some real-world tasks.\n\n2. The idea of achieving automatic multi-modality context curriculum learning via applying softmax on sampled context is intuitive.\n\n3. The experiments show the proposed algorithm performs better or at least similar to baseline algorithms on evaluated problems."
            },
            "weaknesses": {
                "value": "1. While the concept of the proposed technique is easy to follow, some important details are missing and it might affect the reproducibility of the proposed approach.\n\n3. The novelty over previous work seems incremental.\n\n3. More extensive evaluation are needed."
            },
            "questions": {
                "value": "1. To better understand the action space of the contextual episode-based policy, could the author give some details or examples of the concept of motion primitives and how to convert the policy parameters into the episode-wise robot action trajectory?\n\n2. Eq (3) seems to be not original from this work, a proper reference would help readers to understand the background of this line of work.\nThe derivation from Eq (4) to Eq (5) and Eq (6) is unclear. It would be more clear to have an intermediate objective which is jointly optimizing for $\\pi(\\theta|c, o)$ and $\\pi(c|o)$, and derive from there to have two separate objectives for bi-level optimization.\n\n3. In Section 3.1, it says “mapping the context $c$ to a mean vector and a covariance matrix” and “Note that in most cases a context dependent covariance matrix is not useful and introduces unnecessary complex relations.” It is confusing that whether the covariance matrix in the implementation is context dependent.\n\n4. Line 10 in Section 3.2, should “Fig. 2c” be “Fig. 2d”?\n\n5. Which terms in Eq (8) and Eq (9) accounts for encouraging the coverage of the context space by experts? From the formulation, it seems to try to learn a set of policy each of which can solve the entire task space as much as possible. The learning of policies seem to be relatively independent and is it possible to learn a set of experts whose preferred context distributions are the same.\n\n6. More testing environment description would be helpful. Some details about action space and reward definitions are missing for both tasks.\n\n7. Evaluating the algorithm on more environments will make the comparison more thorough. For example, it would be helpful to evaluate on the other tasks used in Otto et al. 2023.\n\n8. It would also helpful to show complete comparison against both SVSL and BBRL on all evaluated tasks (at least provide comparison plots in Appendix)\n\n9. Given the proposed approach is built upon SVSL with two improvements, it would be great to do ablation study on both improvement techniques.\n\n10. The multi-modality in this work is achieved by mixture of experts, however each expert is still modeled by uni-model gaussian policy. \n\n11. Recent work (Huang et al. 2023 [1]) proposes some multi-modal policy parameterization. How is the proposed approach compare to this work and can the proposed approach enhanced by the policy reparameterization from [1]?\n\n12. Is this proposed approach also applicable to step-based RL problems?\n\n[1] Huang et al, Reparameterized Policy Learning for Multimodal Trajectory Optimization."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "5: marginally below the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5988/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5988/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5988/Reviewer_w2WU"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5988/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698487562022,
        "cdate": 1698487562022,
        "tmdate": 1699636641177,
        "mdate": 1699636641177,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "zZLYkDmUOV",
        "forum": "yjX303Smre",
        "replyto": "yjX303Smre",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5988/Reviewer_vLLv"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5988/Reviewer_vLLv"
        ],
        "content": {
            "summary": {
                "value": "The paper introduces Di-SkilL, a reinforcement learning (RL) approach for training agents to exhibit multi-modal and diverse skills. The authors propose a mixture of experts (MoE) model that enables the agent to select and adapt from a repertoire of skills based on the context. The context in this work represents task definitions like goal positions or varying environmental parameters. The authors leverage energy-based models for per-expert context distributions to overcome challenges in multi-modality representation and hard discontinuities. They demonstrate the efficacy of their approach on complex robot simulation tasks."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "2 fair"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The paper addresses an important and timely challenge in RL, that of equipping agents with the ability to learn and adapt to multiple skills for a given task. The energy-based approach for representing per-expert context distributions is innovative and offers a solution to traditional Gaussian parameterization limitations. The model's design, which avoids assumptions about the environment and doesn't require prior knowledge, increases its general applicability."
            },
            "weaknesses": {
                "value": "There might be concerns regarding the scalability and computational efficiency of the proposed method, especially in real-world robotic applications. This should be discussed.\n\nRelated work discussion and baseline are not sufficient, missing other MoE methods like PMOE [1].\n\n[1] Ren, Jie, et al. \"Probabilistic mixture-of-experts for efficient deep reinforcement learning.\" arXiv preprint arXiv:2104.09122 (2021)."
            },
            "questions": {
                "value": "See Weakness."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5988/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5988/Reviewer_vLLv",
                    "ICLR.cc/2024/Conference/Submission5988/Senior_Area_Chairs"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5988/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698769999465,
        "cdate": 1698769999465,
        "tmdate": 1700644906705,
        "mdate": 1700644906705,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "xqgGzZ5akw",
        "forum": "yjX303Smre",
        "replyto": "yjX303Smre",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5988/Reviewer_BduN"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5988/Reviewer_BduN"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes an approach for acquisition of diverse skills using non-linear mixture of experts. The main ingredients of this approach are maximum-entropy objective for learning diverse experts, trust-region optimisation for stable bi-level optimisation, and energy-based models for automatic curriculum learning. Their approach demonstrates the learning of diverse skills for solving the same task."
            },
            "soundness": {
                "value": "2 fair"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- Section 3 on Diverse Skill Learning is well-written and describes the method and the contributions of the work in a clear manner, with the appropriate references to existing work in the area.\n- Figure 5 provides good qualitative evidence of diverse skills being learnt by the proposed approach.\n- The Conclusions mention a drawback of the approach in that it is unable to replan in the event of collisions, for instance. This is an important empirical detail and I liked the fact that it was raised in the paper."
            },
            "weaknesses": {
                "value": "- Automatic curriculum learning is a key ingredient of the proposed method; however, an important set of approaches in this direction has not been covered in related work, such as [1] and others in this family of approaches.\n- Figure 3-c which shows ablations on the TT environment has inconsistent number of episodic samples (X-axis) for the different approaches in the plot. It would be useful to have asymptotic performance of each of these approaches and then compare them in terms of this performance, and also in terms of training speed (eg: w/o automatic curriculum learning is slower than w/ automatic curriculum learning).\n- In Figure 4 a-b as well, it would be nice to have the asymptotic performance for Di-Skill and BBRL to have a fair comparison of performance.\n- While SVSL and BBRL are good CEPS baselines, it would also be nice to compare with a standard RL baseline such as PPO to better motivate the need for this approach.\n- Minor points:\n    - The environment description has been duplicated to some extent in the main text and the caption for Figure 4. It may help to prune that and instead include additional analysis.\n    - Section 2 Prelimanaries -> Preliminaries\n\n[1] Prioritized Level Replay. Jiang et al, 2020."
            },
            "questions": {
                "value": "- I am not sure why the prior $\\pi(o)$ has been assumed to be uniform. For sparse reward tasks, I can imagine observations that are closer to the goal would be rarer than those closer to the initial state at the beginning of the episode. Or does this paper assume full access to the simulator in which resetting to any observation is possible?\n- In the Experiments section, the paper mentions that the aim is to check whether Di-Skill is able to learn precise and diverse skills. The fact that it learns diverse skills is reasonably demonstrated in Figure 5, but I am yet to find evidence that precise skills are learnt. Could the authors please point me to that?\n- Could the authors provide any insights on the learnt $\\pi(o | c)$? Of the number of experts used, how often were they used when averaging across observations?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5988/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5988/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5988/Reviewer_BduN"
                ]
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5988/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1699184935837,
        "cdate": 1699184935837,
        "tmdate": 1700674530702,
        "mdate": 1700674530702,
        "license": "CC BY 4.0",
        "version": 2
    }
]