[
    {
        "id": "PD3WPxSOi5",
        "forum": "yZJapMWdHZ",
        "replyto": "yZJapMWdHZ",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3019/Reviewer_VX9S"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3019/Reviewer_VX9S"
        ],
        "content": {
            "summary": {
                "value": "This paper identifies the problem of equal treatment of tokens in LLM-generated text, despite variations in their relevance and representativeness due to linguistic redundancy. Existing methodologies overlook these generative inequalities, leading to biased uncertainty estimation where less semantically significant tokens receive excessive weighting. To rectify this, the proposed method, called Shifting Attention to more Relevant (SAR) components, suggests joint attention shifting at both the token and sentence levels for accurate uncertainty estimation. Extensive experiments are conducted on various LLMs, including instruction-tuned models and pretrained models, using different question-answering tasks across domains like reading comprehension, science, and medical Q&A. The experimental results, along with a demographic analysis, demonstrate SAR's superior performance in addressing the challenges of uncertainty estimation in LLMs. Overall, SAR offers a promising approach to tackle hallucinations and improve uncertainty quantification in the context of LLMs."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1.\tThe authors propose to renormalize the uncertainty scores calculated by tokens with different importance (relevance). The method is intuitive, simple yet pretty effective.\n\n2.\tThe authors first conduct experiments to verify the existence of generation inequalities, which is a relatively trivial phenomenon. However, the fact that uncertainty estimation is highly affected by the inequalities is also verified and may pose a good contribution to this area.\n\n3.\tThe experiments are comprehensive and able to prove the effectiveness of the proposed method."
            },
            "weaknesses": {
                "value": "1.\tAlthough there is stable improvement over the baseline models, it seems marginal."
            },
            "questions": {
                "value": "1. I have a minor question since I am not an expert in this area: why would the unimportant tokens pose a higher uncertainty? In Figure 1, it seems that the unimportant tokens have relatively less possibility to convey information since the model should have been pretty certain about these tokens in my understanding. However, as shown in Figure 3, this is actually the opposite since the token-level mean of UP is actually higher when the relevance is less. Could you please give an explanation for this?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3019/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3019/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3019/Reviewer_VX9S"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3019/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698790615668,
        "cdate": 1698790615668,
        "tmdate": 1699636246728,
        "mdate": 1699636246728,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "qLozgIVFa0",
        "forum": "yZJapMWdHZ",
        "replyto": "yZJapMWdHZ",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3019/Reviewer_UFP5"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3019/Reviewer_UFP5"
        ],
        "content": {
            "summary": {
                "value": "This paper studies uncertainty quantification in long-form generation in language models. While there are many methods for this now, one common method is the predictive entropy, or the log probability of the generated sentence given the prompt. However, predictive entropy assumes all tokens are equally valued when estimating the uncertainty, even though not all of them contribute to the semantics (which determines correctness). To combat this, the paper introduces SAR, which computes a weighted average of the log probability of each added token, weighted by how much each token contributes to the semantics (measured by how much the semantics change when you remove a token). The authors also experiment with a similar procedure for sentences, where the sentence-level uncertainty is measured in terms of similarity to other generated sentences. The authors find that both the token and sentence uncertainties tend to outperform existing baselines, measured by AUROC."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "* The paper presents intuitive, effective methods for uncertainty estimation; in particular, their method effectively captures the difference between what’s generated (tokens) and what we want to measure uncertainty over (semantics)\n* The paper is well-written and easy to follow throughout\n* The empirical analysis is good; in particular, their method outperforms baselines across multiple datasets and six different models."
            },
            "weaknesses": {
                "value": "* The sentSar and tokenSar methods are conceptually quite different, and don’t really make sense to package together (especially since while they are compared, sentSar requires more computation than tokenSar).\n* The sentSar method is more computationally expensive than baselines.\n* The tables in the paper are very difficult to parse; the font size is small, and presentation could be improved."
            },
            "questions": {
                "value": "* Is removal the right way to test for change in semantics (rather than just considering likely replacements)?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission3019/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3019/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission3019/Reviewer_UFP5"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3019/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698811476054,
        "cdate": 1698811476054,
        "tmdate": 1699636246619,
        "mdate": 1699636246619,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "v2I7pt0mCO",
        "forum": "yZJapMWdHZ",
        "replyto": "yZJapMWdHZ",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission3019/Reviewer_i37c"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission3019/Reviewer_i37c"
        ],
        "content": {
            "summary": {
                "value": "The authors present a new method for quantifying uncertainty in LLM outputs that involves weighting token probabilities by an estimate of the token's relative importance (\"relevance\"). This is combined with a second sentence-level uncertainty measure which adjusts a sentence's importance measure according to how similar it is to other generated sentences. When combined these uncertainty measures outperform multiple baselines across various models, and datasets, and evaluation methods."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "The presented uncertainty estimation is built up out of simple to understand pieces, and yield impressive empirical results compared to competing techniques."
            },
            "weaknesses": {
                "value": "I believe there is a typo in Equation 9. According to the definition of R_S given in Equation 4, the sum in the second line should be over $g(s_j,s_k)p(s_k|x)$ not $g(s_j,s_k)p(s_j|x)$.\n\n\"The reason we normalize relevance score in Eq. (6) is two-fold: a) to make tokens comparable within a sentence\" - this doesn't make sense, the relative token relevances are the same before and after the normalization, they're all being scaled by the same factor\n\nTable 1 is very crowded (multiple models, multiple datasets, multiple Rouge-L cutoffs, multiple baselines, multiple SAR methods). Maybe stick with just 1 RL cutoff and if you want to include the other cutoff, put it in the appendix."
            },
            "questions": {
                "value": "“The area under the receiver operator characteristic curve (AUROC) metric is equivalent to the probability that a randomly chosen correct answer has a higher uncertainty score than a randomly chosen incorrect answer.” - Shouldn’t this be the opposite? If the model’s uncertainty is high, then it implies that the model is more likely to get the answer wrong, no? I realize that this was copied from Kuhn et al, but this still seems like an important point to understand."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission3019/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698963867389,
        "cdate": 1698963867389,
        "tmdate": 1699636246539,
        "mdate": 1699636246539,
        "license": "CC BY 4.0",
        "version": 2
    }
]