[
    {
        "id": "GIhsulnZA6",
        "forum": "Z0ojN315Uf",
        "replyto": "Z0ojN315Uf",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5097/Reviewer_qWzN"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5097/Reviewer_qWzN"
        ],
        "content": {
            "summary": {
                "value": "This research paper provides a comprehensive solution called Secure Principal Component Analysis (SPCA) for differentially private principal component analysis (PCA) in vertical Federated Learning. SPCA technique introduces minimal noise to the obtained subspace while preserving differential privacy (DP) without assuming any trusted client or third party. Ensuring data privacy can be a challenge, especially when clients are adversarial. SPCA, on the other hand, ensures privacy protection for both the server and clients. The authors provide a theoretical analysis that indicates that it can achieve the same level of privacy-utility trade-off as the optimal baseline in a centralized setting. Through experiments on real-world datasets, the researchers demonstrate that SPCA achieves optimal error rates comparable to the centralized baseline. Overall, this paper presents a new solution for DP-PCA on vertically partitioned data, with a theoretical analysis demonstrating its effectiveness."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "1 poor"
            },
            "strengths": {
                "value": "1) The paper proposes a solution called Secure Principal Component Analysis (SPCA) for differentially private principal component analysis in vertical Federated Learning.\n2) The paper presents a theoretical analysis demonstrating that SPCA can achieve the privacy-utility trade-off of the optimal baseline in the centralized setting. The analysis shows the solution's effectiveness.\n3) The research paper presents real-world experiments that confirm the theoretical analysis. The paper demonstrates how the analysis has been validated on various datasets."
            },
            "weaknesses": {
                "value": "1) Although the paper includes experiments on real-world datasets, the number of experiments is relatively small, which could limit the generalizability of the results.\n\n2) Comparisons with other existing solutions for differentially private principal component analysis for vertically partitioned data are not presented in the paper."
            },
            "questions": {
                "value": "1) Wang et al. did \"Differentially Private Principal Component Analysis Over Horizontally Partitioned Data,\" but what is your novelty for vertically partitioned data?\n2) Can you elaborate on how the proposed solution can be practically applied?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "1: strong reject"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission5097/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5097/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission5097/Reviewer_qWzN"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5097/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698506149102,
        "cdate": 1698506149102,
        "tmdate": 1699636501212,
        "mdate": 1699636501212,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "70TpnDUADD",
        "forum": "Z0ojN315Uf",
        "replyto": "Z0ojN315Uf",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5097/Reviewer_fmuB"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5097/Reviewer_fmuB"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a differentially private technique for PCA on vertically partitioned data."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "2 fair"
            },
            "strengths": {
                "value": "The approach is mostly sound (but see a few important notes below).\nThe text is well written and understandable.\nProbably the most important contribution is the analysis of the privacy as a function of noise (if it is correct)."
            },
            "weaknesses": {
                "value": "The paper mentions secret sharing, but then doesn't mention an important baseline to consider.  In particular, the brute-force approach which needs \"minimal (*)\" noise is that the clients secret-share their portion of the data, that they compute the covariance matrix together in secret shared form (this only requires additions and multiplications, which under SSS can be performed rather efficiently once the data is secret shared), together add the (minimally required) noise, and then reveal the noisy covariance matrix C.  This algorithm is clearly differentially private and doesn't leak intermediate results.  The only thing another approach can hope to do better is to require fewer communication (and computation).  Unless you can show that your proposal is significantly less expensive than this fully secret-sharing based approach, it doesn't seem a very valuable contribution.  In fact, it seems that Algorithm 1 is not much more efficient that the brute force algorithm I sketch above as it needs to involve all N clients for the computation of each inner product of columns i and j not belonging to the same client.  I guess Algorithm 1 isn't significantly faster than the baseline I describe above, while you could have made it faster by computing D[:,i].D[:,j] using a multi party computation involving only the clients owning columns i and j.\n\nWhile \\sum_{q=1}^N z_q offers some privacy, every client k knows z_k and can therefore compute \\sum_{q=1}^{k-1} z_q + \\sum_{k+1}^N z_q which is the sum of only (N-1) noise terms and hence gives only (N-1)/N of the privacy provided by Sk(\\mu).  Ideally, in line 4 of Algorithm 1 clients should sample from Sk(\\mu/(N-1)).  Alternatively, instead of letting all clients sample from Sk(\\mu/(N-1)) it would be even better to let the clients collaborative sample from Sk(\\mu) without any client learning the sampled value (i.e., sampling using SSS).  In that case, the \"minimal (*)\" amount of noise Sk(\\mu) would be added to the final result.\n\nWhen the abstract (and my comments above) say \"minimal noise\", this is not really the minimal noise, but the smallest amount of noise for which the proof of DP is easy and straightforward.  There is no proof that there doesn't exist an even smaller amount of noise (where in particular possibly not every component C[i,j] gets independent noise) which leads to a result which can also be proven to be DP.\n\nThe proof of the main result (privacy) contains several mistakes, and it is therefore hard to verify its overall correctness, even if I believe that at a high level the result is plausible (i.e., I'm confident such a result is possible but I don't know whether the lower-order terms or constant factors are correct).  For example:\n* \"Since the L2 norm for each row in D and D' is bounded by \\sqrt{\\gamma^2+n} ... we have that ... \\|D^\\top D - D'^\\top D'\\|_F^2 \\le \\gamma^2 + n\" : I would expect that the bound on the norm of these inner products is also linear in \\sqrt{m} with m the number of rows.\n* \"In addition, that the L1 norm of an integer-valued vector v is always less than or equal to \\|v\\|_2^2 and \\sqrt{n}\\|v\\|_2\" : this sentence isn't fully grammatically clear.  It is not correct that the L1 norm of v, i.e., \\sum_i |v_i| is always smaller than \\|v\\|_2^2 = \\sum_i v_i^2 (especially not for \"integer valued v\" where it is possible some components of v are larger than 1 in absolute value.\n* Next, the text just calls for lemma 1, but it would help significantly if the text would first make all parameters of lemma 1 explicit, e.g., \\Delta_1, \\Delta_2, ..."
            },
            "questions": {
                "value": "I assume that what you describe in \"Baseline in vertical FL.\" corresponds to what is more commonly known as \"Local differential privacy\", i.e., every client adds so much noise that the publication of the data doesn't allow an adversary to reveal any sensitive information ?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "--"
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5097/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698682766349,
        "cdate": 1698682766349,
        "tmdate": 1699636501082,
        "mdate": 1699636501082,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "a3rRsNbWaK",
        "forum": "Z0ojN315Uf",
        "replyto": "Z0ojN315Uf",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission5097/Reviewer_DSCS"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission5097/Reviewer_DSCS"
        ],
        "content": {
            "summary": {
                "value": "This paper studies the principal component analysis (PCA) in the vertical FL setting, where each party owns a subset of columns in the data matrix. It requires the observations by each client or the server to be differentially private and the error of PCA in the end can be small. The paper proposes an algorithm, where the MPC protocol is utilized and the noise from each party is carefully calculated. In the empirical evaluation, the proposed method is compared with a reasonable baseline and centralized DP algorithm."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. The clarity of this paper is great. The arguments in the paper are well-explained.\n2. The problem is well formulated and it is clear the see the advantage of the proposed algorithm over the baseline. The proposed algorithm is independent of $m$ and the baseline highly depends on $m$.\n3. The empirical evaluation looks reasonable. The selected dataset covers different range of $(m, n)$."
            },
            "weaknesses": {
                "value": "1. The utility result (Lemma 3) doesn't show $N$, which is an important factor in vertical FL. It would be great to show how $N$ influences the results empirically.\n2. It would be meaningful to present the time/communication cost that happened during the MPC, which is dependent on the choice of $\\gamma$.\n3. Dataset release in RMGM-OLS [1] would provide another reasonable baseline: unlike the baseline in the paper which adds noise to the data matrix directly, it adds noise after a random projection, which can reasonably reduce the scaling of noise.\n\n[1] Wu, Ruihan, et al. \"Differentially Private Multi-Party Data Release for Linear Regression.\" Uncertainty in Artificial Intelligence. PMLR, 2022"
            },
            "questions": {
                "value": "Please see the \"Weakness\" above."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission5097/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698723911462,
        "cdate": 1698723911462,
        "tmdate": 1699636500989,
        "mdate": 1699636500989,
        "license": "CC BY 4.0",
        "version": 2
    }
]