[
    {
        "id": "6sgtseAPeN",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission821/Reviewer_dEjQ"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission821/Reviewer_dEjQ"
        ],
        "forum": "ZNzDXDFZ0B",
        "replyto": "ZNzDXDFZ0B",
        "content": {
            "summary": {
                "value": "The paper presents a diffusion model for panoramic image generation. A two-stage RGB-D PanoDiffusion model is proposed for indoor RGB-D panorama outpainting. The model taks depth information as input and processed through a bi-modal LDM structure. As the results shown, the use of depth information enhances the generation of RGB panoramas, and the alignment mechanism ensures wraparound consistency in the results. The method can be used to generate RGB-D panoramas at 512×1024 resolution."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "The RGB-D fusion and combination mechanism is brought to the field of panoramic image generation via using the latent diffusion models. A RGB-D panoramic outpainting model is proposed to perform indoor 360-degree image generation. \n\nA bi-modal latent diffusion structure is proposed to combine RGB and depth information during training the diffusion model for panoramic image generation. \n\nA camera-rotation method is proposed to perform a stronger data augmentation. The two-end method can be used to crop a 90-degree equivalent area and stitch to the opposite sides to perform additional data augmentation to improve the wraparound consistency."
            },
            "weaknesses": {
                "value": "As compared to the previous methods, the depth information is additionally added to train the diffusion model. Even though the depth information is not needed for inference. \n\nThe proposed RGB-D framework is constructed by using two parallel LDM to reconstruct the depth and RGB images separately. This structure might result in a larger and more complex model architecture than using a shared or depth-conditional LDM.  \n\nAn additional module is needed to refine and upscale the low-resolution image output to a high-resolution image. However, a pre-trained super-resolution GAN model is needed to perform such a refinement."
            },
            "questions": {
                "value": "Apart from the visualization results, how about the evaluation results of using concatenation or cross-attention in the so-called depth-conditional diffusion model? \n\nHow is the cross-attention operation used in the depth-conditional method? Whether the authors try other advanced multimodal fusion methods to better combine the features from RGB and depth? \n\nIt would be better to ablate the camera-rotation data augmentation method. \n\nIn the depth panoramic synthesis, how about the comparison to some RGB-based depth estimation methods? For example, in the case of using fully masked input. \n\nHow about the runtime or complexity analysis of the proposed method, since the parallel LDM are used for RGB and depth separately."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission821/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission821/Reviewer_dEjQ",
                    "ICLR.cc/2024/Conference/Submission821/Senior_Area_Chairs"
                ]
            }
        },
        "number": 1,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission821/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1697383074682,
        "cdate": 1697383074682,
        "tmdate": 1700653520439,
        "mdate": 1700653520439,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "rctI0Aksf1",
        "forum": "ZNzDXDFZ0B",
        "replyto": "ZNzDXDFZ0B",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission821/Reviewer_MEmh"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission821/Reviewer_MEmh"
        ],
        "content": {
            "summary": {
                "value": "This paper proposed a latent diffusion model (LDM) for indoor RGB panaroma inpainting and depth map generation. During training stage, the input to the bi-modal LDM structure are RGB images and corresponding depth maps, which improve the performance of panaroma inpainting. At each stage of the denoising process in the diffusion model, the proposed alignment mechanism enhances the wraparound consistency of the results. The results indicate that the proposed PanoDiffusion excels not only by achieving a substantial performance advantage over state-of-the-art techniques in RGB-D panorama outpainting, yielding diverse and well-structured results for various mask types, but also by demonstrating the capability to generate high-quality depth panoramas."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "- During inference process, there is no need to input the depth map as a guidance, only training process requires depth maps as input. It is significantly different from the previous approaches.\n- This paper proposed a noval approach that involves gradually introducing camera rotations at each stage of the diffusion denoising process, resulting in a notable enhancement in achieving seamless panorama wraparound consistency.\n- With the clear description of each module and step, this approach ensures that the framework is not only effective but also easily comprehensible and straightforward to follow."
            },
            "weaknesses": {
                "value": "- There is not many noval changes to the LDM framework. The authors only add a pretrained depth map encoder as a guidance.\n- There are only one visual result (Figure 6) in the paper, which is not convincing. The authors should add more visual results for comparison in the supplementary materials."
            },
            "questions": {
                "value": "- How about the training and inference time compared to other frameworks? Since LDM requires a step-by-setp mechanism to generate the final results, the efficiency may be a problem.\n- There are only 4 types of maskes. Each type of mask covers different portion of the whole panaroma. I recommand the authors to add a chart that describes the performance changing along the percentage of the mask. According to my understanding, with the increase of the percentage of the mask, the performance will drop.\n- The mask are all continuous presented in this paper, I am curious when there are several separate masks in one panaroma, what will the performance become?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission821/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission821/Reviewer_MEmh",
                    "ICLR.cc/2024/Conference/Submission821/Senior_Area_Chairs"
                ]
            }
        },
        "number": 2,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission821/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698732271543,
        "cdate": 1698732271543,
        "tmdate": 1700664300335,
        "mdate": 1700664300335,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "msuGy8LJJ4",
        "forum": "ZNzDXDFZ0B",
        "replyto": "ZNzDXDFZ0B",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission821/Reviewer_inST"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission821/Reviewer_inST"
        ],
        "content": {
            "summary": {
                "value": "The authors propose a way to outpaint a near field-of-view image (i.e. a normal image from a normal camera) to a panorama, which they represent as a equirectangular projected image. They use latent diffusion models to do so. Their latent model is trained on RGB-D panoramic data, but works on just RGB inputs. \n\nOne problem with outpainting panoramic images is that the left and right side of the equirectangular project image need to map to each other. The authors introduce a novel technique to do this. It works by rotating the image by 90 degrees in each denoising step in the diffusion model.\n\nThe authors compare to a variety of other techniques and show that their method is better than competing methods."
            },
            "soundness": {
                "value": "4 excellent"
            },
            "presentation": {
                "value": "4 excellent"
            },
            "contribution": {
                "value": "4 excellent"
            },
            "strengths": {
                "value": "The paper is well-written and the results seem pretty good. The author’s idea to rotate the image 90 degrees in each denoising step seems very novel. \n\nThere are lots of comparisons to many other methods and the proposed method is better based on a variety of techniques. \n\nI appreciate that the authors include the code as supplementary material!"
            },
            "weaknesses": {
                "value": "It is somewhat hard to evaluate the generated panoramic images based on looking at images or fixed rotations. I would be interested in seeing the panoramic images of both the proposed method and competing method in a viewer like threejs. See https://threejs.org/examples/webgl_panorama_equirectangular.html"
            },
            "questions": {
                "value": "There are many ways to represent 360 degree panorama images. The authors should clarify that using the equirectangular projection is a choice they are making.\n\nDo the authors only rotate the camera in the horizontal direction? Or are vertical rotations allowed as well?\n\nDuring inference, did the authors try 180 degree shifts instead of 90 degree shifts? Or some other rotation?\n\nWhat’s the difference between Fig. 2 and Fig. 3? They seem like they are both figures about how training and inference are done, but they seem to be different. Specifically, Fig. 2b does not add noise and does not reference the circular shift, while Fig. 3b does. Is Fig. 2b incorrect?\n\nIn the supplemental video, do the shown 3D Scenes at 00:12 use the generated depth maps?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "8: accept, good paper"
            },
            "confidence": {
                "value": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
            },
            "code_of_conduct": {
                "value": "Yes"
            },
            "first_time_reviewer": {
                "value": "Yes",
                "readers": [
                    "ICLR.cc/2024/Conference/Program_Chairs",
                    "ICLR.cc/2024/Conference/Submission821/Senior_Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission821/Area_Chairs",
                    "ICLR.cc/2024/Conference/Submission821/Reviewer_inST"
                ]
            }
        },
        "number": 3,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission821/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698772561444,
        "cdate": 1698772561444,
        "tmdate": 1699636009258,
        "mdate": 1699636009258,
        "license": "CC BY 4.0",
        "version": 2
    },
    {
        "id": "r5eWG5kDMB",
        "forum": "ZNzDXDFZ0B",
        "replyto": "ZNzDXDFZ0B",
        "signatures": [
            "ICLR.cc/2024/Conference/Submission821/Reviewer_SqKp"
        ],
        "nonreaders": [],
        "readers": [
            "everyone"
        ],
        "writers": [
            "ICLR.cc/2024/Conference",
            "ICLR.cc/2024/Conference/Submission821/Reviewer_SqKp"
        ],
        "content": {
            "summary": {
                "value": "This paper proposes a new diffusion based method to tackle panorama image generation task. The proposed method utilizes the latent diffusion models to outpaint the area that is not originally taken by the camera. Relying on the powerful generation capability of diffusion models, the proposed method proposes to progressively apply camera rotations during the image generation process in order to enhance the generalizability. Extensive experiments show that the proposed method is able to outperforms the baseline methods significantly."
            },
            "soundness": {
                "value": "3 good"
            },
            "presentation": {
                "value": "3 good"
            },
            "contribution": {
                "value": "3 good"
            },
            "strengths": {
                "value": "1. This paper is generally well written with strong motivation and well-organized writing. It clearly demonstrates the problem of  current pano generation and implies the proposed method is tackling the problems stated. \n2. The proposed method significantly outperforms the baseline methods on the selected benchmarks."
            },
            "weaknesses": {
                "value": "1. During the training stage, does the random angle rotation only apply to horizontal direction?\n2. Depth map actually provides rich information indicating the scales of the objects in the images. In order to test the generalization capability, can you provide more results of running the proposed method on other datasets?\n3. This paper claims the camera rotations as one of the contributions, please provide an ablation study on how the camera rotation actually works effectively."
            },
            "questions": {
                "value": "The authors are suggested to address the concerns raised in the weaknesses section during the rebuttal period."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": "6: marginally above the acceptance threshold"
            },
            "confidence": {
                "value": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        "number": 4,
        "invitations": [
            "ICLR.cc/2024/Conference/Submission821/-/Official_Review",
            "ICLR.cc/2024/Conference/-/Edit"
        ],
        "domain": "ICLR.cc/2024/Conference",
        "tcdate": 1698831748974,
        "cdate": 1698831748974,
        "tmdate": 1699636009175,
        "mdate": 1699636009175,
        "license": "CC BY 4.0",
        "version": 2
    }
]